{
  "_comment": "本地翻譯快取，會在執行時自動更新",
  "names": {},
  "descriptions": {
    "Show off your style by designing homes for all of your favorite Animal Crossing villagers! Use your creativity to design the perfect houses - inside and out - for both old and new friends. With the new amiibo cards, you can call your favorite villagers into the game.\nFeatures:\nDesign the interior and exterior of hundreds of homes for animal villagers\nLeave your decorative touch on the school, hospital and other public facilities\nCollect and Connect - Collect and share amiibo cards of your favori...": "為所有你最喜歡的《動物之森》村民設計家園，展示你的風格！發揮您的創造力，為新老朋友設計從內到外的完美房屋。使用新的 amiibo 卡，您可以召喚您最喜歡的村民進入遊戲。\n特點：\n為動物村民設計數百個房屋的內部和外部\n為學校、醫院和其他公共設施留下您的裝飾風格\n收集並連接 - 收集並分享您最喜歡的 amiibo 卡...",
    "Play with Kitty and her entire family.\nLearn while having fun with 25 entertaining workshops.\nCollect hundreds of images and disguises for Kitty and Mimmy!": "與凱蒂和她的全家人一起玩耍。\n通過 25 個有趣的研討會，邊學習邊享受樂趣。\n為凱蒂和咪咪收集數百張圖像和偽裝！",
    "Discover a handicraft world bursting at the seams with creativity, as you guide Yarn Yoshi or Yarn Poochy through clever side-scrolling stages. Unravel secrets, toss yarn to weave platforms, and power up with woolly transformations. All stages from the Wii U version are joined by new ones starring Poochy and more Nintendo 3DS exclusive features!\nIt's a mad dash for beads in new Poochy stages: dodge stumps, mush down snowy paths, chase Lakitu, and unearth hidden paths and items. Sniffing out secr...": "當您引導 Yarn Yoshi 或 Yarn Poochy 通過巧妙的橫向捲軸關卡時，探索充滿創意的手工藝世界。解開秘密，將紗線扔到編織平台上，並通過羊毛變形來增強力量。Wii U 版本的所有關卡均加入了由 Poochy 主演的新關卡以及更多 Nintendo 3DS 獨有功能！\n在新的 Poochy 關卡中，這是一次瘋狂的珠子衝刺：躲避樹樁，衝破雪路，追逐拉基圖，並挖掘隱藏的路徑和物品。嗅出秘密...",
    "Professor Layton and Luke head to the town of miracles, Montdol, in search of the Mask of Miracle. The mask has the ability to grant wishes to its wearer. Layton and Luke arrive at the town to see they are too late, as a mysterious man is using the power of the mask to turn people to stone. Layton and Luke task themselves with solving the mystery of Montdol and the Mask of Miracles.\nThis fifth game in the Professor Layton series makes more use of the physical button controls for puzzle-solving a...": "雷頓教授和盧克前往奇蹟小鎮蒙多爾尋找奇蹟面具。面具有能力實現佩戴者的願望。雷頓和盧克到達小鎮後發現為時已晚，一名神秘男子正在利用面具的力量將人們變成石頭。雷頓和盧克的任務是解開蒙多爾之謎和奇蹟面具。\n《雷頓教授》系列的第五款遊戲更多地利用物理按鈕控制來解決謎題……",
    "Developed by Banpresto and Monolith Soft, Project X Zone features over 50 characters from 29 historic game franchises by three of Japan's most prolific video game companies. In Project X Zone players will use a team of two characters known as a Pair Unit to explore the world within the game. An additional character known as a Solo Unit can be combined with the Pair Unit to assist in battles with Solo Attacks as well as augment the attacks available for players to execute. Throughout the game, ep...": "Project X Zone 由 Banpresto 和 Monolith Soft 開發，擁有來自日本最多產的三個視頻遊戲公司的 29 個歷史遊戲系列的 50 多個角色。在 Project X Zone 中，玩家將使用兩個角色組成的團隊（稱為“配對單位”）來探索遊戲中的世界。稱為單人單位的附加角色可以與配對單位組合，以協助單人攻擊的戰鬥，並增強玩家可以執行的攻擊。在整個比賽過程中，ep...",
    "In the sequel to the original world-crossing RPG adventure, legendary characters from Japan's most prolific video game publishers come together to create the biggest mash-up strategy game ever! Project X Zone 2 gives gamers the opportunity to play as their favorite characters from a multitude of franchises and form teams of characters hailing from classic and current franchises and engage enemies through strategic turn-based battles.": "在原創跨界 RPG 冒險的續集中，來自日本最多產的視頻遊戲發行商的傳奇人物齊聚一堂，創造了有史以來最大的混搭策略遊戲！Project X Zone 2 讓玩家有機會扮演眾多系列中他們最喜歡的角色，並組建來自經典和當前系列的角色團隊，並通過戰略回合製戰鬥與敵人交戰。",
    "With Puzzler World 2012 3D, players can collect trophies in a personal trophy cabinet as proof of skill, collect hint tokens for help on tricky clues and puzzles, and teach the game to remember individual letters and numbers using the handwriting recognition feature. Add more variety and hours of fun by unlocking bonus games with new modes. Take on additional bonus games such as Hangman, Chain Letters, Missing Piece, and more with Challenge mode. For an extra challenge, unlock Master mode puzzle...": "借助 Puzzler World 2012 3D，玩家可以在個人獎杯櫃中收集獎杯作為技能證明，收集提示標記以幫助解決棘手的線索和謎題，並教遊戲使用手寫識別功能記住單個字母和數字。通過使用新模式解鎖獎勵遊戲來增加更多的多樣性和更多的樂趣。通過挑戰模式進行額外的獎勵遊戲，例如絞刑吏、連環信、失踪的碎片等等。如需額外挑戰，請解鎖大師模式謎題......",
    "Puzzler World 2013 features over 1,200 brain teasing puzzles and introduces new games such as Maze-a-Pix, Number Jig and Loko.\n \nPuzzler World 2013 takes Master Mode even further with new, tougher challenge that the player can unlock and test themselves against.": "Puzzler World 2013 包含 1,200 多個腦筋急轉彎謎題，並推出了 Maze-a-Pix、Number Jig 和 Loko 等新遊戲。\n\nPuzzler World 2013 進一步推進了大師模式，推出了新的、更艱鉅的挑戰，玩家可以解鎖並測試自己。",
    "Rabbids are bwaaack and this time they have an infallible plan: travel back in time and invade human history! Plunge into the past with the wacky Rabbids and revisit the greatest moments of history like the discovery of fire, the broken nose of the Sphinx or the legend of Arthur. Uncover how Rabbids wreaked havoc and changed the course of history...": "兔子們瘋了，這一次他們有一個萬無一失的計劃：回到過去併入侵人類歷史！與古怪的瘋兔一起沉浸在過去，重溫歷史上最偉大的時刻，比如火的發現、獅身人面像的斷鼻子或亞瑟的傳說。揭開瘋狂兔子如何造成嚴重破壞並改變歷史進程......",
    "Rhythmic gaming bliss, goats eating turnips, and the funkiest tunes you?ve ever bashed a button to? This must be the Rhythm Heaven? Megamix. With 70+ rhythm games, including new ones, remixed fan-favorites, and US debuts, this fresh mix has it all. Try to reach Heaven World as you stab viruses, feed a bear, and more! Just don't miss a beat.\nAs you dig into each hilariously random activity, you'll get pulled into the world of Rhythm Heaven by the riveting soundtrack, created with help from legend...": "有節奏的遊戲樂趣，山羊吃蘿蔔，還有你按下按鈕聽過的最時髦的曲調？這裡一定是節奏天堂吧？超級混音。這個新鮮的組合擁有 70 多款節奏遊戲，包括新遊戲、粉絲最愛的混音遊戲以及美國首發遊戲。嘗試到達天堂世界，刺殺病毒、餵熊等等！只是不要錯過任何一個節拍。\n當你深入研究每一個搞笑的隨機活動時，你會被傳奇人物創造的引人入勝的配樂帶入節奏天堂的世界......"
  }
}