{
  "names": {},
  "descriptions": {
    "Show off your style by designing homes for all of your favorite Animal Crossing villagers! Use your creativity to design the perfect houses - inside and out - for both old and new friends. With the new amiibo cards, you can call your favorite villagers into the game.\nFeatures:\nDesign the interior and exterior of hundreds of homes for animal villagers\nLeave your decorative touch on the school, hospital and other public facilities\nCollect and Connect - Collect and share amiibo cards of your favori...": "為所有你最喜歡的《動物之森》村民設計家園，展示你的風格！發揮您的創造力，為新老朋友設計從內到外的完美房屋。使用新的 amiibo 卡，您可以召喚您最喜歡的村民進入遊戲。\n特點：\n為動物村民設計數百個房屋的內部和外部\n為學校、醫院和其他公共設施留下您的裝飾風格\n收集並連接 - 收集並分享您最喜歡的 amiibo 卡...",
    "Play with Kitty and her entire family.\nLearn while having fun with 25 entertaining workshops.\nCollect hundreds of images and disguises for Kitty and Mimmy!": "與凱蒂和她的全家人一起玩耍。\n通過 25 個有趣的研討會，邊學習邊享受樂趣。\n為凱蒂和咪咪收集數百張圖像和偽裝！",
    "Discover a handicraft world bursting at the seams with creativity, as you guide Yarn Yoshi or Yarn Poochy through clever side-scrolling stages. Unravel secrets, toss yarn to weave platforms, and power up with woolly transformations. All stages from the Wii U version are joined by new ones starring Poochy and more Nintendo 3DS exclusive features!\nIt's a mad dash for beads in new Poochy stages: dodge stumps, mush down snowy paths, chase Lakitu, and unearth hidden paths and items. Sniffing out secr...": "當您引導 Yarn Yoshi 或 Yarn Poochy 通過巧妙的橫向捲軸關卡時，探索充滿創意的手工藝世界。解開秘密，將紗線扔到編織平台上，並通過羊毛變形來增強力量。Wii U 版本的所有關卡均加入了由 Poochy 主演的新關卡以及更多 Nintendo 3DS 獨有功能！\n在新的 Poochy 關卡中，這是一次瘋狂的珠子衝刺：躲避樹樁，衝破雪路，追逐拉基圖，並挖掘隱藏的路徑和物品。嗅出秘密...",
    "Professor Layton and Luke head to the town of miracles, Montdol, in search of the Mask of Miracle. The mask has the ability to grant wishes to its wearer. Layton and Luke arrive at the town to see they are too late, as a mysterious man is using the power of the mask to turn people to stone. Layton and Luke task themselves with solving the mystery of Montdol and the Mask of Miracles.\nThis fifth game in the Professor Layton series makes more use of the physical button controls for puzzle-solving a...": "雷頓教授和盧克前往奇蹟小鎮蒙多爾尋找奇蹟面具。面具有能力實現佩戴者的願望。雷頓和盧克到達小鎮後發現為時已晚，一名神秘男子正在利用面具的力量將人們變成石頭。雷頓和盧克的任務是解開蒙多爾之謎和奇蹟面具。\n《雷頓教授》系列的第五款遊戲更多地利用物理按鈕控制來解決謎題……",
    "Developed by Banpresto and Monolith Soft, Project X Zone features over 50 characters from 29 historic game franchises by three of Japan's most prolific video game companies. In Project X Zone players will use a team of two characters known as a Pair Unit to explore the world within the game. An additional character known as a Solo Unit can be combined with the Pair Unit to assist in battles with Solo Attacks as well as augment the attacks available for players to execute. Throughout the game, ep...": "Project X Zone 由 Banpresto 和 Monolith Soft 開發，擁有來自日本最多產的三個視頻遊戲公司的 29 個歷史遊戲系列的 50 多個角色。在 Project X Zone 中，玩家將使用兩個角色組成的團隊（稱為“配對單位”）來探索遊戲中的世界。稱為單人單位的附加角色可以與配對單位組合，以協助單人攻擊的戰鬥，並增強玩家可以執行的攻擊。在整個比賽過程中，ep...",
    "In the sequel to the original world-crossing RPG adventure, legendary characters from Japan's most prolific video game publishers come together to create the biggest mash-up strategy game ever! Project X Zone 2 gives gamers the opportunity to play as their favorite characters from a multitude of franchises and form teams of characters hailing from classic and current franchises and engage enemies through strategic turn-based battles.": "在原創跨界 RPG 冒險的續集中，來自日本最多產的視頻遊戲發行商的傳奇人物齊聚一堂，創造了有史以來最大的混搭策略遊戲！Project X Zone 2 讓玩家有機會扮演眾多系列中他們最喜歡的角色，並組建來自經典和當前系列的角色團隊，並通過戰略回合製戰鬥與敵人交戰。",
    "With Puzzler World 2012 3D, players can collect trophies in a personal trophy cabinet as proof of skill, collect hint tokens for help on tricky clues and puzzles, and teach the game to remember individual letters and numbers using the handwriting recognition feature. Add more variety and hours of fun by unlocking bonus games with new modes. Take on additional bonus games such as Hangman, Chain Letters, Missing Piece, and more with Challenge mode. For an extra challenge, unlock Master mode puzzle...": "借助 Puzzler World 2012 3D，玩家可以在個人獎杯櫃中收集獎杯作為技能證明，收集提示標記以幫助解決棘手的線索和謎題，並教遊戲使用手寫識別功能記住單個字母和數字。通過使用新模式解鎖獎勵遊戲來增加更多的多樣性和更多的樂趣。通過挑戰模式進行額外的獎勵遊戲，例如絞刑吏、連環信、失踪的碎片等等。如需額外挑戰，請解鎖大師模式謎題......",
    "Puzzler World 2013 features over 1,200 brain teasing puzzles and introduces new games such as Maze-a-Pix, Number Jig and Loko.\n \nPuzzler World 2013 takes Master Mode even further with new, tougher challenge that the player can unlock and test themselves against.": "Puzzler World 2013 包含 1,200 多個腦筋急轉彎謎題，並推出了 Maze-a-Pix、Number Jig 和 Loko 等新遊戲。\n\nPuzzler World 2013 進一步推進了大師模式，推出了新的、更艱鉅的挑戰，玩家可以解鎖並測試自己。",
    "Rabbids are bwaaack and this time they have an infallible plan: travel back in time and invade human history! Plunge into the past with the wacky Rabbids and revisit the greatest moments of history like the discovery of fire, the broken nose of the Sphinx or the legend of Arthur. Uncover how Rabbids wreaked havoc and changed the course of history...": "兔子們瘋了，這一次他們有一個萬無一失的計劃：回到過去併入侵人類歷史！與古怪的瘋兔一起沉浸在過去，重溫歷史上最偉大的時刻，比如火的發現、獅身人面像的斷鼻子或亞瑟的傳說。揭開瘋狂兔子如何造成嚴重破壞並改變歷史進程......",
    "Rhythmic gaming bliss, goats eating turnips, and the funkiest tunes you?ve ever bashed a button to? This must be the Rhythm Heaven? Megamix. With 70+ rhythm games, including new ones, remixed fan-favorites, and US debuts, this fresh mix has it all. Try to reach Heaven World as you stab viruses, feed a bear, and more! Just don't miss a beat.\nAs you dig into each hilariously random activity, you'll get pulled into the world of Rhythm Heaven by the riveting soundtrack, created with help from legend...": "有節奏的遊戲樂趣，山羊吃蘿蔔，還有你按下按鈕聽過的最時髦的曲調？這裡一定是節奏天堂吧？超級混音。這個新鮮的組合擁有 70 多款節奏遊戲，包括新遊戲、粉絲最愛的混音遊戲以及美國首發遊戲。嘗試到達天堂世界，刺殺病毒、餵熊等等！只是不要錯過任何一個節拍。\n當你深入研究每一個搞笑的隨機活動時，你會被傳奇人物創造的引人入勝的配樂帶入節奏天堂的世界......",
    "Raphael, a normal boy by day, acts as the legendary art thief Phantom R by night. He is well-known for stealing precious paintings and returning them days later, never getting caught. His true motive can be traced back three years prior to the start of the game, where Raphael's father mysteriously disappeared and left him with a strange coin. Raphael found all of the paintings his father had stolen shortly afterward, replacing them with forgeries. As Phantom R, Raphael works to replace his fathe...": "拉斐爾白天是一個普通男孩，晚上則扮演傳奇的藝術品竊賊 Phantom R。他因偷竊珍貴畫作並在幾天后歸還而從未被抓而聞名。他的真正動機可以追溯到遊戲開始前三年，拉斐爾的父親神秘失踪，並給他留下了一枚奇怪的硬幣。拉斐爾不久後發現了他父親偷來的所有畫作，並用贗品取代了它們。作為幻影 R，拉斐爾致力於取代他的父親......",
    "Rune Factory 4 marks the return of the popular Harvest Moon spinoff that combines farming with dungeon adventuring. For the first time in the series, the player can select to play as a male or female hero, and potential suitors of either gender are also available in order to pursue love, marriage, and possibly a child. As the newly-appointed prince or princess, you can fulfill your royal duties of protecting the town from invaders, or take a more rural approach to governing by raising your own f...": "《符文工廠 4》標誌著廣受歡迎的《牧場物語》衍生遊戲的回歸，該遊戲將農業與地下城冒險結合在一起。在該系列中，玩家第一次可以選擇扮演男性或女性英雄，並且也可以選擇任何性別的潛在追求者來追求愛情、婚姻，甚至可能是孩子。作為新任命的王子或公主，你可以履行保護城鎮免受入侵者的皇家職責，或者通過養育自己的孩子來採取更鄉村的方式進行治理。",
    "Senran Kagura Burst is an enhanced and updated version of the original Senran Kagura. It includes the complete original game, along with an entirely new scenario starring the rival Hebijo ninja team, which tells the original story from a different perspective. A number of new outfits and unlockable missions have also been added.": "閃亂神樂爆裂是原始閃亂神樂的增強和更新版本。它包括完整的原創遊戲，以及由對手 Hebijo 忍者隊主演的全新場景，從不同的角度講述原創故事。還添加了許多新服裝和可解鎖任務。",
    "Embark on a brand new adventure with Shantae, the hair-whipping belly dancing genie! When Shantae loses her genie magic, she must team up with her nemesis, the nefarious pirate Risky Boots in order to save Sequin Land from evil. As a pirate, Shantae gains new weapons and tools to advance her quest, slay monsters, battle epic bosses ?and hopefully get her magic back in the bargain! But can she really trust her most deadly enemy?": "與甩頭髮的肚皮舞精靈桑塔一起踏上全新的冒險之旅！當桑塔失去精靈魔法時，她必須與她的宿敵、邪惡的海盜風險靴子聯手，以拯救亮片之地免受邪惡的侵害。作為一名海盜，桑塔獲得了新的武器和工具來推進她的任務、殺死怪物、與史詩般的頭目戰鬥——並希望能重新獲得她的魔法！但她真的能相信她最致命的敵人嗎？",
    "Soul Hackers delivers a first-person, dungeon-crawling RPG experience set in a future where technology and otherworldly forces meet in a macabre fusion of cyberpunk futurism and gothic horror. A first-person sci-fi RPG epic, Soul Hackers tells of a city held up as a beacon of humanity's triumph of technology, but with an infernal secret. In this would-be utopia, a group of hackers takes on a centuries-old mystic society, and a battle for control over humanity's fate is about to begin.": "《Soul Hackers》提供了第一人稱、地下城探索的角色扮演遊戲體驗，背景設定在未來，科技與超凡脫俗的力量相遇，賽博朋克未來主義與哥特式恐怖的可怕融合。《靈魂黑客》是一款第一人稱科幻角色扮演遊戲史詩，講述了一座被視為人類科技勝利燈塔的城市，但卻隱藏著一個地獄般的秘密。在這個未來的烏托邦中，一群黑客挑戰了一個有著數百年曆史的神秘社會，一場爭奪人類命運控制權的戰鬥即將開始。",
    "Expanded and enhanced, Devil Survivor Overclocked for Nintendo 3DS builds upon the game's original release with the addition of voice acting for the entirety of the game's lengthy, unconventional narrative. Moreover, that very story, already boasting multiple endings based on critical decisions by the player, now concludes with a special eighth chapter, a rousing epilogue for Shin Megami Tensei fans. The game's beautifully remastered hand drawn artwork and character portraits benefit from the ne...": "任天堂 3DS 版《惡魔倖存者超頻》經過擴展和增強，以遊戲的原始版本為基礎，並為整個遊戲冗長、非傳統的敘述添加了配音。此外，這個故事已經擁有基於玩家關鍵決定的多個結局，現在以特殊的第八章結束，這是真女神轉生粉絲們激動人心的尾聲。遊戲精美的重製手繪藝術作品和人物肖像受益於新...",
    "Building on the styles of ATLUS' Persona, Devil Summoner, and Devil Survivor titles, SMTIV is the first true successor to 2004's Shin Megami Tensei: Nocturne. The story of SMTIV revolves around the Samurai, the sacred protectors of the Eastern Kingdom of Mikado. As a newly appointed Samurai, players will struggle with factions that have nefarious designs on the world as they defend their home kingdom from a growing army of demons. Decisions players make throughout the course of the story will ha...": "SMTIV 以 ATLUS 的《女神異聞錄》、《惡魔召喚師》和《惡魔倖存者》遊戲的風格為基礎，是 2004 年《真女神轉生：夜曲》的第一個真正的繼承者。SMTIV 的故事圍繞東方天皇王國的神聖保護者武士展開。作為一名新任命的武士，玩家將與對世界懷有邪惡圖謀的派系進行鬥爭，同時保衛自己的祖國免受日益壯大的惡魔大軍的侵害。玩家在整個故事過程中做出的決定將...",
    "Betrayed by your friend you must battle an ancient and evil clan in this epic reboot of the acclaimed Shinobi series. Shinobi captures the classic side-scrolling action from the original Shinobi games. This coupled with intense combat in exotic locations and over the top boss encounters is what players have loved since the early days of the series.": "在這部廣受好評的忍者係列的史詩重啟中，你被朋友背叛，必須與一個古老而邪惡的部落戰鬥。Shinobi 捕捉了原版 Shinobi 遊戲中的經典橫向捲軸動作。再加上異國情調的激烈戰鬥和頂級的 Boss 遭遇，是該系列早期以來玩家所喜愛的。",
    "Shovel Knight is a 2014 action platformer video game developed and published by independent developer Yacht Club Games for the Nintendo 3DS, Wii U, and personal computer platforms. The game was released worldwide on June 26, 2014. Shovel Knight was directed by former WayForward Technologies member Sean Velasco, and includes music composed by Jake Kaufman and Manami Matsumae.\nPrior to the game, adventurers Shovel Knight and Shield Knight fought alongside one another, journeying across the world a...": "《鏟子騎士》是一款 2014 年動作平台視頻遊戲，由獨立開發商 Yacht Club Games 為 Nintendo 3DS、Wii U 和個人電腦平台開發和發行。該遊戲於 2014 年 6 月 26 日在全球發布。 《鏟子騎士》由前 WayForward Technologies 成員 Sean Velasco 執導，音樂由 Jake Kaufman 和 Manami Matsumae 創作。\n遊戲開始前，冒險家鏟子騎士和盾騎士並肩作戰，穿越世界……",
    "Dr. Eggman has harnessed the power of six menacing creatures known as the Deadly Six, but when the Deadly Six rise up against their master, Sonic has to unite with his arch nemesis in order to take on the new enemies head-to-head. Using his dynamic new parkour moves and improved Colour Powers, Sonic must run, jump and race through a variety of ever changing terrains in order to defeat the Deadly Six.": "艾格曼博士利用了被稱為“致命六人”的六種威脅生物的力量，但當“致命六人”奮起反抗他們的主人時，索尼克必須與他的宿敵聯合起來，才能與新敵人正面交鋒。索尼克必須利用他充滿活力的新跑酷動作和改進的色彩力量，在各種不斷變化的地形中奔跑、跳躍和競賽，才能擊敗致命六人組。",
    "Set across three defining eras from 20 years of Sonic the Hedgehog video game history, the instantly recognisable environments of Sonic Generations have been re-built in stunning HD and are now playable in both classic side scrolling 2D from 1991, as well as modern 3D style found in Sonic's most recent adventures. Each incarnation of Sonic in Sonic Generations comes complete with his trademark special move, Spin Dash and Spin Attack for Classic Sonic, and Homing Attack and Sonic Boost for Modern...": "《刺猬索尼克》視頻遊戲歷史跨越了 20 年的三個決定性時代，《索尼克世代》中可立即識別的環境已以令人驚嘆的高清版本重新構建，現在可以以 1991 年的經典橫向捲軸 2D 模式以及索尼克最新冒險中的現代 3D 風格進行遊戲。索尼克在《索尼克世代》中的每一個化身都配有他標誌性的特殊動作，經典索尼克的旋轉衝刺和旋轉攻擊，現代索尼克的歸巢攻擊和音速增強……",
    "The Star Fox team triumphantly returns to one of its greatest missions with this remake of Star Fox 64 in full 3D, featuring a complete graphical update.\nThe entire Star Fox universe spreads out realistically into the depths of the Nintendo 3DS screen while the 3D visuals give the player a clearer grasp of distance and position. This makes the game more approachable and intuitive, thereby allowing players to focus on the action.": "《星際火狐》團隊以全 3D 方式重製《星際火狐 64》，並進行了完整的圖形更新，成功回歸其最偉大的任務之一。\n整個《星際火狐》宇宙真實地展開到任天堂 3DS 屏幕的深處，而 3D 視覺效果讓玩家更清楚地掌握距離和位置。這使得遊戲更加平易近人、直觀，從而讓玩家能夠專注於動作。",
    "What will you do today? Take charge of an expansive farm near three unique and exciting towns and choose what kind of life to lead.\nThe original and best-selling farming/life sim returns for its 20th anniversary with a brand new adventure!\nTake on the role of a young city slicker who has always wished for a life on the farm. Your dream leads you to a huge plot of open land just ready to be filled with crops, livestock, decorations, and more.\nYour new farm is at the crossroads of three different ...": "今天你會做什麼？負責管理三個獨特而令人興奮的城鎮附近的廣闊農場，並選擇過什麼樣的生活。\n原創最暢銷的農業/生活模擬遊戲帶著全新的冒險回歸 20 週年！\n扮演一位年輕的城市人，一直渴望在農場生活。你的夢想會帶你來到一大片開闊的土地，準備種植農作物、牲畜、裝飾品等等。\n你的新農場位於三個不同的十字路口......",
    "Story of Seasons is a farming simulation video game developed by Marvelous Entertainment for the Nintendo 3DS. It was released in Japan on February 27, 2014, and in North America on March 31, 2015. The game is not under the Harvest Moon title in North America due to Natsume's ownership of the name. However, less than a month later, Natsume themselves announced their own original title, not produced by Marvelous, Harvest Moon: The Lost Valley released only in North America and Europe, also releas...": "Story of Seasons 是 Marvelous Entertainment 為任天堂 3DS 開發的一款農業模擬視頻遊戲。該遊戲於2014年2月27日在日本發行，並於2015年3月31日在北美髮行。由於夏目擁有該名稱，該遊戲在北美並未以Harvest Moon為標題。然而，不到一個月後，夏目自己宣布了自己的原創作品，不是由 Marvelous 製作的，《牧場物語：失落的山谷》僅在北美和歐洲發行，還發行了……",
    "Super Mario 3D Land is a platform game that has been described by game designer Shigeru Miyamoto as a \"3D Mario that plays as a 2D Mario game.\" As such, Super Mario 3D Land combines the elements of traditional side-scrolling Mario titles, such as linear-based levels, with those of the modern open world Mario titles, such as moving Mario in three dimensions and performing a variety of actions. Similar to the classic side-scrolling Mario games, the objective of each level is to reach and grab the ...": "《超級馬里奧 3D 大陸》是一款平台遊戲，遊戲設計師宮本茂將其描述為“像 2D 馬里奧遊戲一樣玩的 3D 馬里奧”。因此，《Super Mario 3D Land》結合了傳統橫向捲軸 Mario 遊戲的元素（例如基於線性的關卡）與現代開放世界 Mario 遊戲的元素（例如在三個維度中移動 Mario 並執行各種動作）。與經典的橫向捲軸馬里奧遊戲類似，每個級別的目標都是到達並抓住......",
    "Play the game, watch the movie!\nTekken 3D Prime Edition contains the complete entertainment world of TEKKEN onto a single Nintendo 3DS card!\nPlay the game, watch the movie! Tekken 3D Prime Edition contains the complete entertainment world of TEKKEN onto a single Nintendo 3DS card! Battle with more than 40 fighters from the TEKKEN universe and with Young Heihachi for the first time ever! In addition, watch TEKKEN: Blood Vengeance, a full 3D theatrical experience produced by Digital Frontier in co...": "玩遊戲，看電影！\n鐵拳 3D Prime 版將《鐵拳》的完整娛樂世界包含在一張任天堂 3DS 卡上！\n玩遊戲，看電影！鐵拳 3D Prime 版將《鐵拳》的完整娛樂世界包含在一張任天堂 3DS 卡上！有史以來第一次與 TEKKEN 宇宙中的 40 多名戰士以及幼年平八一起戰鬥！此外，觀看《鐵拳：血色復仇》，這是由 Digital Frontier 聯合製作的全 3D 影院體驗。",
    "Terraria is a two dimensional platform game of exploration and crafting. Players can use mines and picks to collect various items from the environment including wood, ore and even spider webs. Resources acquired from the environment can be placed or crafted into all manner of items.\nThe simple crafting system automatically lists any item that you have the materials to craft. First priority is to set up a base before night fall hits in order to protect yourself from roving zombies and eyeball mon...": "Terraria 是一款探索和製作的二維平台遊戲。玩家可以使用地雷和鎬從環境中收集各種物品，包括木材、礦石甚至蜘蛛網。從環境中獲取的資源可以放置或製作成各種物品。\n簡單的製作系統會自動列出您擁有製作材料的所有物品。當務之急是在夜幕降臨之前建立一個基地，以保護自己免受遊蕩的殭屍和眼球怪物的侵害。",
    "Tomodachi Life is a communication game for the 3DS in which players can convert their Miis into Tomodachis (or create new ones) and put them in a wide range of scenarios ranging from charming to utterly ridiculous. A key feature of the game is its text-to-speech tech which outputs user generated text as computerized speech in seven languages (EFIGS, Japanese and Korean).": "Tomodachi Life 是一款 3DS 通訊遊戲，玩家可以將他們的 Miis 轉換為 Tomodachi（或創建新的），並將它們置於從迷人到完全荒謬的各種場景中。該遊戲的一個關鍵功能是其文本轉語音技術，該技術可將用戶生成的文本輸出為七種語言（EFIGS、日語和韓語）的計算機化語音。",
    "Play as yourself or one of eleven playable characters from the series, like Yuma, Astral, Tori, Shark and more, each with their own storyline and earn an invite to the World Duel Carnival where you can battle with more than 40 Duelists from the TV show! Players can enjoy a Story Mode and a Free Duel Mode where they can play with more than 5,700 cards.\n-The very first Yu-Gi-Oh! ZEXAL video game and the first Yu-Gi-Oh! video game available for the Nintendo 3DS handheld system.\n-Twelve playable cha...": "扮演您自己或該系列中的 11 個可玩角色之一，如 Yuma、Astral、Tori、Shark 等，每個角色都有自己的故事情節，並獲得參加世界決鬥嘉年華的邀請，在那裡您可以與電視節目中的 40 多名決鬥者戰鬥！玩家可以享受故事模式和自由決鬥模式，在其中可以玩超過 5,700 張卡牌。\n-第一個遊戲王！ZEXAL 視頻遊戲和第一款遊戲王！適用於任天堂 3DS 手持系統的視頻遊戲。\n- 十二個可玩的...",
    "You thought you'd defeated the Nonary Game, but now it's back, and more deadly than ever. It'll take cunning, skill, and more than a little luck to escape alive, but do you really have a choice?\nIDO agents working in California report that preliminary findings indicate the exceedingly dangerous Japanese adventure game known as \"Zennin Shiboudesu\" has somehow crossed the Pacific. Attempts were made to contain it, but some carriers seem to have escaped the quarantine and are now at large.": "你以為你已經打敗了九元遊戲，但現在它又回來了，而且比以往任何時候都更加致命。要想活著逃脫，需要狡猾、技巧和一點點運氣，但你真的有選擇嗎？\n在加州工作的 IDO 特工報告說，初步調查結果表明，極其危險的日本冒險遊戲“Zennin Shiboudesu”已經以某種方式穿越了太平洋。人們曾試圖遏制它，但一些攜帶者似乎已經逃脫了隔離，目前在逃。",
    "The desert's last safe haven is a lone oasis you call home. So draw a line in the sand and fight to protect it! As you explore the desert and solve puzzling dungeons, you'll gather resources to build up your oasis with the water spirit Esna. Allies will join your cause, so equip them with weapons, and use their skills to slay towering bosses.\n\nThe Ever Oasisâ„¢ game is a new action-adventure RPG grown from the ground up by Koichi Ishii, creator of the Mana series and producer at GREZZO, the stud...": "沙漠最後的避風港是你稱之為家的孤獨綠洲。所以，在沙子上畫一條線，並努力保護它！當你探索沙漠並解決令人費解的地牢時，你將收集資源，與水精靈埃斯納一起建立你的綠洲。盟友將加入你的事業，所以為他們配備武器，並利用他們的技能殺死高大的頭目。\n\n《Ever Oasis™》遊戲是一款全新的動作冒險角色扮演遊戲，由《聖劍傳說》系列的創作者兼 GREZZO 製作人石井浩一 (Koichi Ishii) 精心打造。",
    "Nintendo.com Description (from Ad Blurbs)It?s all right here, in 50 Classic Games for Nintendo 3DS! With new \neye-popping graphics and interactive features, you?ll get lost for hours \nin the wildly entertaining games that range from backgammon to \nbrainteasers! Try your hand at Texas Hold?Em, Blackjack, and Roulette. \nRediscover classic board and dice games like Farkle, Chess, and \nMahjongg. Go fishing, play air hockey, take out enemy battleships, and \nthrow darts! Solve tricky brainteasers, pic...": "Nintendo.com 描述（來自 Ad Blurbs）Nintendo 3DS 的 50 款經典遊戲就在這裡！與新\n令人瞠目結舌的圖形和交互功能，你會迷失幾個小時\n在從雙陸棋到\n腦筋急轉彎！試試德州撲克、二十一點和輪盤賭。\n重新發現經典的棋盤和骰子遊戲，例如 Farkle、國際象棋和\n麻將。釣魚、打空氣曲棍球、幹掉敵方戰艦，\n扔飛鏢！解決棘手的腦筋急轉彎，圖片...",
    "Two kingdoms are on the brink of war. Whose side will you choose? Torn between two families, you're an heir of Hoshido, raised by Nohrian royals. If you walk the path of Conquest, you must fight to change your misguided kingdom from within. Command warriors with expert precision and forge deep relationships to master this turn-based strategy game.": "兩個王國正處於戰爭邊緣。你會選擇哪一邊呢？你是星戶的繼承人，由諾里王室成員撫養長大，夾在兩個家庭之間。如果你走征服之路，你就必須努力從內部改變你被誤導的王國。以專業的精確度指揮戰士並建立深厚的關係，以掌握這款回合製策略遊戲。",
    "Start your turbo-charged engines and blast into the outrageous arcade racing game, Face Racers: Photo Finish, with photo customizable 3D racers that put YOU in the game! Available on the Nintendo 3DS, Face Racers delivers unique, in-your-face gameplay, with dangerous obstacles that come to life in 3D right before your eyes! Take photos with your 3DS camera and place them on the face of your custom 3D racer, billboards and power-ups. Take on friends in multiplayer mode for a true photo finish in ...": "啟動你的渦輪增壓引擎，衝進令人驚嘆的街機賽車遊戲《Face Racers: Photo Finish》，照片可定制的 3D 賽車讓你身臨其境！Face Racers 可在 Nintendo 3DS 上使用，提供獨特的、面對面的遊戲玩法，危險的障礙物以 3D 形式呈現在您眼前！使用 3DS 相機拍攝照片並將其放置在自定義 3D 賽車、廣告牌和道具的表面上。在多人遊戲模式中與朋友較量，獲得真正的照片完成...",
    "Danny is troubled with insomnia. Desperate for sleep and unable to get it, he finds himself a test subject in the mad Dr. Reubens' crowning achievement, C.R.U.S.H. (or Cognitive Regression Utilizing pSychiatric Heuristics, if you prefer). C.R.U.S.H. puts the subject under hypnosis and allows them to explore their psyche and confront their own deep, dark secrets.": "丹尼飽受失眠之苦。由於極度渴望睡眠卻無法入睡，他發現自己成為了瘋狂魯本斯博士的最高成就 C.R.U.S.H. 的測試對象。（或者如果您願意的話，利用精神病學啟發法進行認知回歸）。壓碎。將受試者置於催眠狀態，讓他們探索自己的心靈，面對自己內心深處、黑暗的秘密。",
    "Save Princess Peach's voice, the Beanbean Kingdom and ... Bowser?!\n\n\n\nThe game that launched the Mario & Luigi series returns looking better than ever before. In this renewed classic, Mario and Luigi journey to the Beanbean Kingdom with Bowser to restore Princess Peach?s voice. Control Mario and Luigi simultaneously, making use of their unique Bros. Moves to solve puzzles and emerge victorious in action-packed battles. Pay heed to the enemy?s patterns and time your reactions right to land satisf...": "拯救桃子公主的聲音、豆豆王國和……庫巴？ ！\n\n\n\n推出《馬里奧與路易吉》系列的遊戲回歸，看起來比以往任何時候都更好。在這部全新經典中，馬里奧和路易吉與庫巴一起前往豆豆王國，恢復桃子公主的聲音。同時控制馬里奧和路易吉，利用他們獨特的兄弟動作來解決謎題並在充滿動作的戰鬥中取得勝利。注意敵人的模式並及時做出反應，以獲得滿意的結果...",
    "F1 2011 is the handheld adaptation of the main F1 2011 game. It offers the full 2011 racing season with all stages and it incorporates the multi-season career mode from the main game. In addition there are Grand Prix weekends and three-lap sprints. Grand Prix events are split up in practice runs, qualifying sessions and the main races themselves. There are driving aids (including determining the race distance), weather effects, fuel and tires options, and it includes the KERS and DRS systems fro...": "F1 2011 是主要 F1 2011 遊戲的掌機改編版。它提供了完整的 2011 年賽車賽季的所有階段，並融合了主遊戲中的多賽季生涯模式。此外還有大獎賽週末和三圈衝刺賽。大獎賽分為練習賽、排位賽和正賽。有駕駛輔助（包括確定比賽距離）、天氣影響、燃料和輪胎選項，並且包括來自...的 KERS 和 DRS 系統。",
    "This new yet traditional offering from Square Enix captures the charm and elegant and simplicity of yesteryear's canonical RPGs. Become a Warrior of Light and journey to the land of Luxemdarc in this classic tale of personal growth and adventure.": "Square Enix 推出的這款全新而傳統的產品捕捉了昔日經典角色扮演遊戲的魅力、優雅和簡潔。在這個關於個人成長和冒險的經典故事中，成為一名光之戰士並前往盧森達爾克之地。",
    "DEAD OR ALIVE Dimensions takes the vivacious characters and locales that have made the DOA franchise a hit with gamers everywhere and presents them in eye-popping 3D. All of the punches, kicks, counters and holds that have defined the series as a top-tier fighter are present for the first time on a portable gaming system - the Nintendo 3DS. DEAD OR ALIVE Dimensions features some of the best content from the series spanning all of the titles from the original DOA up to DOA 4.": "《DEAD OR ALIVE Dimensions》採用了 DOA 系列深受世界各地玩家歡迎的活潑角色和場景，並以令人瞠目結舌的 3D 方式呈現。將該系列定義為頂級格鬥遊戲的所有拳擊、踢腿、反擊和握持動作均首次出現在便攜式遊戲系統 - 任天堂 3DS 上。DEAD OR ALIVE Dimensions 收錄了該系列的一些最佳內容，涵蓋從最初的《DOA》到《DOA 4》的所有遊戲。",
    "Etrian Odyssey Untold is a game in two parts: the first part is a story-driven first person adventure into the world of Etria. Appropriate for players new to the series and veterans alike, the Story mode gives players five pre-made characters, each with their own personalities and dialogue to explore a side of Etria not seen in the first game. Adventurers must brave new dungeon layouts, floors, and enemies to find out the truth of the Yggdrasil Tree and the mysterious girl, Frederica.\n\nFor serie...": "Etrian Odyssey Untold 是一款由兩部分組成的遊戲：第一部分是故事驅動的第一人稱冒險，進入 Etria 世界。故事模式適合該系列的新玩家和老玩家，為玩家提供五個預製角色，每個角色都有自己的個性和對話，以探索第一款遊戲中未見的 Etria 的一面。冒險者必須勇敢面對新的地牢佈局、樓層和敵人，找出世界之樹和神秘女孩弗雷德麗卡的真相。\n\n對於系列...",
    "The newest installment of the fan-favorite Mario Kart franchise brings Mushroom Kingdom racing fun into glorious 3D. For the first time, drivers explore new competitive kart possibilities, such as soaring through the skies or plunging to the depths of the sea. New courses, strategic new abilities and customizable karts bring the racing excitement to new heights.": "深受粉絲喜愛的《馬里奧賽車》系列的最新作品將蘑菇王國的賽車樂趣帶入光彩奪目的 3D 之中。車手們第一次探索新的競技卡丁車可能性，例如翱翔於天空或潛入大海深處。新賽道、戰略性新能力和可定制的卡丁車將賽車的興奮感提升到了新的高度。",
    "For centuries, the tree Yggdrasil has been a constant presence in the lives of the people of Tharsis. It looms on the horizon, visible from everywhere in the city. But its roots are in a far-off land where no one has ventured until the Outland Count of Tharsis sponsors an Explorers Guild to reach Yggdrasil and discover its secrets. You are the latest explorer arriving in Tharsis to seek your fame and fortune. Board your skyship and set out into the clouds in search of treasure, glory, and the an...": "幾個世紀以來，世界之樹一直存在於塔爾西斯人民的生活中。它隱約出現在地平線上，從城市的任何地方都可以看到。但它的根源在於一片遙遠的土地，直到塔西斯外域伯爵贊助探險家公會到達世界樹並發現它的秘密之前，沒有人冒險去過那裡。您是最新抵達塔爾西斯尋求名譽和財富的探險家。登上你的飛船，出發進入雲端，尋找寶藏、榮耀和……",
    "Over 70 levels of banana-hoarding fun featuring Donkey Kong and Diddy Kong. Run, jump, climb and defeat enemies through diverse environments until you retrieve Donkey Kong's stolen banana hoard. Rebuilt and optimized for portable play on the Nintendo 3DS system.": "超過 70 個級別的香蕉囤積樂趣，以大金剛和吹笛人為主角。在不同的環境中奔跑、跳躍、攀爬並擊敗敵人，直到取回大金剛偷來的香蕉寶藏。針對任天堂 3DS 系統上的便攜式遊戲進行了重建和優化。",
    "Join Korra and her friends to stop an ancient evil that has emerged from the portal and threatens the balance of both worlds!\n\n\n\nOriginal Avatar storyline penned by the TV show's creators.\n\nWield the power of all 4 elements?water, earth, fire, and air as only the Avatar can!\n\nTake control of Korra and her friends in strategic battles spanning the world.\n\nBeat overwhelming odds by activating the all-powerful Avatar state.": "與科拉和她的朋友們一起阻止從傳送門中出現並威脅兩個世界平衡的遠古邪惡！\n\n\n\n《阿凡達》的原創故事情節由電視節目的創作者撰寫。\n\n像阿凡達一樣運用所有 4 種元素的力量：水、土、火和空氣！\n\n在全球範圍內的戰略戰鬥中控制科拉和她的朋友們。\n\n通過激活全能的阿凡達狀態來克服壓倒性的困難。",
    "Cooking Mama 5: Bon AppÃ©tit! (ã‚¯ãƒƒã‚­ãƒ³ã‚°ãƒžãƒžï¼• Kukkingu Mama 5) is the sequel to the Nintendo 3DS video game Cooking Mama 4: Kitchen Magic and is the fifth installment to the Cooking Mama series on the Nintendo 3DS. It was released in Japan on November 21, 2013, on September 16, 2014 in North America [2] and on March 6, 2015 in Europe.[3] It contains over 60 recipes and new household activities/games.[4]": "烹飪媽媽 5：祝你胃口好！（庫金古媽媽 5）是任天堂 3DS 視頻遊戲《烹飪媽媽 4：廚房魔法》的續作，也是任天堂 3DS 上烹飪媽媽系列的第五部。它於2013年11月21日在日本發行，2014年9月16日在北美髮行[2]，2015年3月6日在歐洲發行。[3]它包含 60 多種食譜和新的家庭活動/遊戲。 [4]",
    "Summon up all your skill, precision and nerves of steel: Flap Flap won'tgo easy on you!\n\n\nBit of a lightweight? Then all the bonuses and special abilities will come in handy?\n\n\nUnfortunately, there are also enemies and obstacles to make things complicated, too!": "調動你所有的技能、精確度和鋼鐵般的意志：Flap Flap 對你來說並不容易！\n\n\n有點輕？那麼所有的加成和特殊能力都會派上用場嗎？\n\n\n不幸的是，還有敵人和障礙讓事情變得複雜！",
    "Launch S.T.E.A.M., an elite team of steam-powered special-forces soldiers, to save the world from an alien menace. In this new blend of action and strategy, our commandos use steam power stored in special backpacks to move into position and fire an arsenal of distinct weapons. Pick your team members and load out, then use strategy to decide the best way to approach this steampunk-inspired battlefield.": "成立 S.T.E.A.M.，這是一支由蒸汽動力特種部隊士兵組成的精英團隊，旨在拯救世界免受外星威脅。在這種行動與策略的新融合中，我們的突擊隊員使用特殊背包中存儲的蒸汽動力移動到位並發射一系列不同的武器。選擇你的團隊成員並裝載，然後使用策略來決定接近這個蒸汽朋克風格的戰場的最佳方式。",
    "Travel to the past to save the present in this classic Dragon Quest adventure that has been completely remade from the ground up for Nintendo 3DS. The world has been rebuilt, the characters have new 3D models and the story has been completely re-localized. Even customize your party with over 30 classes and rank up in turn-based battles to learn new spells and abilities.": "在這款經典勇者鬥惡龍冒險遊戲中穿越到過去拯救現在，該冒險遊戲已針對 Nintendo 3DS 進行了徹底重製。世界已經重建，角色有了新的 3D 模型，故事也已經完全重新本地化。甚至可以用 30 多個類別來定制您的隊伍，並在回合製戰鬥中升級以學習新的咒語和能力。",
    "FANTASY LIFE* is an original RPG for the Nintendo 3DS from LEVEL-5, featuring music by Nobuo Uematsu and image illustration by Yoshitaka Amano. \nSet in a beautiful and vast open world, players create their own avatars and take up a vocation of their choosing, living out their lives as they see fit. You can set out on an adventure to save the world, or spend your days in leisurely pursuits such as cooking or fishing. Find the meaning of your new life in the limitless possibilities that reside in ...": "FANTASY LIFE* 是任天堂 3DS 的原創角色扮演遊戲，從 LEVEL-5 開始，由植松伸夫 (Nobuo Uematsu) 創作音樂，天野喜孝 (Yoshitaka Amano) 繪製插畫。\n以美麗而廣闊的開放世界為背景，玩家創建自己的化身並從事自己選擇的職業，過著自己認為合適的生活。您可以踏上拯救世界的冒險之旅，也可以享受烹飪或釣魚等休閒活動。在無限的可能性中找到新生活的意義......",
    "Pink? Check. Puffy? Check. Powerful? You have no idea. \n\nDevour trees, obstacles, and huge chunks of stages with Kirbyâ€™s Hypernova ability and inhale enemies to copy epic new moves like Archer. Itâ€™s a grand new Kirbyâ„¢ adventure PLUS a new multiplayer battle mode, Kirby Fighters! \n\nWhen a mysterious being kidnaps King Dedede atop a giant Dreamstalk, only Kirby can save the day! Jump from the foreground to the background in dynamic 3D side-scrolling environments while using new and returning...": "粉色的？查看。蓬鬆？查看。強大的？你不知道。\n\n使用卡比的超新星能力吞噬樹木、障礙物和大塊舞台，並吸入敵人以模仿弓箭手等史詩般的新動作。這是一場盛大的全新卡比冒險之旅，還有全新的多人戰鬥模式“卡比戰士”！\n\n當一個神秘生物在巨大的夢莖上綁架了帝帝帝國王時，只有卡比可以拯救世界！在動態 3D 橫向捲軸環境中從前台跳轉到後台，同時使用新的和返回的...",
    "LEGO Star Wars: The Force Awakens marks the triumphant return of the No. 1 LEGO videogame franchise and immerses fans in the new Star Wars adventure like never before. Players can relive the epic action from the blockbuster film in a way that only LEGO can offer, featuring all of the storylines from Star Wars: The Force Awakens, retold through the clever and witty LEGO lens. The game will also feature exclusive playable content that takes players on adventures between Star Wars: Episode VI: Retu...": "樂高星球大戰：原力覺醒標誌著第一大樂高電子遊戲系列的凱旋歸來，讓粉絲們以前所未有的方式沉浸在全新的星球大戰冒險中。玩家可以以只有樂高才能提供的方式重溫這部大片中的史詩般的動作，其中包含《星球大戰：原力覺醒》的所有故事情節，並通過巧妙而詼諧的樂高鏡頭重述。該遊戲還將提供獨家可玩內容，帶領玩家踏上《星球大戰：第六集：回歸》之間的冒險……",
    "The popular fantasy action franchise Monster Hunter is now one of the most iconic gaming series in the world selling over 21 million copies worldwide since the series began in 2004. Players take on the role of a hunter and are sent to explore a settlement within the Monster Hunter universe, completing quests on their journey to seek and slay monsters whilst improving their skills and earning equipment upgrades. With many challenging monsters and over 200 quests the latest edition to the series i...": "廣受歡迎的奇幻動作系列《怪物獵人》自 2004 年推出以來，現已成為世界上最具標誌性的遊戲系列之一，全球銷量超過 2100 萬份。玩家扮演獵人的角色，被派去探索《怪物獵人》宇宙中的定居點，在旅途中完成尋找和殺死怪物的任務，同時提高技能並獲得裝備升級。該系列的最新版本包含許多具有挑戰性的怪物和 200 多個任務...",
    "Join the original digital chef as she makes her debut on Nintendo 3DS with Cooking Mama 4: Kitchen Magic! From new recipes and ways to play to fresh kitchen activities and dish combinations, the iconic kitchen cutie has some tricks up her sleeve that will magically transform kitchen newbies into master culinary artists! Slice, dice, knead, toss and flip your way through more than 200 unique Touch Screen mini-games as you cook in brand new ways with the Nintendo 3DS gyroscope: crack eggs, flip pa...": "與原創數字廚師一起在 Nintendo 3DS 上首次亮相《烹飪媽媽 4：廚房魔法》！從新的食譜和玩法到新鮮的廚房活動和菜餚組合，這位標誌性的廚房小可愛有一些妙招，可以神奇地將廚房新手變成烹飪大師！當您使用 Nintendo 3DS 陀螺儀以全新方式烹飪時，您可以在 200 多個獨特的觸摸屏迷你游戲中進行切片、切丁、揉捏、拋擲和翻轉：打雞蛋、翻轉...",
    "Ace Combat: Assault Horizon Legacy is a flight-sim / arcade fighter combat action game.  The game is typically played in a 3rd-Person, behind the aircraft, or 1st-Person, inside the cockpit view.  It features series mainstays such as numerous selectable aircraft and the ability to purchase parts and weapons to customize the fighters.  Where Assault Horizon Legacy sets itself apart from current console versions of Assault Horizon in that the gameplay is tipped more in favor of the arcade-style ac...": "皇牌空戰：突擊地平線遺產是一款飛行模擬/街機戰鬥機格鬥動作遊戲。該遊戲通常以第三人稱（在飛機後面）或第一人稱（在駕駛艙視圖內）進行。它具有系列支柱，例如眾多可選擇的飛機以及購買零件和武器來定制戰鬥機的能力。《突擊地平線：遺產》與當前主機版《突擊地平線》的不同之處在於，遊戲玩法更傾向於街機風格的遊戲……",
    "With the threat of the evil Xehanort's return, King Mickey and Yen Sid have begun preparations to combat him.  Their first step is to turn Keyblade wielders Sora and Riku into Keyblade Masters.  Sora and Riku are given the task of completing the Mark of Mastery exam which when completed will help them obtain a great power to aid in the fight against Xehanort.  This test will not be so easy as the two must venture together into seven Sleeping Worlds and find the the Keyholes of Sleep to awaken th...": "隨著邪惡的 Xehanort 捲土重來的威脅，米奇國王和 Yen Sid 開始準備對抗他。他們的第一步是將鍵刃持有者 Sora 和 Riku 轉變為鍵刃大師。Sora 和 Riku 接到了完成精通標記考試的任務，完成後將幫助他們獲得強大的力量來幫助對抗 Xehanort。這項測試不會那麼容易，因為兩人必須一起冒險進入七個睡眠世界並找到睡眠的鑰匙孔以喚醒......",
    "Arriving on Nintendo's new handheld system for the first time ever Mario & Sonic at the London 2012 Olympic Games contains over 50 original Olympic themed events playable in both single and multiplayer modes. Bringing a whole new dimension to the Mario & Sonic universe, the glasses-free 3D visuals and the unique control systems mean there are plenty of new and exciting ways to compete for a coveted gold medal!": "2012 年倫敦奧運會上首次登陸任天堂全新掌上系統的《馬里奧與索尼克》包含 50 多個原創奧運主題賽事，可在單人和多人模式下進行。裸眼 3D 視覺效果和獨特的控制系統為《馬里奧與索尼克》宇宙帶來了全新的維度，這意味著有很多新的、令人興奮的方式來爭奪令人垂涎的金牌！",
    "After the happenings of Luigi's Mansion, Luigi once again has to put on his ghostbusting gear. This time he visits Evershade Valley, where the destruction of the Dark Moon caused all ghosts to become hostile to humans. Luigi is hired by the eccentric professor Gadd to visit five haunted mansions to retrieve the Dark Moon parts.\n\nLuigi's weapon of choice is vacuum device called PolterGust 5000 which is used to fight against the numerous ghost enemies. The basic procedure is always the same: Luigi...": "路易吉洋館發生事件後，路易吉再次穿上他的捉鬼裝備。這次他來到了永影谷，闇月的毀滅導致所有鬼魂都對人類產生了敵意。路易吉受古怪教授加德的僱傭，前往五座鬼屋取回闇月部件。\n\n路易吉選擇的武器是名為 PolterGust 5000 的真空裝置，用於對抗眾多幽靈敵人。基本程序始終相同：Luigi...",
    "Monster Hunter Generations is an action role-playing video game developed and published by Capcom for the Nintendo 3DS. Announced in May 2015, the game was released in Japan in November 2015, under the title Monster Hunter Cross, and was released internationally in July 2016. Like other titles in the Monster Hunter series, players undertake quests that involve hunting dangerous creatures. Major additions in this installment include special attacks, new combat styles, and the ability to play as F...": "《怪物獵人世代》是一款由 Capcom 為任天堂 3DS 開發和發行的動作角色扮演視頻遊戲。該遊戲於 2015 年 5 月發布，並於 2015 年 11 月在日本發布，遊戲名稱為《怪物獵人 Cross》，並於 2016 年 7 月在全球發布。與《怪物獵人》系列中的其他遊戲一樣，玩家將承擔涉及狩獵危險生物的任務。本期的主要新增內容包括特殊攻擊、新的戰鬥風格以及扮演 F...",
    "A tale of two armies with one destiny\n\nIn a continent that was torn asunder by warring gods, guide two armies through brutal tactical battlesâ€”as this reimagined RPG epic invades the West! Uncover the intertwining stories of Alm and Celica, engage foes, fend off dragons, and explore 3D dungeons. Your prowess will grow as you master this melding of modern and legacy Fire Emblemâ„¢ gameplay.\n\nAlm and Celica lead separate armies united by a common goal: to stop the war and unify Valentia. Each arm...": "兩支軍隊同命運的故事\n\n在一個被戰神撕裂的大陸上，引導兩支軍隊進行殘酷的戰術戰鬥——這款重新想像的角色扮演史詩入侵了西方！揭開阿爾姆和塞莉卡相互交織的故事，與敵人交戰，擊退巨龍，並探索 3D 地下城。當你掌握了現代與傳統火焰紋章™遊戲玩法的融合時，你的實力將會不斷增強。\n\n阿爾姆和塞莉卡領導著各自的軍隊，為了一個共同的目標而團結起來：停止戰爭並統一瓦倫西亞。每隻手臂...",
    "In this enhanced remake of Pokémon Ruby Version, players travel throughout the Hoenn region on a journey to become a Pokémon Master. Like the original, the goal is to challenge the eight Pokémon Gyms of the Hoenn League and earn badges from their Gym Leaders, then take on the Elite Four and the Champion. However, the world is endangered when the villainous Team Magma tries to expand the continents by resurrecting the ancient Legendary Pokémon Groudon.\n\nAside from technical upgrades, the game is ...": "在這款神奇寶貝紅寶石版的增強版重製版中，玩家將穿越豐緣地區，踏上成為神奇寶貝大師的旅程。與原版一樣，目標是挑戰豐緣聯盟的八個神奇寶貝道館，並從道館領袖那裡獲得徽章，然後挑戰精英四強和冠軍。然而，當邪惡的岩漿隊試圖通過復活古老的傳奇神奇寶貝固拉多來擴張大陸時，世界正面臨危險。\n\n除了技術升級之外，遊戲...",
    "On the day of the annual Sticker Fest, Bowser decides to pull a prank and scatters six Royal Stickers across the land. To retrieve these mysterious, magical stickers, which are now stuck onto Bowser and his underlings, Mario sets off on an adventure with Kersti, a sticker fairy, visiting prairies, deserts, forests, snowy mountains and volcanoes around the world.": "在一年一度的貼紙節當天，鮑澤決定搞個惡作劇，將六張皇家貼紙撒在了整個土地上。為了取回這些貼在鮑澤和他的部下身上的神秘魔法貼紙，馬里奧與貼紙仙子克斯蒂一起踏上了冒險之旅，參觀了世界各地的草原、沙漠、森林、雪山和火山。",
    "Pokémon Sun, along with Pokémon Moon, marks the start of the seventh generation of the Pokémon franchise. The game takes place in the Alola region, an archipelago whose culture, geography, and native wildlife are based on those of Hawaii. A number of Alola's native Pokémon have never been seen before, bringing the series' total number of Pokémon species to over 800.\n\nThe story follows a customizable protagonist who has just moved to the region and received their first Pokémon. What differs from ...": "《精靈寶可夢太陽》和《精靈寶可夢月亮》標誌著第七代《精靈寶可夢》系列的開始。遊戲發生在阿羅拉群島，該群島的文化、地理和本土野生動物均以夏威夷為基礎。許多阿羅拉本土神奇寶貝以前從未見過，使該系列的神奇寶貝種類總數超過 800 種。\n\n這個故事講述了一個可定制的主角，他剛剛搬到該地區並收到了他們的第一隻神奇寶貝。與...有何不同",
    "Inspired by the upcoming DisneyPixar animated film, Cars 2: The Video Game lets players jump into the Cars 2 universe with some of their favorite Cars personalities in exotic locations around the globe.": "受到即將上映的迪士尼皮克斯動畫電影的啟發，《汽車總動員 2：電子遊戲》讓玩家與他們最喜歡的汽車總動員人物一起進入全球異國他鄉的汽車總動員 2 宇宙。",
    "Having received tremendous acclaim in its previous releases on PC and WiiWare, Cave Story, an indie side scrolling 2D action game, now makes its way into an all new dimension with Cave Story 3D for Nintendo 3DS. At once both a throwback to classic 2D action platformers and also the potential future of the genre, Cave Story 3D blends tight controls, superb level design, and excellent story and presentation to deliver a memorable, addicting retro experience!": "《Cave Story》是一款獨立橫向捲軸 2D 動作遊戲，在之前的 PC 和 WiiWare 版本中獲得了巨大好評，現在憑藉適用於 Nintendo 3DS 的《Cave Story 3D》進入了一個全新的維度。Cave Story 3D 既是對經典 2D 動作平台遊戲的回歸，也是該類型的潛在未來，它融合了嚴格的控制、精湛的關卡設計以及出色的故事和演示，帶來令人難忘、令人上癮的複古體驗！",
    "Compete On-the-go with Mario and Sonic! All of your favorite Mario? and Sonic characters are ready to join the fun in Rio de Janeiro, host of the Olympic Games in 2016. Then take the rivalry on the road with this portable collection of supercharged events like Soccer, Table Tennis, or test your skills in a challenging game of Golf. Take on fun and exciting events set throughout host city Rio de Janeiro. Join Mario, Sonic and your favorite characters to take on new challenging events like Soccer ...": "與馬里奧和索尼克一起隨時隨地競爭！所有你最喜歡的馬里奧？索尼克和索尼克角色已準備好加入 2016 年奧運會主辦國里約熱內盧的歡樂之旅。然後參加足球、乒乓球等一系列超強賽事的便攜式賽事，在公路上展開競爭，或者在具有挑戰性的高爾夫比賽中測試您的技能。參加在主辦城市里約熱內盧舉辦的有趣而激動人心的活動。與馬里奧、索尼克和您最喜歡的角色一起參加足球等新的挑戰性活動......",
    "Mario Party: Island Tour lets you take the fun on the road with your Nintendo 3DS system!\n\nFace off against friends and family in the all-new, ultimate Mario Party â€“ a portable minigame extravaganza thatâ€™s bursting with gameplay possibilities. If youâ€™ve never played a Mario Party game before, youâ€™re in for a treat.\n\nThereâ€™s always something new to see on the Party Islands.\nIn this ultimate showdown you can take on the road, blaze through the 7 new game boards, some of which take just m...": "《馬里奧派對：島嶼之旅》讓您使用 Nintendo 3DS 系統享受旅途的樂趣！\n\n在全新的終極《馬里奧派對》中與朋友和家人對決——這是一款充滿遊戲可能性的便攜式迷你游戲盛宴。如果您以前從未玩過《馬里奧派對》遊戲，那麼您一定會大飽眼福。\n\n在派對群島上總有新的東西可看。\n在這場終極對決中，您可以上路，在 7 個新遊戲版塊中大放異彩，其中一些只需幾分鐘...",
    "The court jester Dhoulmagus of the kingdom of Trodain stole a powerful magical scepter sealed beneath the royal castle. Using the power of the scepter, Dhoulmagus destroyed the castle, placed a curse upon the kingdom and its people, and turned King Trode into a troll and the princess into a horse. A sole surviving castle guard journeys with the king, the princess, a reformed bandit named Yangus and a few other companions in search of the evil jester and a way to break the curse. \n\nDragon Quest V...": "特羅丹王國的宮廷小丑杜爾馬格斯偷走了封印在皇家城堡下方的強大魔法權杖。杜爾馬格斯利用權杖的力量摧毀了城堡，對王國及其人民下了詛咒，並將特羅德國王變成了巨魔，公主變成了馬。唯一倖存的城堡守衛與國王、公主、改過自新的強盜楊格斯以及其他幾個同伴一起踏上旅程，尋找邪惡的小丑和打破詛咒的方法。\n\n勇者鬥惡龍 V..",
    "Culdcept is a hybrid board/card game where the objective is to generate the most mana before making it back to the castle.\n\nEach player starts out with a deck of 50 cards. Card types range from monster cards (e.g. Skeleton), which are used to accumulate territory on the board to increase your mana; Equipment (e.g. Chain Mail), which will boost your monsters' abilities when they battle; and Magic (e.g. Holy Word 0), which can be used to help you or hinder the other players on the board. When a pl...": "Culdcept 是一款混合棋盤/紙牌遊戲，其目標是在返回城堡之前產生最多的法力。\n\n每個玩家一開始都有一副 50 張牌。卡牌類型包括怪物卡（例如骷髏），用於在棋盤上積累領土以增加法力；裝備（例如鎖子甲），可以增強怪物戰鬥時的能力；和魔法（例如聖言0），可以用來幫助你或阻礙棋盤上的其他玩家。當一個...",
    "PAC-MAN and Galaga bring their iconic gameplay to spectacular 3D in an exciting six game package for the Nintendo 3DS! Enjoy classic hits PAC-MAN, PAC-MAN Championship Edition, Galaga, and Galaga Legions, or play two brand new games developed exclusively for the Nintendo 3DS. In PAC-MAN Tilt, move PAC-MAN through stages filled with obstacles, platforms and ghosts with tilt controls. Flippers, platforms and power pellets help PAC-MAN jump, flip, swing, and eat his way to the finish line. Rid spac...": "PAC-MAN 和 Galaga 將他們的標誌性遊戲玩法帶入令人興奮的 3D 3D 遊戲中，為 Nintendo 3DS 推出了令人興奮的六款遊戲套裝！享受經典熱門 PAC-MAN、PAC-MAN 冠軍版、Galaga 和 Galaga Legions，或者玩專為 Nintendo 3DS 開發的兩款全新遊戲。在 PAC-MAN Tilt 中，通過傾斜控制移動 PAC-MAN 通過充滿障礙物、平台和幽靈的舞台。腳蹼、平台和動力丸幫助 PAC-MAN 跳躍、翻轉、擺動和吃食，直至終點線。擺脫空間...",
    "Collect, build and battle your palm-sized robot. Play as Van Yamano, a young boy who comes upon a unique LBX - a complex, customizable, palm-sized robot. Use it - and team up with familiar characters from the hit TV series - to take down the evil corporation known as the New Dawn Raisers.\n\nFeatures:\n-Collect and build your own palm-sized robot from more than 4,000 parts to create a one-of-a-kind LBX\n-Choose from more than 130 different complete sets of matching parts, or mix and match.\n-Customiz...": "收集、建造並與你的手掌大小的機器人進行戰鬥。扮演 Van Yamano，一個小男孩，他遇到了一個獨特的 LBX——一個複雜的、可定制的、手掌大小的機器人。使用它 - 並與熱門電視劇中熟悉的角色合作 - 摧毀名為“新黎明崛起者”的邪惡公司。\n\n特點：\n-用 4,000 多個零件收集並建造您自己的手掌大小的機器人，打造出獨一無二的 LBX\n- 從超過 130 種不同的全套匹配零件中進行選擇，或混合搭配。\n-定制...",
    "Cut down entire legions of enemies as fan-favorite Legend of Zelda characters using powerful moves as Hyrule Warriors comes to the Nintendo 3DS. Control multiple characters to enhance your strategies and enjoy new story elements with playable characters from The Legend of Zelda: The Wind Waker, such as Tetra, King Daphnes, and more.\n\nWar rages as the delicate balance of the Triforce is disrupted. The kingdom of Hyrule is once again being torn apart by a dark power, this time lead by Sorceress Ci...": "在任天堂 3DS 上，海拉爾無雙 (Hyrule Warriors) 登場，扮演深受粉絲喜愛的《塞爾達傳說》角色，使用強大的招式消滅大批敵人。控制多個角色來增強你的策略，並通過《塞爾達傳說：風之杖》中的可玩角色（例如 Tetra、King Daphnes 等）享受新的故事元素。\n\n三角力量的微妙平衡被破壞，戰爭愈演愈烈。海拉魯王國再次被黑暗力量撕裂，這次由女巫茨領導……",
    "The makers of The Legend of Legacy bring the classic JRPG back to form in The Alliance Alive, a new adventure that evokes the nostalgia of the JRPG greats by offering huge world-exploration, an intertwining story of 9 protagonists, and well-designed battle mechanics.\n\n\nOne thousand years ago, Daemons invaded the world of Humans. They subjugated Humanity and created the Great Barrier to separate the realms. The world was thrown into upheaval, and the Dark Current was born. Humanity was decimated ...": "《The Legend of Legacy》的製作者在《The Alliance Alive》中將經典 JRPG 重新演繹出來，這是一款全新的冒險遊戲，通過提供宏大的世界探索、9 位主角相互交織的故事以及精心設計的戰鬥機制，喚起了 JRPG 偉人的懷舊之情。\n\n\n一千年前，惡魔入侵人類世界。他們征服了人類並創造了隔離各個領域的大屏障。世界陷入劇變，暗流誕生。人類慘遭毀滅……",
    "Dream Trigger 3D showcases the wow factor of the 3DS like no other game. A stunning mixture of explosive graphics and nonstop action, it is a signature shooter for the system. Play as a fixer of dreams', turning nightmare landscapes into gorgeous dreamscapes in this must-have visual masterpiece for new 3DS owners.": "Dream Trigger 3D 展示了 3DS 的令人驚嘆的因素，這是其他遊戲所無法比擬的。它是爆炸性圖形和不間斷動作的驚人結合，​​是該系統的標誌性射擊遊戲。在這款 3DS 新用戶必備的視覺傑作中，扮演夢想的修復者，將噩夢般的風景變成華麗的夢境。",
    "Metroid: Samus Returns is a side-scrolling action-adventure video game developed collaboratively by MercurySteam and Nintendo, with the latter also publishing it for the Nintendo 3DS handheld game console. A part of the science fiction Metroid series, the game is a reimagining of the 1991 Game Boy game Metroid II: Return of Samus, and was released worldwide on 15 September 2017. It follows series protagonist Samus Aran, who is sent by the Galactic Federation to exterminate the parasitic Metroids...": "《銀河戰士：薩姆斯歸來》是一款由 MercurySteam 和任天堂合作開發的橫向捲軸動作冒險視頻遊戲，後者還為任天堂 3DS 手持遊戲機發行了該遊戲。作為科幻小說《銀河戰士》系列的一部分，該遊戲是對 1991 年 Game Boy 遊戲《銀河戰士 II：薩姆斯歸來》的重新演繹，於 2017 年 9 月 15 日在全球發行。該遊戲講述了系列主角薩姆斯·阿蘭 (Samus Aran) 被銀河聯邦派去消滅寄生銀河戰士的故事……",
    "Etrian Odyssey 2 Untold - The Fafnir Knight is a continuation of the Untold spin-off series for Etrian Odyssey. This Etrian Odyssey Untold game is an upgraded and enhanced version of the original Nintendo DS game: Etrian Odyssey II: Heroes of Lagaard.\n\nIn the same line as Etrian Odyssey Untold: The Millennium Girl, this Untold game features an enhanced version of the original Nintendo DS game, which one can play through in the \"Classic Mode\" or can explore the mystery of the Fafnir Knight (the s...": "Etrian Odyssey 2 Untold - 法夫納騎士是 Etrian Odyssey 的 Untold 衍生系列的延續。這款《Etrian Odyssey Untold》遊戲是原版 Nintendo DS 遊戲《Etrian Odyssey II：拉加德英雄》的升級版和增強版。\n\n與《Etrian Odyssey Untold：千禧年女孩》一脈相承，這款 Untold 遊戲具有原版 Nintendo DS 遊戲的增強版本，玩家可以在“經典模式”下玩該遊戲，也可以探索法夫尼爾騎士（法夫納騎士）的神秘面紗。",
    "It's finally here: The first games collection for Nintendo 3DS in eShop!\n    \n      It's finally here: The first games collection for Nintendo 3DS in eShop!\n    \n      \n      Play a round of Sudoku, do a relaxing puzzle or make the other player's \n      ships sink to the bottom of the sea. A grand total of 25 game types in \n      three magnificently themed worlds provide plenty of variety and lots of \n      fun.\n    \n\n    \n      Accept the challenge and try to collect all the trophies. But be wa...": "終於來了：eShop 上的第一個 Nintendo 3DS 遊戲合集！\n\n終於來了：eShop 上的第一個 Nintendo 3DS 遊戲合集！\n\n\n玩一輪數獨、玩一個輕鬆的謎題或製作其他玩家的遊戲\n船隻沉入海底。共有25種遊戲類型\n三個宏偉的主題世界提供了豐富的多樣性和豐富的內容\n有趣。\n\n\n\n接受挑戰並嘗試收集所有獎杯。但要...",
    "The definitive Pokemon Mystery Dungeon! Prepare yourself for a grand adventure where you become a Pokemon and battle alongside Legendary and Mythical Pokemon to help save the world! Befriend Pokemon and explore ever-changing mystery dungeons with them! Players are suddenly transformed into a Pokemon and sent out to a world inhabited only by Pokemon. From a group of 20 Pokemon, including the starters from core RPG Pokemon games plus Pikachu and Riolu, you can choose your Pokemon and your partner ...": "終極寶可夢不可思議的迷宮！準備好迎接一場盛大的冒險吧，你將成為一名神奇寶貝，與傳奇和神話的神奇寶貝一起戰鬥，幫助拯救世界！與神奇寶貝交朋友，與它們一起探索不斷變化的神秘地下城！玩家突然變成了神奇寶貝，並被傳送到只有神奇寶貝居住的世界。從 20 只 Pokemon 中，包括核心 RPG Pokemon 遊戲的入門者以及皮卡丘和利歐魯，您可以選擇您的 Pokemon 和您的伙伴......",
    "Dragon Ball Fusions is an RPG action game that combines fighting, customization, and collection elements to bring Dragon Ball to the next level. In this new world, players will discover powerful items, find warriors who can become their allies, and build teams to bring into battle to see who the best fighters are. The battle system combines strategy and real time action to make this a fun and unique Dragon Ball experience for fans.": "Dragon Ball Fusions 是一款 RPG 動作遊戲，結合了戰鬥、自定義和收集元素，將 Dragon Ball 提升到了一個新的水平。在這個新世界中，玩家將發現強大的物品，尋找可以成為盟友的戰士，並組建團隊參加戰鬥，看看誰是最好的戰士。戰鬥系統結合了策略和實時動作，為粉絲們帶來有趣而獨特的龍珠體驗。",
    "Dorothy is Back!\nOz is in Trouble again thanks to the evil Jester! A new villain named Jester showed up on the scene and started kidnapping a lot of the legends of Oz! Scarecrow, Lion and the Tin Man were all captured by his flying monkeys, and now theyre being held with others against their will! Dorothy needs to recruit some new companions to help her make it to the Emerald City. With exciting new lands of Oz to explore, you can help Dorothy and become a Legend of Oz!": "多蘿西回來了！\n由於邪惡的小丑，奧茲國再次陷入麻煩！一個名叫小丑的新反派出現了，並開始綁架很多奧茲國的傳奇人物！稻草人、獅子、鐵皮人都被他的飛猴抓走了，現在又被強行關押在一起！多蘿西需要招募一些新同伴來幫助她到達翡翠城。探索令人興奮的奧茲國新大陸，您可以幫助多蘿西並成為奧茲國傳奇！",
    "Animal Crossing: New Leaf is a social simulation game. You take on the role as the new mayor in a small village populated by animals. Game play consists of improving the village with new buildings and decorations, collecting furniture and items for your own house as well as donating fossils, fish, insects and art to the local museum.\n\nThere's more to discover than ever before in the Animal Crossingâ„¢: New Leafâ€”Welcome amiibo game! This updated version of Animal Crossingâ„¢: New Leaf adds in s...": "《動物之森：新葉》是一款社交模擬遊戲。你在一個充滿動物的小村莊里擔任新村長。遊戲包括用新的建築和裝飾來改善村莊，為自己的房子收集家具和物品，以及向當地博物館捐贈化石、魚類、昆蟲和藝術品。\n\n《動物之森™：新葉》中有比以往更多的內容等待您探索——歡迎來到 amiibo 遊戲！此更新版本的《Animal Crossing™：New Leaf》添加了...",
    "Fire Emblem Awakening offers a unique blend of in-battle strategy, vast character customization, and lush 3D cinematic graphics that appeal to a wide range of gamers. In this game, you'll join Chrom, brother to Ylisse's empress and commander of its forces, in a fantasy world teetering on the brink of war. It's your duty to guide a team of Ylisse's finest soldiers--knights, mages, archers, and more--against the marauding Plegian bandits. To succeed, you will need to carefully choose the units you...": "《火焰紋章覺醒》將戰鬥策略、大量角色定制和豐富的 3D 電影圖形獨特地融合在一起，吸引了廣泛的遊戲玩家。在這款遊戲中，你將與伊麗絲皇后的兄弟、軍隊的指揮官克羅姆 (Chrom) 一起，進入一個瀕臨戰爭邊緣的奇幻世界。你的職責是帶領一支由伊利斯最優秀的士兵組成的隊伍——騎士、法師、弓箭手等等——對抗掠奪成性的普雷吉亞強盜。為了成功，您需要仔細選擇您的單位...",
    "Two worlds collide in an all-new adventure set in the world of Super NES classic The Legend of Zelda: A Link to the Past. In this newly spun tale, Link transforms into a living painting to cross into a dark, parallel dimension mirroring Hyrule. Conquer the puzzles, traps, and hidden rooms of deadly dungeons to save both worlds from certain doom! \n\nBrought to life in 3D, this beloved, top-down world is the perfect backdrop for a sweeping new tale. Dungeons sink deep below the screen as Link and h...": "兩個世界在 Super NES 經典《塞爾達傳說：眾神的三角力量》世界中展開全新冒險。在這個新編的故事中，林克變成了一幅活生生的畫作，穿越到一個反映海拉爾的黑暗平行維度。征服致命地牢的謎題、陷阱和隱藏房間，將兩個世界從厄運中拯救出來！\n\n這個受人喜愛的自上而下的世界以 3D 形式栩栩如生，是全新故事的完美背景。當林克和他的...",
    "The Legend of Zelda: Ocarina of Time 3D brings a completely re-mastered version of an epic entry in the beloved The Legend of Zelda game series to Nintendos newest hand-held system, Nintendo 3DS. The game couples phenomenally enhanced graphics with stunning, glasses-free 3D visuals to bring to life the daring adventures of its hero, Link. A streamlined touch-screen interface and newly implemented motion controls provide a fresh and intuitive feel as players immerse themselves in the tale of the ...": "《塞爾達傳說：時之笛 3D》將深受喜愛的《塞爾達傳說》遊戲系列中史詩般的作品的完全重新製作版本帶到了任天堂最新的手持系統 Nintendo 3DS 上。該遊戲將顯著增強的圖形與令人驚嘆的裸眼 3D 視覺效果結合在一起，將英雄林克的大膽冒險帶入生活。流線型的觸摸屏界面和新實現的運動控制提供了新鮮直觀的感覺，讓玩家沉浸在……的故事中。",
    "Monster Hunter 4 Ultimate (called Monster Hunter 4G in Japan) is the newest installment in the popular Monster Hunter series, which has sold more than 28 million units worldwide to date. In Monster Hunter 4 Ultimate, players will take on the role of a hunter that joins up with a traveling caravan to explore new lands and towns along the way. This grand adventure will include hundreds of quests to take on a variety of extraordinary creatures that yield valuable resources used for weapons and equi...": "《怪物獵人 4 Ultimate》（在日本稱為《怪物獵人 4G》）是廣受歡迎的《怪物獵人》系列的最新作品，迄今為止該系列在全球的銷量已超過 2800 萬份。在《怪物獵人 4 Ultimate》中，玩家將扮演獵人的角色，與旅行商隊一起探索沿途的新土地和城鎮。這場盛大的冒險將包括數百個任務，以應對各種非凡的生物，這些生物會產生用於武器和裝備的寶貴資源......",
    "A youth has grown up as one of the royal children of the glory-seeking nation of Nohr. Though their father has forbidden them to leave the castle, they still live a happy life with their four siblings. However, when they finally are sent to the outside world, it is on a mission to Hoshido, a peace-loving country that Nohr has plans to invade. There they learn that they were born to the Hoshido royal family, and were kidnapped by Nohr as an infant. A Nohr princess named Azura was taken hostage by...": "一名年輕人成長為追求榮耀的諾爾國家的皇室子弟之一。儘管父親禁止他們離開城堡，但他們仍然和四個兄弟姐妹過著幸福的生活。然而，當他們最終被派往外面的世界時，卻是去星戶執行任務，這是諾爾計劃入侵的一個愛好和平的國家。在那裡，他們得知自己出生於星戶皇室，並在嬰兒時期被諾爾綁架。一位名叫阿祖拉的諾爾公主被劫為人質……"
  }
}