{
  "Motoracer Advance (USA) (En,Fr,De,Es,It)": {
    "key": "Motoracer Advance (USA) (En,Fr,De,Es,It)",
    "original_name": "Motoracer Advance",
    "name": "賽車前進",
    "name_source": "api",
    "original_desc": "The player controls a motorcyclist and must try to win races on various terrain and settings. Each motorcycle in the game handles differently with some performing better on paved roads and others working better on rougher terrain.[1]\n\nThere are a number of different modes: Grand Prix (GP), Motocross, and Traffic. GP takes place at a number of different locations across the world on paved tracks in places such as San Francisco and Russia. The paved tracks require the player to learn how to effectively use their brakes around corners. The GP courses contain small differences between them, giving more variety to the courses in the game. Motocross requires the player to drive on off-road terrain and to master the act of \"powersliding\" on corners. The courses found in Motocross races are less hospitable and often take place in arid and unkept locales and with obstacles. Traffic mixes both GP and Motocross, having mixed pavement courses and traffic on roads that serve as obstacles.",
    "desc": "玩家控制一名摩托車手，必須嘗試在各種地形和環境下贏得比賽。遊戲中的每輛摩托車都有不同的處理方式，有些在鋪砌的道路上表現更好，而另一些則在崎嶇的地形上表現更好。[1]\n\n有多種不同的模式：大獎賽 (GP)、越野摩托車和交通賽。大獎賽在世界各地的許多不同地點舉行，例如舊金山和俄羅斯等地的鋪設賽道。鋪好的賽道要求玩家學習如何在拐角處有效地使用剎車。GP 課程之間存在細微差別，從而使遊戲中的課程更加多樣化。越野摩托車要求玩家在越野地形上駕駛並掌握在彎道上“動力滑行”的動作。越野摩托車比賽的賽道不太好客，通常在乾旱、未維護的地區進行，並且有障礙。GP 和越野摩托車的交通混合在一起，有混合的路面路線和作為障礙物的道路上的交通。",
    "desc_source": "api"
  },
  "Final Fantasy Tactics Advance (USA)": {
    "key": "Final Fantasy Tactics Advance (USA)",
    "original_name": "Final Fantasy Tactics Advance",
    "name": "最终幻想系列游戏列表",
    "name_source": "wiki",
    "original_desc": "When Marche and his friends open an ancient magical tome, their small town is transformed into a fantasy-filled kingdom known as Ivalice. Guide Marche and his clan against countless foes, and discover the wonders of Ivalice. Build up your party, master abilities and summons, and learn tactical combat to win in battle.",
    "desc": "當馬爾凱和他的朋友們打開一本古老的魔法書時，他們的小鎮變成了一個充滿幻想的王國，名為伊瓦利斯。引導馬爾凱和他的部落對抗無數的敵人，並發現伊瓦利斯的奇蹟。建立你的隊伍，掌握能力和召喚，並學習戰術戰鬥以在戰鬥中獲勝。",
    "desc_source": "api"
  },
  "Pinball of the Dead, The (USA)": {
    "key": "Pinball of the Dead, The (USA)",
    "original_name": "The Pinball of the Dead",
    "name": "傳送門2",
    "name_source": "wiki",
    "original_desc": "Based on \"The House of the Dead\" arcade/dreamcast series, this is a simple combination of pinball and the evil dead. Three pinball tables, Wondering, Movement, and Cemetary (all based on areas seen in The House of the Dead and The House of the Dead 2) are infested with zombies and using your silver ball, you must take out the zombies to save the table. The more you take out, the more points you get and the better the opportunity to take on one of the final bosses.",
    "desc": "SEGA土星（日語：セガサターン，英語：SEGA Saturn，多簡稱為SS、SAT），中文又通稱土星或沙騰，是日本電子遊戲商SEGA於1994年11月在日本、1995年5月在北美、1995年7月在歐洲發行的32位元次世代家用遊戲機，前代主機為Mega Drive。主機名「SEGA土星」源自於SEGA土星為SEGA發行的第六部主機，故取名為對應的太陽系第六顆行星——土星。繼任主機為Dreamcast。\nSEGA土星的開發始於1992年，當時SEGA甫推出劃時代的3D大型電玩主機板SEGA Model-1。SEGA土星採用雙中央處理器架構，主機內含有兩顆日本電子公司日立製造的SH-2 32位元精簡指令集（RISC）處理器；SEGA土星原先在設計上只有一顆圖形處理器VDP1，但為抗衡競爭對手索尼推出的家用遊戲機PlayStation而加入另一圖形處理器VDP2，使VDP1得以專注處理3D圖形運算。\nSEGA土星雖然在日本獲得成功，但是在北美地區的發售由於操之過急，導致第三方遊戲開發商沒有時間為其開發遊戲，因此在3D運算技術更為先進、遊戲陣容更為豐富的PlayStation及任天堂64的影響下，SEGA土星之市佔率不斷流失；SEGA自家招牌遊戲《音速小子》系列最新遊戲開發中止一事，也對SEGA土星造成不小的打擊。最終SEGA土星於2000年全面停售，SEGA公司也因其後繼主機Dreamcast的失敗，而於隔年退出家用遊戲機硬體市場。SEGA土星在其生命週期中僅售出了926萬部，以商業角度來看並不成功。\n儘管有著《飛天幽夢》、《飛龍騎士》系列及《VR快打》系列等遊戲，SEGA土星仍因其硬體架構過於複雜、第三方遊戲陣容不足及SEGA本身之商業決策錯誤而遭到抨擊。",
    "desc_source": "wiki"
  },
  "Summon Night - Swordcraft Story 2 (USA)": {
    "key": "Summon Night - Swordcraft Story 2 (USA)",
    "original_name": "Summon Night : Swordcraft Story 2",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "In Summon Night: Swordcraft 2, the player is an orphan from the Colthearts clan raised by a Craftknight (a smith/warrior). The character aspires to be a Craftknight as well. The player character, either Edgar Colthearts or Aera Colthearts, who are Edge Fencers, find themselves at the site of an abandoned ruin where a violent Summon Beast named Goura is awakened. In order to protect their new family, Edgar/Aera is bound to a wild Summon Beast (stray summon) and embarks on a journey to reseal the ruins.",
    "desc": "官方Game Boy Advance平台的2,819款遊戲中，一塊遊戲卡匣的容量為0.5Mb至256Mb不等，其中以32Mb、64Mb及128Mb的遊戲作品最多。本列表共有1,074款Game Boy Advance遊戲。",
    "desc_source": "wiki"
  },
  "Gunstar Super Heroes (USA)": {
    "key": "Gunstar Super Heroes (USA)",
    "original_name": "Gunstar Super Heroes",
    "name": "有生之年非玩不可的1001款游戏",
    "name_source": "wiki",
    "original_desc": "Your enemies intend to use a powerful crystal to resurrect the devastating God of Ruin and it's up to the Gunstar Heroes, Blue and Red to stop them! Developed by critically acclaimed developer, Treasure, this fast-paced action game will push your Game Boy Advance to the limits!\n\n-Blast your way through six intense levels and defeat an evil empire\n-Choose your hero: play as Red or Blue to combat powerful enemies and gigantic bosses\n-Amazing visuals create an unforgettable gaming experience",
    "desc": "你的敵人打算使用強大的水晶來復活毀滅性的毀滅之神，而槍星英雄（藍色和紅色）將阻止他們！這款快節奏動作遊戲由廣受好評的開發商 Treasure 開發，將把您的 Game Boy Advance 推向極限！\n\n- 衝破六個激烈關卡並擊敗邪惡帝國\n-選擇你的英雄：扮演紅色或藍色角色來對抗強大的敵人和巨大的頭目\n- 令人驚嘆的視覺效果創造令人難忘的遊戲體驗",
    "desc_source": "api"
  },
  "Iridion II (USA)": {
    "key": "Iridion II (USA)",
    "original_name": "Iridion II",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "This sequel to Iridion 3D is different in gameplay, but twice as much action. Piloting in Kiloblaster Style mechanics from a 3D perspective, you fight through 15 \nlevels of pulse-pounding action that will keep you up all night. Six different weapons with upgrade ability will give you awesome firepower to stop your foes. \n The storyline goes that a hundred years have passed since the Earth was attacked by the vicious IRIDION forces. Wanting revenge over their lost systems, they attack once more. Earth is too far away to send help, and you're the only one that could stop them.",
    "desc": "Iridion 3D 的這款續作在遊戲玩法上有所不同，但動作內容卻是其兩倍。從 3D 視角駕駛 Kiloblaster 風格的機制，戰鬥 15 個關卡\n令人心跳加速的動作會讓您徹夜難眠。六種具有升級能力的不同武器將為您提供強大的火力來阻止敵人。\n故事情節是，自從地球遭受邪惡的 IRIDION 勢力襲擊以來，已經過去了一百年。為了報復失去的系統，他們再次發起攻擊。地球距離我們太遠，無法提供幫助，而你是唯一可以阻止他們的人。",
    "desc_source": "api"
  },
  "Sonic Battle (USA) (En,Ja,Fr,De,Es,It)": {
    "key": "Sonic Battle (USA) (En,Ja,Fr,De,Es,It)",
    "original_name": "Sonic Battle",
    "name": "Greatest Hits",
    "name_source": "wiki",
    "original_desc": "“Sonic Battle” is a fast-paced fighting game featuring an isometric 3D perspective and 2D character sprites. With nine characters and five game modes, including Story, Battle, and Mini-Games, the game delivers diverse action. Players can customize attacks for air, ground, and defense, choosing from a total of nine special moves that can be flexibly swapped during matches. A trainable robot character allows for personalized skill and technique upgrades, with every detail of its style fully customizable. The game offers extensive content and high replayability for those who want to unlock all characters and moves.",
    "desc": "《Sonic Battle》是一款快節奏格鬥遊戲，採用等距3D視角和2D角色精靈。該遊戲有九個角色和五種遊戲模式，包括故事、戰鬥和迷你游戲，提供多樣化的動作。玩家可以自定義空中、地面和防禦的攻擊，總共有九種特殊動作可供選擇，這些特殊動作可以在比賽中靈活切換。可訓練的機器人角色允許個性化的技能和技術升級，其風格的每個細節都完全可定制。該遊戲為那些想要解鎖所有角色和動作的玩家提供了豐富的內容和高重玩性。",
    "desc_source": "api"
  },
  "Medabots - Metabee (USA)": {
    "key": "Medabots - Metabee (USA)",
    "original_name": "Medabots : Metabee",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Join Ikki as he begins his journey as a Medafighter and tries to save his hometown of Riverview City from the evil Rubberobo Gang. Ikki must solve various mysteries with the help of his friends and the Phantom Renegade. Interact with characters and control Medabots popular in the Medabots TV animated series. Can Ikki save the world from the treacherous Rubberobo Gang and become the #1 ranked Medafighter...It is all up to you!",
    "desc": "與一輝一起開始他作為一名 Medafighter 的旅程，並試圖從邪惡的橡膠幫手中拯救他的家鄉河景城。一輝必須在朋友和幻影叛徒的幫助下解開各種謎團。與 Medabots 電視動畫系列中流行的 Medabots 角色互動並控制 Medabots。一輝能否從奸詐的橡膠幫手中拯救世界並成為排名第一的 Medafighter...這一切都取決於你！",
    "desc_source": "api"
  },
  "Rayman Advance (USA) (En,Fr,De,Es,It)": {
    "key": "Rayman Advance (USA) (En,Fr,De,Es,It)",
    "original_name": "Rayman Advance",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Rayman Advance is a GBA game. It is basically a port of Rayman 1, however bears some minor changes. The evil Mr. Dark has stolen the Great Protoon, kidnapped all of the Electoons and defeated Betilla the Fairy. Rayman has to travel through 5 worlds before finally meeting up with Mr Dark and defeating him.",
    "desc": "《雷曼前進》是一款 GBA 遊戲。它基本上是 Rayman 1 的移植，但有一些細微的變化。邪惡的黑暗先生偷走了偉大的質子，綁架了所有的電子子並擊敗了仙女貝蒂拉。雷曼必須穿越 5 個世界才能最終見到黑暗先生並擊敗他。",
    "desc_source": "api"
  },
  "Broken Sword - The Shadow of the Templars (USA) (En,Fr,De,Es,It)": {
    "key": "Broken Sword - The Shadow of the Templars (USA) (En,Fr,De,Es,It)",
    "original_name": "Broken Sword: The Shadow of the Templars",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "A quiet drink in a Cafe in Paris is the start of a mysterious adventure for young American George Stobbart. Unwittingly he is drawn into a web of archaic and sinister plots, with origins that extend back to the earty 14th Century and the deadly order of the Knights Templar. Dive into an adventure of global exploration: cryptic puzzle solving; and fight for survival. Feast on over 60 beautifully animated characters in over 70 breathtaking, hand drawn locations. Answer the call to action and challenge yourself to the limit with compelling game play for the would-be adventure.",
    "desc": "年輕的美國人喬治·斯托巴特在巴黎的一家咖啡館安靜地喝了一杯，開啟了一場神秘冒險。不知不覺中，他被捲入了一張古老而險惡的陰謀之網，其根源可以追溯到 14 世紀的聖殿騎士團的致命組織。潛入全球探索冒險：解開神秘謎題；並為生存而戰。在 70 多個令人驚嘆的手繪地點欣賞 60 多個精美的動畫角色。響應行動號召，通過引人入勝的遊戲來挑戰自己的極限，體驗即將到來的冒險。",
    "desc_source": "api"
  },
  "Double Dragon Advance (USA)": {
    "key": "Double Dragon Advance (USA)",
    "original_name": "Double Dragon Advance",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "After a global nuclear war leaves the world in ruins, gangs emerge as the new elite by seizing control of the city. Twin brothers Jimmy and Billy Lee survive the cataclysmic event with their martial arts abilities intact, but Billy's girlfriend is soon kidnapped by mysterious thugs. Now it's up to you to guide both brothers through different stages filled with enemies and boss characters. Whether you play solo or cooperatively with a friend, you must master new techniques and weapons to find the girl and defeat the bad guys.",
    "desc": "全球核戰爭將世界夷為廢墟後，幫派通過奪取城市控制權成為新的精英。雙胞胎兄弟吉米和比利·李在這場災難中倖存下來，他們的武術能力完好無損，但比利的女朋友很快就被神秘暴徒綁架了。現在你需要引導兄弟倆度過充滿敵人和頭目角色的不同階段。無論你是單人遊戲還是與朋友合作，你都必須掌握新的技巧和武器來找到女孩並擊敗壞人。",
    "desc_source": "api"
  },
  "Spyro - Season of Ice (USA)": {
    "key": "Spyro - Season of Ice (USA)",
    "original_name": "Spyro : Season of Ice",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "Dragons never seem to have had it too easy. They have always had to worry about dragon slayers, plus they usually get a bad rap for being destructive, and let's not even get started on what people say about their breath! Fortunately Spyro has generally avoided such negative opinions, but then again he hasn't always had it easy either. You'd think that after several death-defying adventures on the Playstation over the past few years, which included the defeat of the evil Sorceress, Spyro and his friends would be able to take some time off and enjoy a bit of a vacation at Dragon Shores. But with evil brewing and a new title on the way for the GameBoy Advance, which is due out in November, the gang shouldn't get too comfortable on the beach.",
    "desc": "龍似乎從來都沒有過得太輕鬆。他們總是不得不擔心屠龍者，而且他們通常會因為破壞性而受到不好的批評，我們甚至不開始談論人們對他們的呼吸的評價！幸運的是，斯派羅通常會避免此類負面意見，但話又說回來，他也並不總是那麼容易。你可能會認為，在過去幾年裡，在 PS 上經歷了幾次玩命的冒險之後，其中包括擊敗了邪惡的女巫，斯派羅和他的朋友們應該可以休息一段時間，在龍之海岸享受一段假期了。但隨著邪惡的醞釀和 GameBoy Advance 即將於 11 月推出的新遊戲，這夥人在海灘上應該不會太舒服。",
    "desc_source": "api"
  },
  "Fire Emblem (USA, Australia)": {
    "key": "Fire Emblem (USA, Australia)",
    "original_name": "Fire Emblem",
    "name": "火焰之纹章系列",
    "name_source": "wiki",
    "original_desc": "After centuries of peace, smoldering rivalries threaten to set the world aflame in a blaze of battle! The drums of war beat, noble houses plot treason, allies become enemies, and as Lycia stands poised for war, a shadowy figure manipulates empires for his own ends. Now, Lyn, Eliwood, and Hector must amass an army strong enough to fight back the forces that would destroy their homeland. Master battle tactics to douse the embers before they burn the world to ash.",
    "desc": "經過幾個世紀的和平之後，陰燃的敵對威脅要讓世界陷入戰火之中！戰爭的鼓聲已敲響，貴族家族密謀叛國，盟友變成敵人，當利西亞準備戰爭時，一個神秘人物為了自己的目的而操縱帝國。現在，林恩、艾利烏德和赫克托必須集結一支足夠強大的軍隊來反擊那些摧毀他們家園的軍隊。掌握戰鬥策略，在餘燼將世界燒成灰燼之前撲滅它們。",
    "desc_source": "api"
  },
  "Super Mario Advance 2 - Super Mario World (USA, Australia)": {
    "key": "Super Mario Advance 2 - Super Mario World (USA, Australia)",
    "original_name": "Super Mario World: Super Mario Advance 2",
    "name": "超级马力欧 奥德赛",
    "name_source": "wiki",
    "original_desc": "Bowser and his crew of cruel Koopalings have taken over Dinosaur Island, but luckily, Mario and Luigi are up for some Koopa-kicking. \nAs they ride Yoshi, search for P-Switches, find secret paths, blast fireballs, and soar skyward with the Cape, they'll need to use every trick in the plumber handbook. \nDino Rhinos, Chargin' Chucks, and a host of unforgettable enemies await in one of the Mario Bros. biggest and most challenging adventures ever!",
    "desc": "庫巴和他的殘忍的庫帕林船員已經佔領了恐龍島，但幸運的是，馬里奧和路易吉準備好踢庫帕了。\n當他們騎著耀西、尋找 P 開關、尋找秘密路徑、爆炸火球以及駕駛海角翱翔天空時，他們需要使用管道工手冊中的每一個技巧。\n恐龍犀牛、Chargin' Chucks 和眾多令人難忘的敵人正等待著馬里奧兄弟有史以來最大、最具挑戰性的冒險之一！",
    "desc_source": "api"
  },
  "Kirby - Nightmare in Dream Land (USA)": {
    "key": "Kirby - Nightmare in Dream Land (USA)",
    "original_name": "Kirby : Nightmare in Dream Land",
    "name": "任天堂Switch Online",
    "name_source": "wiki",
    "original_desc": "Everyone in Dream Land has lost the ability to dream! It seems that King Dedede has stolen the Star Rod, the source of power for the Fountain of Dreams, and given its fragmented pieces to his goons for safekeeping. The world needs a hero... a round pink one. As Kirby embarks on an adventure to recover the Star Rod, he'll have to copy every trick in the book to bring good dreams back to Dream Land.",
    "desc": "夢境之地的所有人都失去了做夢的能力！迪迪迪國王似乎偷走了夢想之泉的力量源泉——星之杖，並將其碎片交給了他的手下保管。世界需要一位英雄……一位圓形的粉紅色英雄。當卡比踏上尋找星棒的冒險之旅時，他必須複製書中的每一個技巧，才能將好夢帶回夢境之地。",
    "desc_source": "api"
  },
  "Sword of Mana (USA, Australia)": {
    "key": "Sword of Mana (USA, Australia)",
    "original_name": "Sword of Mana",
    "name": "聖劍傳說2",
    "name_source": "wiki",
    "original_desc": "Sword of Mana tells the tale of two unlikely companions, a former prisoner out for revenge and the last known girl from the Mana tribe. The two come together, despite their differences, for one very important reason: they are the only ones that can save the Mana tree.\n\nBased upon the Mana series and the classic Game Boy title Final Fantasy Adventures, you can take control of both characters (or join with another player in co-op) and battle in realtime using spells, weapons and many more items.",
    "desc": "《瑪娜之劍》講述了兩個不太可能的同伴的故事，一個是前去複仇的囚犯，另一個是瑪娜部落最後一個已知的女孩。儘管存在差異，兩人還是因為一個非常重要的原因走到了一起：他們是唯一能夠拯救法力樹的人。\n\n基於《聖劍傳說》系列和經典 Game Boy 遊戲《最終幻想冒險》，您可以控制兩個角色（或與其他玩家合作）並使用咒語、武器和更多物品進行實時戰鬥。",
    "desc_source": "api"
  },
  "ChuChu Rocket! (USA) (En,Ja,Fr,De,Es)": {
    "key": "ChuChu Rocket! (USA) (En,Ja,Fr,De,Es)",
    "original_name": "ChuChu Rocket!",
    "name": "Dreamcast",
    "name_source": "wiki",
    "original_desc": "ChuChu Rocket is an action puzzler, designed predominantly as a multi-player game. You have indirect control over mice, and must guide them to the safety of a rocket, and away from a cat. You do this by placing arrows on the ground, which they will follow. The multi-player game is a frantic all-against-all duel, in which each player's mice will only follow instructions of their own colour. You can play this mode on your own against CPU opponents, or take on a series of predefined puzzles",
    "desc": "ChuChu Rocket 是一款動作益智遊戲，主要設計為多人遊戲。你可以間接控制老鼠，並且必須引導它們到達火箭的安全位置，並遠離貓。您可以通過在地面上放置箭頭來實現此目的，它們將跟隨箭頭移動。這款多人遊戲是一場瘋狂的全面對決，每個玩家的老鼠只會遵循自己顏色的指示。您可以獨自玩此模式，與 CPU 對手對抗，或解決一系列預定義的謎題",
    "desc_source": "api"
  },
  "Lilo & Stitch 2 - Haemsterviel Havoc (USA)": {
    "key": "Lilo & Stitch 2 - Haemsterviel Havoc (USA)",
    "original_name": "Disney's Lilo & Stitch 2: Hamsterviel Havoc",
    "name": "迪士尼《星際寶貝 2：倉鼠大戰》",
    "name_source": "api",
    "original_desc": "Play as both Stitch and Lilo to rescue Nina and David, who have been kidnapped by the evil Hamsterviel and taken onboard his spaceship. To complicate things, Hamsterviel created evil alien Experiments that go head-to-head with our heroes. Start by capturing each Experiment and harnessing its special power in order to progress and capture the next. Sparky, Experiment 22, helps you out with his powerful electricity balls, while Richter, Experiment 513, shakes things up by igniting an earthquake. Gameplay modes include platform-shooting as Stitch, navigation and strategy as Lilo, intense racing, and multiplayer mode.",
    "desc": "扮演史迪奇和莉洛來拯救被邪惡的倉鼠菲爾綁架並帶上他的宇宙飛船的尼娜和大衛。讓事情變得更加複雜的是，Hamsterviel 創造了邪惡的外星實驗，與我們的英雄正面交鋒。首先捕獲每個實驗並利用其特殊力量來取得進展並捕獲下一個。Sparky，實驗 22，用他強大的電球幫助你擺脫困境，而 Richter，實驗 513，通過點燃地震來震撼一切。遊戲模式包括《Stitch》的平台射擊、《Lilo》的導航和策略、激烈的賽車和多人遊戲模式。",
    "desc_source": "api"
  },
  "Pokemon - Sapphire Version (USA, Europe) (Rev 2)": {
    "key": "Pokemon - Sapphire Version (USA, Europe) (Rev 2)",
    "original_name": "Pokémon Sapphire Version",
    "name": "寶可夢系列 (遊戲)",
    "name_source": "wiki",
    "original_desc": "Immerse yourself in the beautiful region of Hoenn, a place of masterful heroes and mysterious teams, of friendship and battles. As the new kid in town, you set off on your journey as a Pokémon Trainer. Who knows what wonders and dangers await you? Now it's time to grab your gear and head out on your own...\n\n-Over 200 Pokémon appear with over 100 new discovered species--you'll have to link up and trade with a friend who has Ruby Version to catch them all!\n-2-on-2 battles--use two of your Pokémon in a battle at the same time!\n-Engage in intense multi battles with up to four friends!\n-Pokémon Contests let you groom your Pokémon to be the Best of Show!\n-Stunning Game Boy Advance graphics display the world of Pokémon with more detail than ever!",
    "desc": "沉浸在美麗的豐緣地區，這裡充滿了高超的英雄和神秘的團隊，充滿了友誼和戰鬥。作為鎮上的新來的孩子，你踏上了神奇寶貝訓練師的旅程。誰知道有什麼奇蹟和危險在等待著你呢？現在是時候拿起你的裝備，獨自出發了……\n\n- 超過 200 種神奇寶貝和超過 100 種新發現的物種出現——你必須與擁有紅寶石版的朋友聯繫並進行交易才能捕獲所有它們！\n-2對2戰鬥——同時使用兩隻神奇寶貝進行戰鬥！\n- 與最多四位朋友進行激烈的多人戰鬥！\n- 神奇寶貝大賽可讓您培養您的神奇寶貝，使其成為最佳表演者！\n- 令人驚嘆的 Game Boy Advance 圖形以比以往更多的細節展示神奇寶貝世界！",
    "desc_source": "api"
  },
  "Rebelstar - Tactical Command (USA)": {
    "key": "Rebelstar - Tactical Command (USA)",
    "original_name": "Rebelstar : Tactical Command",
    "name": "高级战争",
    "name_source": "wiki",
    "original_desc": "You can play as the leader of a revolt in the turn-based strategy game Rebelstar: Tactical Command. The Arelian Empire seized control of Earth 70 years ago and has since become an oppressive regime, controlling the world with fear and marauding shock troops. You can fight back by equipping a team of rebels and controlling them in battle. Rebelstar: Tactical Command includes campaign, skirmish, multiplayer hotseat, and multiplayer link mode.",
    "desc": "您可以在回合製策略遊戲《叛逆之星：戰術指揮》中扮演叛亂領袖。阿雷利亞帝國在 70 年前控制了地球，從此成為一個壓迫性政權，以恐懼和掠奪的突擊部隊控制著世界。你可以通過裝備一支叛軍隊伍並在戰鬥中控制他們來進行反擊。《叛逆之星：戰術指揮》包括戰役、小衝突、多人熱座和多人鏈接模式。",
    "desc_source": "api"
  },
  "Pokemon - LeafGreen Version (USA, Europe) (Rev 1)": {
    "key": "Pokemon - LeafGreen Version (USA, Europe) (Rev 1)",
    "original_name": "Pokémon LeafGreen Version",
    "name": "寶可夢系列 (遊戲)",
    "name_source": "wiki",
    "original_desc": "In the Kanto region, your adventure begins as you form a close bond with your Pokémon and catch various species to complete the Pokédex. Face other trainers in exciting battles, take on Team Rocket, and defeat the Gym Leaders to earn all eight badges. With these, you can challenge the Elite Four and ultimately face the reigning Champion in a decisive duel. Your goal: Become the best trainer and catch them all!",
    "desc": "在關東地區，當你與你的神奇寶貝建立密切的聯繫並捕捉各種物種以完成神奇寶貝圖鑑時，你的冒險就開始了。在激動人心的戰鬥中面對其他訓練師，挑戰火箭隊，並擊敗道館領袖以獲得全部八枚徽章。有了這些，您就可以挑戰四強，並最終在決定性的對決中與衛冕冠軍對決。你的目標：成為最好的訓練家並抓住他們！",
    "desc_source": "api"
  },
  "Super Mario Advance 3 - Yoshi's Island (USA)": {
    "key": "Super Mario Advance 3 - Yoshi's Island (USA)",
    "original_name": "Yoshi's Island: Super Mario Advance 3",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Yoshi's Island: Super Mario Advance 3 makes us discover the origin of brothers Mario and Luigi. While a stork brings both babies to their parents, the wizard Kamek hits him to prevent him from reaching his destination because he predicted that Mario and Luigi would be a problem for his master Bowser in the future. Kamek manages to kidnap Luigi but Mario fails on Yoshis Island. The latter get organised so that Mario finds his brother.",
    "desc": "《耀西島：超級馬里奧高級3》讓我們了解了馬里奧和路易吉兄弟的起源。當一隻鸛鳥把兩個孩子帶到父母身邊時，巫師卡梅克為了阻止他到達目的地而打了他，因為他預測馬里奧和路易吉將來會給他的主人鮑澤帶來麻煩。卡梅克設法綁架了路易吉，但馬里奧在耀西島失敗了。後者組織起來，以便馬里奧找到他的兄弟。",
    "desc_source": "api"
  },
  "Wings (USA)": {
    "key": "Wings (USA)",
    "original_name": "Wings",
    "name": "星海爭霸II：自由之翼",
    "name_source": "wiki",
    "original_desc": "You are an allied fighter pilot in WW1, duking it out with the \"Huns\" up in the sky in over 200 missions.\n\nThe missions usually come in three flavors: Top-down view bombing missions where you have to take out strategically important targets, isometric strafing runs where you get to blast anything that you fancy blasting with an unlimited supply of ammo, and of course the main part: Dogfights in the sky. Rendered in 3D, seems from behind your head.\n\nThe game is set in the years 1916 through 1918, and to loosen things up a little, we get to read a page of our character's new entry for the diary-like journal in his company between every mission.",
    "desc": "您是一戰中的一名盟軍戰鬥機飛行員，在 200 多項任務中與“匈奴”在空中決鬥。\n\n這些任務通常分為三種類型：自上而下的轟炸任務，你必須消滅具有重要戰略意義的目標；等距掃射任務，你可以用無限的彈藥來炸毀任何你想炸毀的東西，當然還有主要部分：空中纏鬥。以 3D 方式渲染，彷彿從您的腦後觀看。\n\n遊戲的背景設定在 1916 年到 1918 年之間，為了讓事情稍微放鬆一些，我們可以在每次任務之間閱讀我們角色的公司日記般的日記的新條目。",
    "desc_source": "api"
  },
  "Super Mario Advance (USA, Europe)": {
    "key": "Super Mario Advance (USA, Europe)",
    "original_name": "Super Mario Advance",
    "name": "超级马力欧USA",
    "name_source": "wiki",
    "original_desc": "Super Mario Advance is the adaptation on GBA of Super Mario Bros 2 released on NES. This episode marks a turning point in the series as it introduces the possibility of choosing his character. Embody the famous tandem of mustachio plumbers, Princess Peach or her companion Toad in a magical adventure. You must save the inhabitants of the dream world from the clutches of the ignoble Wart, the batrachian tyrant. This version offers as a bonus a revamped version of the game Mario Bros.",
    "desc": "《Super Mario Advance》是在 NES 上發布的《Super Mario Bros 2》的 GBA 改編版。這一集標誌著該系列的一個轉折點，因為它介紹了選擇他的角色的可能性。扮演著名的小鬍子水管工串聯人，桃子公主或她的同伴蟾蜍，踏上神奇的冒險之旅。你必須將夢境世界的居民從卑鄙的巴特拉克暴君沃特的魔爪下拯救出來。這個版本提供了馬里奧兄弟遊戲的改進版本作為獎勵。",
    "desc_source": "api"
  },
  "Kirby & The Amazing Mirror (USA)": {
    "key": "Kirby & The Amazing Mirror (USA)",
    "original_name": "Kirby & the Amazing Mirror",
    "name": "星之卡比 鏡之大迷宮",
    "name_source": "wiki",
    "original_desc": "The Mirror World has been invaded by an evil shadow, and Kirby's got to save the day! Fortunately, he won't have to go it alone! He's been split into four Kirbys of different colors, and with his trusty cell phone, he can call up his colorful clones to lend a hand!",
    "desc": "鏡像世界被邪惡的陰影入侵，卡比必須拯救世界！幸運的是，他不必孤軍奮戰！他被分成了四個不同顏色的卡比，用他值得信賴的手機，他可以召喚他的彩色克隆人來幫忙！",
    "desc_source": "api"
  },
  "F-Zero - Maximum Velocity (USA, Europe)": {
    "key": "F-Zero - Maximum Velocity (USA, Europe)",
    "original_name": "F-Zero : Maximum Velocity",
    "name": "F-Zero : Maximum Velocity",
    "name_source": "keep",
    "original_desc": "All galactic speed limits are about to be broken! F-Zero Maximum Velocity has arrived, and the future of racing has never looked so sweet. Brand-new vehicles and Game Boy Advance original tracks await, so whether you're a Super NES® veteran or a race rookies, you'll need some practice laps. And even if you do master the Grand Prix circuit, you'll still have to beat your friends to the finish line. That's right, race fans--with the Game Boy Advance Game Link® cable you can take on up to three rival racers, so put the pedal to the metal and get busy boosting, bumping and jumping your way to intergalactic glory!",
    "desc": "2015年電子遊戲界敘述了在2015年發行的電子遊戲及電子遊戲界的重要事件。",
    "desc_source": "wiki"
  },
  "Mega Man Battle Network 5 - Team Colonel (USA)": {
    "key": "Mega Man Battle Network 5 - Team Colonel (USA)",
    "original_name": "Mega Man Battle Network 5 : Team Colonel",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Team Colonel is the second edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization from taking control of the global Internet.",
    "desc": "《Team Colonel》是《Mega Man Battle Network 5》的第二版。在遊戲中，您可以與《Mega Man Battle Network》系列前幾部中的角色聯手，並可以玩新的戰鬥模式。與其他網絡英雄合作，阻止邪惡組織控制全球互聯網。",
    "desc_source": "api"
  },
  "Sonic Advance (USA) (En,Ja)": {
    "key": "Sonic Advance (USA) (En,Ja)",
    "original_name": "Sonic Advance",
    "name": "畅销电子游戏列表",
    "name_source": "wiki",
    "original_desc": "Sonic the Hedgehog has arrived for his first ever adventure on a Nintendo console. Sonic Advance combines elements from the original Sonic series on Sega's Genesis, as well as from the Dreamcast Sonic Adventure series.\n\nChoose from Sonic, Knuckles, Tails, or Amy and take them through level after level of blindingly fast gameplay and ring collecting, dodging enemies in your path towards the final showdown with Dr Robotnik (aka Dr Eggman). \n\nCollect Chaos Emeralds along the way to transform into Super Sonic for added speed, and train your Chao to exchange them into Sonic Adventure 2 Battle on the Nintendo Gamecube.\n\nAnd if that wasn't enough, you can also play 4 player battle modes with your mates, using one game cart between 4 GBA's.",
    "desc": "網際網路特有的社會和文化現象包括的網路迷因，像是流行主題、流行語、圖像、網路爆紅短片和笑話。當這種時尚和感覺在網路上出現時，它們往往會迅速增長並變得更加普遍，因為即時通信促進了口耳相傳的傳播。\n以下部分列表更側重於不受地區網際網路法律限制的網際網路現象；其他國家，例如中國或巴基斯坦，確實存在不受地區法律禁止的特定網際網路現象。 這些都包含在中國大陸網路熱點事件列表和巴基斯坦網路熱點事件列表中。",
    "desc_source": "wiki"
  },
  "Tony Hawk's Pro Skater 2 (USA, Europe)": {
    "key": "Tony Hawk's Pro Skater 2 (USA, Europe)",
    "original_name": "Tony Hawk's Pro Skater 2",
    "name": "GameSpot",
    "name_source": "wiki",
    "original_desc": "The Tony Hawk skateboarding series makes its debut on the Game Boy Advance with this adaptation of the second Pro Skater game.\n\nGameplay is similar to the original console game. The levels have been adapted from the console version for the two dimensional isometric perspective; one is even taken from the original Tony Hawk's Pro Skater.\n\nIn Career Mode, choose from one of 13 professional skaters and, in each level, complete various goals like collecting items, performing special tricks and of course breaking high scores by performing tricks and combos. Completing the goals earns money which unlocks new levels and can be spent on new boards, tricks and upgrading your skater's stats. In competition levels, you don't skate for money but compete for a medal.\n\nIn the Free Skate and Single Session modes, unlocked levels can be practiced and new high scores be established.",
    "desc": "托尼霍克滑板系列在 Game Boy Advance 上首次亮相，改編自第二款職業滑板遊戲。\n\n遊戲玩法與原始主機遊戲類似。這些關卡已根據控制台版本改編為二維等軸測視角；其中一張甚至取自原版《托尼霍克職業滑冰者》。\n\n在生涯模式中，從 13 名職業滑冰運動員中選擇一名，並在每個關卡中完成各種目標，例如收集物品、表演特殊技巧，當然還有通過表演技巧和連擊打破高分。完成目標可以賺取金錢，解鎖新的關卡，並可以花在新的滑板、技巧和升級滑冰者的統計數據上。在比賽級別中，滑冰不是為了金錢，而是為了獎牌。\n\n在自由滑和單場模式中，可以練習解鎖的級別並創造新的高分。",
    "desc_source": "api"
  },
  "Super Robot Taisen - Original Generation (USA)": {
    "key": "Super Robot Taisen - Original Generation (USA)",
    "original_name": "Super Robot Taisen : Original Generation",
    "name": "PlayStation Portable游戏列表",
    "name_source": "wiki",
    "original_desc": "Unlike some of the saga's opuses, Super Robot Taisen: Original Generation contains only original creations from its developer Banpresto. The player can start this episode by embodying one of the two proposed protagonists, each with its own scenario. For the first time in the series, the player can customize his robots and choose their equipment and weapons.",
    "desc": "與該傳奇的一些作品不同，《超級機器人大戰：原創一代》僅包含其開發商 Banpresto 的原創作品。玩家可以通過體現兩個提議的主角之一來開始這一集，每個主角都有自己的場景。在該系列中，玩家第一次可以定制他的機器人並選擇他們的裝備和武器。",
    "desc_source": "api"
  },
  "Dynasty Warriors Advance (USA)": {
    "key": "Dynasty Warriors Advance (USA)",
    "original_name": "Dynasty Warriors Advance",
    "name": "真·三國無雙 起源",
    "name_source": "wiki",
    "original_desc": "Dynasty Warriors Advance is a Game Boy Advance adaptation of the Dynasty Warriors franchise. Based on the \"Three Kingdoms period\" of ancient China,  it takes place at the end of the Han Dynasty during 190 A.D. As the previous government collapses, warlords rise up and fight among one another, eventually establishing three powerful kingdoms: Wei, Wu and Shu. Generals from each of these nations spend the next 100 years fighting among one another, each trying to become the dominant power.\n\nDynasty Warriors Advance is a top-down turn-based strategy board game, but with a focus on action combat. Since it is based on the earlier Dynasty Warriors titles, many of the same concepts carry over. Players begin by choosing one of three available characters from the lands of either Wu, Shu or Wei. Each character has their own unique storyline and missions. A briefing is given for each mission detailing specific objectives before allowing the player to equip themselves with weapons and skills at the camp. Once begun, the player moves the designed number of spaces (determined by movement) around the \"board\". If an enemy player is encountered, the game shifts to a top-down action fighting mode. Here the player uses one button to attack, another button to charge and another to unleash a misou special attack once it is powered up. Misou energy is charged by successful attacking enemy units. The player's success against the enemy unit will determine the unit's \"heath\" and will be destroyed completely if all of it's units are destroyed. Some enemy units contain not just soldiers but enemy generals who have their own special moves and greater health. Many missions feature specific objectives rather than just defeating all enemies.",
    "desc": "《真三國無雙》是《真三國無雙》系列的 Game Boy Advance 改編版。以中國古代“三國時期”為背景，故事發生在公元190年的漢朝末年，隨著前朝政權的崩潰，軍閥聯合起來，互相爭鬥，最終建立了魏、吳、蜀三個強大的國家。這些國家的將軍在接下來的 100 年裡互相爭鬥，都試圖成為主導力量。\n\n《真三國無雙》是一款自上而下的回合製策略棋盤遊戲，但重點是動作戰鬥。由於它是基於早期的真三國無雙系列遊戲，因此許多相同的概念得以延續。玩家首先從吳國、蜀國或魏國的三個可用角色中選擇一個。每個角色都有自己獨特的故事情節和任務。每個任務都會有一個簡報，詳細說明具體目標，然後允許玩家在營地裝備武器和技能。一旦開始，玩家就在“棋盤”周圍移動設計數量的空間（由移動決定）。如果遇到敵方玩家，遊戲就會切換到自上而下的動作戰鬥模式。在這裡，玩家使用一個按鈕進行攻擊，另一個按鈕進行沖鋒，另一個按鈕在通電後釋放出特殊攻擊。成功攻擊敵方單位可充能 Misou 能量。玩家對抗敵方單位的成功將決定該單位的“健康”，如果該單位的所有單位都被摧毀，則該單位將被徹底摧毀。有些敵方單位不僅包含士兵，還包含敵方將軍，他們有自己的特殊動作和更高的生命值。許多任務都有特定的目標，而不僅僅是擊敗所有敵人。",
    "desc_source": "api"
  },
  "Mega Man Battle Network 2 (USA)": {
    "key": "Mega Man Battle Network 2 (USA)",
    "original_name": "Mega Man Battle Network 2",
    "name": "主机大战",
    "name_source": "wiki",
    "original_desc": "Netto Hikari (a.k.a. Lan Hikari) and his Navi MegaMan.EXE are back in a new adventure! After defeating the sinister World Three (WWW) and their leader, Dr. Wily, Netto and MegaMan have made the Internet safe once again. But a new Internet terrorist group, led by a mysterious new Navi named Gospel, have begun to spread chaos and fear throughout the Net! Netto and his friend Meiru, Dekao, and Yaito must get to the bottom of their plan and stop them before the Internet is deleted!",
    "desc": "Netto Hikari（又名 Lan Hikari）和他的 Navi MegaMan.EXE 又回來了，開始新的冒險！在擊敗險惡的第三世界 (WWW) 及其首領後，威利博士、內托和洛克人再次讓互聯網變得安全。但是一個新的互聯網恐怖組織，由一個名叫福音的神秘新 Navi 領導，已經開始在整個網絡上散播混亂和恐懼！Netto 和他的朋友 Meiru、Dekao 和 Yaito 必須查出他們的計劃並在互聯網被刪除之前阻止他們！",
    "desc_source": "api"
  },
  "Game & Watch Gallery 4 (USA)": {
    "key": "Game & Watch Gallery 4 (USA)",
    "original_name": "Game & Watch Gallery 4",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "A collection of classic Nintendo Game & Watch titles, as well as GBA exclusive updates.\n\nGames include Donkey Kong 3, Boxing, Fire Attack, Mario Cement Factory & Rainshower, plus extra games that can only be opened if you beat the high score for each game.\n\nEach game has two modes, one which emulates the original Game & Watch LCD format and an updated version which features improved graphics, slight gameplay changes and a host of Mario characters.",
    "desc": "經典 Nintendo Game & Watch 遊戲合集，以及 GBA 獨家更新。\n\n遊戲包括《大金剛 3》、《拳擊》、《Fire Attack》、《馬里奧水泥工廠》和《Rainshower》，以及只有在每場比賽中獲得高分後才能打開的額外遊戲。\n\n每個遊戲都有兩種模式，一種是模擬原始 Game & Watch LCD 格式，另一種是更新版本，該版本具有改進的圖形、輕微的遊戲玩法變化和大量馬里奧角色。",
    "desc_source": "api"
  },
  "Ultimate Brain Games (USA, Europe)": {
    "key": "Ultimate Brain Games (USA, Europe)",
    "original_name": "Ultimate Brain Games",
    "name": "早期電子遊戲史",
    "name_source": "wiki",
    "original_desc": "Ultimate Brain Games is a collection of 8 games you can play against the computer or a friend.  The games include Sink Ships (aka Battleship), Mahjong, Backgammon, Chess, Checkers, Reversi, Dominoes, and Four in a Row (aka Connect Four).\n\nYou start out by designing how your character looks.  You can modify 9 areas of your character, from eyes to clothes.  After doing so, decide to play single or multiplayer.\n\nEach game follows the rules and gameplay seen in the original games.",
    "desc": "全球最高跨媒體製作票房收入列表包含從書、電影、電子遊戲、漫畫書、電視節目或其他媒體開始製作的跨媒體製作收入超過20億美元。\n該清單包括總收入數字和收入細目。對於尚未報告總收入數字的跨媒體製作作品，根據不同媒體的綜合收入給出估算。對於報告數字不是最新的跨媒體製作作品，會根據現有數據給出更新的估計。",
    "desc_source": "wiki"
  },
  "Klonoa 2 - Dream Champ Tournament (USA)": {
    "key": "Klonoa 2 - Dream Champ Tournament (USA)",
    "original_name": "Klonoa 2 : Dream Champ Tournament",
    "name": "The Best",
    "name_source": "wiki",
    "original_desc": "Floppy-eared hero Klonoa returns in another fast-paced, colorful side-scrolling adventure for the Game Boy Advance. In his latest challenge, Klonoa must race against time and other dream travelers in the Dream Champ Tournament to collect stars, sun and moon stones to become the ultimate Dream Champion. Combining platform, puzzle and adventure elements, Klonoa 2: Dream Champ Tournament is just the adventure fans of the series have been anticipating. Explore the intricate and puzzle-packed worlds where you'll meet a wide variety of interesting creatures! Solve Fiendishly-Designed Puzzles ? Use Boxes, Bomb Boxes, Switches, Pressure Switches, Goomis, Springs and Scales in your quest for glory. Hoverboard Races ? Each world contains a fast-paced thrill ride of gem collecting fun! Master your Skills to Win ? Klonoa must prove his skills against other dream travelers in the Dream Champ Tournament.",
    "desc": "垂耳英雄克洛諾亞在 Game Boy Advance 的另一款快節奏、色彩繽紛的橫向捲軸冒險中回歸。在他的最新挑戰中，克洛諾亞必須在夢想冠軍錦標賽中與時間和其他夢想旅行者賽跑，收集星星、太陽和月亮石，成為最終的夢想冠軍。結合了平台、解謎和冒險元素，《Klonoa 2：夢想冠軍錦標賽》正是該系列冒險迷們一直期待的。探索錯綜複雜、充滿謎題的世界，在那裡你會遇到各種各樣有趣的生物！解決精心設計的謎題？使用盒子、炸彈箱、開關、壓力開關、古米斯、彈簧和秤來追求榮耀。氣墊板比賽？每個世界都包含快節奏、刺激的寶石收集樂趣！掌握獲勝技巧？克洛諾亞必須在夢想冠軍錦標賽中與其他夢想旅行者一較高下，證明自己的技能。",
    "desc_source": "api"
  },
  "Mega Man Zero (USA, Europe)": {
    "key": "Mega Man Zero (USA, Europe)",
    "original_name": "Mega Man Zero",
    "name": "四部曲",
    "name_source": "wiki",
    "original_desc": "It is the year 22XX...\n\nThe legendary heroes of the Reploids, X and Zero, defeated the evil Sigma long ago, and a new army was created to prevent outbreaks of the Maverick Virus. But as time went on, the army became oppressive, and began to deal out a paranoid brand of justice. It is said that their leader, once a great warrior, has become cold and calculating, eliminating any Reploid that dares oppose him.\n\nA hero is needed in these dark times, and that is exactly what Ciel and her rebel group have found in an old ruin...a hero from the past, reborn in the future.\n\nZero has come into a time he does not know, to save it from a figure of the past...the fate of freedom rests on his shoulders.",
    "desc": "2015年電子遊戲界敘述了在2015年發行的電子遊戲及電子遊戲界的重要事件。",
    "desc_source": "wiki"
  },
  "Mega Man Battle Network 6 - Cybeast Falzar (USA)": {
    "key": "Mega Man Battle Network 6 - Cybeast Falzar (USA)",
    "original_name": "Mega Man Battle Network 6 : Cybeast Falzar",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "In Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encounters dangerous new enemies on the virtual plane. Together they will face threats far more powerful and perilous than they ever have before.",
    "desc": "在《洛克人戰網 6》中，蘭的父親得到了工作調動，全家搬到了以進行各種技術實驗而聞名的網絡城。Lan 將在現實世界中結識新朋友並建立新的友誼，而洛克人則與樂於助人的 Navis 成為朋友，並在虛擬飛機上遇到危險的新敵人。他們將共同面對比以往任何時候都更加強大和危險的威脅。",
    "desc_source": "api"
  },
  "F-Zero - GP Legend (USA)": {
    "key": "F-Zero - GP Legend (USA)",
    "original_name": "F-Zero : GP Legend",
    "name": "F-Zero : GP Legend",
    "name_source": "keep",
    "original_desc": "The year is A.D. 2201, and you are about to enter the world of ultra-high-speed F-ZERO Grand Prix races, which take place on specially-constructed circuit tracks located all over the universe. Take control of eight different characters - including the mysterious Captain Falcon, new racing star Rick Wheeler, and the evil lord Black Shadow - as you race through an action-packed story that spans multiple planets!",
    "desc": "公元 2201 年，您即將進入超高速 F-ZERO 大獎賽的世界，比賽在遍布宇宙的專門建造的賽道上進行。控制八個不同的角色——包括神秘的獵鷹船長、新賽車明星瑞克·惠勒和邪惡領主黑影——在跨越多個星球的動感十足的故事中馳騁！",
    "desc_source": "api"
  },
  "Magical Vacation (Japan) (Translated)": {
    "key": "Magical Vacation (Japan) (Translated)",
    "original_name": "Magical Vacation",
    "name": "No Russian",
    "name_source": "wiki",
    "original_desc": "Magical Vacation is one of the Game Boy Advance's earliest RPGs and it was also Brownie Brown's very first game after they completed Legend of Mana and left Squaresoft. Magical Vacation is a prequel of sorts to the Nintendo DS game \"Magical Starsign.\"\n\nBrownie Brown would later go on to do Sword of Mana and Mother 3 on the GBA. The game never saw an overseas release and is one of the few gems on the Game Boy Advance that is Japanese exclusive.",
    "desc": "官方Game Boy Advance平台的2,819款遊戲中，一塊遊戲卡匣的容量為0.5Mb至256Mb不等，其中以32Mb、64Mb及128Mb的遊戲作品最多。本列表共有1,074款Game Boy Advance遊戲。",
    "desc_source": "wiki"
  },
  "Fire Emblem - The Binding Blade (Japan) (Translated)": {
    "key": "Fire Emblem - The Binding Blade (Japan) (Translated)",
    "original_name": "Fire Emblem : Fuuin no Tsurugi",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Fire Emblem: Fūin no Tsurugi is the sixth entry in the Fire Emblem series, the first title produced for the system, and the first title to appear on a handheld console. It is a turn-based tactical role-playing game in which players move a small group of units around a square-based grid, battling their enemies in order to complete a certain predefined objective. It is reminiscent of other tactical RPGs with features such as character classes and the ability to level up.\n\nThe Binding Blade is set on the fictional continent of Elibe, which has been dominated by humans for centuries following an ancient war between humanity and dragons. The story follows Roy, a young nobleman from the small independent nation of Pherae as he leads a growing army against the forces of King Zephiel of the kingdom of Bern, who is gradually taking over Elibe with the aid of a mysterious power.",
    "desc": "《火焰紋章：風院劍》是《火焰紋章》系列的第六部作品，也是第一款為該系統製作的遊戲，也是第一款出現在掌上游戲機上的遊戲。這是一款回合製戰術角色扮演遊戲，玩家在方形網格周圍移動一小群單位，與敵人作戰，以完成某個預先確定的目標。它讓人想起其他具有角色類別和升級能力等功能的戰術角色扮演遊戲。\n\n《束縛之刃》的故事發生在虛構的埃利貝大陸，在人類與龍之間的古老戰爭之後，該大陸已經被人類統治了幾個世紀。故事講述了來自獨立小國菲萊的年輕貴族羅伊領導著一支不斷壯大的軍隊對抗伯爾尼王國澤菲爾國王的軍隊，後者在一種神秘力量的幫助下逐漸接管了埃利布。",
    "desc_source": "api"
  },
  "Yggdra Union - We'll Never Fight Alone (USA)": {
    "key": "Yggdra Union - We'll Never Fight Alone (USA)",
    "original_name": "Yggdra Union : We'll Never Fight Alone",
    "name": "Yggdra Union：我們永遠不會孤軍奮戰",
    "name_source": "api",
    "original_desc": "Ruled by a royal family said to be descendants of the gods themselves, Fantasinia is a prosperous and peaceful land -- until the peace is shattered by the invading forces of the Empire of Bronkia. Led by the young emperor Gulcasa, who seized control of the Empire in a brutal coup d?etat, Bronchia's Imperial Army cuts a bloody swath through the people of Fantasinia and the Royal Armies of King Ordeene. Amidst the chaos, a young woman escapes from the besieged capital of Partina -- a woman with innocence in her face, and a sword in her hand. The girl?s name is Princess Yggdra, the last surviving member of the royal family; the sword is the Gran Centurio, a legendary blade once wielded by the founder of Fantasinia, and passed down through generations of royalty. Fleeing to to a remote valley at the southern tip of the continent, Yggdra meets up with Milanor, the charismatic leader of a band of thieves, and readies herself for a war of liberation.",
    "desc": "幻想尼亞由據說是眾神的後裔的王室統治，是一片繁榮而和平的土地——直到和平被布朗基亞帝國的入侵力量打破。在年輕的古爾卡薩皇帝的領導下，古爾卡薩通過殘酷的政變奪取了帝國的控制權，布朗奇亞的帝國軍隊在幻想尼亞的人民和奧丁國王的皇家軍隊中殺戮了一條血路。混亂之中，一名年輕女子從被圍困的帕爾蒂納首都逃了出來——她的臉上帶著天真，手中握著一把劍。這個女孩的名字叫尤格德拉公主，是最後一位倖存的王室成員。這把劍是 Gran Centurio，一把傳說中的劍，曾由 Fantasinia 的創始人使用，並代代相傳。逃到大陸南端的一個偏遠山谷中，伊格德拉遇到了盜賊團伙的魅力領袖米蘭諾，並為解放戰爭做好了準備。",
    "desc_source": "api"
  },
  "Drill Dozer (USA)": {
    "key": "Drill Dozer (USA)",
    "original_name": "Drill Dozer",
    "name": "增田順一",
    "name_source": "wiki",
    "original_desc": "The Skulker gang has stolen your beloved Red Diamond that once belonged to your departed mother. Using your Drill Dozer, you must lead your fellow band of thieves, the Red Dozers, on a quest to retrieve the Red Diamond. \n\nGameplay consists of navigating through several areas using your Drill Dozer robot to bore through enemies, walls, and pretty much anything else that's in your way. The Drill Dozer itself is a multifaceted machine able to work underwater and to take flight. It also has the ability to shift the drill into higher gears to tear through the toughest of obstacles. Along the way, you'll upgrade your Drill Dozer robot with gears and add-ons that will help aide you in your quest.",
    "desc": "潛藏者團伙偷走了你心愛的紅鑽石，它曾經屬於你已故的母親。您必須使用您的鑽推土機，帶領您的盜賊同伴“紅色推土機”，踏上尋回紅鑽石的旅程。\n\n遊戲玩法包括使用鑽推土機機器人穿越多個區域，鑽穿敵人、牆壁和幾乎所有阻礙你的東西。鑽推土機本身是一種多功能機器，能夠在水下工作和飛行。它還能夠將鑽機調至更高的檔位，以突破最艱難的障礙。在此過程中，您將使用齒輪和附加組件升級您的鑽推土機機器人，以幫助您完成任務。",
    "desc_source": "api"
  },
  "Spider-Man - Mysterio's Menace (USA, Europe)": {
    "key": "Spider-Man - Mysterio's Menace (USA, Europe)",
    "original_name": "Spider-Man : Mysterio's Menace",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Set in New York, Spider-Man: Mysterio's Menace enables players to assume the role of Spider-Man as they take on super-villain Mysterio and his illusory tricks for control of Manhattan. Spider-Man must fight a slew of Mysterio's sinister conspirators and gadgetry to get to the bottom of their plot and free New York from Mysterio's mind-warping grip.",
    "desc": "《蜘蛛俠：神秘人的威脅》以紐約為背景，玩家可以扮演蜘蛛俠的角色，對抗超級反派神秘人以及他控制曼哈頓的虛幻詭計。蜘蛛俠必須與神秘客的一大批邪惡陰謀者和小玩意作鬥爭，以查出他們的陰謀，並將紐約從神秘客扭曲思想的控制中解救出來。",
    "desc_source": "api"
  },
  "Boktai 2 - Solar Boy Django (USA)": {
    "key": "Boktai 2 - Solar Boy Django (USA)",
    "original_name": "Boktai 2 : Solar Boy Django",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Boktai 2 continues the adventures of Django the Solar Boy as he sets out to rid the world of evil vampires and demons. The second installment in the franchise brings back the solar sensor technology, which incorporates natural sunlight into gameplay. Take advantage of natural sunlight through the built-in solar sensor on the Game Boy Advance cartridge to power up and fuse more than 60 weapons and items. Now you can head outdoors and battle enemies with more weapons, new characters, and a larger game environment.",
    "desc": "官方Game Boy Advance平台的2,819款遊戲中，一塊遊戲卡匣的容量為0.5Mb至256Mb不等，其中以32Mb、64Mb及128Mb的遊戲作品最多。本列表共有1,074款Game Boy Advance遊戲。",
    "desc_source": "wiki"
  },
  "Klonoa - Empire of Dreams (USA)": {
    "key": "Klonoa - Empire of Dreams (USA)",
    "original_name": "Klonoa : Empire of Dreams",
    "name": "Now Production",
    "name_source": "wiki",
    "original_desc": "A grumpy Emperor suffering from insomnia has banned dreaming and imprisoned Klonoa for breaking the law. To prove his courage and win his freedom, Klonoa must defeat the monsters that are creating havoc throughout the empire. Help our hero in his most perilous journey yet and experience the all-new thrills!",
    "desc": "脾氣暴躁的皇帝患有失眠症，禁止做夢，並因違反法律而監禁了克洛諾亞。為了證明自己的勇氣並贏得自由，克洛諾亞必須擊敗正在整個帝國製造浩劫的怪物。幫助我們的英雄踏上迄今為止最危險的旅程，體驗全新的刺激！",
    "desc_source": "api"
  },
  "Mega Man Battle Network 3 - White Version (USA)": {
    "key": "Mega Man Battle Network 3 - White Version (USA)",
    "original_name": "Mega Man Battle Network 3 : White Version",
    "name": "網路爆紅列表",
    "name_source": "wiki",
    "original_desc": "Join MegaMan.EXE, his operator Lan, and friends as they keep the net safe from viruses and cyber menaces. You'll travel through new virtual and real worlds, fight new bosses, interact with new characters, and even find new Battle Chips. It's cyber mayhem at its best!\n\nMega Man Battle Network 3 has two unique versions: Blue and White.  Each version contains unique Battle Chips, characters, and styles for MegaMan.EXE to use.",
    "desc": "與 MegaMan.EXE、他的操作員 Lan 和朋友們一起保護網絡免受病毒和網絡威脅的侵害。你將穿越新的虛擬和現實世界，對抗新的老闆，與新的角色互動，甚至找到新的戰鬥籌碼。這是最好的網絡混亂！\n\n《洛克人戰網 3》有兩個獨特的版本：藍色和白色。每個版本都包含獨特的戰鬥籌碼、角色和風格，供 MegaMan.EXE 使用。",
    "desc_source": "api"
  },
  "Mario vs. Donkey Kong (USA, Australia)": {
    "key": "Mario vs. Donkey Kong (USA, Australia)",
    "original_name": "Mario vs. Donkey Kong",
    "name": "瑪利歐系列",
    "name_source": "wiki",
    "original_desc": "After years of apparent goodwill, Mario and Donkey Kong are at it again--this time, on Game Boy Advance. Donkey Kong has stolen all the Mini-Mario toys from the Mario Toy Co., and now it's up to Mario to hunt down his longtime nemesis and retrieve the pilfered goods. As Mario, you must race through challenging levels while finding keys and releasing Mini Marios before time runs out. Along the way, you'll master new moves that can help you overcome new puzzles.",
    "desc": "經過多年表面上的善意之後，馬里奧和大金剛再次出現——這一次是在 Game Boy Advance 上。大金剛從馬里奧玩具公司偷走了所有迷你馬里奧玩具，現在馬里奧必須追捕他的宿敵並找回被盜的物品。作為馬里奧，您必須在充滿挑戰的關卡中競速，同時找到鑰匙並在時間耗盡之前釋放迷你馬里奧。一路上，你將掌握新的動作，幫助你克服新的謎題。",
    "desc_source": "api"
  },
  "Mega Man Battle Network 4 - Blue Moon (USA)": {
    "key": "Mega Man Battle Network 4 - Blue Moon (USA)",
    "original_name": "Mega Man Battle Network 4 : Blue Moon",
    "name": "網路爆紅列表",
    "name_source": "wiki",
    "original_desc": "The fourth installment in the Mega Man Battle Network series comes in two versions--Red Sun and Blue Moon--each with different enemies, battle chips, souls, and characters. Once again, you assume the role of Lan as he and his friend, Mega Man.exe, fight to rid the Internet of viruses and other cyberworld enemies. Unlike previous games in the series, Mega Man Battle Network 4 focuses on a tournament system where players encounter a variety of enemies that must be defeated. A new Soul Unison system lets Mega Man transform into his defeated enemies.",
    "desc": "《洛克人戰網》系列的第四部分有兩個版本——紅日和藍月——每個版本都有不同的敵人、戰鬥籌碼、靈魂和角色。您再次扮演 Lan 的角色，與他的朋友 Mega Man.exe 一起努力消滅互聯網上的病毒和其他網絡世界的敵人。與該系列之前的遊戲不同，《洛克人戰網 4》專注於錦標賽系統，玩家會遇到各種必須擊敗的敵人。新的靈魂統一系統讓洛克人變身為他擊敗的敵人。",
    "desc_source": "api"
  },
  "Astro Boy - Omega Factor (USA) (En,Ja,Fr,De,Es,It)": {
    "key": "Astro Boy - Omega Factor (USA) (En,Ja,Fr,De,Es,It)",
    "original_name": "Astro Boy : Omega Factor",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Join Astro, the robotic superhero with a human mind, in a quest to reunite the robotic race with humans. Astro uses his seven super abilities to face off against the likes of Atlas, Blue Knight, and more than 40 other characters. The game brings classic 2D gaming to the Game Boy Advance along with an original seven-episode story. Playing as Astro Boy, you'll learn about justice, compassion, evil, courage, and the history of Astro Boy--all while building Astro's Omega Factor and strengthening his character and superhuman abilities.",
    "desc": "與具有人類思維的機器人超級英雄 Astro 一起，尋求將機器人種族與人類重新團結起來。阿斯特羅 (Astro) 使用他的七種超級能力來對抗阿特拉斯 (Atlas)、藍騎士 (Blue Knight) 和其他 40 多個角色。該遊戲為 Game Boy Advance 帶來了經典 2D 遊戲以及原創的七集故事。扮演阿童木，你將了解正義、同情、邪惡、勇氣和阿童木的歷史，同時建立阿童木的歐米茄因子並強化他的性格和超人能力。",
    "desc_source": "api"
  },
  "Mario Tennis - Power Tour (USA, Australia) (En,Fr,De,Es,It)": {
    "key": "Mario Tennis - Power Tour (USA, Australia) (En,Fr,De,Es,It)",
    "original_name": "Mario Tennis: Power Tour",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "Players can test their backhand in this unique role-playing tennis adventure. Train hard at the Royal Tennis Academy to be a champion. Gain experience and improve your skills through lessons and tournaments, and rise to the top of the ranks. Play as Mario, Peach, Waluigi, or Donkey Kong in a slew of wild modes. Advance through the story and unlock even more characters, all with their own power moves. Beat Mario at his own game, then link up with a friend or three for even more frantic fun.",
    "desc": "玩家可以在這個獨特的角色扮演網球冒險中測試自己的反手。在皇家網球學院刻苦訓練，成為冠軍。通過課程和錦標賽獲得經驗並提高您的技能，並躋身頂尖行列。在多種狂野模式中扮演馬里奧、桃子、瓦路易吉或大金剛。推進故事並解鎖更多角色，每個角色都有自己的力量動作。在馬里奧自己的遊戲中擊敗他，然後與一三個朋友一起享受更多瘋狂的樂趣。",
    "desc_source": "api"
  },
  "Kurukuru Kururin (Europe)": {
    "key": "Kurukuru Kururin (Europe)",
    "original_name": "Kurukuru Kururin",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Kuru Kuru Kururin is an innovative puzzle game in which the main character is inside a helicopter, and he must navigate himself through a maze in the least amount of time possible. Movements must be timed and precise, because if the helicopter's propeller hits a wall, 3 seconds is added to the timer. The protagonist's mission is to retrieve his brothers, who will join him after he finds them. He also finds many power-ups that will allow him to customize his helicopter's appearance.",
    "desc": "Kuru Kuru Kururin 是一款創新的益智遊戲，其中主角在直升機內，他必須在盡可能短的時間內穿過迷宮。動作必須定時且精確，因為如果直升機的螺旋槳撞到牆壁，計時器就會增加 3 秒。主角的任務是找回他的兄弟，找到他們後，他們就會加入他的行列。他還發現了許多能力提升，可以讓他定制直升機的外觀。",
    "desc_source": "api"
  },
  "Super Puzzle Fighter II (USA) (Rev 1)": {
    "key": "Super Puzzle Fighter II (USA) (Rev 1)",
    "original_name": "Super Puzzle Fighter II",
    "name": "PlayStation Classic",
    "name_source": "wiki",
    "original_desc": "Capcom's knockout puzzle game action, set in the Street Fighter universe, arrives on Game Boy Advanced. Hailed as one of the best puzzle games of all time, Super Puzzle Fighter is chockfull of ferocious competition, pint-sized characters and non-stop high-energy insanity.\n\nCarefully stack the falling colored gems in strategic combinations. When the moment is right, use a burst gem to shatter your blocks. Watch your character execute a combo move and rain a volley of counter gems down on your opponent. Be the first to fill the other's screen with gems and K.O. the other player. Features eight characters from the Dark Stalkers and Street Fighter franchises, including Ryu, Ken, and Chun-Li.",
    "desc": "Xbox One遊戲列表包括了正在開發中或已經發售的部分Xbox One遊戲。",
    "desc_source": "wiki"
  },
  "Mario Golf - Advance Tour (USA)": {
    "key": "Mario Golf - Advance Tour (USA)",
    "original_name": "Mario Golf : Advance Tour",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Grab your clubs and start down the road to golfing perfection in this role-playing golf adventure! Chat up the locals at golf clinics, hone your skills in challenges like Club Slots and Go-Go Gates, and try to become the champ of all the country clubs! The Mushroom Kingdom residents take on only the very best.",
    "desc": "拿起您的球桿，在這場角色扮演高爾夫冒險中開始走向完美高爾夫之路！在高爾夫診所與當地人聊天，在俱樂部老虎機和 Go-Go Gates 等挑戰中磨練您的技能，並嘗試成為所有鄉村俱樂部的冠軍！蘑菇王國的居民只與最優秀的人較量。",
    "desc_source": "api"
  },
  "Sonic Advance 2 (USA) (En,Ja,Fr,De,Es,It)": {
    "key": "Sonic Advance 2 (USA) (En,Ja,Fr,De,Es,It)",
    "original_name": "Sonic Advance 2",
    "name": "畅销电子游戏列表",
    "name_source": "wiki",
    "original_desc": "Sonic returns for a second outing on the Game Boy Advance.\n\nOnce again, Sonic is called upon to save the world from the evil Dr. Eggman. On this occasion, Sonic is joined by friends Tails, Knuckles and Cream and rabbit, the latest addition to the Sonic team. Each comes with a set of unique moves, allowing you to reach certain areas through-out the levels. However, unlike Sonic Advance, you must compelte the game as Sonic to unlock the other characters.\n\nChaos Emeralds and Special Rings litter the stages. To collect the emeralds (transforming Sonic into Super Sonic for the final battle with Dr. Eggman), you must find the special rings hidden in each stage to unlock the bonus stage. Complete the bonus stage and the emerald is yours.\n\nYou'll also get the chance to collect and raise chaos, and trade them over to Sonic Adventure 2: Battle on Gamecube, through the use of the GBA/GC link cable.",
    "desc": "索尼克在 Game Boy Advance 上第二次回歸。\n\n索尼克再次被要求從邪惡的艾格曼博士手中拯救世界。這次，索尼克的朋友包括塔爾斯 (Tails)、納克魯斯 (Knuckles) 以及索尼克團隊的最新成員奶油和兔子 (Cream andrabbit)。每個都有一套獨特的動作，讓你可以在關卡中到達某些區域。然而，與索尼克前進不同的是，你必須以索尼克的身份完成遊戲才能解鎖其他角色。\n\n舞台上散落著混沌翡翠和特殊戒指。要收集祖母綠（將索尼克轉變為超級索尼克，與艾格曼博士進行最後的戰鬥），您必須找到隱藏在每個階段中的特殊戒指才能解鎖獎勵階段。完成獎勵階段，祖母綠就是你的了。\n\n您還有機會收集和引發混亂，並通過使用 GBA/GC 連接線將它們交易到 Gamecube 上的《索尼克冒險 2：戰鬥》。",
    "desc_source": "api"
  },
  "River City Ransom EX (USA)": {
    "key": "River City Ransom EX (USA)",
    "original_name": "River City Ransom EX",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Kunio's greatest adventure with enhanced graphics and new gameplay!\n\nBrothers Ryuichi and Ryuji arrive at the Reihou Academy, located near Nekketsu High. After a short amount of time, nearby schools have begun fallen under the control of Ryuichi and Ryuji, who rumor has it have dubbed themselves the Double Dragons.\n\nRiki Samejima of Hanazono High has never seen eye to eye with Kunio, and in fact, they seem to always compete to be the best.\n\nBut one day, Mami Shimada, Riki's girlfriend, is kidnapped and held at Reihou Academy. The issue is challenged to Riki, come save your girlfriend!\n\nRiki's heart is burning with fury, and he flies out of the gates and seeks out his rival Kunio to help take on all opposing gangs. But one man awaits them at Reihou Academy that will shock Kunio!",
    "desc": "國夫最偉大的冒險，具有增強的圖形和新的遊戲玩法！\n\n龍一和龍二兄弟抵達位於熱結高中附近的靈鳳學園。不久之後，附近的學校開始落入龍一和龍次的控制之下，有傳言稱他們自稱“雙龍”。\n\n花園高中的鮫島力與國夫從來沒有意見一致，事實上，他們似乎總是在競爭最好的。\n\n但有一天，力的女友島田麻美被綁架並關押在靈鳳學園。問題向Riki發起挑戰，快來拯救你的女朋友吧！\n\n力氣的心中燃燒著憤怒，他飛出了大門，尋找他的對手國夫來幫助對抗所有敵對幫派。然而，在靈鳳學園等待著他們的卻是一個讓國男大吃一驚的男人！",
    "desc_source": "api"
  },
  "Legend of Zelda, The - The Minish Cap (USA)": {
    "key": "Legend of Zelda, The - The Minish Cap (USA)",
    "original_name": "The Legend of Zelda : The Minish Cap",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Link returns in an all-new Game Boy Advance adventure. When the sorcerer Vaati turns Princess Zelda to stone, the king of Hyrule sends Link on a quest that takes him to all-new locations. Using the power of a mystical hat called the Minish Cap, Link must travel through a fantastic world rife with new items, puzzles, and bosses. As Link, you can shrink down to either battle large enemies from within or find secret items. You can also unlock items and solve puzzles by fusing together magic relics.",
    "desc": "林克在全新的 Game Boy Advance 冒險中回歸。當巫師瓦蒂將塞爾達公主變成石頭時，海拉魯國王派林克去執行一項任務，將他帶到全新的地點。林克必須利用一頂名為“迷你帽”的神秘帽子的力量，穿越一個充滿新物品、謎題和 Boss 的奇幻世界。作為林克，你可以縮小範圍，從內部與大型敵人作戰或尋找秘密物品。您還可以通過將魔法遺物融合在一起來解鎖物品並解決謎題。",
    "desc_source": "api"
  },
  "Mega Man Zero 2 (USA)": {
    "key": "Mega Man Zero 2 (USA)",
    "original_name": "Mega Man Zero 2",
    "name": "洛克人Zero (游戏)",
    "name_source": "wiki",
    "original_desc": "A year after the events in Mega Man Zero, the hero finds himself in another battle to save the world. Caught in-between the reploids and humans, Neo Arcadia's new commander has tricked Zero into helping her, although her reasons are uncertain.\n\nTo fix the problem, Zero must battle through level after level, using the new Chain Rod weapon to grapple onto ledges to gain an advantage in collecting out of reach items or attacking enemies from above. Cyber Elfs can again be collected to gain some helpful powerups.\n\nNew to the series is a two player challenge mode, where the first to complete the level wins.",
    "desc": "《Map of the Soul: 7》是南韓男子音樂團體防彈少年團的第四張韓語錄音室專輯暨出道以來第七張錄音室專輯，在2020年2月21日由Big Hit娛樂發行。本專輯為2019年發行的迷你專輯《Map of the Soul: Persona》的續作，發行時亦收錄《Map of the Soul: Persona》的所有5首曲目，並且反映防彈少年團出道七年來的旅程和成長。《Map of the Soul: 7》被描述為一張含有流行、R&B和嘻哈的音樂專輯，其中包含搖滾、陷阱和EDM等都市當代流派的影響力。在歌詞上，它涉及反思、內省和自我接受的主題。\n在《Map of the Soul: 7》中，防彈少年團與海爾希共同製作〈敬微小事物的詩〉，與紅髮艾德共同為〈Make it Right〉填詞，與特洛伊·希文共同為〈Louder Than Bombs〉填詞，而希雅在〈On〉中客串。本專輯主要由Pdogg製作，另外SUGA、Jimin、Fred Again、Hiss Noise、El Capitxn、Supreme Boi、Arcades以及其他音樂人亦參與本專輯的製作。這張專輯一經發行就獲得評論界的好評，人們對唱片的反思敘事和嘗試各種風格的連貫製作表示稱讚。\n《Map of the Soul: 7》因為在超過20個國家專輯排行榜登上冠軍，且成為2020年全球最暢銷專輯，因此這張專輯在商業上取得巨大成功，而防彈少年團更是第一個在全球五大音樂唱片市場名列第一的亞洲團體。在美國，這張專輯在發行第一周以422,000個專輯等價單位（含銷售量347,000）登上告示牌二百大專輯榜冠軍，因此成為連續第四張登上該榜單冠軍的防彈少年團專輯。這張專輯在發行後9天內的銷售量突破410萬張，不僅寫下Gaon專輯榜新紀錄，也因為成為南韓最暢銷專輯而拿下金氏世界紀錄。這張專輯不僅獲得韓國音樂內容協會（KMCA）四百萬認證，也在美國和日本獲得白金認證，並且在其他七個國家獲得金認證。\n收錄於《Map of the Soul: 7》的兩首單曲〈Black Swan〉和〈On〉均登上美國告示牌百大單曲榜，其中〈Black Swan〉登上最高排名第57，而〈On〉則登上最高排名第4，並成為第一首在該榜單登上前五名的防彈少年團歌曲。《Map of the Soul: 7》在2020年Genie音樂獎、2020年Mnet亞洲音樂大獎、2020年甜瓜音樂獎以及第46屆全美民選獎獲得年度專輯獎，收錄曲〈On〉在2020年MTV音樂錄影帶大獎獲得最佳流行歌曲、最佳編舞以及最佳韓國流行歌曲獎項。為了宣傳這張專輯，防彈少年團登上《詹姆斯柯登深夜秀》、《吉米A咖秀》，並且在《M Countdown》、《音樂銀行》以及《人氣歌謠》等南韓音樂節目做打歌宣傳，另外也宣布展開第四輪世界巡迴演唱會「Map of the Soul Tour」。",
    "desc_source": "wiki"
  },
  "Silent Scope (USA) (En,Fr,De,Es,It)": {
    "key": "Silent Scope (USA) (En,Fr,De,Es,It)",
    "original_name": "Silent Scope",
    "name": "Now Production",
    "name_source": "wiki",
    "original_desc": "This coin-op conversion doesn't have a sniper rifle light gun, but all the scoping action is still here. \n\nThe aim of the game is to save the captured family of the President of the USA, by sniping all on-coming enemies as you go along. \n\nAs an enemy appears, an area of the screen zooms in, allowing you to easily pick off the guy in the head. Once done, press a button to zoom out, so as to choose your next target.",
    "desc": "這個投幣式改裝沒有狙擊步槍光槍，但所有瞄準動作仍然在這裡。\n\n遊戲的目的是通過狙擊所有迎面而來的敵人來拯救被俘的美國總統的家人。\n\n當敵人出現時，屏幕的一個區域會放大，讓你可以輕鬆地干掉頭部的敵人。完成後，按下按鈕縮小，以便選擇下一個目標。",
    "desc_source": "api"
  },
  "Motocross Maniacs Advance (USA) (En,Es)": {
    "key": "Motocross Maniacs Advance (USA) (En,Es)",
    "original_name": "Motocross Maniacs Advance",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Motocross Maniacs Advance is a side-scrolling racing game with dirt bikes as the main vehicle of choice.  There are four modes of play, Race, Time Attack, Action (stunt tracks for points) and Link Battle (which requires four more cartridges and the link cable to use).  There are six different riders to choose from, each with their own different attributes and abilities. Players can also pick up power-ups during races such as heat-seeking missiles and land-mines along with the nitro tanks among others.",
    "desc": "Motocross Maniacs Advance 是一款以越野車為主要選擇車輛的橫向捲軸賽車遊戲。有四種遊戲模式：競賽、計時、動作（特技賽道得分）和鏈接戰鬥（需要四個以上的彈藥筒和鏈接電纜才能使用）。有六種不同的騎手可供選擇，每個騎手都有自己不同的屬性和能力。玩家還可以在比賽中獲得能量提升裝置，例如熱追踪導彈、地雷以及硝基坦克等。",
    "desc_source": "api"
  },
  "Metal Slug Advance (USA)": {
    "key": "Metal Slug Advance (USA)",
    "original_name": "Metal Slug Advance",
    "name": "鋼鐵蟲師系列電子遊戲列表",
    "name_source": "wiki",
    "original_desc": "You're a warrior of the war, but now you are alone. Enemies have captured your allied troops, and it's up to you to get them back. Armed to the teeth with firearms, grenades and specially made \"Slug\" vehicles, you must travel across the levels and blast anything in sight that isn't a friendly.\n\nTwo characters are offered to play as, and along with the usual Metal Slug flair visually, and epic battle sequences against strange and startling foes, you can now collect special E-cards during the game. Saved allies will hand you these cards that, when brought back to camp, can increase ammo, power and many more improvements to alter the gameplay experience.",
    "desc": "你是戰爭的戰士，但現在你孤身一人。敵人俘虜了你的盟軍，你要把他們救回來。你必須用槍械、手榴彈和特製的“鼻涕蟲”載具武裝到牙齒，穿越關卡並炸毀視線內的任何非友軍。\n\n提供兩個角色來扮演，除了通常的《合金彈頭》視覺風格，以及對抗奇怪和令人震驚的敵人的史詩般的戰鬥序列，你現在可以在遊戲過程中收集特殊的電子卡。被保存的盟友會給你這些卡片，當它們帶回營地時，可以增加彈藥、力量和更多改進，以改變遊戲體驗。",
    "desc_source": "api"
  },
  "Wing Commander - Prophecy (USA)": {
    "key": "Wing Commander - Prophecy (USA)",
    "original_name": "Wing Commander : Prophecy",
    "name": "Origin Systems",
    "name_source": "wiki",
    "original_desc": "It has been some twelve years since the destruction of Kilrah, the Kilrathi homeworld. The Terran Confederation, slowly demobilizing and reorganizing its military assets, has settled on a new strategy: building several Midway-class megacarriers, brainchild of Navy Commodore Christopher Blair. These new carriers, over a kilometer long, carry all the hardware and weaponry of a Kilrathi-War-era carrier battle group. The first one, the Midway herself, is undergoing her shakedown cruise, with Blair along for the ride. Before this, though, the player is treated to a CGI video of a bizarre rupture in space in the Kilrah system: the first of the Nephilim invaders. The game's titular prophecy involves the coming of these alien invaders, who shall arrive only after \"one who has the heart of a Kilrathi, but who is not Kilrathi-born,\" conquers the felinoid warrior race.",
    "desc": "基爾拉希的家園世界基爾拉 (Kilrah) 被毀滅已有十二年了。人類聯邦正在慢慢地複員和重組其軍事資產，並製定了一項新戰略：建造幾艘中途島級巨型航母，這是海軍準將克里斯托弗·布萊爾的創意。這些新型航母長度超過一公里，搭載了基拉提戰爭時期航母戰鬥群的所有硬件和武器。第一艘，即中途島號，正在與布萊爾一起進行試航巡航。不過在此之前，玩家會看到一段 CGI 視頻，顯示基拉星系中奇異的空間破裂：第一個尼非利人入侵者。遊戲的標題預言涉及到這些外星入侵者的到來，只有在“擁有基拉提人的心，但不是基拉提人出生的人”征服了貓類戰士種族之後，他們才會到來。",
    "desc_source": "api"
  },
  "Wario Land 4 (USA, Europe)": {
    "key": "Wario Land 4 (USA, Europe)",
    "original_name": "Wario Land 4",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "In this fourth episode of the adventures of Mario's nemesis, the greedy Wario reads in a newspaper about a secret treasure lost in a pyramid. That's enough for Wario: he jumps in his car, enters the pyramid, and then you take control of him. Wario is a classic platform game with a twist: some enemies don't actually hurt you but change you into various forms, like Floating Wario, Zombie Wario, or Bat Wario.",
    "desc": "網際網路特有的社會和文化現象包括的網路迷因，像是流行主題、流行語、圖像、網路爆紅短片和笑話。當這種時尚和感覺在網路上出現時，它們往往會迅速增長並變得更加普遍，因為即時通信促進了口耳相傳的傳播。\n以下部分列表更側重於不受地區網際網路法律限制的網際網路現象；其他國家，例如中國或巴基斯坦，確實存在不受地區法律禁止的特定網際網路現象。 這些都包含在中國大陸網路熱點事件列表和巴基斯坦網路熱點事件列表中。",
    "desc_source": "wiki"
  },
  "Castlevania - Circle of the Moon (USA)": {
    "key": "Castlevania - Circle of the Moon (USA)",
    "original_name": "Castlevania : Circle of the Moon",
    "name": "恶魔城系列",
    "name_source": "wiki",
    "original_desc": "The year is 1830. At an old Austrian castle, the worshipers of Chaos attempted to revive the Lord of Darkness, Count Dracula. Vampire Hunter Morris Baldwin and his apprentices, Nathan Graves and Hugh Baldwin, heard of this and headed to Castlevania to stop Count Dracula's resurrection and restoration of power. However, they arrived a few seconds too late and Camilla, a minion of Count Dracula, started the rite to revive her master.\nNow it is up to you to fight your way through various monsters, and Dracula's minions, in order to defeat the Lord of Darkness!",
    "desc": "1830年，在一座古老的奧地利城堡裡，混沌的崇拜者們試圖復活黑暗之王德古拉伯爵。吸血鬼獵人莫里斯·鮑德溫和他的徒弟內森·格​​雷夫斯和休·鮑德溫得知此事後前往惡魔城阻止德古拉伯爵的複活和恢復權力。然而，他們來得太晚了幾秒鐘，德古拉伯爵的部下卡米拉開始了復活她主人的儀式。\n現在你要與各種怪物和德古拉的爪牙戰鬥，打敗黑暗之王！",
    "desc_source": "api"
  },
  "DK - King of Swing (USA)": {
    "key": "DK - King of Swing (USA)",
    "original_name": "DK : King of Swing",
    "name": "大金刚系列游戏列表",
    "name_source": "wiki",
    "original_desc": "Cranky is hosting the Jungle Jam contest. Before the contest can begin, King K. Rool steals the medallions. It's up to Donkey Kong to retrieve the medals. Players use the L and R Buttons to move left and right and to rotate counter-clockwise and clockwise on pegs. Most of the action takes place on these pegs. DK attacks by either charging up by holding on to two pegs at once or throwing things such as rocks or bombs.",
    "desc": "脾氣暴躁的人正在主持叢林果醬比賽。比賽開始前，King K. Rool 偷走了獎章。現在就看大金剛能否奪回獎牌了。玩家使用 L 和 R 按鈕左右移動以及在釘子上逆時針和順時針旋轉。大部分動作都發生在這些釘子上。DK 的攻擊方式是同時抓住兩個釘子進行沖鋒，或者投擲石塊或炸彈等物品。",
    "desc_source": "api"
  },
  "Advance Wars (USA) (Rev 1)": {
    "key": "Advance Wars (USA) (Rev 1)",
    "original_name": "Advance Wars",
    "name": "高级战争",
    "name_source": "wiki",
    "original_desc": "The battle lines have been drawn, and an elite group of sly strategists is massing troops at your borders. You'll have to command ground, air and naval forces if you hope to survive the coming wars, and it won't be easy. With 114 maps to battle on and both the Single-Pak and Multi-Pak link modes, Advance Wars brings turn-based strategy to a depth never before seen on a handheld!",
    "desc": "戰線已經劃定，一群狡猾的戰略家精英正在你的邊境集結軍隊。如果你希望在即將到來的戰爭中生存下來，你就必須指揮地面、空中和海軍部隊，這並不容易。Advance Wars 擁有 114 張可供戰鬥的地圖以及 Single-Pak 和 Multi-Pak 鏈接模式，將回合製策略帶到了掌機上前所未有的深度！",
    "desc_source": "api"
  },
  "Mother 3 (Japan) (Translated)": {
    "key": "Mother 3 (Japan) (Translated)",
    "original_name": "Mother 3",
    "name": "Mother Game～她們的階級～",
    "name_source": "wiki",
    "original_desc": "The Nowhere Islands are an idyllic place; the residents of Tazmily Village live peacefully and in harmony with nature and with each other. But this changes when the mysterious Pigmask Army arrives and proceeds to destroy and corrupt, with force and sly persuasion alike. The main character is Lucas, a young boy who must find out who wants to destroy the tranquility of Nowhere Islands and turn them into a high-tech nightmare.\n\nMother 3 is a top-down role-playing game. The player character travels around the Nowhere Islands with his party, talking to people and furthering the plot. It is possible to \"dash\", which not only allows to travel faster, but also allows to knock weaker enemies out of the way (or to ram some objects/characters).\n\nThere are many enemies to battle in the game. The battles are turn-based and feature a musical combo system, where tapping a button in rhythm with the background music will cause additional damage to the enemy. The characters have \"rolling HP meters\"; when they are dealt damage, they don't lose all the HP right away, but their HP decreases slowly; this way, even if a character receives massive damage, he can survive with only minor injuries if you manage to end the combat quickly.",
    "desc": "無人島是一個田園詩般的地方。塔茲米里村的居民與自然和彼此和諧相處。但當神秘的豬面具軍到來並通過武力和狡猾的說服手段進行破壞和腐敗時，情況發生了變化。主角是盧卡斯，一個小男孩，他必須找出誰想要破壞無處群島的寧靜，並將其變成高科技噩夢。\n\nMother 3 是一款自上而下的角色扮演遊戲。玩家角色與他的隊伍一起在無處群島旅行，與人們交談並推進情節。可以“衝刺”，這不僅可以使行進速度更快，還可以將較弱的敵人擊倒（或撞擊某些物體/角色）。\n\n遊戲中有很多敵人需要戰鬥。戰鬥是回合製的，並具有音樂連擊系統，隨著背景音樂的節奏點擊按鈕將對敵人造成額外傷害。角色擁有“滾動生命值表”；當他們受到傷害時，他們的生命值不會立即消失，而是緩慢減少；這樣，即使角色受到巨大傷害，如果你能夠快速結束戰鬥，他也可以僅受輕傷而生存。",
    "desc_source": "api"
  },
  "Mr. Driller 2 (USA)": {
    "key": "Mr. Driller 2 (USA)",
    "original_name": "Mr. Driller 2",
    "name": "万代南梦宫电子游戏系列列表",
    "name_source": "wiki",
    "original_desc": "You play the game as Susumu or Anna. Equipped with nothing but a pressurized suit and a drill, you need to contact the King of the Undergrounders. To do this, you will need to drill down several thousands of feet avoiding being crushed and remembering to pick up air tanks.This is a real-time puzzle game where you will be continually moving down or sideways in an effort to get to the bottom. As you dig, blocks will fall to fill in the spaces below. Like colored blocks will stick together (giving you time to rest), but will disappear if 4 or more blocks come together. This can cause chain reactions (very common in two-color levels) that become dangerous quickly.Three modes of play: Story, Time Attack, and Endless Driller. Story Mode uses the bare bones story from above. Time Attack gives you a set levels with a specific time limit. Endless Driller allows you to dig for as long as you can.",
    "desc": "您將扮演 Susumu 或 Anna 來玩遊戲。除了加壓服和鑽頭之外什麼都沒有，你需要聯繫地下人之王。為此，您需要向下鑽數千英尺，避免被壓碎，並記住撿起氣罐。這是一款實時益智遊戲，您將不斷向下或向側面移動，努力找到底部。當你挖掘時，方塊會掉落以填充下面的空間。就像彩色塊會粘在一起（讓你有時間休息），但如果 4 個或更多塊聚集在一起就會消失。這可能會導致連鎖反應（在兩種顏色的關卡中很常見），並很快變得危險。三種遊戲模式：故事、時間攻擊和無盡鑽探。故事模式使用上面的基本故事。時間攻擊為您提供具有特定時間限制的設定級別。無盡的鑽機讓您可以盡可能長時間地挖掘。",
    "desc_source": "api"
  },
  "Lunar Legend (USA)": {
    "key": "Lunar Legend (USA)",
    "original_name": "Lunar Legend",
    "name": "PlayStation Portable游戏列表",
    "name_source": "wiki",
    "original_desc": "You play Alex, a young boy who hopes to one day be a Dragonmaster like his dearly departed hero Dyne. One day, a wizard named Nash comes into town, and needs an escort to a nearby shrine in the woods. You, your childhood friend Luna, and your flying cat-like pet Nall accompany Nash to the shrine, and your adventure begins.",
    "desc": "這是爆紅音樂影片的部分列表，在網際網路上獲得了迅速的關注。與網路迷因一樣，此類視頻的收視率往往會迅速擴大並變得更加普遍，因為即時通信有助於口耳相傳。\n該列表記錄了已知已走紅的音樂視頻；其他爆紅視頻可以在爆紅影片列表中找到，其他視頻已成為網際網路現象的其他類別可以在網路爆紅列表中找到。",
    "desc_source": "wiki"
  },
  "Tony Hawk's Underground (USA, Europe)": {
    "key": "Tony Hawk's Underground (USA, Europe)",
    "original_name": "Tony Hawk's Underground",
    "name": "斯派克电子游戏大奖",
    "name_source": "wiki",
    "original_desc": "Like earlier entries in the Tony Hawk skateboarding series on the Game Boy Advance, Tony Hawk's Underground adapts the console title to the handheld platform using isometric graphics and polygonal characters.The main game mode is story mode. Players creat",
    "desc": "與 Game Boy Advance 上《托尼霍克》滑板系列的早期作品一樣，《托尼霍克地下城》使用等距圖形和多邊形角色將游戲機標題改編為手持平台。主要遊戲模式是故事模式。玩家創造",
    "desc_source": "api"
  },
  "TMNT (USA) (En,Fr,Es)": {
    "key": "TMNT (USA) (En,Fr,Es)",
    "original_name": "TMNT",
    "name": "Greatest Hits",
    "name_source": "wiki",
    "original_desc": "Cowabunga! Take control of your favourite turtle ninjas as you play through the events of the 2007 CGI movie. The turtles have grown apart, and Raphael has taken to crime fighting solo under the guise of the Nightwatcher. The Foot Clan are turning up in the streets again, and a mysterious man known as Winters seems to be involved with them. Only the Ninja Turtles can clean up the streets!\n\nPlayers fight through waves of enemies in a sidescrolling beat-em-up style. Enemies will drop the usual health pickups, but also drop money and weaponry. Money can be used to purchase weapons or upgrades between missions, while weapons can be used as a more powerful tool to defeat your foes. After the completion of a mission, experience is earned, and after a certain amount, you can level up the turtles.\n\nEach turtle has their own specific weapon: Leonardo with his dual Katana, Michelangelo with his Nunchucks, Donatello with his Bo Staff and Raphael with his two Sai. These weapons are used in their standard attacks. A basic attack is performed with the B Button, but you can perform different attacks with B and other buttons such as the directions of the Control Pad and the A Button. Uppercuts, Sweep Kicks, Jump Kicks and more can be performed, and you can even juggle enemies in the air to get more hits in and increase your score.",
    "desc": "科瓦邦加！控制您最喜歡的烏龜忍者，體驗 2007 年 CGI 電影中的事件。海龜們漸漸疏遠，拉斐爾以守夜人的名義獨自打擊犯罪。腳族再次出現在街頭，一個名叫溫特斯的神秘男子似乎與他們有關。只有忍者神龜才能清理街道！\n\n玩家以橫向捲軸格鬥風格與一波又一波的敵人作戰。敵人會掉落通常的生命值，但也會掉落金錢和武器。金錢可以用來購買武器或在任務之間進行升級，而武器可以用作擊敗敵人的更強大的工具。完成任務後會獲得經驗，積累到一定數量後可以對海龜進行升級。\n\n每隻烏龜都有自己的特定武器：萊昂納多用他的雙武士刀，米開朗基羅用他的雙節棍，多納泰羅用他的博杖，拉斐爾用他的兩個賽伊。這些武器用於他們的標準攻擊。使用 B 按鈕執行基本攻擊，但您可以使用 B 和其他按鈕（例如控制板的方向和 A 按鈕）執行不同的攻擊。可以進行上勾拳、橫掃踢、跳躍踢等動作，你甚至可以在空中與敵人進行雜耍，以獲得更多的打擊並提高你的分數。",
    "desc_source": "api"
  },
  "Oriental Blue - Ao no Tengai (Japan) (Translated)": {
    "key": "Oriental Blue - Ao no Tengai (Japan) (Translated)",
    "original_name": "Oriental Blue : Ao no Tengai",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "The game continues the tradition of Tengai Makyou series, also known as \"Far East of Eden\". You play as either Tenran or Aoi, a teenage boy and girl, respectively, on quest to defeat the ancient evil that threatens the prosperous land of Jipang, to prove themselves worthy of the legendary Fire Clan, warriors who have been protecting Jipang for many generations from evil demons and warlocks. The land Jipang is very similar to medieval Japan, and during your adventure you'll also visit Mongolia, China, and other Asian countries.\n\nThe most important new feature of the game is a non-linear storyline. You can tackle many missions in any order you want, and the storyline also changes depending on the outcome of major battles. If you lose against a boss enemy, the game is not over, but instead, a branching storyline path is revealed. Otherwise, the gameplay is similar to other Tengai Makyou games, featuring overworld map traveling and first person perspective, turn-based combat.",
    "desc": "遊戲延續了《天外魔鏡》系列的傳統，也被稱為“遠東伊甸園”。你扮演天蘭或葵，分別是一個十幾歲的男孩和女孩，尋求擊敗威脅吉龐繁榮土地的遠古邪惡，證明自己配得上傳說中的火氏族，這些戰士世世代代保護著吉龐免受邪惡惡魔和術士的侵害。吉龐這片土地與中世紀的日本非常相似，在您的冒險過程中，您還將訪問蒙古、中國和其他亞洲國家。\n\n遊戲最重要的新功能是非線性故事情節。你可以按照你想要的任何順序完成許多任務，故事情節也會根據主要戰鬥的結果而變化。如果你輸給了頭目敵人，遊戲並沒有結束，而是會出現一個分支故事情節路徑。除此之外，遊戲玩法與其他《天外魔鏡》遊戲類似，以世界地圖旅行和第一人稱視角、回合製戰鬥為特色。",
    "desc_source": "api"
  },
  "Boktai - The Sun Is in Your Hand (USA)": {
    "key": "Boktai - The Sun Is in Your Hand (USA)",
    "original_name": "Boktai : The Sun Is in Your Hand",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Boktai: The Sun Is in Your Hand is the first Game Boy Advance game that uses sunlight to influence gameplay. In the game, you'll follow the adventures of Django, a young vampire hunter on a quest to rid the world of evil. As Django, you must overcome traps, defeat enemies, and fight through the deepest parts of dungeons. Watch out for the amount of sunlight--Django is stronger by day, while the vampires are stronger by night. The game features a solar sensor on the cartridge and a real-time clock system.",
    "desc": "Boktai：太陽在你手中是第一款利用陽光影響遊戲玩法的 Game Boy Advance 遊戲。在遊戲中，你將跟隨年輕的吸血鬼獵人姜戈的冒險之旅，尋求消滅世界上的邪惡。作為姜戈，你必須克服陷阱，擊敗敵人，並在地牢的最深處戰鬥。注意陽光的量——姜戈在白天更強，而吸血鬼在晚上更強。該遊戲的特點是卡帶上有一個太陽能傳感器和一個實時時鐘系統。",
    "desc_source": "api"
  },
  "Tactics Ogre - The Knight of Lodis (USA)": {
    "key": "Tactics Ogre - The Knight of Lodis (USA)",
    "original_name": "Tactics Ogre : The Knight of Lodis",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Assume the role of Alphonse, a knight of Galicia, sent on a mission to investigate the intentions of the suspect governing body of the Holy Lodis Empire and solve the mystery of Ovis. Along the way, you will experience many trials and tribulations, but you must survive the unrelenting battles and cultivate your characters' abilities to reveal your true destiny.",
    "desc": "扮演加利西亞騎士阿爾方斯，奉命調查神聖洛迪斯帝國可疑統治機構的意圖並解開奧維斯之謎。一路上，你會經歷許多考驗和磨難，但你必須在無情的戰鬥中生存下來，並培養你的角色的能力，以揭示你真正的命運。",
    "desc_source": "api"
  },
  "GT Advance - Championship Racing (USA, Europe)": {
    "key": "GT Advance - Championship Racing (USA, Europe)",
    "original_name": "GT Advance : Championship Racing",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "A Racing Simulation using \"real world\" vehicles, mostly Japanese models. similar to the PlayStation Gran Turismo series. Players begin with a single vehicle selected from a range of fairly standard models, that car is entered into a series of races with cash prizes and prize money can be used to purchase additional vehicles or upgrade an existing one.",
    "desc": "使用“現實世界”車輛（主要是日本車型）的賽車模擬。類似於 PlayStation Gran Turismo 系列。玩家從一系列相當標準的車型中選擇一輛車開始，該車將參加一系列有現金獎勵的比賽，獎金可用於購買額外的車輛或升級現有的車輛。",
    "desc_source": "api"
  },
  "Bruce Lee - Return of the Legend (USA)": {
    "key": "Bruce Lee - Return of the Legend (USA)",
    "original_name": "Bruce Lee : Return of the Legend",
    "name": "李小龙",
    "name_source": "wiki",
    "original_desc": "The legendary Bruce Lee is back as Hai Feng! Master Bruce's fists of fury, nunchaku and dozens of awesome moves as you travel across the globe to locations of mystery and intrigue in this epic martial arts adventure! Use the environment to your advantage, evade your enemies by scaling walls, fight like the Masterwith multiple combo and power-up attacks.",
    "desc": "傳奇人物李小龍回歸，飾演海峰！布魯斯大師的憤怒之拳、雙截棍和數十種令人敬畏的動作，讓您在這場史詩般的武術冒險中穿越全球，前往神秘和陰謀的地點！利用環境優勢，通過攀爬牆壁來躲避敵人，像大師一樣通過多種連擊和強化攻擊進行戰鬥。",
    "desc_source": "api"
  },
  "Castlevania - Aria of Sorrow (USA)": {
    "key": "Castlevania - Aria of Sorrow (USA)",
    "original_name": "Castlevania : Aria of Sorrow",
    "name": "恶魔城系列",
    "name_source": "wiki",
    "original_desc": "The year is 2035 and Soma Cruz is about to witness the first solar eclipse of the 21st century when he suddenly blacks out -- only to awaken inside a mysterious castle. As Soma, you must navigate the castle's labyrinths while confronting perilous monsters at every turn. But beware, you must escape before the evil consumes you!",
    "desc": "2035 年，索馬·克魯茲即將目睹 21 世紀的第一次日食，卻突然眼前一黑，醒來時發現自己身處一座神秘的城堡內。作為索瑪，你必須在城堡的迷宮中穿行，同時還要隨時面對危險的怪物。但要小心，你必須在邪惡吞噬你之前逃脫！",
    "desc_source": "api"
  },
  "Final Fantasy I & II - Dawn of Souls (USA)": {
    "key": "Final Fantasy I & II - Dawn of Souls (USA)",
    "original_name": "Final Fantasy I & II : Dawn of Souls",
    "name": "最终幻想II",
    "name_source": "wiki",
    "original_desc": "Final Fantasy I: Experience Final Fantasy in a way you've never imagined, with improved graphics and the all-new Soul of Chaos dungeon. Take on the role of the four Warriors of Light, and restore order to their chaotic world!\nFinal Fantasy II: Final Fantasy II gave players deeper characters and a more compelling storyline. In this enhanced edition, experience the addition of the Soul of Rebirth, the never-before-told saga of the heroes who gave their lives to save their world!",
    "desc": "《Final Fantasy VII 重製版》（日語：ファイナルファンタジーVII リメイク，英語：Final Fantasy VII Remake）是史克威爾艾尼克斯開發並於2020年4月10日在PlayStation 4平台全球發行的動作角色扮演遊戲，由PS4獨占首年發售時間。該遊戲為1997年在PS平台推出的Final Fantasy系列本傳《Final Fantasy VII》的完全重製作品。 多位參與《Final Fantasy VII》原作的開發成員亦回歸本作研發，包括擔任總監與負責概念設計的野村哲也、製作人北瀨佳范、編劇野島一成、聯合總監與編劇鳥山求、音樂總監植松伸夫等人。 \n由於原作具有龐大的內容，故整個《Final Fantasy VII》的重製計畫將會分拆為多部作品推出。第一部作品加入大量擴充橋段，對原作序盤的魔晄都市米德加有了深入描寫，故事推進至一行人離開米德加為止。主線講述身為僱傭兵的主角克勞德·史特萊夫協同名為「雪崩」的生態恐怖主義組織成員，對抗汲取星球生命精華作為能源並擁有極大權力的巨型企業「神羅」。遊戲結合了即時戰鬥、策略與傳統RPG等要素。\n企劃於2015年正式公布，原定2020年3月3日發售，後小幅延期到2020年4月10日上市。其畫面、遊戲玩法、故事情節和音樂方面獲得業界普遍好評，對原版劇情的忠實與擴展也被稱道。《Final Fantasy VII 重製版》是PlayStation 4平台上銷售最快的遊戲之一，遊戲發售前三天實體版出貨量與數位版銷量合計超過了350萬份。遊戲的加強版《Final Fantasy VII 重製版 Intergrade》（日語：ファイナルファンタジーVII リメイク インターグレード，英語：Final Fantasy VII Remake Intergrade）於2021年6月10日在PlayStation 5上推出，在畫質等方面有所加強，並加入了獨占角色尤菲·如月，在2021年12月16日也在Epic Games上推出Microsoft Windows版本。本遊戲的續作《Final Fantasy VII 重生》已於2024年2月29日推出，並將會再有一部續作，構成重製版三部曲。",
    "desc_source": "wiki"
  },
  "Puyo Pop (USA) (En,Ja)": {
    "key": "Puyo Pop (USA) (En,Ja)",
    "original_name": "Puyo Pop",
    "name": "任天堂Switch Online",
    "name_source": "wiki",
    "original_desc": "Help Arle and Carbuncle make their way home! Take on all of the wacky characters you meet in challenging games of Puyo Pop so you can make your way through the land and back to safety. It's a mad scramble to erase Puyo, create chain combos, and fill up your opponent's playfield in this fast-paced puzzle game.",
    "desc": "幫助阿爾勒和卡邦科回家！在《Puyo Pop》的挑戰性遊戲中，扮演你遇到的所有古怪角色，這樣你就可以穿過這片土地，回到安全的地方。在這款快節奏的益智遊戲中，消滅 Puyo、創造連鎖組合併填滿對手的遊戲場是一場瘋狂的爭奪戰。",
    "desc_source": "api"
  },
  "Mario Pinball Land (USA, Australia)": {
    "key": "Mario Pinball Land (USA, Australia)",
    "original_name": "Mario Pinball Land",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "This is the standard \"Bowser has kidnapped the Princess, and Mario must rescue her\" story. In this case, the Princess is transformed into a ball and launched from a Super Mario 64-style cannon, which a pair of goombas aim directly at Bowser's Castle. Mario is also transformed into a ball and chases after her.\n\nThere are 5 levels, each consisting of a set of pinball tables. Each table has some exits (including the one below the flippers) that Mario can use to move to other tables. Also, each one holds a star, normally obtained by defeating all enemies on the table. Some exits require that Mario has a certain number of stars. To gain access to Bowser's castle, Mario must defeat the bosses of the first 4 levels, which gives him star keys. The game also features a \"Time Attack\" mode, which allows players to fight already defeated bosses again.",
    "desc": "這是標準的“鮑澤綁架了公主，馬里奧必須營救她”的故事。在這種情況下，公主變成了一個球，並從超級馬里奧 64 式的大砲中發射出去，一對 goombas 直接瞄準庫巴城堡。馬里奧也變成了球，追趕著她。\n\n有 5 個級別，每個級別由一組彈球桌組成。每張桌子都有一些出口（包括腳蹼下方的出口），馬里奧可以使用這些出口移動到其他桌子。此外，每個人都持有一顆星星，通常是通過擊敗桌子上的所有敵人來獲得的。有些出口要求馬里奧擁有一定數量的星星。為了進入庫巴的城堡，馬里奧必須擊敗前 4 個關卡的頭目，這會給他星星鑰匙。遊戲還設有“時間攻擊”模式，允許玩家再次與已經擊敗的頭目戰鬥。",
    "desc_source": "api"
  },
  "Tony Hawk's Pro Skater 3 (USA, Europe)": {
    "key": "Tony Hawk's Pro Skater 3 (USA, Europe)",
    "original_name": "Tony Hawk's Pro Skater 3",
    "name": "GameSpot",
    "name_source": "wiki",
    "original_desc": "Tony Hawk returns with an all new line-up of skaters, an all new line-up of parks to crash through, and a whole new level of graphics.\n\nThe line-up of street and vert riders include Elissa Steamer, Jamie Thomas, Steve Caballero, Rune Glifberg, Geoff Rowley, Andrew Reynolds, Rodney Mullen, Eric Koston, Chad Muska, Bucky Lasek and Bam Margera from MTV's Jackass (and Tony Hawk, of course).\n\nThe create a skater mode returns, allowing for even further levels of options for your character, like adding glasses and tatoos to changing the colour of the knee and elbow pads or even the hair.\n\nAnd the levels themselves that you must skate through are now more interactive, with cars and humans blocking paths and making noise as you race around to make as many points as possible. Use items around the streets or the park to jump from or over to increase your score, and pull of as many wild and wacky tricks as you can.",
    "desc": "Xbox One遊戲列表包括了正在開發中或已經發售的部分Xbox One遊戲。",
    "desc_source": "wiki"
  },
  "Golden Sun - The Lost Age (USA, Europe)": {
    "key": "Golden Sun - The Lost Age (USA, Europe)",
    "original_name": "Golden Sun : The Lost Age",
    "name": "黃金太陽 失落的時代",
    "name_source": "wiki",
    "original_desc": "The story of Golden Sun: The Lost Age picks up right near the end of the first game. Golden Sun veterans will be surprised to learn that The Lost Age is played from the point of view of the party being chased as they try to light the remaining two lighthouses, which will unlock the power of alchemy for the world--or will it instead unlock the world's destruction?",
    "desc": "《金太陽：失落的時代》的故事發生在第一款遊戲快結束時。金太陽的老玩家們會驚訝地發現，《失落的時代》是從被追趕的一方的角度來玩的，他們試圖點亮剩下的兩座燈塔，這將為世界解鎖煉金術的力量——還是會解鎖世界的毀滅？",
    "desc_source": "api"
  },
  "Kao the Kangaroo (USA) (En,Fr,De,Es,It,Nl)": {
    "key": "Kao the Kangaroo (USA) (En,Fr,De,Es,It,Nl)",
    "original_name": "Kao the Kangaroo",
    "name": "袋鼠小天王 (2000年遊戲)",
    "name_source": "wiki",
    "original_desc": "Crikey! Kao's been stolen from down under! It's up to you to get him home to the Outback.\n\nUnlike the Windows and Dreamcast versions of this game, the GBA version is a 2D side scrolling platform game. You control Kao the Kangaroo through twenty-seven levels. You basic modes of travel are running or jumping but in later levels, you will have snowboarding, flying and jet skiing. As you travel along, enemies try to stop you. You must kill or avoid these enemies. Your main weapon is a pair of boxing gloves with which you can pound enemies but, if you push down and attack, you can also do a tail spin to attack lower-height enemies. In each level, there are flags you can pick up and, by pressing select, you can drop them to create your own continue point.",
    "desc": "克里克！Kao 被從下面偷走了！由你來帶他回到內陸的家。\n\n與該遊戲的 Windows 和 Dreamcast 版本不同，GBA 版本是一款 2D 橫向捲軸平台遊戲。您可以通過二十七個級別來控製袋鼠 Kao。你的基本旅行方式是跑步或跳躍，但在後面的關卡中，你將有滑雪板、飛行和水上摩托艇。當你前進時，敵人會試圖阻止你。你必須殺死或避開這些敵人。你的主要武器是一副拳擊手套，你可以用它猛擊敵人，但如果你向下推並攻擊，你也可以做尾部旋轉來攻擊身高較低的敵人。在每個級別中，您都可以拾取一些標誌，並且通過按選擇，您可以放下它們以創建您自己的繼續點。",
    "desc_source": "api"
  },
  "Tony Hawk's Underground 2 (USA, Europe)": {
    "key": "Tony Hawk's Underground 2 (USA, Europe)",
    "original_name": "Tony Hawk's Underground 2",
    "name": "畅销PlayStation 2游戏列表",
    "name_source": "wiki",
    "original_desc": "Tony Hawk's Underground 2 is based on the console games of the same name.  Like the previous GBA releases of the series, it's an isometric representation of the console levels combined with polygonal characters.  It contains both a story mode, in which you create a rookie skater and take him or her on a world tour with pros to improve their skills and win prizes; and a classic mode, in which you must accomplish various goals such as tricking off objects or getting a high score within two minutes.  Changes in this iteration include removing the timer from most goals in story mode, allowing you to have several active at once and new moves like the nata spin, tantrum, which allows you to recover from a bail without losing everything, focus, where you can slow time in order to land the best trick and sticker-slapping.",
    "desc": "D.I.C.E.大獎（英語：D.I.C.E. Awards），原名互動成就獎（Interactive Achievement Awards），是從1998年開始的電子遊戲產業的頒獎典禮。業界通常將其稱為「電子遊戲奧斯卡」。該獎項由互動藝術與科學學會 (AIAS) 規劃，並在拉斯維加斯舉行年度 D.I.C.E. 峰會。「D.I.C.E」 是「設計創新溝通娛樂」（Design Innovate Communicate Entertain）的逆向首字母縮略詞。 D.I.C.E. 獎項的宗旨為表彰為全球數十億美元娛樂軟體產業的發展做出貢獻的遊戲、個人和開發團隊。",
    "desc_source": "wiki"
  },
  "Dragon Quest Monsters - Caravan Heart (Japan) (Translated)": {
    "key": "Dragon Quest Monsters - Caravan Heart (Japan) (Translated)",
    "original_name": "Dragon Quest Monsters : Caravan Heart",
    "name": "勇者鬥惡龍系列",
    "name_source": "wiki",
    "original_desc": "Up to his usual mischief, Kiefer upsets his father, the King of Gran Estard, more than ever before and flees to his room in hopes of escaping his punishment. Hiding inside his dresser, Kiefer hears a voice call out to him and wanders out to an odd silence and the presence of a Travelers' Gate in his room. Once stepping in, Kiefer finds himself in the world of Dragon Quest II and must no sooner assume the role of a caravan leader in order to help a boy named Luin find a cure for his sick parents.",
    "desc": "基弗一如既往的惡作劇讓他的父親，大埃斯塔德國王比以往任何時候都更加不安，並逃到他的房間，希望逃脫他的懲罰。基弗躲在梳妝台裡，聽到有人呼喚他，於是他走出去，房間裡一片奇怪的寂靜，房間裡有一扇旅行者之門。一旦踏入，基弗就發現自己身處《勇者鬥惡龍 II》的世界中，他必須立即扮演商隊領袖的角色，以幫助一個名叫魯因的男孩為他生病的父母找到治療方法。",
    "desc_source": "api"
  },
  "Pokemon - Ruby Version (USA, Europe) (Rev 2)": {
    "key": "Pokemon - Ruby Version (USA, Europe) (Rev 2)",
    "original_name": "Pokémon Ruby Version",
    "name": "寶可夢系列 (遊戲)",
    "name_source": "wiki",
    "original_desc": "Immerse yourself in the beautiful region of Hoenn, a place of masterful heroes and mysterious teams, of friendship and battles. As the new kid in town, you set off on your journey as a Pokémon Trainer. Who knows what wonders and dangers await you? Now it's time to grab your gear and head out on your own...\n\n-Over 200 Pokémon appear with over 100 new discovered species--you'll have to link up and trade with a friend who has Sapphire Version to catch them all!\n-2-on-2 battles--use two of your Pokémon in a battle at the same time!\n-Engage in intense multi battles with up to four friends!\n-Pokémon Contests let you groom your Pokémon to be the Best of Show!\n-Stunning Game Boy Advance graphics display the world of Pokémon with more detail than ever!",
    "desc": "沉浸在美麗的豐緣地區，這裡充滿了高超的英雄和神秘的團隊，充滿了友誼和戰鬥。作為鎮上的新來的孩子，你踏上了神奇寶貝訓練師的旅程。誰知道有什麼奇蹟和危險在等待著你呢？現在是時候拿起你的裝備，獨自出發了……\n\n- 超過 200 只神奇寶貝和超過 100 種新發現的物種出現——你必須與擁有藍寶石版的朋友聯繫並進行交易才能捕捉到所有它們！\n-2對2戰鬥——同時使用兩隻神奇寶貝進行戰鬥！\n- 與最多四位朋友進行激烈的多人戰鬥！\n- 神奇寶貝大賽可讓您培養您的神奇寶貝，使其成為最佳表演者！\n- 令人驚嘆的 Game Boy Advance 圖形以比以往更多的細節展示神奇寶貝世界！",
    "desc_source": "api"
  },
  "Sabre Wulf (USA)": {
    "key": "Sabre Wulf (USA)",
    "original_name": "Sabre Wulf",
    "name": "Sabre Wulf",
    "name_source": "keep",
    "original_desc": "The amulet that had been in place to imprison Sabrewulf has been shattered by the evil Dr. Dolittle-Goode. Now, it is up to Sabreman to traverse the land in pursuit of these villains; and to retrieve the eight pieces of the amulet.\n\nThe game is separated into two modes of play: the 3D exploration mode and the 2D platforming sections. The 3D exploration mode is how Sabreman gets around the eight different themed worlds of Sabre Wulf. While there are no enemies in this mode, there are plenty of people to talk to, who might help you in your quest. Also strewn about are more than fifty 2D platforming levels, which you can access through the wulf's head tunnels.",
    "desc": "用於囚禁 Sabrewulf 的護身符已被邪惡的 Dolittle-Goode 博士打碎。現在，薩布雷曼必須穿越這片土地追捕這些惡棍；並取回八塊護身符。\n\n遊戲分為兩種遊戲模式：3D 探索模式和 2D 平台部分。3D 探索模式是 Sabreman 探索 Sabre Wulf 八個不同主題世界的方式。雖然此模式中沒有敵人，但有很多人可以交談，他們可能會幫助你完成任務。還散佈著五十多個 2D 平台關卡，您可以通過狼人的頭部隧道進入這些關卡。",
    "desc_source": "api"
  },
  "Rhythm Heaven Silver (Japan) (Translated)": {
    "key": "Rhythm Heaven Silver (Japan) (Translated)",
    "original_name": "Rhythm Tengoku",
    "name": "节奏天国",
    "name_source": "wiki",
    "original_desc": "Rhythm Tengoku is a music game based around good timing and rhythm. The game has music supplied by the record production company J.P. ROOM, and is developed by the team responsible for Wario Ware.\n\nAs with Wario Ware, the game is actually a series of shorter games bundled into one package. Before each game starts, you are presented with a short tutorial that gets you ready and practice before you begin the real thing.\n\nPlayers will punch in time with a karate expert as pots and rocks are thrown; pluck hairs off of an onion; march in time to an instructor; hit a baseball while the screen zooms in and out; shoot ghosts with arrows; chop demons as a samurai; and much more. At the end of each set of stages is a 'remix stage' - in this stage, sections of the previously played stages are combined and thrown at you at random, all while a single song plays.",
    "desc": "Rhythm Tengoku 是一款基於良好時機和節奏的音樂遊戲。遊戲的音樂由唱片製作公司 J.P. ROOM 提供，並由負責 Wario Ware 的團隊開發。\n\n與《Wario Ware》一樣，該遊戲實際上是捆綁在一個包中的一系列較短的遊戲。在每個遊戲開始之前，您都會看到一個簡短的教程，幫助您在開始真正的遊戲之前做好準備和練習。\n\n玩家將在投擲罐子和石塊時與空手道專家及時打拳；拔掉洋蔥上的毛；及時行進到教練身邊；當屏幕放大和縮小時擊打棒球；用箭射鬼；作為武士斬妖除魔；還有更多。每組階段的末尾是一個“混音階段”——在這個階段，之前播放的階段的部分被組合起來並隨機扔給你，同時播放一首歌曲。",
    "desc_source": "api"
  },
  "Spyro - Attack of the Rhynocs (USA)": {
    "key": "Spyro - Attack of the Rhynocs (USA)",
    "original_name": "Spyro: Attack of the Rhynocs",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "In a terrible mishap, Spyro, Sparx, and the Professor have inadvertently torn a hole in the fabric of space between the Rhynoc and Dragon Realms. Now, at the command of the elusive Ripto, droves of Rhynocs are pouring into the Dragon Realms in yet another attempt to make life miserable. As Spyro, Agent 9, or Sergeant Byrd, you must help the Professor close the hole quickly before the gate becomes too big and the two realms fuse together--permanently. You can use Spyro's new abilities, including the Head-Butt Slam, Cyclone Attack, Phoenix Vision, and more.",
    "desc": "在一次可怕的事故中，斯派羅、斯帕克斯和教授無意中在犀牛王國和龍王國之間的空間結構上撕開了一個洞。現在，在難以捉摸的瑞普託的指揮下，成群的犀牛正湧入龍界，再次試圖讓生活變得悲慘。作為小龍斯派羅、9號特工或伯德中士，你必須幫助教授迅速關閉這個洞，以免大門變得太大，兩個領域永久地融合在一起。您可以使用小龍斯派羅的新能力，包括頭撞猛擊、旋風攻擊、鳳凰視覺等等。",
    "desc_source": "api"
  },
  "Denki Blocks! (USA) (En,Es)": {
    "key": "Denki Blocks! (USA) (En,Es)",
    "original_name": "Denki Blocks!",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Denki Blocks! uses a single, simple digital toy set to provide a collection of 'puzzle games'.\n\nDenki Blocks! is played by sliding blocks around a board. When blocks of the same colour touch, they stick together to form clumps. Sometimes the player has to join all blocks of the same colour in any way possible. Sometimes specific shapes have to be made.",
    "desc": "電氣塊！使用單一、簡單的數字玩具套裝來提供一系列“益智遊戲”。\n\n電氣塊！是通過在棋盤上滑動滑塊來玩的。當相同顏色的塊接觸時，它們會粘在一起形成團塊。有時，玩家必須以任何可能的方式連接所有相同顏色的塊。有時必須製作特定的形狀。",
    "desc_source": "api"
  },
  "Mega Man Zero 3 (USA)": {
    "key": "Mega Man Zero 3 (USA)",
    "original_name": "Mega Man Zero 3",
    "name": "洛克人Zero (游戏)",
    "name_source": "wiki",
    "original_desc": "In the third installment of Capcom's Mega Man Zero series, you, unsurprisingly, play as Zero. Continuing where the Mega Man Zero 2 left off, you have to find and neutralize the recently escaped \"Dark Elf,\" before it's able to brainwash the Resistance for the purpose of conquering Neo Arcadia. \n\nIn addition to the old Cyber Elf system, this game also contains a new \"chip\" system, where Zero can gain new abilities by finding chips and installing chip in himself. But they didn't decide to abandon the Cyber Elves in this game by giving them nothing new. No, in order to extend the life of the Cyber Elves, they added the new concept of \"Cyber Space\" to levels, where you enter a door to Cyber Space and are allowed to use each Cyber Elf as much as you please without them dying. However, there aren't too many \"Secret Disks\" (items that can contain anything from profiles of characters to Cyber Elves to new chips) in Cyber Space, so it's better to spend more time in the normal level.",
    "desc": "在 Capcom 的《洛克人零》系列的第三部中，不出所料，你將扮演零。繼續《洛克人零式 2》的故事，你必須找到並消滅最近逃脫的“黑暗精靈”，然後它才能對抵抗組織進行洗腦，以征服新阿卡迪亞。\n\n除了舊的網絡精靈系統外，這款遊戲還包含了新的“芯片”系統，零可以通過尋找芯片並在自己身上安裝芯片來獲得新的能力。但他們並沒有決定在這款遊戲中放棄網絡精靈，不給他們任何新東西。不，為了延長網絡精靈的壽命，他們在關卡中添加了“網絡空間”的新概念，你進入網絡空間的大門，可以隨意使用每個網絡精靈，而不會導致他們死亡。不過，賽博空間中的“秘密磁盤”（可以包含從角色簡介到網絡精靈到新芯片等任何內容的物品）並不多，所以最好在正常關卡上多花點時間。",
    "desc_source": "api"
  },
  "Banjo-Kazooie - Grunty's Revenge (USA, Europe)": {
    "key": "Banjo-Kazooie - Grunty's Revenge (USA, Europe)",
    "original_name": "Banjo-Kazooie: Grunty's Revenge",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Gruntilda is back, and it's up to Banjo and Kazooie to stop her master plan. In Banjo-Kazooie: Grunty's Revenge, you'll play as Banjo and follow him through six worlds rife with trials and contests. Some of the challenges you must overcome include solving puzzles, avoiding obstacles, and battling different enemies. Defeat your foes by using Banjo's array of combat moves. You can also seek help from witch doctors, who can transform Banjo into a mouse, a tank, and other creatures.",
    "desc": "格倫蒂達回來了，班卓琴和卡祖伊必須阻止她的總體計劃。在《Banjo-Kazooie: Grunty's Revenge》中，您將扮演班卓琴並跟隨他穿越六個充滿考驗和競賽的世界。你必須克服的一些挑戰包括解決謎題、躲避障礙以及與不同的敵人作戰。使用班卓琴的一系列戰鬥動作擊敗你的敵人。您還可以向巫醫尋求幫助，他們可以將班卓琴變成老鼠、坦克和其他生物。",
    "desc_source": "api"
  },
  "Super Mario Advance 4 - Super Mario Bros. 3 (USA, Australia) (Rev 1)": {
    "key": "Super Mario Advance 4 - Super Mario Bros. 3 (USA, Australia) (Rev 1)",
    "original_name": "Super Mario Advance 4 : Super Mario Bros. 3",
    "name": "超级马力欧 奥德赛",
    "name_source": "wiki",
    "original_desc": "A combination of exciting platforming action, wild power-ups, and charming Mario style has made Super Mario Bros. 3 a classic. With Super Mario Advance 4: Super Mario Bros. 3, you have your chance to partake in the special adventure anywhere you go on your Game Boy Advance. Your mission is to rescue the Mushroom Kingdom monarchs who have been transformed into animals by Bowser and his mischievous offspring, and in the process save the princess kidnapped by Bowser. Traverse eight huge worlds and encounter fun minigames and frantic boss battles as you explore the first Mario game to use an overworld map.",
    "desc": "激動人心的平台動作、狂野的強化道具和迷人的馬里奧風格相結合，使《超級馬里奧兄弟 3》成為經典。在《超級馬里奧高級 4：超級馬里奧兄弟 3》中，無論您身在何處，您都有機會在 Game Boy Advance 上參與特殊的冒險。你的任務是營救被庫巴和他頑皮的後代變成動物的蘑菇王國君主，並在此過程中拯救被庫巴綁架的公主。當您探索第一款使用世界地圖的馬里奧遊戲時，穿越八個巨大的世界，遇到有趣的小遊戲和瘋狂的頭目戰鬥。",
    "desc_source": "api"
  },
  "Teenage Mutant Ninja Turtles (USA)": {
    "key": "Teenage Mutant Ninja Turtles (USA)",
    "original_name": "Teenage Mutant Ninja Turtles",
    "name": "忍者龜：變種大亂鬥",
    "name_source": "wiki",
    "original_desc": "The heroes in a half shell are back in an all new adventure. The four turtles have been split up in order to combat the many bad guys that surround the city.\n\nEach turtle (Leonardo, Michelangelo, Raphael & Donatello) has their own set of levels to complete, with their own distinct moves and combat options to use during battle. Along with a set of side-scrolling levels, complete with end of level boss battles, the four turtles will also get the chance to race through the sewers in the unique 3rd person race modes, shooting down the enemy or collecting items, while Donatello takes to the sky in the Shell Glider and Raphael challenges Casey Jones to a one-on-one cycle race.",
    "desc": "半殼英雄們又回來了，開始了全新的冒險。四隻烏龜被分開，以對抗城市周圍的許多壞人。\n\n每隻烏龜（萊昂納多、米開朗基羅、拉斐爾和多納泰羅）都有自己的一套關卡需要完成，並在戰鬥中使用自己獨特的動作和戰鬥選項。除了一系列橫向捲軸關卡以及關卡結尾的 Boss 戰外，四隻海龜還將有機會以獨特的第三人稱競賽模式穿過下水道，擊落敵人或收集物品，而多納泰羅則駕駛貝殼滑翔機飛向天空，拉斐爾則向凱西·瓊斯發起一對一的自行車賽挑戰。",
    "desc_source": "api"
  },
  "Metroid Fusion (USA)": {
    "key": "Metroid Fusion (USA)",
    "original_name": "Metroid Fusion",
    "name": "超级银河战士",
    "name_source": "wiki",
    "original_desc": "While lending mission support on planet SR388, interstellar bounty hunter Samus Aran is attacked by an X parasite, an organism with the ability to mimic the abilities of any creature it infects. Near death, Samus is saved by a vaccine made from the DNA of the last Metroid -- the X parasite's only natural predator. When the X spread to a research station in orbit around SR388, a weakened Samus is forced to exterminate them all ... or die trying.",
    "desc": "星際賞金獵人薩姆斯·阿蘭在 SR388 星球上提供任務支持時，遭到 X 寄生蟲的攻擊，這是一種能夠模仿其感染的任何生物能力的生物體。瀕臨死亡的 Samus 被最後一個銀河戰士（X 寄生蟲唯一的天敵）DNA 製成的疫苗拯救了。當 X 擴散到 SR388 周圍軌道上的一個研究站時，虛弱的薩姆斯被迫將他們全部消滅……或者死去。",
    "desc_source": "api"
  },
  "Super Robot Taisen - Original Generation 2 (USA)": {
    "key": "Super Robot Taisen - Original Generation 2 (USA)",
    "original_name": "Super Robot Taisen : Original Generation 2",
    "name": "任天堂DS游戏列表",
    "name_source": "wiki",
    "original_desc": "The battle rages on! Peace slowly settles over the planet Earth after a brutal war against the alien armada. However, the world is not able to rest for long, as new forces emerge and threaten to bring Earth to it's knees once again. Use all the cunning and tactical skill you have to command the best and brightest mech pilots the world has ever seen in saving humanity from enemies bent on dominating the human race - or worse, annihilating it's very existence.",
    "desc": "戰鬥愈演愈烈！在與外星艦隊的殘酷戰爭之後，和平慢慢地降臨在地球上。然而，世界無法長久休息，因為新的力量出現並威脅著地球再次屈服。運用你所擁有的一切狡猾和戰術技能，指揮世界上最優秀、最聰明的機甲飛行員，從一心統治人類的敵人手中拯救人類——或者更糟糕的是，消滅人類的存在。",
    "desc_source": "api"
  },
  "Teenage Mutant Ninja Turtles 2 - Battle Nexus (USA)": {
    "key": "Teenage Mutant Ninja Turtles 2 - Battle Nexus (USA)",
    "original_name": "Teenage Mutant Ninja Turtles 2 : Battle Nexus",
    "name": "2025年電子遊戲界",
    "name_source": "wiki",
    "original_desc": "Play with\nUp To 4 Players!\nVenture with the Turtles to shell and back in TMNT 2: BattleNexus . Pick up the action on a strange new planet with mysterious new technology. Two tail-kickin' modes deliver green-knuckled action including Story and Battle Nexus Mode!\n\n-Specialized moves for each Turtle!\n-4-player shell-action!\n-Cooperative play & head-to-head four player competition",
    "desc": "這是一個包含有一定影響力的電子遊戲開發商列表，這些公司製作了包括但不限於電腦（如PC或Mac）、遊戲主機、可攜式設備或行動裝置的電子遊戲。該列表包括目前存在和已經關閉的開發商。\n關於開發商開發的遊戲更詳盡的內容，請參閱電子遊戲列表。想了解更多已停運的開發商內容，請參閱已結業電子遊戲公司。需要注意的是個人開發者獨立開發的遊戲，與之相關的遊戲開發者/開發商通常不會收錄在此列表中，相關內容請參考獨立遊戲開發商列表。",
    "desc_source": "wiki"
  },
  "Metroid - Zero Mission (USA)": {
    "key": "Metroid - Zero Mission (USA)",
    "original_name": "Metroid : Zero Mission",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "She's battled baddies on nearly every Nintendo system, and now, Samus Aran returns to her roots. Metroid: Zero Mission relives the story that started it all--revealing for the first time full details of her meeting with the Metroids. The plotline will be familiar to longtime fans of the Metroid series, but the challenges are new, the power-ups are plentiful, and the graphics and sound are supercharged. Plus, if you thought that the original Metroid had a surprise ending, wait until you get past the Mother Brain in Metroid: Zero Mission. A new twist provides a deeper adventure than ever before.",
    "desc": "她幾乎在所有任天堂系統上都與壞人戰鬥過，而現在，薩姆斯·阿蘭又回到了她的根源。《銀河戰士：零任務》重溫了這一切開始的故事——首次揭示了她與銀河戰士會面的全部細節。《銀河戰士》系列的長期粉絲會熟悉該情節，但挑戰是新的，能力提升充足，圖形和聲音也非常強大。另外，如果你認為最初的《銀河戰士》有一個令人驚訝的結局，那就等到你通過《銀河戰士：零任務》中的母腦吧。新的轉折提供了比以往更深入的冒險。",
    "desc_source": "api"
  },
  "Castlevania - Harmony of Dissonance (USA)": {
    "key": "Castlevania - Harmony of Dissonance (USA)",
    "original_name": "Castlevania : Harmony of Dissonance",
    "name": "恶魔城系列",
    "name_source": "wiki",
    "original_desc": "Nearly fifty years has past since Simon Belmont rescued the land from the curse of Dracula. Now, Simon's descendant Juste Belmont, must acquire the relics of Dracula to unravel the disappearance of his childhood friend Lydie. The castle's enchanting mysteries and danger await all those who dare enter.",
    "desc": "自從西蒙貝爾蒙特將這片土地從德古拉的詛咒中拯救出來以來，已經過去了近五十年。現在，西蒙的後裔賈斯特·貝爾蒙特必須獲得德古拉的遺物，以解開他兒時好友莉迪失踪的謎團。這座城堡迷人的神秘和危險等待著所有敢於進入的人。",
    "desc_source": "api"
  },
  "Summon Night - Swordcraft Story (USA)": {
    "key": "Summon Night - Swordcraft Story (USA)",
    "original_name": "Summon Night : Swordcraft Story",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Summon Night: Swordcraft Story is an RPG set in the strange world of Lyndbaum, a sacred land linked to four magical dimensions from which Summoners can call forth spirits called Guardian Beasts to do their bidding.",
    "desc": "官方Game Boy Advance平台的2,819款遊戲中，一塊遊戲卡匣的容量為0.5Mb至256Mb不等，其中以32Mb、64Mb及128Mb的遊戲作品最多。本列表共有1,074款Game Boy Advance遊戲。",
    "desc_source": "wiki"
  },
  "Virtua Tennis (USA)": {
    "key": "Virtua Tennis (USA)",
    "original_name": "Virtua Tennis",
    "name": "Dreamcast",
    "name_source": "wiki",
    "original_desc": "Virtua Tennis arrives on the GBA, without the 'Virtual' 3D element, but with the same gameplay you expect from a tennis game.\n\nChoose from a male or female player (or create your own) and take to the world tour, competing in various tournaments on clay, hardcourt, grass or indoors. Play against some of the best players in the world, both in singles and doubles, or compete against your friends in 4 player doubles.\n\nMini-games test your skills and improves the timing of your shots. Games range from Burger Chef (aim at the grid to decide what comes next on the burger), Disc Shooter (similar to Othello) and Bull's Eye, where you aim for the center of the target. Your created character will also improve depending on your success in each mini-game, with his or her stats increasing over time.",
    "desc": "Virtua Tennis 登陸 GBA，沒有“虛擬”3D 元素，但具有與網球遊戲相同的遊戲玩法。\n\n選擇男性或女性玩家（或創建自己的玩家）並參加世界巡迴賽，在紅土、硬地、草地或室內的各種錦標賽中競爭。與世界上一些最好的選手進行單打和雙打比賽，或者與您的朋友進行 4 人雙打比賽。\n\n迷你游戲可以測試您的技能並提高您的射擊時機。遊戲範圍包括 Burger Chef（瞄準網格來決定漢堡接下來會發生什麼）、Disc Shooter（類似於奧賽羅）和 Bull's Eye（您瞄準目標的中心）。你創建的角色也會根據你在每個迷你游戲中的成功而得到改善，他或她的統計數據會隨著時間的推移而增加。",
    "desc_source": "api"
  },
  "Zone of the Enders - The Fist of Mars (USA)": {
    "key": "Zone of the Enders - The Fist of Mars (USA)",
    "original_name": "Zone of the Enders : The Fist of Mars",
    "name": "终极地带系列",
    "name_source": "wiki",
    "original_desc": "In the distant future, mankind is at the brink of war with it's colonies on the moon, Mars and Jupiter. You take control of a young man who, after a series of events, finds himself in possession of a new type of L.E.V. (a giant combat robot) and stranded on Mars, where he joins forces with the Anti-Terrestrial League.",
    "desc": "在遙遠的未來，人類與月球、火星和木星上的殖民地正處於戰爭邊緣。你控制了一個年輕人，在發生一系列事件後，他發現自己擁有一種新型 L.E.V. （一個巨大的戰鬥機器人）並被困在火星上，在那裡他與反地球聯盟聯手。",
    "desc_source": "api"
  },
  "Mega Man Battle Network 6 - Cybeast Gregar (USA)": {
    "key": "Mega Man Battle Network 6 - Cybeast Gregar (USA)",
    "original_name": "Mega Man Battle Network 6 : Cybeast Gregar",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "In Mega Man Battle Network 6, Lan's father has received a job transfer and the family moves to Cyber City, a town known for conducting various technological experiments. Lan will meet new people and build new friendships in the real world while Mega Man befriends helpful Navis and encounters dangerous new enemies on the virtual plane. Together they will face threats far more powerful and perilous than they ever have before.",
    "desc": "在《洛克人戰網 6》中，蘭的父親得到了工作調動，全家搬到了以進行各種技術實驗而聞名的網絡城。Lan 將在現實世界中結識新朋友並建立新的友誼，而洛克人則與樂於助人的 Navis 成為朋友，並在虛擬飛機上遇到危險的新敵人。他們將共同面對比以往任何時候都更加強大和危險的威脅。",
    "desc_source": "api"
  },
  "Street Fighter Alpha 3 (USA)": {
    "key": "Street Fighter Alpha 3 (USA)",
    "original_name": "Street Fighter Alpha 3",
    "name": "快打旋風ZERO",
    "name_source": "wiki",
    "original_desc": "Street Fighter Alpha 3, the third game in the Alpha series, has a total of 31 fighters, the most in the series so far. New characters include old favorites E. Honda, Blanka, Vega, Cammy, T. Hawk, Dee Jay, Juni and Juli. Some of the newest fighters on the block include a former Final Fight character (Cody, who has been in jail since the last Final Fight game, or so his clothing suggests), Karin Kanzuki and Rainbow Mika.\n\nThe major difference between this Alpha and the last two are the new play modes World Tour, Arcade, VS, Training and Entry. \n\nWorld Tour - Simply choose your fighter and travel around the world, fighting the home town heroes that you run into. The more fights you win, the stronger you fighter becomes. You can also learn new moves, and there are three levels of Super moves to choose from before you start each round (called Isms).\n\nArcade - A simple conversion of the arcade version. Beat each fighter with your chosen warrior, in three rounds per match (much the same as past versions of Street Fighter)\n\nVersus - Two human players battle it out. \n\nTraining - A good way to learn all the super moves that are available, against a dummy.\n\nEntry - If you save your character during the World Tour mode, you can upload him here to use in the other modes in the game (especially handy for Training).\n\nFinally, if you complete certain areas of the game three new fighters become available, including another old favourite in Guile, Evil Ryu and Shin Akuma.",
    "desc": "本電子遊戲列表列舉了索尼 PlayStation的電子遊戲。索尼PlayStation最早於1994年12月3日在日本推出，之後於1995年9月9日在北美推出。",
    "desc_source": "wiki"
  },
  "Final Fight One (USA)": {
    "key": "Final Fight One (USA)",
    "original_name": "Final Fight One",
    "name": "火影忍者疾風傳 終極風暴4",
    "name_source": "wiki",
    "original_desc": "Classic arcade action is unleased on the Game Boy Advance system in Final Fight One. There's trouble in Metro City. The members of the Mad Gear Gang have kidnapped the mayor's daughter Jessica and the clock is ticking. The mayor, an ex-street fighter himself, calls in the big guns to help, enlisting the iron fist team of Cody and Guy. Now, it's a race against time to scour the city, defeat an army of the Mad Gear Gang's minions, and rescue Jessica before it's too late!",
    "desc": "《Final Fight One》中的經典街機動作遊戲在 Game Boy Advance 系統上發布。美羅城有麻煩了。瘋狂裝備幫的成員綁架了市長的女兒傑西卡，時間緊迫。市長本人曾經是一名街頭霸王，他召集了大佬們來幫忙，並招募了科迪和蓋伊組成的鐵拳團隊。現在，我們正在與時間賽跑，搜尋這座城市，擊敗瘋狂齒輪幫的爪牙軍隊，並在為時已晚之前營救傑西卡！",
    "desc_source": "api"
  },
  "Goemon - New Age Shutsudou! (Japan)": {
    "key": "Goemon - New Age Shutsudou! (Japan)",
    "original_name": "Goemon : New Age Shutsudou!",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Goemon: New Age Shutsudou! gives the franchise a facelift, putting Goemon and his friends in a futuristic rendition of Japan, fending off a supernatural force threatening the city.",
    "desc": "五右衛門：新紀元戒堂！對該系列進行了改頭換面，讓五右衛門和他的朋友們置身於未來派的日本，抵禦威脅這座城市的超自然力量。",
    "desc_source": "api"
  },
  "Mega Man Zero 4 (USA)": {
    "key": "Mega Man Zero 4 (USA)",
    "original_name": "Mega Man Zero 4",
    "name": "洛克人Zero (游戏)",
    "name_source": "wiki",
    "original_desc": "The Zero Knuckle... the baddest new tool in Zero's arsenal lets you steal enemies' weapons and use them in battle. Employ this along with countless other cool moves to fight the Neo Arcadian army, defeat the evil Dr. Weil and help the caravan of humans reach the peace and security of Area Zero.",
    "desc": "零指關節...零的武器庫中最糟糕的新工具可以讓你竊取敵人的武器並在戰鬥中使用它們。使用這個以及無數其他酷炫動作來對抗新阿卡迪亞軍隊，擊敗邪惡的威爾博士並幫助人類商隊到達零區的和平與安全。",
    "desc_source": "api"
  },
  "Jet Grind Radio (USA)": {
    "key": "Jet Grind Radio (USA)",
    "original_name": "Jet Grind Radio",
    "name": "Dreamcast",
    "name_source": "wiki",
    "original_desc": "The hip-hop Dreamcast hit makes it's way to the Game Boy Advance. Your favorite skaters from Jet Grind Radio return in true 3D blasting through exciting and diverse levels. Grab your spray cans and hit the streets painting the town in your colors while avoiding the cops and rival gangs. It's not easy being a kid in Tokyo but with your Overdrive Magnetic-Motor Skates and a need for self-expression you're on your way to making the town yours!\n\nFeatures multiple game modes including one-on-one races, freestyle skating for points, timed tagging sessions and multiple playable characters that have a completely unique look and feel, power-ups that allow you, the skater, to have extra powers.",
    "desc": "嘻哈 Dreamcast 熱門歌曲登陸 Game Boy Advance。Jet Grind Radio 中您最喜愛的滑手將通過激動人心且多樣化的關卡以真正的 3D 方式回歸。拿起你的噴霧罐，走上街頭，將小鎮塗成你的顏色，同時避開警察和敵對幫派。在東京做一個孩子並不容易，但憑藉您的超速磁力溜冰鞋和自我表達的需求，您正在踏上將這座小鎮變成您自己的道路！\n\n具有多種遊戲模式，包括一對一比賽、自由式滑冰得分、定時標記會話和多個具有完全獨特外觀和感覺的可玩角色，以及讓滑冰者擁有額外能力的能力提升。",
    "desc_source": "api"
  },
  "Mega Man Battle Network 5 - Team Protoman (USA)": {
    "key": "Mega Man Battle Network 5 - Team Protoman (USA)",
    "original_name": "Mega Man Battle Network 5 : Team ProtoMan",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Team Protoman is the first edition of Mega Man Battle Network 5. In the game, you can join forces with characters from previous installments of the Mega Man Battle series, and you can play in a new fighting mode. Team up with other cyberheroes in an effort to stop an evil organization from taking control of the global Internet.",
    "desc": "Team Protoman 是《Mega Man Battle Network 5》的第一版。在遊戲中，您可以與《Mega Man Battle Network》系列之前作品中的角色聯手，並可以玩新的戰鬥模式。與其他網絡英雄合作，阻止邪惡組織控制全球互聯網。",
    "desc_source": "api"
  },
  "V-Rally 3 (USA) (En,Fr,Es)": {
    "key": "V-Rally 3 (USA) (En,Fr,Es)",
    "original_name": "V-Rally 3",
    "name": "Game Source Entertainment",
    "name_source": "wiki",
    "original_desc": "The rally racing series comes to the GBA with texture mapped 3d graphics that take the GBA in a direction never thought possible.\nPlayers can choose from a variety of game modes including rally racing, circuit racing and time trials or link up and go head to head with another player. The better and further you get the more cars and tracks are unlocked.\nView the race from inside the car or behind it as you scream through snow, rain, fog, dirt, gravel and over jumps at different times of day and night as you try to become the best rally racer on the planet.\nFeatures battery backup.",
    "desc": "Dreamcast（日語：ドリームキャスト，簡稱為DC）是日本電子遊戲商SEGA於1998年11月27日在日本、1999年9月9日在北美、1999年10月14日在歐洲發行的家用遊戲機，為第六世代電子遊戲機中第一部推出的主機，也是SEGA開發的最後一部家用遊戲機。主要競爭對手包括索尼的PlayStation 2、任天堂的任天堂GameCube及微軟的Xbox。\n與前代主機SEGA土星不同，Dreamcast採用了日立的SH-4中央處理器（CPU）及VideoLogic/日本電氣的PowerVR2圖形處理器（GPU）等現成組件取代客製化組件，藉以降低成本。儘管Dreamcast在北美地區發售初期頗有斬獲，但在索尼力推其PlayStation 2之後，Dreamcast主機銷量便逐漸滑落；在銷量長期低迷的情況下，SEGA的財務損失持續擴大。在改組領導層之後，SEGA最終在2001年1月31日宣布於3月底終止Dreamcast硬體製造及開發、全面退出家用遊戲機硬體市場，並改組為純第三方遊戲開發商。Dreamcast在其生命週期中銷量僅有約1000萬部，是SEGA最重大的商業失敗之一。\n雖然Dreamcast的生命週期不長、第三方遊戲有限，但輿論普遍認為Dreamcast是一部超前時代的主機。Dreamcast擁有《瘋狂計程車》、《Jet Set Radio》和《莎木》系列等創意十足的獨占遊戲，以及一些來自SEGA自有大型電玩系統NAOMI的高品質移植作品。Dreamcast也是第一部內建撥接網路並提供原生網路遊戲的家用遊戲機。",
    "desc_source": "wiki"
  },
  "Final Fantasy V Advance (USA)": {
    "key": "Final Fantasy V Advance (USA)",
    "original_name": "Final Fantasy V Advance",
    "name": "最终幻想V",
    "name_source": "wiki",
    "original_desc": "The winds fail. Ships stand still, unable to fill their sails. The world races to its end. Unless a handful of heroes can protect the remaining crystals, the world will fall into ruin. Set off on a grand adventure in the finest version of FINAL FANTASY V ever released!",
    "desc": "風失敗了。船靜止不動，無法揚帆。世界正競相走向末日。除非少數英雄能夠保護剩餘的水晶，否則世界將陷入毀滅。在史上最優秀的《最終幻想 V》版本中踏上一場盛大的冒險！",
    "desc_source": "api"
  },
  "Final Fantasy IV Advance (USA)": {
    "key": "Final Fantasy IV Advance (USA)",
    "original_name": "Final Fantasy IV Advance",
    "name": "最終幻想IV",
    "name_source": "wiki",
    "original_desc": "This classic adventure includes 18 towns and castles, dozens of magical spells, and hundreds of monsters, weapons, and items to help players on their quests. The game features the astounding music, challenging adventures, and interesting storyline that are the hallmarks of the Final Fantasy franchise. Additional game elements also have been added to enhance the Game Boy Advance version.",
    "desc": "這個經典的冒險包括 18 個城鎮和城堡、數十種魔法咒語以及數百種怪物、武器和物品，以幫助玩家完成任務。該遊戲具有令人驚嘆的音樂、富有挑戰性的冒險和有趣的故事情節，這些都是《最終幻想》系列的標誌。還添加了其他遊戲元素來增強 Game Boy Advance 版本。",
    "desc_source": "api"
  },
  "Harvest Moon - More Friends of Mineral Town (USA)": {
    "key": "Harvest Moon - More Friends of Mineral Town (USA)",
    "original_name": "Harvest Moon : More Friends of Mineral Town",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Live the simple life as a farmer in Harvest Moon: More Friends of Mineral Town. This game is similar to the original Harvest Moon: Friends of Mineral Town, but now you can play as a girl who has left the city to pursue a life on the farm. You'll take part in growing crops, managing livestock, finding a husband, and raising children.",
    "desc": "在《牧場物語：礦物鎮的更多朋友》中過著農民的簡單生活。這款遊戲與原版《牧場物語：礦物鎮之友》類似，但現在你可以扮演一個離開城市去追求農場生活的女孩。你將參與種植農作物、管理牲畜、尋找丈夫和撫養孩子。",
    "desc_source": "api"
  },
  "Spyro 2 - Season of Flame (USA)": {
    "key": "Spyro 2 - Season of Flame (USA)",
    "original_name": "Spyro 2 : Season of Flame",
    "name": "Xbox 360游戏列表",
    "name_source": "wiki",
    "original_desc": "Spyro 2: Season of Flame tells the story of Spyro's return to the Dragon Realms where he is surprised to discover that a mysterious enemy has stolen the Fireflies, the source of all dragon firepower, including Spyro's. Now it is up to everyone's favorite purple dragon to save the Fireflies before it is too late!",
    "desc": "《小龍斯派羅 2：火焰季節》講述了小斯派羅回到龍之國度的故事，他驚訝地發現一個神秘的敵人偷走了螢火蟲，螢火蟲是包括小龍斯派羅在內的所有龍火力的源泉。現在輪到大家最喜歡的紫龍來拯救螢火蟲了，以免為時已晚！",
    "desc_source": "api"
  },
  "Sonic Advance 3 (USA) (En,Ja,Fr,De,Es,It)": {
    "key": "Sonic Advance 3 (USA) (En,Ja,Fr,De,Es,It)",
    "original_name": "Sonic Advance 3",
    "name": "畅销电子游戏列表",
    "name_source": "wiki",
    "original_desc": "Eggman has broken the world into seven parts, now the player must find the seven Chaos Emeralds to restore the world. \n\nSonic Advance 3 is a Sonic game with a twist: the player can play with a friend in co-op mode or one of many multi-player modes like ring race. The game contains features from Sonic Advance and Sonic Advance 2, but with more options like choosing from 2 characters in story mode (a leading and a following character).",
    "desc": "蛋頭博士已將世界分成七部分，現在玩家必須找到七顆混沌翡翠來恢復世界。\n\nSonic Advance 3 是一款有特色的索尼克遊戲：玩家可以在合作模式中與朋友一起玩，也可以選擇多種多人遊戲模式（例如環形競賽）。該遊戲包含《Sonic Advance》和《Sonic Advance 2》的功能，但還有更多選項，例如在故事模式中從 2 個角色中進行選擇（主角和跟隨角色）。",
    "desc_source": "api"
  },
  "Mega Man & Bass (USA)": {
    "key": "Mega Man & Bass (USA)",
    "original_name": "Mega Man & Bass",
    "name": "主机大战",
    "name_source": "wiki",
    "original_desc": "The mighty robot King has taken over Dr. Wily's base, invaded the Robot Museum, and stolen 100 CDs containing secret robot plans, hoping to create the ultimate unstoppable army of robots! And to make matters worse, he's sent 8 robot masters to prove his new-found power!\n\nMega Man is the only one who can stop him...or so he thought! Bass, Dr. Wily's greatest creation and Mega Man's sworn rival, is actually fighting ALONGSIDE Mega Man for once! Of course, it's only to prove that he's the strongest robot ever made, and he'll do it by smashing King's army of mechanical maniacs!\n\nNow, Mega Man and Bass are heading out to get back all of the CD's that King stole. Run, jump, slide, dash, and blast your way through to destroy this new menace!",
    "desc": "強大的機器人國王占領了威利博士的基地，入侵了機器人博物館，並偷走了 100 張包含秘密機器人計劃的 CD，希望打造出終極不可阻擋的機器人大軍！更糟糕的是，他還派出了 8 名機器人大師來證明他新發現的力量！\n\n洛克人是唯一能阻止他的人……至少他是這麼認為的！威利博士最偉大的創造物和洛克人的死敵巴斯，實際上正在與洛克人並肩作戰一次！當然，這只是為了證明他是有史以來最強大的機器人，他會通過粉碎國王的機械狂人軍隊來做到這一點！\n\n現在，洛克人和巴斯正出發去取回金偷走的所有 CD。奔跑、跳躍、滑行、衝刺和爆破，消滅這個新的威脅！",
    "desc_source": "api"
  },
  "WarioWare, Inc. - Mega Microgame$! (USA)": {
    "key": "WarioWare, Inc. - Mega Microgame$! (USA)",
    "original_name": "WarioWare, Inc. : Mega Microgame$!",
    "name": "马力欧医生",
    "name_source": "wiki",
    "original_desc": "Frantic action! Prepare for lightning-quick game play as you blaze through over 200 bizarre microgames designed by a crazy crew of Wario's cronies! There are even two-player contests that can be played on a single Game Boy Advance! Pick up and play! Ultra-simple controls make each game easy to get into...until the games start coming faster... and faster...and FASTER!",
    "desc": "瘋狂行動！準備好享受快如閃電的遊戲體驗吧，暢玩由瓦里奧的一群瘋狂親信設計的 200 多個奇異的微型遊戲！甚至還可以在一台 Game Boy Advance 上進行兩人比賽！拿起玩吧！超簡單的控制讓每個遊戲都很容易上手...直到遊戲開始變得越來越快...越來越快...越來越快！",
    "desc_source": "api"
  },
  "WarioWare - Twisted! (USA)": {
    "key": "WarioWare - Twisted! (USA)",
    "original_name": "WarioWare : Twisted!",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "After accidentally discovering spin technology, Wario reassembles the developers at WarioWare, Inc. to make a new set of wild minigames. WarioWare: Twisted! maintains the fast-paced style of gameplay from the original WarioWare and introduces a new gyro sensor that lets you control the gameplay by rotating the Game Boy Advance SP left and right. The new controls play into more than 200 minigames. Play through them all to unlock souvenirs, such as bonus games, figurines, and instruments.",
    "desc": "在意外發現旋轉技術後，瓦里奧重新召集了瓦里奧軟件公司的開發人員，製作了一套新的狂野迷你游戲。瓦里奧軟件：扭曲！保留了原始 WarioWare 的快節奏遊戲風格，並引入了新的陀螺儀傳感器，讓您可以通過左右旋轉 Game Boy Advance SP 來控制遊戲玩法。新的控件可用於 200 多個迷你游戲。通關所有關卡即可解鎖紀念品，例如獎勵遊戲、雕像和樂器。",
    "desc_source": "api"
  },
  "Max Payne (USA)": {
    "key": "Max Payne (USA)",
    "original_name": "Max Payne",
    "name": "英雄本色3",
    "name_source": "wiki",
    "original_desc": "Max Payne lost his family to death. Now he is seeking revenge. In the lore of the original PC hit, Max Payne on the Game Boy Advance follows Max's story as he attempts to take down the crime lords who tried to destroy his life.\n\nUnlike the original, the GBA version uses an isometric perspective to present the action. Various weapons are offered to dispatch the guys (or girls) who get in your way, and by using bullet time, you can slow down time and increase your chances of avoiding incoming fire and hitting the target.",
    "desc": "索塞克斯公爵哈利王子（英語：Prince Harry, Duke of Sussex，1984年9月15日—），全名為亨利·查爾斯·阿爾伯特·大衛（英語：Henry Charles Albert David），是英國王室成員。作為查爾斯三世與威爾斯王妃黛安娜的次子，他在英國王位繼承順序中排名第五。\n哈利曾先後就讀於韋瑟比學校、拉德格羅夫學校及伊頓公學，後於桑德赫斯特皇家軍事學院完成軍官訓練。他以少尉軍銜加入皇家藍色騎兵團，並曾與兄長威爾斯親王威廉短暫共事。哈利曾兩次被派往阿富汗前線服役：第一次是2007年至2008年間在赫爾曼德省為期十週的部署，第二次則是2012年至2013年作為英國陸軍航空團成員進行為期二十週的任務。\n受美國勇士運動會啟發，哈利於2014年創辦勇士不敗運動會並擔任創始贊助人，至今仍積極參與相關事務。兩年後，他與兄長威廉及嫂子威爾斯王妃凱薩琳共同發起關注心理健康的「同心協力」（Heads Together）倡議活動。\n2018年，哈利在與美國女演員梅根·馬克爾舉行婚禮前獲封索塞克斯公爵。二人育有兩名子女：亞契與莉莉白。2020年1月，哈利與梅根退出王室高級成員行列，遷居梅根的家鄉南加州，並成立總部位於比佛利山莊、混合營利與非營利性質的企業亞契威爾。2021年3月，哈利與妻子接受奧花·雲費專訪的電視特輯《奧花與哈利梅根的訪談》引發廣泛關注。夫婦二人還參與拍攝了Netflix紀錄片《哈利與梅根》，該片於2022年12月上映。",
    "desc_source": "wiki"
  },
  "Super Robot Taisen R (Japan) (Translated)": {
    "key": "Super Robot Taisen R (Japan) (Translated)",
    "original_name": "Super Robot Taisen R",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "Raul/Fiona and their two friends test out their machine, the Excellence, but are attacked in the middle of the test and the base is totaled. They send out an SOS, which is received by the Ra Calium and the Nadesico. Who will survive?",
    "desc": "勞爾/菲奧娜和他們的兩個朋友測試了他們的機器“卓越”，但在測試過程中遭到攻擊，基地被徹底摧毀。他們發出求救信號，Ra Calium 和 Nadesico 收到該信號。誰能活下來？",
    "desc_source": "api"
  },
  "Mega Man Battle Network 3 - Blue Version (USA)": {
    "key": "Mega Man Battle Network 3 - Blue Version (USA)",
    "original_name": "Mega Man Battle Network 3 : Blue Version",
    "name": "刺猬索尼克 (1991年游戏)",
    "name_source": "wiki",
    "original_desc": "Join MegaMan.EXE, his operator Lan, and friends as they keep the net safe from viruses and cyber menaces. You'll travel through new virtual and real worlds, fight new bosses, interact with new characters, and even find new Battle Chips. It's cyber mayhem at its best! Mega Man Battle Network 3 has two unique versions: Blue and White. Each version contains unique Battle Chips, characters, and styles for MegaMan.EXE to use.",
    "desc": "與 MegaMan.EXE、他的操作員 Lan 和朋友們一起保護網絡免受病毒和網絡威脅的侵害。你將穿越新的虛擬和現實世界，對抗新的老闆，與新的角色互動，甚至找到新的戰鬥籌碼。這是最好的網絡混亂！《洛克人戰網 3》有兩個獨特的版本：藍色和白色。每個版本都包含獨特的戰鬥籌碼、角色和風格，供 MegaMan.EXE 使用。",
    "desc_source": "api"
  },
  "Pokemon - Emerald Version (USA, Europe)": {
    "key": "Pokemon - Emerald Version (USA, Europe)",
    "original_name": "Pokémon Emerald Version",
    "name": "寶可夢系列 (遊戲)",
    "name_source": "wiki",
    "original_desc": "The Hoenn region is unstable--Rayquaza has awakened! Your skills as a Trainer will be challenged like they've never been challenged before as you try to maintain the balance between Kyogre & Groudon. Prove your skills by earning badges & gaining access to the Battle Frontier--the front line of Pokémon battling that offers a whole new level of competition. Never-before-experienced battles await you!\n\n-The third adventure with new episodes in the Hoenn region!\n-Tons of new features, including surprising plot twists and changes to where and how often you can catch certain Pokémon!\n-Use the Game Boy Advance Wireless Adapter to trade & battle between Pokémon Emerald and Pokémon FireRed & LeafGreen versions.\n-Expand your collection when you trade with a friend. Using a Game Link cable, link up with Pokémon Ruby & Sapphire, Pokémon FireRed & LeafGreen or Pokémon Colosseum to catch them all! See instruction booklet for details.",
    "desc": "豐緣地區不穩定——烈空座甦醒了！當你試圖保持蓋歐卡和固拉多之間的平衡時，你作為訓練師的技能將受到前所未有的挑戰。通過贏得徽章和進入戰鬥前沿來證明你的技能——神奇寶貝戰鬥的前線提供了全新的競爭水平。前所未有的戰斗等待著你！\n\n-豐緣地區的第三次冒險，有新情節！\n-大量新功能，包括令人驚訝的情節曲折以及捕捉某些神奇寶貝的地點和頻率的變化！\n- 使用 Game Boy Advance 無線適配器在 Pokémon Emerald 和 Pokémon FireRed & LeafGreen 版本之間進行交易和戰鬥。\n- 與朋友交易時擴大您的收藏。使用 Game Link 電纜，連接 Pokémon Ruby & Sapphire、Pokémon FireRed & LeafGreen 或 Pokémon Colosseum 將它們全部捕獲！詳情請參閱說明書。",
    "desc_source": "api"
  },
  "Tony Hawk's Pro Skater 4 (USA, Europe)": {
    "key": "Tony Hawk's Pro Skater 4 (USA, Europe)",
    "original_name": "Tony Hawk's Pro Skater 4",
    "name": "GameSpot",
    "name_source": "wiki",
    "original_desc": "THPS4 is the fourth game in Activision's ever popular franchise.\n\nThe main feature of this game is it's redesigned career mode.  When beginning a level, you have all the time in the world to skate around, perform tricks, get a feel for the level, without the hassel of any goals or time limits.  When you're ready to attempt a goal, simply find a pro skater, talk to him, then receive the goal, similar to Dave Mirra Freestyle BMX.  Goals are similar to the previous games, such as collect SKATE, get a certain amount of points, transfer over this and grind that.  There are new goals, however, such as collecting the word COMBO while doing one big combo.  Miss a trick, and goal fails.  Once all regular goals are accomplished, you can attempt the Pro Goal, which is specific to each skater, and is extremely hard.\n\nAll the major skaters are here, including Tony Hawk, Bob Burnquist, Steve Caballero, Kareem Campbell, Rune Gilfberg, Eric Koston, Bucky Lasek, Bam Margera, Rodney Mullen, Chad Muska, Andrew Reynolds, Geoff Rowley, Elissa Steamer and Jamie Thomas.\n\nThe levels are been expanded and are huge.  Some of the levels include a college campus, a shipyard, and the infamous prison complex Alcatraz.\n\nFor multiplayer, all the favorite modes are back, from Graffiti and Trick Attack to Horse and King Of The Hill.  New modes include Capture The Flag and Combo Mambo.  THPS4 also supports System Link play, but not XBox Live.\n\nThe PlayStation 2 version offers everything from the XBox version, but also has online play, utilizing either your own network adaptor or the official one.  The PS2 version also features a one level demo of Shaun Murray's Pro Wakeboarder, which is not featured on any other version of the game.",
    "desc": "THPS4 是動視公司廣受歡迎的系列中的第四款遊戲。\n\n該遊戲的主要特點是重新設計的職業模式。當開始一個關卡時，你有足夠的時間到處滑冰、表演特技、感受關卡，沒有任何目標或時間限制的麻煩。當您準備好嘗試實現目標時，只需找到一名職業滑冰運動員，與他交談，然後接收目標，類似於 Dave Mirra 自由式 BMX。目標和之前的遊戲類似，比如收集SKATE、獲得一定的積分、轉這個、磨那個。然而，還有新的目標，例如在進行一個大連擊時收集“COMBO”一詞。錯過一招，進球就會失敗。完成所有常規目標後，您可以嘗試專業目標，這是針對每個滑冰者的特定目標，並且非常困難。\n\n所有主要的滑冰運動員都在這裡，包括托尼·霍克、鮑勃·伯恩奎斯特、史蒂夫·卡瓦列羅、卡里姆·坎貝爾、魯恩·吉爾夫伯格、埃里克·科斯頓、巴基·拉塞克、巴姆·馬格拉、羅德尼·馬倫、查德·穆斯卡、安德魯·雷諾茲、傑夫·羅利、艾麗莎·斯蒂默和傑米·托馬斯。\n\n級別已擴大且巨大。部分關卡包括大學校園、造船廠和臭名昭著的惡魔島監獄。\n\n對於多人遊戲，所有最受歡迎的模式都回來了，從塗鴉和特技攻擊到騎馬和山丘之王。新模式包括“奪旗”和“組合曼波”。THPS4 還支持 System Link 播放，但不支持 Xbox Live。\n\nPlayStation 2 版本提供 Xbox 版本的所有內容，而且還可以使用您自己的網絡適配器或官方網絡適配器進行在線遊戲。PS2 版本還包含 Shaun Murray 的 Pro Wakeboarder 的一級演示，該遊戲在任何其他版本中均未提供。",
    "desc_source": "api"
  },
  "Pokemon Pinball - Ruby & Sapphire (USA)": {
    "key": "Pokemon Pinball - Ruby & Sapphire (USA)",
    "original_name": "Pokémon Pinball : Ruby & Sapphire",
    "name": "畅销Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Pokémon Pinball: Ruby & Sapphire has all the features you'd demand of a pinball game, including bonus tables, lots of bumpers and ways to score massive points. As with your standard pinball video game, the left button on the D-pad and the A-button control the flippers with the R/L triggers used to shake the table. The catch here is that everything is themed in Pokémon. Instead of a ball, you make use of a Pokéball. Instead of standard bumpers, you're hitting the Pokéball against other Pokémon, and the ultimate goal is of course to \"catch 'em all\". The game features 200 Pokémon, two main tables, and link cable support.",
    "desc": "《神奇寶貝彈球：紅寶石與藍寶石》擁有彈球遊戲所需的所有功能，包括獎金表、大量保險槓以及獲得大量積分的方法。與標準彈球視頻遊戲一樣，方向鍵上的左側按鈕和 A 按鈕控制腳蹼，並使用 R/L 觸發器來搖動桌子。這裡的問題是一切都以神奇寶貝為主題。你可以使用神奇球來代替球。你不是用標準的保險槓，而是用神奇寶貝球對抗其他神奇寶貝，最終目標當然是“抓住它們”。遊戲擁有 200 個神奇寶貝、兩個主桌和連接線支持。",
    "desc_source": "api"
  },
  "Mario & Luigi - Superstar Saga (USA)": {
    "key": "Mario & Luigi - Superstar Saga (USA)",
    "original_name": "Mario & Luigi : Superstar Saga",
    "name": "马力欧与路易吉RPG",
    "name_source": "wiki",
    "original_desc": "An evil witch has replaced Princess Peach's fair speech with explosives! Mario and Luigi must once again come to her rescue, but this time they employ the help of Bowser, their sworn enemy. Mario and Luigi must learn new moves and combine powers to fight off enemies and move closer to the witch's castle. Guide this unlikely bunch through an abundance of minigames such as Border Jump and Mystery Carts. Combine the powers of Mario and Luigi to pull off special tag-team moves. Immerse yourself in this bright, cartoonish, and humorous world, complete with hit music featured in previous Mario games.",
    "desc": "邪惡的女巫用炸藥取代了桃子公主的公平演講！馬里奧和路易吉必須再次營救她，但這一次他們得到了死敵鮑澤的幫助。馬里奧和路易吉必須學習新動作並結合力量來擊退敵人並靠近女巫的城堡。引導這群看似不太可能的人玩各種迷你游戲，例如“邊境跳躍”和“神秘車”。結合馬里奧和路易吉的力量，完成特殊的雙打動作。讓自己沉浸在這個明亮、卡通和幽默的世界中，並享受以前的馬里奧遊戲中的熱門音樂。",
    "desc_source": "api"
  },
  "Ninja Five-0 (USA)": {
    "key": "Ninja Five-0 (USA)",
    "original_name": "Ninja Five-O",
    "name": "Game Source Entertainment",
    "name_source": "wiki",
    "original_desc": "Take on the role of Ninja Five-O as he uses all his skill, stealth and magic to rescue hostages and defeat his enemies. Master the art of ninja swords, shuriken throwing stars and ancient ninjitsu magic!\n\n* Kaginawa Wire grappling hook that can be used to hang, fly, jump, climb walls and surprise attack.\n* 6 Challenging missions covering 20 levels.\n* Crush objects to find hidden Power-Ups and secret items\n* Unique enemy boss characters for each level.",
    "desc": "扮演忍者五人組，使用他所有的技能、潛行和魔法來營救人質並擊敗敵人。掌握忍者劍、飛鏢和古代忍術魔法的藝術！\n\n* Kaginawa 鋼絲抓鉤，可用於懸掛、飛行、跳躍、爬牆和奇襲。\n* 6 個具有挑戰性的任務，涵蓋 20 個級別。\n* 粉碎物體來尋找隱藏的強化道具和秘密物品\n* 每個級別都有獨特的敵人頭目角色。",
    "desc_source": "api"
  },
  "Worms World Party (USA) (En,Fr,De,Es,It)": {
    "key": "Worms World Party (USA) (En,Fr,De,Es,It)",
    "original_name": "Worms World Party",
    "name": "Game Source Entertainment",
    "name_source": "wiki",
    "original_desc": "The Worms are back, deadlier than ever.\nYou're going to learn that there's nothing more dangerous than a Worm with a bazooka or a shotgun...\n\nAt first sight, Worms World Party may seem very similar to Worms Armageddon. However, this time the game has been specially designed with multiplayer in mind. Up to 6 players can battle out at the same time on local networks or on the internet, using Team17 own matchmaking service, called Wormnet.\n\nOther welcomed additions are the Wormpot, which can provide 400 gameplay variations from \"Goliath Mode\" to \"Bleeding Worms\", hundreds of new landscapes, flags and fanfares, and a load of single player missions.",
    "desc": "蠕蟲又回來了，而且比以往更加致命。\n你將了解到沒有什麼比拿著火箭筒或霰彈槍的蠕蟲更危險了......\n\n乍一看，《百戰天虫世界派對》可能與《百戰天虫世界末日》非常相似。然而，這一次的遊戲是專門為多人遊戲而設計的。使用 Team17 自己的配對服務（稱為 Wormnet），最多 6 名玩家可以在本地網絡或互聯網上同時對戰。\n\n其他受歡迎的新增內容包括 Wormpot，它可以提供從“歌利亞模式”到“流血蠕蟲”的 400 種遊戲玩法變化、數百種新景觀、旗幟和號角，以及大量單人任務。",
    "desc_source": "api"
  },
  "Car Battler Joe (USA)": {
    "key": "Car Battler Joe (USA)",
    "original_name": "Car Battler Joe",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Rampaging rogues roam the highways and byways that surround your village. If your believed the rumors, you would blame your missing father for the surge in vehicular violence. That's why you've decided to lead the life of a car battler, transporting cargo between towns and running down every lethal lead foot foolish enough to cross your path. This gritty work isn't easy. Other car battlers fight for money or fame, but you have a higher calling: You're determined to restore your family's lost honor and bring your father home.",
    "desc": "狂暴的盜賊在村莊周圍的高速公路和小路上游盪。如果你相信這些謠言，你就會將車輛暴力事件的激增歸咎於你失踪的父親。這就是為什麼你決定過上汽車戰士的生活，在城鎮之間運輸貨物，並撞倒每一個愚蠢到橫穿你道路的致命前腳。這項艱鉅的工作並不容易。其他賽車手為金錢或名譽而戰，但你有更高的使命：你決心恢復家人失去的榮譽，並將你的父親帶回家。",
    "desc_source": "api"
  },
  "Alien Hominid (Europe) (En,Fr,De,Es,It)": {
    "key": "Alien Hominid (Europe) (En,Fr,De,Es,It)",
    "original_name": "Alien Hominid",
    "name": "独立游戏节",
    "name_source": "wiki",
    "original_desc": "Alien Hominid is a 2D side-scrolling shooter with heavy references to the Metal Slug series of games - from the hand-drawn graphics, huge explosions, right down to the ability to eviscerate FBI Agents when you get up close to them. The graphics are by featured artist Dan Paladin. Your goal, is quite simply, to get to the end of the stage, and die as little as possible. Which is made difficult due to the fact that any bullet is an instant kill.\n\nTo help you out, you can grab a range of power-ups, such as lasers, spread shots, shotguns and more, as well as hijacking vehicles and using them for protection. Grenades can be lobbed, and you can jump on enemy shoulders and choose to bite their heads off if you like, or pick them up and throw them at other enemies. You can also dive underground for a short period of time to avoid enemies - while underground, you can drag agents into the ground to kill them.",
    "desc": "Alien Hominid 是一款 2D 橫向捲軸射擊遊戲，大量參考了《合金彈頭》系列遊戲 - 從手繪圖形、巨大爆炸，到靠近 FBI 特工時將其開膛破肚的能力。這些圖形由特色藝術家丹·帕拉丁 (Dan Paladin) 創作。你的目標很簡單，就是到達舞台的盡頭，並儘可能少地死掉。由於任何子彈都會立即殺死，因此這變得很困難。\n\n為了幫助你擺脫困境，你可以獲取一系列能量道具，例如激光、散彈、霰彈槍等，以及劫持車輛並使用它們進行保護。手榴彈可以投擲，你可以跳到敵人的肩膀上，如果你願意的話可以選擇咬掉他們的頭，或者撿起它們扔向其他敵人。你還可以短時間潛入地下來躲避敵人——在地下時，你可以將特工拖入地下殺死他們。",
    "desc_source": "api"
  },
  "Harvest Moon - Friends of Mineral Town (USA)": {
    "key": "Harvest Moon - Friends of Mineral Town (USA)",
    "original_name": "Harvest Moon : Friends of Mineral Town",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "As a child, you spent a memorable summer on a farm in the country and experience a whole new world of excitement. Years have passed, and now the long-neglected farm that holds fond memories is yours! It is up to you to successfully rejuvenate the farm and build a life for yourself. The best part is that you can do it any way you want! Plant and harvest crops, raise farm animals, marry the woman of your dreams, and start a family! Take over the reins of life, and create your own pastoral adventure!",
    "desc": "當你還是個孩子的時候，你在鄉村的一個農場度過了一個難忘的夏天，體驗了一個全新的興奮世界。多年過去了，現在這個長期被忽視、充滿美好回憶的農場是你的了！成功地振興農場並為自己創造生活取決於你。最好的部分是您可以隨心所欲地做！種植和收穫莊稼，飼養農場動物，娶你夢想中的女人，組建家庭！掌控生活，創造你自己的田園冒險！",
    "desc_source": "api"
  },
  "Super Monkey Ball Jr. (USA)": {
    "key": "Super Monkey Ball Jr. (USA)",
    "original_name": "Super Monkey Ball Jr.",
    "name": "網路爆紅列表",
    "name_source": "wiki",
    "original_desc": "Based on the Gamecube series of the same name, Super Monkey Ball Jr. has you in control of 3D style arenas, each with a varying degree of difficulty and objectives. Your little monkey, inside a ball, relies on your movement of the arena to get to the required objectives (collecting items, getting to the finish line in under a certain time limit, etc.).\n\nApart from the single player puzzle experience (which includes more then 60 arenas), up to four people can play a collection of mini-games (which you must unlock in the single player game). Play monkey bowling (aka ten pin bowling), monkey fight (knock the other 3 players' monkey ball out of the circle arena) or an 18 hole mini golf challenge.",
    "desc": "《Super Monkey Ball Jr.》以同名 Gamecube 系列為基礎，讓您掌控 3D 風格的競技場，每個競技場都有不同的難度和目標。你的小猴子在一個球內，依靠你在競技場的移動來達到所需的目標（收集物品、在一定的時間限制內到達終點線等）。\n\n除了單人解謎體驗（包括 60 多個競技場）之外，最多四個人可以玩一系列迷你游戲（您必須在單人遊戲中解鎖）。玩猴子保齡球（又稱十瓶保齡球）、猴子大戰（將其他 3 名玩家的猴子球擊出圓形競技場）或 18 洞迷你高爾夫挑戰。",
    "desc_source": "api"
  },
  "Racing Gears Advance (USA)": {
    "key": "Racing Gears Advance (USA)",
    "original_name": "Racing Gears Advance",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "This handheld racing game offers a range of licensed cars, several courses and circuits, and a challenging set of opponents. To these stock elements, it adds one more: weaponry. Now you can choose to nitro past the opponent ahead of you, or slow him down with a missile.\n\nWith each vehicle and driver pair you can race in Practice Mode to familiarize yourself with tracks or choose a Championship Mode to progress through a series of circuits. After each race you'll need to spend some of the money you've earned (either by placing or picking up money icons during the race) to repair and -- if possible -- upgrade your car. The upgrades can improve your car as a racing machine (e.g. a larger engine or better brakes) or as a war machine (e.g. adding more weapons bays or buying a new type of weapon).\n\nThe track design uses the isometric view, and almost never puts the car behind an obstacle. However, among the twisty roads are a few shortcuts that require you to think outside the lines of the road, and occasionally take a leap of faith.",
    "desc": "這款掌上賽車遊戲提供了一系列授權汽車、多個賽道和賽道以及一組具有挑戰性的對手。除了這些庫存元素之外，它還添加了一項：武器。現在你可以選擇硝基超過你前面的對手，或者用導彈減慢他的速度。\n\n對於每對車輛和車手，您可以在練習模式下比賽以熟悉賽道，或選擇錦標賽模式以在一系列賽道上前進。每場比賽結束後，你需要花費一些你賺到的錢（通過在比賽期間放置或拾取金錢圖標）來修理和（如果可能的話）升級你的汽車。升級可以將您的汽車改進為賽車機器（例如更大的發動機或更好的製動器）或戰爭機器（例如添加更多武器艙或購買新型武器）。\n\n賽道設計採用等軸測視圖，幾乎不會將賽車置於障礙物後面。然而，在曲折的道路中，有一些捷徑需要你跳出道路思考，並偶爾進行一次信念的飛躍。",
    "desc_source": "api"
  },
  "Pokemon - FireRed Version (USA, Europe) (Rev 1)": {
    "key": "Pokemon - FireRed Version (USA, Europe) (Rev 1)",
    "original_name": "Pokémon FireRed Version",
    "name": "寶可夢系列 (遊戲)",
    "name_source": "wiki",
    "original_desc": "In this adventure, you travel through the Kanto region, form a close bond with your Pokémon, and catch various species to complete the Pokédex. Challenge other trainers, stand up to Team Rocket, and battle the Gym Leaders to earn all eight badges. With these in your possession, you can take on the Elite Four and ultimately face the reigning Champion in a final, decisive battle. Your goal: Become the best trainer and catch them all!",
    "desc": "在這次冒險中，你穿越關東地區，與你的神奇寶貝建立密切的聯繫，並捕捉各種物種來完成神奇寶貝圖鑑。挑戰其他訓練師，對抗火箭隊，並與道館領袖作戰，以獲得全部八枚徽章。有了這些，您就可以與精英四強並最終在最後的決定性戰鬥中面對衛冕冠軍。你的目標：成為最好的訓練家並抓住他們！",
    "desc_source": "api"
  },
  "Legend of Zelda, The - A Link to the Past & Four Swords (USA)": {
    "key": "Legend of Zelda, The - A Link to the Past & Four Swords (USA)",
    "original_name": "The Legend of Zelda : A Link to the Past & Four Swords",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "The Legend of Zelda: A Link to the Past & Four Swords for Game Boy Advance is a remake of A Link to the Past coupled with an entirely new game, Four Swords. This two-in-one game was released shortly before The Wind Waker.\n\nWhile A Link to the Past is largely a faithful port of the original, it does include an entirely new dungeon and a new quest as rewards for the player playing through the multiplayer-only Four Swords. Aside from these additions, it includes a number of smaller gameplay and dialogue changes, the latter of which are designed to correct a number of minor translation mistakes and inconsistencies with the original Japanese release and to unify the common terms used with the later games.",
    "desc": "Game Boy Advance 的《塞爾達傳說：眾神的三角力量》和《四劍》是《眾神的三角力量》的重製版，加上全新的遊戲《四劍》。這款二合一遊戲在《風之杖》之前不久發布。\n\n雖然《眾神的三角力量》在很大程度上是原作的忠實移植版，但它確實包括一個全新的地下城和一個新的任務，作為玩僅限多人遊戲的《四劍》玩家的獎勵。除了這些新增內容之外，它還包括一些較小的遊戲玩法和對話更改，後者旨在糾正一些較小的翻譯錯誤以及與原始日語版本的不一致之處，並統一後來游戲中使用的常用術語。",
    "desc_source": "api"
  },
  "Mega Man Battle Network 4 - Red Sun (USA)": {
    "key": "Mega Man Battle Network 4 - Red Sun (USA)",
    "original_name": "Mega Man Battle Network 4 : Red Sun",
    "name": "網路爆紅列表",
    "name_source": "wiki",
    "original_desc": "The fourth installment in the Mega Man Battle Network series comes in two versions--Red Sun and Blue Moon--each with different enemies, battle chips, souls, and characters. Once again, you assume the role of Lan as he and his friend, Mega Man.exe, fight to rid the Internet of viruses and other cyberworld enemies. Unlike previous games in the series, Mega Man Battle Network 4 focuses on a tournament system where players encounter a variety of enemies that must be defeated. A new Soul Unison system lets Mega Man transform into his defeated enemies.",
    "desc": "《洛克人戰網》系列的第四部分有兩個版本——紅日和藍月——每個版本都有不同的敵人、戰鬥籌碼、靈魂和角色。您再次扮演 Lan 的角色，與他的朋友 Mega Man.exe 一起努力消滅互聯網上的病毒和其他網絡世界的敵人。與該系列之前的遊戲不同，《洛克人戰網 4》專注於錦標賽系統，玩家會遇到各種必須擊敗的敵人。新的靈魂統一系統讓洛克人變身為他擊敗的敵人。",
    "desc_source": "api"
  },
  "Sonic Pinball Party (USA) (En,Ja,Fr,De,Es,It)": {
    "key": "Sonic Pinball Party (USA) (En,Ja,Fr,De,Es,It)",
    "original_name": "Sonic Pinball Party",
    "name": "刺猬索尼克系列",
    "name_source": "wiki",
    "original_desc": "Sonic Pinball Party is the second Sonic Pinball game since Sonic Spinball in the early 90's. The game has an arcade mode, a tutorial mode, and a vs mode (party mode). In the game the game has pinball tables of famous Sonic Team characters such as Nights, Samba de Amigo, and of course SONIC! \n\nThe story mode of the game is the usual type of story, Robotnik steals animals visiting Casinopolis, and is going turn into his Robotic slaves. Of course, Sonic is going to try and stop him. Before he does, he has to win a pinball competition and during the game you unlock prizes. The competition is set out as a knockout format. The game also has a Casinopolis mode, which has Casino games like Roulette. There is also a chao garden, just like in the Sonic Advance games.",
    "desc": "本電子遊戲列表列舉了微軟Xbox360的電子遊戲。\n對於中文名稱部分的說明：\n\n列表中所有有官方中文的遊戲名字一律保持不變，絕大多數沒有官中的遊戲視情況而定：\n一般來說這裡選擇的是在現有各類五花八門的譯名中接受程度最高的。\n如果有同時存在民間和官方譯名的情況，那麼將使用如下格式，例如：\n獵天使魔女 / 魔兵驚天錄\n合金裝備崛起：復仇 / 潛龍諜影崛起：復仇\n刺客信條 / 刺客教條\n戰地 / 戰地風雲 等等，類似這樣。\n但因為絕大多數遊戲（尤其是各種美式問答和體育遊戲）沒有官方譯名，目前還是民間譯名占大多數。以後這些中文譯名將被編輯者不定期維護更新。",
    "desc_source": "wiki"
  },
  "Golden Sun (USA, Europe)": {
    "key": "Golden Sun (USA, Europe)",
    "original_name": "Golden Sun",
    "name": "黃金太陽 失落的時代",
    "name_source": "wiki",
    "original_desc": "Evil is slowly covering the world. Forces of darkness are pursuing the lost art of Alchemy, and as they draw ever closer to their foul purpose, mankind hangs in the balance. You and your companions are the last hope: armed with noble weapons, magical Psynergy, and a host of elemental creatures, you must find a way to stem the evil tide.",
    "desc": "邪惡正在慢慢覆蓋世界。黑暗勢力正在追尋失落的煉金術，當他們越來越接近他們的邪惡目的時，人類的命運岌岌可危。你和你的同伴是最後的希望：帶著高貴的武器、神奇的靈能和大量的元素生物，你必須找到一種方法來阻止邪惡的浪潮。",
    "desc_source": "api"
  },
  "Crash Nitro Kart (USA)": {
    "key": "Crash Nitro Kart (USA)",
    "original_name": "Crash Nitro Kart",
    "name": "The Best",
    "name_source": "wiki",
    "original_desc": "Crash Bandicoot returns to the karting scene with a host of other characters from the adventure series, and this time they have both Neo Cortex and Emperor Velo to worry about. Velo has taken the crew to a remote planet, forced to race for their lives against Neo Cortex and his many evil doers.\n\nChoose from various game modes, from the straight into the action Arcade mode to Adventure mode, following Crash and the gang in the story to save Earth. Race against four friends in multiplayer battle modes, plus connect to the Gamecube for extra options and upload your high scores to the internet ranking system.",
    "desc": "本電子遊戲列表列舉了微軟Xbox的電子遊戲。",
    "desc_source": "wiki"
  },
  "Urban Yeti! (USA, Europe)": {
    "key": "Urban Yeti! (USA, Europe)",
    "original_name": "Urban Yeti!",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Urban Yeti is is a smooth scrolling 2 1/2-D platform adventure, and might very well be the strangest game you've ever played. You can smash your way through 4 twisting city stages, or attempt to avoid detection all together. Either way the Human AI will adapt as you progress - the more contact you have, the more aggressive they'll become. There are even some unique minigames to add to the excitement - Yeti Frisbee, managing the local \"Yeti Kingdom Of Eats\" restaurant, and catching poultry to offer to your prospective mate. You can even float down a lazy sewer river o' fun on a giant tube! Achieve the ultimate goal and show the world just what kind of Bigfoot you really are.",
    "desc": "Urban Yeti 是一款平滑滾動的 2 1/2-D 平台冒險遊戲，很可能是您玩過的最奇怪的遊戲。你可以一路殺出一條血路，穿過 4 個扭曲的城市關卡，或者嘗試一起躲避被發現。不管怎樣，人類人工智能都會隨著你的進步而適應——你接觸的越多，他們就會變得越有攻擊性。甚至還有一些獨特的小遊戲可以增添刺激感 - 雪人飛盤、管理當地的“雪人美食王國”餐廳，以及捕捉家禽送給你的未來伴侶。您甚至可以在巨大的管子上沿著慵懶的下水道河漂流，真是太有趣了！實現最終目標並向世界展示你到底是什麼樣的大腳怪。",
    "desc_source": "api"
  },
  "Mario Kart - Super Circuit (USA)": {
    "key": "Mario Kart - Super Circuit (USA)",
    "original_name": "Mario Kart : Super Circuit",
    "name": "马力欧系列游戏列表",
    "name_source": "wiki",
    "original_desc": "All your favourite kart-racing characters are back and ready to kick it into high gear! 20 brand-new tracks await on Game Boy Advance, loaded with classic power-ups and primed for the type of frenzied racing that only Mario Kart: Super Circuit can deliver. It's time to burn rubber in the Grand Prix, challenge your pals, race your own ghost, clash in battle mode and feel the power in the palm of your hand!",
    "desc": "所有你最喜歡的卡丁車賽車角色都回來了，並準備好全力以赴！Game Boy Advance 上有 20 條全新賽道等待您的體驗，其中充滿了經典的強化道具，並為只有《馬里奧賽車：超級賽道》才能提供的瘋狂賽車類型做好了準備。是時候在大獎賽中燃燒橡膠，挑戰你的朋友，與你自己的幽靈比賽，在戰鬥模式中發生衝突，感受手掌中的力量！",
    "desc_source": "api"
  },
  "Lady Sia (USA) (En,Fr,De,Es,It,Nl)": {
    "key": "Lady Sia (USA) (En,Fr,De,Es,It,Nl)",
    "original_name": "Lady Sia",
    "name": "希雅",
    "name_source": "wiki",
    "original_desc": "Lady Sia is a young female warrior princess who's attempting to save her homeland from the cruel beastmen, the T'soas. \n\nAt the opening Sia is being thrown in prison. A veiled figure eventually helps her escape, and that's where you begin the game. Run, jump, crawl, climb, sneak and slash your way past monsters, demons, and assorted perils in order to save your empire from the evil race of the animal creatures.",
    "desc": "西亞女士是一位年輕的女戰士公主，她試圖從殘酷的獸人提索亞人手中拯救自己的家園。\n\n一開始，希婭就被投入監獄。一個蒙著面紗的人物最終幫助她逃脫，這就是遊戲開始的地方。奔跑、跳躍、爬行、攀爬、潛行和砍殺，穿過怪物、惡魔和各種危險，從邪惡的動物種族手中拯救你的帝國。",
    "desc_source": "api"
  },
  "SpaceTwins": {
    "key": "SpaceTwins",
    "original_name": "Space Twins",
    "name": "内森·菲利安",
    "name_source": "wiki",
    "original_desc": "Join forces as the Space Twins for an action-packed adventure! With its captivating gameplay and unique mechanics, this title promises to transport players into a captivating space odyssey. Switch between two twin protagonists, each with distinct abilities, to overcome challenges and solve puzzles.",
    "desc": "與太空雙胞胎聯手，踏上充滿動感的冒險之旅！憑藉其引人入勝的遊戲玩法和獨特的機制，這款遊戲有望將玩家帶入一場迷人的太空漫遊。在兩個具有不同能力的雙胞胎主角之間切換，以克服挑戰並解決難題。",
    "desc_source": "api"
  },
  "Mega Man Battle Network (USA)": {
    "key": "Mega Man Battle Network (USA)",
    "original_name": "Mega Man Battle Network",
    "name": "刺猬索尼克 (1991年游戏)",
    "name_source": "wiki",
    "original_desc": "In the future, a young net-battler named Lan, boots his 'personal information terminal'(PET) and prepares to hack into the network to battle net crime. Lan's PET is no ordinary network navigator. It is Mega Man.EXE, the cyber-identity, which infiltrates the crime-ridden network to battle destructive computer viruses. Defeat viruses in real time and collect Battle Chips program data, containing valuable weapons data and critical system info. Collect over 175 Battle Chips to help Netto and Mega Man.EXE restore peace and order to the network.",
    "desc": "未來，一位名叫蘭的年輕網絡鬥士啟動了他的“個人信息終端”（PET），準備侵入網絡打擊網絡犯罪。Lan 的 PET 不是普通的網絡導航器。它就是 Mega Man.EXE，即網絡身份，它滲透到犯罪猖獗的網絡中，與破壞性的計算機病毒作鬥爭。實時擊敗病毒並收集戰鬥芯片程序數據，其中包含有價值的武器數據和關鍵系統信息。收集超過 175 個戰鬥籌碼來幫助 Netto 和 Mega Man.EXE 恢復網絡的和平與秩序。",
    "desc_source": "api"
  },
  "Fire Emblem - The Sacred Stones (USA, Australia)": {
    "key": "Fire Emblem - The Sacred Stones (USA, Australia)",
    "original_name": "Fire Emblem : The Sacred Stones",
    "name": "火焰之纹章系列",
    "name_source": "wiki",
    "original_desc": "The kingdom of Renais lies in ruins, shattered by a sudden invasion from a former ally. Guide the loyal heirs, Eirika and Ephraim, on their twin quest to rebuild Renais and discover the dark secret behind the war that has torn their homeland apart.",
    "desc": "雷奈王國因前盟友的突然入侵而陷入廢墟。引導忠誠的繼承人 Eirika 和 Ephraim 踏上重建雷奈的雙重任務，並發現導致家園四分五裂的戰爭背後的黑暗秘密。",
    "desc_source": "api"
  },
  "Tomato Adventure (Japan) (Translated)": {
    "key": "Tomato Adventure (Japan) (Translated)",
    "original_name": "Tomato Adventure",
    "name": "红白机游戏列表",
    "name_source": "wiki",
    "original_desc": "This story takes place in a land ruled by and intended for kids: the Ketchup Kingdom. On the holiday, Tomato Day, King Abiira makes an important announcement, declaring a rebirth of the nation with the help of the six Super Kids, and unveiling an awesome machine, the Super Cara-Cooker.\n\nUnfortunately, just after the machine is unveiled, the TV of a boy named Demiru blows out. The adventure begins when you take control of Demiru, and set out to have your TV repaired...\"\n\nTomato Adventure is a very cute and unique RPG meant for young kids, and is currently only available in Japan. It's fairly simple compared to the more complex RPGs out there. But I still think it's very fun; it reminds me a lot of Super Mario RPG.",
    "desc": "這個故事發生在一個由孩子統治並為孩子們服務的土地上：番茄醬王國。在番茄日這一節日，阿比拉國王發表了一項重要聲明，宣布國家在六個超級孩子的幫助下重生，並推出了一款令人敬畏的機器——超級卡拉炊具。\n\n不幸的是，機器剛剛亮相，一個名叫德米魯的男孩的電視就爆炸了。當你控制德米魯並開始修理你的電視時，冒險就開始了……”\n\n番茄大冒險是一款非常可愛且獨特的角色扮演遊戲，專為小孩子設計，目前僅在日本推出。與市面上更複雜的角色扮演遊戲相比，它相當簡單。但我還是覺得很好玩；它讓我想起了很多超級馬里奧角色扮演遊戲。",
    "desc_source": "api"
  },
  "Konami Krazy Racers (USA)": {
    "key": "Konami Krazy Racers (USA)",
    "original_name": "Konami Krazy Racers",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "Konami Krazy Racers is a kart racing game with super deformed racers. It features famous Konami characters like Goemon (from Ganbare Goemon), Dracula (from Castlevania), and Vic Viper (from Gradius). There are 16 courses to race through, and you can collect coins to buy items. Gameplay is similar to that of Mario Kart.",
    "desc": "Konami Krazy Racers是一款擁有超級變形賽車手的卡丁車賽車遊戲。它以著名的科樂美角色為特色，如五右衛門（來自《Ganbare Goemon》）、德古拉（來自《惡魔城》）和維克·毒蛇（來自《Gradius》）。有 16 個賽道可供比賽，您可以收集金幣來購買物品。遊戲玩法與馬里奧賽車類似。",
    "desc_source": "api"
  },
  "Pokemon Mystery Dungeon - Red Rescue Team (USA, Australia)": {
    "key": "Pokemon Mystery Dungeon - Red Rescue Team (USA, Australia)",
    "original_name": "Pokémon Mystery Dungeon : Red Rescue Team",
    "name": "电子游戏开发商列表",
    "name_source": "wiki",
    "original_desc": "Introducing the newest Pokemon, YOU!\n\nWhat if you woke up one day, and you were a Pokemon? What if all of the sudden you find yourself in a NEW world, where you can speak and interact with other Pokemon? The adventure begins when you and your partner Pokemon set out on rescue missions in a world ravaged by natural disasters. But what is your true purpose and destiny in this Pokemon world? That's the real mystery....",
    "desc": "介紹最新的神奇寶貝，你！\n\n如果有一天你醒來發現自己是一隻神奇寶貝怎麼辦？如果你突然發現自己進入了一個新世界，在那裡你可以與其他神奇寶貝交談並互動怎麼辦？當你和你的伙伴口袋妖怪在遭受自然災害的世界中執行救援任務時，冒險就開始了。但你在這個神奇寶貝世界的真正目的和命運是什麼？這才是真正的奧秘......",
    "desc_source": "api"
  },
  "Lilo & Stitch (USA)": {
    "key": "Lilo & Stitch (USA)",
    "original_name": "Lilo & Stitch",
    "name": "星际宝贝",
    "name_source": "wiki",
    "original_desc": "WARNING: Stitch is extremely dangerous. The result of an illegal genetic experiment by a mad scientist, Stitch appears to be harmless - small, furry, with six legs - but his very existence is an abomination to all that's decent in the galaxy. Last seen on the island of Hawaii in the company of a little girl named Lilo. Fugitive may be disguised as a family pet.",
    "desc": "警告：縫合極其危險。史迪奇是一名瘋狂科學家進行非法基因實驗的結果，它看起來是無害的——體型小，毛茸茸的，有六條腿——但他的存在本身就是對銀河系中所有正派生物的憎惡。最後一次出現是在夏威夷大島，身邊有一個名叫莉洛的小女孩。逃亡者可能偽裝成家庭寵物。",
    "desc_source": "api"
  },
  "Super Street Fighter II Turbo - Revival (USA)": {
    "key": "Super Street Fighter II Turbo - Revival (USA)",
    "original_name": "Super Street Fighter II Turbo Revival",
    "name": "Xbox 360游戏列表",
    "name_source": "wiki",
    "original_desc": "Capcom's timeless Street Fighter masterpiece conquers the Game Boy Advance system. Choose from over 16 brawlers from the Street Fighter universe and execute special moves, and super combos to wreak havoc on your opponent and become the best street fighter in the world. Lightning fast animation, unbelievable graphics and Capcom's signature gameplay make Super Street Fighter II Turbo the most respected fighting game of all time.",
    "desc": "Capcom 永恆的街頭霸王杰作征服了 Game Boy Advance 系統。從《街頭霸王》宇宙中超過 16 名鬥士中進行選擇，並執行特殊動作和超級連擊，對對手造成嚴重破壞，成為世界上最好的街頭霸王。快如閃電的動畫、令人難以置信的圖形和 Capcom 的標誌性遊戲玩法使 Super Street Fighter II Turbo 成為有史以來最受推崇的格鬥遊戲。",
    "desc_source": "api"
  },
  "Final Fantasy VI Advance (USA)": {
    "key": "Final Fantasy VI Advance (USA)",
    "original_name": "Final Fantasy VI Advance",
    "name": "最终幻想VI",
    "name_source": "wiki",
    "original_desc": "An Ancient War Rekindled\n\nA thousand years after the War of the Magi, the Gestahlian Empire has succeeded in reviving the lost power of magic through its clandestine Magitek research program. Now, as the Empire threatens to enslave the world with its newfound might, it is up to a band of rebels known as the Returners to find a way to strike back before the flames of war consume the world once more.",
    "desc": "古老的戰爭重燃\n\n賢士之戰一千年後，蓋斯塔赫利亞帝國通過其秘密的 Magitek 研究計劃成功恢復了失去的魔法力量。現在，當帝國威脅要用其新發現的力量奴役世界時，一群被稱為回歸者的叛軍必須在戰火再次吞噬世界之前找到反擊的方法。",
    "desc_source": "api"
  },
  "Kingdom Hearts - Chain of Memories (USA)": {
    "key": "Kingdom Hearts - Chain of Memories (USA)",
    "original_name": "Kingdom Hearts : Chain of Memories",
    "name": "占士·活士",
    "name_source": "wiki",
    "original_desc": "Adventure is in the cards!\n\nKingdom Hearts: Chain of Memories delivers an entirely new adventure and set the stage for Kingdom Hearts II. Sora, Donald, and Goofy travel through many vast and colourful worlds in search of their missing companions. Encounter over 100 of your favourite Disney and Final Fantasy friends and foes.\n\nCollect mysterious cards that open doors to new adventures, unlock powerful abilities, and call familiar friends to your side.\n\nExperience big, bold graphics and high-quality animation.",
    "desc": "本電子遊戲列表列舉了索尼PlayStation 2的電子遊戲。",
    "desc_source": "wiki"
  },
  "Advance Wars 2 - Black Hole Rising (USA)": {
    "key": "Advance Wars 2 - Black Hole Rising (USA)",
    "original_name": "Advance Wars 2 : Black Hole Rising",
    "name": "Game Boy Advance游戏列表",
    "name_source": "wiki",
    "original_desc": "Just when you thought you'd seen the last of them, the Black Hole Army is storming back in this sequel to the award-winning Game Boy Advance strategy game. With new COs under his command, Sturm is leading a new invasion force, and it'll take advance strategy to stop him!",
    "desc": "岸本齊史（岸本 斉史／きしもと まさし Kishimoto Masashi，1974年11月8日—），日本男性漫畫家。岡山縣勝田郡奈義町出身。已婚，O型血。而漫畫家岸本聖史為雙胞胎弟弟。九州產業大學藝術學部畢業。暱稱為有「キシモッさん」、「キッシー」。\n代表作品《火影忍者》於1999年至2014年在《週刊少年Jump》連載，截至2019年5月，已經在46個國家/地區銷售了超過2.5億卷單行本。該系列已經被改編為三部動畫與多部電影，電子遊戲以及相關媒體。 除了《火影忍者》漫畫之外，岸本還親自指導了兩部動畫電影《火影忍者劇場版：最終章》與《火影忍者劇場版：慕留人》，並刊載了一些單篇故事。 在2019年至2020年間，在《週刊少年Jump》上連載另一部作品《SAMURAI 8 機侍 八丸傳》。\n岸本從小就喜歡看漫畫，他以漫畫家鳥山明與大友克洋為目標，表現了自己想成為漫畫家的夢想。結果，岸本花了數年的時間在《週刊少年Jump》連載了自己的少年漫畫，他對此感到非常高興。",
    "desc_source": "wiki"
  }
}