{
  "Chou Aniki (Japan) (FAAT, FACT)": {
    "key": "Chou Aniki (Japan) (FAAT, FACT)",
    "original_name": "Cho Aniki : Super Big Brothers",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "The odd world in this shooter made for quite the conversation piece in its day. Players control either Idaten or Benten, celestial warriors out to bring an end to the tyrannical rule of the emperor of Planet Builder, who holds muscular prowess to be the supreme virtue of the universe. Aided by able-bodied muscle-head options Adon and Samson, they must battle to defeat the emperors army across five stages. Use the buttons to fire away and lay into the Builder forces! Power up your character and options with protein from defeated enemies to have them \"bulk up\" with a yell, and take their macho battle to the next level!",
    "desc": "這款射擊遊戲中的奇特世界在當時成為了熱門話題。玩家控制天體戰士 Idaten 或 Benten，結束行星建造者皇帝的殘暴統治，這位皇帝將肌肉力量視為宇宙的最高美德。在身強體壯、肌肉發達的艾頓和參孫的幫助下，他們必須在五個階段戰鬥才能擊敗皇帝的軍隊。使用按鈕開火併攻擊建造者部隊！用被擊敗的敵人提供的蛋白質來增強你的角色和選項，讓他們通過大喊“壯大”，並將他們的男子氣概戰鬥提升到一個新的水平！",
    "desc_source": "api"
  },
  "Kaze Kiri - Ninja Action (Japan)": {
    "key": "Kaze Kiri - Ninja Action (Japan)",
    "original_name": "Kaze Kiri - Ninja Action",
    "name": "任天堂DS游戏列表",
    "name_source": "wiki",
    "original_desc": "Princess Shizuhime has been kidnapped by a group of ninja under the command of Genbu, and brought to the castle of the malevolent Lord Hiei. The brave young ninja Kaze is summoned by Lord Yoshikage and sent on a dangerous mission: infiltrate Hiei's castle, defeat his minions, and rescue Shizuhime.\n\nKaze Kiri is essentially a beat-em-up with a few distinguishing characteristics. The game consists of traversing fully linear side-scrolling areas, defeating regular enemies and bosses on the way. Before being able to fight the stage boss, Kaze has to vanquish a pre-determined number of enemies, which is displayed as a shared enemy HP on top of the screen.\n\nKaze attacks with his sword when he is near the enemy, or throws shurikens at them from afar. Enemy projectiles can also be blocked by countering them with shurikens. Kaze can also disappear for a moment and re-appear at another location. He can jump, duck, perform somersaults, and grab and throw enemies. Kaze's health regenerates over time if he is not hit repeatedly. Completing the game unlocks another playable character, the female ninja Suzu.",
    "desc": "靜姬公主被玄武指揮的一群忍者綁架，並被帶到惡毒的比叡領主的城堡。勇敢的年輕忍者風受到吉影大人的召喚，並被派去執行一項危險的任務：潛入比叡的城堡，擊敗他的爪牙，並營救靜姬。\n\nKaze Kiri 本質上是一款具有一些顯著特徵的清版遊戲。遊戲包括穿越完全線性的橫向捲軸區域，擊敗途中的常規敵人和頭目。在能夠與舞台老闆戰鬥之前，Kaze 必須擊敗預定數量的敵人，這些敵人在屏幕頂部顯示為共享敵人 HP。\n\n當風靠近敵人時，他會用劍攻擊，或者從遠處向敵人投擲手裡劍。敵人的射彈也可以通過用手裡劍反擊來阻擋。Kaze也可以消失一會兒，然後重新出現在另一個位置。他可以跳躍、躲避、翻筋斗、抓住和扔擲敵人。如果風沒有被反复擊中，他的生命值會隨著時間的推移而恢復。完成遊戲即可解鎖另一個可玩角色，女忍者鈴。",
    "desc_source": "api"
  },
  "Puyo Puyo CD Tsuu (Japan)": {
    "key": "Puyo Puyo CD Tsuu (Japan)",
    "original_name": "Puyo Puyo Cd Tsuu",
    "name": "Mega Drive游戏列表",
    "name_source": "wiki",
    "original_desc": "The follow-up to Puyo Puyo is, like its predecessor, a falling block game in which the goal is to combine four or more blocks (Puyos) of the same color, which then disappear. The remaining Puyos will then fall down and can produce combos which can cause special blocks (Nuisance Puyos, that can only be destroyed by eliminating adjacent Puyos) to appear on the enemy's field.\n\nThis game includes a story mode, in which Arle (the main character) fights against computer enemies, a vs player mode, a four player mode (SNES only), and an endless mode (SNES only).",
    "desc": "Puyo Puyo 的後續版本與其前身一樣，是一款下落方塊遊戲，目標是將四個或更多相同顏色的方塊 (Puyos) 組合在一起，然後它們就會消失。然後剩餘的 Puyo 會倒下並產生連擊，從而導致特殊方塊（討厭的 Puyo，只能通過消除相鄰的 Puyo 來摧毀）出現在敵人的場地上。\n\n該遊戲包括阿爾勒（主角）與電腦敵人作戰的故事模式、對戰模式、四人模式（僅限 SNES）和無盡模式（僅限 SNES）。",
    "desc_source": "api"
  },
  "Ai Chou Aniki (Japan) (SADS)": {
    "key": "Ai Chou Aniki (Japan) (SADS)",
    "original_name": "Ai Cho Aniki",
    "name": "世嘉土星游戏列表",
    "name_source": "wiki",
    "original_desc": "The sequel to the first Cho Aniki (Super Big Brother) game, this is very Japanese in its bizarreness. It's a shoot ?em up, with the player taking the role of an almost nude muscle-man (Adon) or his brother (Samson) in a 2 player game. Their main weapon is a ball of energy that grows over a hole in their heads and shoots out towards any advancing enemies. Other, more powerful shots are achieved by a combination of back-forward-fire, down-up-fire etc on the pad. Through the levels you will encounter all manner of nasties out to get you, but you are aided by a woman in blue that flies around and drops power-ups conveniently for you. Also, levels vary from the standard left-to-right to vertically scrolling.",
    "desc": "第一代《Cho Aniki》（超級大哥）遊戲的續集，它的奇異之處非常日本化。這是一款射擊遊戲，玩家在 2 人遊戲中扮演幾乎裸體的肌肉男（Adon）或其兄弟（Samson）。他們的主要武器是一個能量球，它生長在他們頭上的一個洞上，並向任何前進的敵人射出。其他更強大的射擊是通過發射台上的前後射擊、向下射擊等組合來實現的。在關卡中，你會遇到各種討厭的人來抓你，但你會得到一個藍衣女人的幫助，她會飛來飛去並方便地為你掉落能量。此外，級別也有所不同，從標準的從左到右到垂直滾動。",
    "desc_source": "api"
  },
  "Garou Densetsu Special (Japan) (FABT)": {
    "key": "Garou Densetsu Special (Japan) (FABT)",
    "original_name": "Garou Densetsu Special",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "Fatal Fury Special is an improved version of SNK's 2D one-on-one fighter Fatal Fury 2. The objective is to win the tournament by defeating all other fighters including end boss Wolfgang Krauser. Fatal Fury Special features a fairly large selection of fighters that includes:\nThe eight regular fighters from Fatal Fury 2: Terry Bogard, Andy Bogard, Joe Higashi, Kim Kaphwan, Jubei Yamada, Cheng Sinzan, Mai Shiranui and Big Bear.\nThe four bosses from Fatal Fury 2: Billy Kane, Axel Hawk, Lawrence Blood and Wolfgang Krauser (this time they're all immediately playable).\nThree characters returning from the first Fatal Fury: Duck King, Tung Fu Rue and Geese Howard (the end boss from Fatal Fury).",
    "desc": "《Fatal Fury Special》是 SNK 的 2D 一對一格鬥遊戲《Fatal Fury 2》的改進版本。目標是通過擊敗包括最終首領沃爾夫岡·克勞瑟 (Wolfgang Krauser) 在內的所有其他格鬥者來贏得比賽。《餓狼傳說》特別版擁有相當多的戰士選擇，其中包括：\n《餓狼傳說 2》中的八名常規戰士：特里·博加德、安迪·博加德、東喬、金·卡夫萬、山田十兵衛、成辛山、不知火舞和大熊。\n《餓狼傳說 2》中的四個 Boss：比利·凱恩、阿克塞爾·霍克、勞倫斯·布拉德和沃爾夫岡·克勞瑟（這次他們都可以立即玩）。\n從第一部《餓狼傳說》中回歸的三個角色：鴨王、董福如和吉斯·霍華德（《餓狼傳說》的最終boss）。",
    "desc_source": "api"
  },
  "Dungeon Master - Theron's Quest (USA)": {
    "key": "Dungeon Master - Theron's Quest (USA)",
    "original_name": "Dungeon Master : Theron's Quest",
    "name": "地下城主:塞隆的任務",
    "name_source": "api",
    "original_desc": "Terrifyingly brutal beasts! Monstrous mazes! Treacherous pits of evil! The adventure of a lifetime is here....Theron's Quest!!\n\nThe Monastery at Ya-Brodin has fallen to the Cult of Deaths and the Brotherhood of Enlightenment, the true keepers of Magic, have been slaughtered. The Seven Great Treasures now lie in the hands of foul beings who will stop at nothing to hold onto their massive powers. But Theron, with a courage beyond belief, has decided to seek out the Cult of Deaths and win back the Treasures. If he succeeds, he will become a High Lord. If not, the land will see eternal darkness.",
    "desc": "兇殘無比的野獸！可怕的迷宮！邪惡的奸詐深淵！一生難忘的冒險就在這裡......塞隆的任務！\n\n亞布羅丁修道院已經落入死亡教的手中，啟蒙兄弟會——魔法的真正守護者——也遭到了屠殺。七大寶藏如今落入邪惡之人手中，他們不擇手段地想要保住其巨大的力量。但塞隆以難以置信的勇氣決定尋找死亡教並奪回寶藏。如果他成功了，他將成為大領主。否則，這片土地將會陷入永恆的黑暗。",
    "desc_source": "api"
  },
  "NEXZR (Japan)": {
    "key": "NEXZR (Japan)",
    "original_name": "Nexzr",
    "name": "內克斯茲爾",
    "name_source": "api",
    "original_desc": "In the year 2012 an alien armada attacked the Earth. Two young pilots were in the midst of a battle, and one of them, a lovely young woman, was killed. Three years later, the surviving pilot finally got a chance to avenge her death. Navigating a powerful new fighter ship named \"Slasher\", the pilot ventured into space, ready to bring destruction to those who took so much away from him.\n\nNexzr is a vertically scrolling shoot-em-up similar to Super Star Soldier. The player-controlled spaceship starts with a simple vulcan gun that can only shoot straight. Various power-ups can either enhance the strength of this gun, replace it with a laser weapon, or add a secondary weapon (homing fire, thin spreading laser attacks, etc.), which is activated automatically. Mid- and end-level bosses are encountered on nearly every stage. Additional lives can be collected, but the player always restarts from the beginning of the stage when his fighter craft is destroyed.",
    "desc": "2012年，一支外星艦隊襲擊了地球。兩名年輕飛行員在一場戰鬥中，其中一名可愛的年輕女子被殺。三年後，倖存的飛行員終於得到了報仇的機會。駕駛著一艘名為“Slasher”的強大新型戰鬥機，飛行員冒險進入太空，準備為那些奪走他許多東西的人帶來毀滅。\n\nNexzr 是一款類似於 Super Star Soldier 的垂直滾動射擊遊戲。玩家控制的宇宙飛船一開始有一把簡單的火神槍，只能直線射擊。各種能量提升可以增強這把槍的強度，用激光武器代替它，或者添加自動激活的輔助武器（尋的火力，薄散激光攻擊等）。幾乎每個階段都會遇到中層和層層老闆。可以收集額外的生命，但當玩家的戰鬥機被摧毀時，玩家總是從階段的開頭重新開始。",
    "desc_source": "api"
  },
  "Ys III - Wanderers from Ys (USA)": {
    "key": "Ys III - Wanderers from Ys (USA)",
    "original_name": "Ys III : Wanderers from Ys",
    "name": "PlayStation 2游戏列表",
    "name_source": "wiki",
    "original_desc": "Adol Christin's long-time friend, Dogi, wishes to return to his home town of Redmont after hearing about strange disturbances that are happening there.  Always looking for an adventure, Adol joins him and soon finds out the cause of this new evil.\n\nYs III: Wanderers from Ys breaks away from the \"bumping into enemies\" battle system of the first two games, allowing Adol to control his sword in a variety of directions. Beside changing the battle system, the game's perspective switches to a side-scrolling view, as opposed to the top-down one of the previous games. Adol also has the ability to jump now.  New to the series is the use of magical rings, which give Adol different powering-up abilities such as healing and shielding. The game also uses various key items found along the way to solve minor puzzles and progress the story.",
    "desc": "阿道爾·克里斯汀的老朋友多吉在聽說雷蒙特的家鄉發生了奇怪的騷亂後，希望回到家鄉。一直在尋找冒險的阿多爾加入了他的行列，很快就發現了這種新邪惡的原因。\n\n《伊蘇3：流浪者》擺脫了前兩部遊戲中“撞到敵人”的戰鬥系統，讓阿特魯可以在多個方向上控制他的劍。除了改變戰鬥系統之外，遊戲的視角也切換為橫向滾動視圖，而不是之前遊戲的自上而下的視圖。阿杜爾現在也有了跳躍的能力。該系列的新功能是使用魔法戒指，它賦予阿道爾不同的能力，例如治療和防護。遊戲還使用沿途發現的各種關鍵物品來解決小謎題並推動故事發展。",
    "desc_source": "api"
  },
  "Ys IV - The Dawn of Ys (Japan) (Translated)": {
    "key": "Ys IV - The Dawn of Ys (Japan) (Translated)",
    "original_name": "Ys IV : The Dawn of Ys",
    "name": "PlayStation Portable游戏列表",
    "name_source": "wiki",
    "original_desc": "The Dawn of Ys is one of two games released under the title of Ys IV, the other being Tonkin House's Ys IV: Mask of the Sun. The two games share the same basic story, but have many differences regarding concrete events, locations, gameplay details, etc. The events of the game take place a short while after those described in Ys II, and before the events of Ys III: Wanderers from Ys.\n\nAs the game begins, Adol and his friend return to the town of Minea, where the first game began. The evil Lord Darm has been defeated, and it's time to relax and spend some time with friends - but not for long. A new evil is rising, and Adol decides to set sail for the overseas land of Celceta to investigate these occurrences.\n\nYs IV returns to the style of play used in the first and second games. The gameplay area is viewed from a top-down perspective, and the player attacks enemies by running into them to cause damage. Combat is slightly more sophisticated than in the first two games, since Adol can now move in eight directions, and attacking enemies diagonally or from the sides is more efficient than bumping into them headstrong. Adol gains experience from defeating enemies, which serves to raise his attack and defense power, like in the previous games. He can equip various swords, armor, shields, and rings to enhance his attributes. The magic system introduced in Ys II is also brought back for this game.",
    "desc": "小德韋恩·麥可·卡特（英語：Dwayne Michael Carter Jr.；1982年9月27日—），藝名小韋恩（英語：Lil Wayne；也稱利爾·韋恩），是一位美國饒舌歌手、歌手、詞曲作者兼廠牌主管。1995年，12歲的他被饒舌歌手鳥人簽下，加入現金唱片，成為了其最年輕的成員。\n同年他以Baby D的藝名與同一廠牌藝人B.G.組成饒舌二人組The B.G.'z並錄製發行了一張專輯《True Story》。在1997年，韋恩加入南部嘻哈組合Hot Boys。組合中其他成員包括Juvenie、B.G.和Turk。同年Hot Boy's發行首張專輯《Get It How U Live!》。1999年發行的專輯《Guerrilla Warfare》使韋恩大獲成功。同年韋恩發行了首張個人專輯《Tha Block Is Hot》。韋恩在2004年發行的專輯《Tha Carter》使其知名度大增，並催生熱門單曲《Go D.J.》。韋恩在同年與Destiny's Child合唱的單曲《Soldier》成為前十熱單。《Tha Carter》的續篇《Tha Carter III》於2005年發行。在2006~2007年間，韋恩發行了數張mixtape並獻唱支收熱門饒舌和R&B單曲。其職業生涯最成功的專輯《Tha Carter III》於2008年發行，全美首周銷量高達100萬。其中收錄冠軍單曲《Lollipop》並獲得葛萊美最佳饒舌專輯的獎項。韋恩首張搖滾專輯《Rebirth》於2010年發行，獲得金唱片認證。\n2010年5月，韋恩因被判非法擁有武器而在紐約開始為期8個月的獄中生活。2010年，韋恩的第八張錄音室專輯《I Am Not A Human Being》於服刑期間發行。2011年《Tha Carter IV》發行，全美首周銷量高達96.4萬，其中收錄熱門單曲《6 Foot 7 Foot》、《How to Love》。他的第十二張錄音室專輯《Tha Carter V》在多次推遲後於2018年發行。韋恩的第十三張專輯《Funeral》於2020年初發行。\n韋恩在全球範圍內已售出超過1.2億張唱片，其中包括超過2000萬張專輯和7000萬首數字曲目，使他成為世界上最暢銷的音樂人之一。他已獲得5次葛萊美獎、11次BET獎、4次告示牌音樂獎、2次MTV音樂錄影帶大獎和8次NAACP形象獎。在2012年9月27日，韋恩超越貓王成為登上告示牌百大熱門榜次數最多的男藝人（共109首單曲登榜）。韋恩目前還擔任他自己的廠牌Young Money Entertainment的執行長。",
    "desc_source": "wiki"
  },
  "Ginga Fukei Densetsu Sapphire (Japan)": {
    "key": "Ginga Fukei Densetsu Sapphire (Japan)",
    "original_name": "Ginga Fukei Densetsu Sapphire",
    "name": "銀河縣警察傳奇警察鰭",
    "name_source": "api",
    "original_desc": "In the future, time travel became a regular commodity. Criminal organizations began using advanced science in order to escape into different time periods to avoid capture. To counter that, a special police unit called \"Burning Rabbits\" was formed to fight through time and space.\nGinga Fukei Densetsu: Sapphire is a vertically-scrolling shoot-em-up. The player can choose between four different female characters, each piloting a different ship: Sapphire has balanced strength is speed; Charlotte is the fastest, but also the weakest; Helen is the slowest and the strongest; Jasmine is the second-strongest and the second-slowest. The ships are also distinguished by their weapon properties. Each ship can collect red, green, or blue power-ups; collecting a power-up of the same color enhances the currently equipped weapon, while a differently-colored power-up changes weapon properties while retaining whatever enhancements the ship might have had with the previous weapon.",
    "desc": "在未來，時間旅行成為一種常見的商品。犯罪組織開始利用先進的科學手段逃入不同的時間段以避免被捕。為了應對這種情況，一支名為“燃燒兔子”的特警部隊成立，以穿越時空進行戰鬥。\n《Ginga Fukei Densetsu: Sapphire》是一款垂直捲軸射擊遊戲。玩家可以在四個不同的女性角色之間進行選擇，每個角色駕駛不同的船：藍寶石具有平衡的力量是速度；夏洛特是最快的，但也是最弱的；海倫是最慢的，也是最強壯的；茉莉花是第二強和第二慢的。這些艦艇還以其武器特性而著稱。每艘船都可以收集紅色、綠色或藍色的能量道具；收集相同顏色的能量提升可以增強當前裝備的武器，而不同顏色的能量提升可以改變武器屬性，同時保留飛船可能對之前的武器進行的任何增強。",
    "desc_source": "api"
  },
  "Seirei Senshi Spriggan (Japan)": {
    "key": "Seirei Senshi Spriggan (Japan)",
    "original_name": "Seirei Senshi Spriggan",
    "name": "超級任天堂遊戲列表",
    "name_source": "wiki",
    "original_desc": "Another top-down shooter from Compile staged in a fantasy world that mingles traditional sci-fi elements with a feudal Japan setting.\n\nAs the game starts a struggle for total control over elemental powers is about to begin between two warring nations. As the best mecha pilot in the good guy's army it's your task to repel the invasion and win the war by dealing with the enemy armada in standard shooter fashion. But surprise surprise! You won't be alone this time, as other AI-controlled mecha pilots will join you in the fray at key moments. Only you can command the magical powers that can be added to your mecha by collecting several color-coded orbs though, so most of the fight is still going to be up to you.",
    "desc": "Compile 的另一款自上而下射擊遊戲，在一個融合了傳統科幻元素和日本封建背景的奇幻世界中上演。\n\n隨著遊戲開始，兩個交戰國家之間爭奪元素力量完全控制權的鬥爭即將開始。作為好人軍隊中最好的機甲飛行員，你的任務是通過以標準射擊遊戲的方式對付敵人的艦隊來擊退入侵並贏得戰爭。但驚喜驚喜！這次你不會孤單，因為其他人工智能控制的機甲飛行員會在關鍵時刻加入你的戰鬥。不過，只有你可以通過收集幾個顏色編碼的球體來指揮可以添加到你的機甲中的魔法力量，所以大部分戰鬥仍然取決於你。",
    "desc_source": "api"
  },
  "Dungeon Explorer II (USA)": {
    "key": "Dungeon Explorer II (USA)",
    "original_name": "Dungeon Explorer II",
    "name": "Take-Two Interactive游戏列表",
    "name_source": "wiki",
    "original_desc": "This CD sequel to Dungeon Explorer plays exactly the same as the first game. You chose your character from a variety of fantasy stereotypes and set forth in a Gauntlet-esque adventure. The CD format allows a greater quantity and variety of levels to compliment the storyline, with new areas and characters becoming open to you as you progress.",
    "desc": "這張《地下城探險家》的 CD 續作的玩法與第一款遊戲完全相同。你從各種奇幻刻板印像中選擇了你的角色，並開始了一場類似挑戰的冒險。CD 格式允許更多數量和種類的關卡來補充故事情節，隨著您的進展，新的區域和角色會向您開放。",
    "desc_source": "api"
  },
  "Gate of Thunder (Japan) (FACT, FADT)": {
    "key": "Gate of Thunder (Japan) (FACT, FADT)",
    "original_name": "Gate Of Thunder",
    "name": "Greatest Hits",
    "name_source": "wiki",
    "original_desc": "A side-scrolling shoot-'em-up, Gate of Thunder asks players to take control of the space-craft \"Hunting Dog\". Playing as the pilot Hawk, along with Esty in her ship the \"Wild Cat\", you must defeat the forces of General Don Jingi, who has plans of taking energy from the star of Aries.\nGate of Thunder allows players to choose in real-time from three weapon-fire types. A blue-coloured electrical fire, a green-coloured wave-fire, and a red-coloured quake-type fire. Along with this, players obtain homing-missiles and the assistance of the \"Wild Cat\" which orbits the ship separately.",
    "desc": "《雷霆之門》是一款橫向捲軸射擊遊戲，要求玩家控制太空飛船“獵犬”。扮演飛行員霍克，與埃斯蒂一起駕駛她的“野貓”號飛船，你必須擊敗唐·金吉將軍的軍隊，他計劃從白羊座之星獲取能量。\n《雷霆之門》允許玩家實時選擇三種武器射擊類型。藍色電氣火災、綠色波浪火災和紅色地震火災。除此之外，玩家還可以獲得尋的導彈和單獨繞船運行的“野貓”的幫助。",
    "desc_source": "api"
  },
  "Lords of Thunder (USA)": {
    "key": "Lords of Thunder (USA)",
    "original_name": "Lords of Thunder",
    "name": "CD-i游戏列表",
    "name_source": "wiki",
    "original_desc": "Lords of Thunder is a side-scrolling shooter that has you take on the role of a legendary warrior, blasting enemies to heavy-metal tunes. Your enemies are plotting to revive Zaggart, \"The Dark One,\" who was sealed beneath the six continents of Mistral. It's up to Landis, descendant of the heroic Dyu, to stop them. Choose the order in which to attack the six stages. Before each stage, select one of four magic armors and use crystals you've collected during your battles to buy items. Then get ready to face awesome enemies like a fire-spewing sea serpent or a giant insect.",
    "desc": "《雷霆之王》是一款橫向捲軸射擊遊戲，您將扮演傳奇戰士的角色，在重金屬樂曲中轟擊敵人。你的敵人正密謀復活被封印在米斯特拉爾六塊大陸之下的“黑暗者”扎格特。英雄 Dyu 的後裔蘭迪斯必須阻止他們。選擇攻擊六個階段的順序。在每個階段之前，選擇四種魔法盔甲之一，並使用您在戰鬥中收集的水晶來購買物品。然後準備好面對可怕的敵人，例如噴火的海蛇或巨型昆蟲。",
    "desc_source": "api"
  },
  "Bakushou Yoshimoto Shinkigeki (Japan) (FABT)": {
    "key": "Bakushou Yoshimoto Shinkigeki (Japan) (FABT)",
    "original_name": "Bakushou Yoshimoto Shinkigeki",
    "name": "哈哈 吉本新喜劇",
    "name_source": "api",
    "original_desc": "The game is based on the comedy TV show Yoshimoto no Shinkigeki, which in its turn is based on a theatrical comedy show popular in Osaka and its surroundings. The game stars characters that either look like the actors from the TV show and/or resemble characters played by them. \n\nThe show consists of short episodes which are depictions of comical situations, and are not related to each other story-wise. Same can be applied to the game: there is no real story, just a stretch of hilarious and intentionally impossible situations the protagonists find themselves in.",
    "desc": "該遊戲改編自喜劇電視節目《吉本新喜劇》，而該劇又改編自大阪及其周邊地區流行的戲劇喜劇節目。該遊戲的主角要么看起來像電視節目中的演員，要么類似於他們扮演的角色。\n\n該節目由短集組成，描述了滑稽的情景，並且在故事上彼此之間沒有關聯。同樣的情況也適用於遊戲：沒有真實的故事，只有主角發現自己陷入的一系列搞笑且故意不可能的情況。",
    "desc_source": "api"
  },
  "Star Parodier (Japan)": {
    "key": "Star Parodier (Japan)",
    "original_name": "Star Parodier",
    "name": "明星模仿秀",
    "name_source": "api",
    "original_desc": "Move fast and blast! It's a nonstop explosion of fire power and you're streaking through space, right in the middle of it! The Brains Cult you once defeated is back, badder than ever. But your finger's on the trigger of an incredible new techno-attack! Scorch the Scorpion with a nuclear a sting. Fire your heat-seeking sidewinders. Then power-up to launch your doomsday Super Bomb! Blow those Brains out and save the galaxy. Then challenge your friends with a special competition time mode to prove who the Super Star really is!",
    "desc": "快速移動並爆炸！這是一場不間斷的火力爆炸，而你就在太空的正中央疾馳而過！你曾經擊敗過的大腦教派又回來了，而且比以往任何時候都更糟糕。但你的手指已觸動了令人難以置信的新技術攻擊的扳機！用核螫刺燒焦蝎子。發射你的尋熱響尾蛇。然後啟動你的末日超級炸彈！炸掉那些大腦並拯救銀河系。然後通過特殊的比賽時間模式挑戰你的朋友，證明誰才是真正的超級明星！",
    "desc_source": "api"
  },
  "Beyond Shadowgate (USA)": {
    "key": "Beyond Shadowgate (USA)",
    "original_name": "Beyond Shadowgate",
    "name": "任天堂64游戏列表",
    "name_source": "wiki",
    "original_desc": "This is a sequel to the adventure game Shadowgate. You control Prince Eric, the descendant of the hero of the first game. You return to your home country, only to discover that your father was murdered. You should become the new king, but the minister of the late king has other plans, frames you for killing your own father, and throws you into jail, where your adventure begins.\n\nUnlike the first Shadowgate, this is a platform game - not an action game, but a classical point-and-click adventure viewed from a platform perspective. You can move your hero around, examine, manipulate, and take objects. You can also duck and have a \"punch\" command. Find the correct solutions to the game's puzzles, otherwise a gruesome death awaits you!",
    "desc": "這是冒險遊戲《暗影之門》的續作。你控制埃里克王子，第一款遊戲英雄的後裔。你回到自己的祖國，卻發現你的父親被謀殺了。你應該成為新國王，但已故國王的大臣另有計劃，陷害你殺害自己的父親，並將你投入監獄，你的冒險就此開始。\n\n與第一部《Shadowgate》不同，這是一款平台遊戲 - 不是動作遊戲，而是從平台角度來看的經典點擊式冒險遊戲。你可以移動你的英雄，檢查、操縱和拿走物體。您還可以躲避並發出“出拳”命令。找到遊戲謎題的正確答案，否則可怕的死亡等待著你！",
    "desc_source": "api"
  },
  "Castlevania - Rondo of Blood (Japan) (Translated)": {
    "key": "Castlevania - Rondo of Blood (Japan) (Translated)",
    "original_name": "Akumajou Dracula X - Chi no Rondo",
    "name": "惡魔城德古拉 X-Chi no Rondo",
    "name_source": "api",
    "original_desc": "In the days of old, the people thrived on peace and prosperity. Indeed, fears of unrest were not among their thoughts...\n\nBut, ever-present, beneath the veneer of tranquility, evil lurks. Evil, which spurns prosperity and disdains peace.\n\nGather they did, those who wished to summon the powers of darkness and cleanse the decadence of the world. And, with smiling countenance, they anxiously awaited the coming of their era.\n\nA hundred years had past, and he was resurrected. Able to become bat, wolf, or mist at will, he lived in the night. He drank the blood of young maidens and lived an eternal life. The lord of Castlevania, the god of evil, Count Dracula was reborn.",
    "desc": "古時候，人民安居樂業。事實上，他們並沒有擔心動亂……\n\n然而，在平靜的外表下，邪惡卻始終潛伏著。邪惡，蔑視繁榮，蔑視和平。\n\n他們聚集在一起，那些希望召喚黑暗力量並淨化世界頹廢的人們。他們面帶微笑，焦急地等待著屬於自己的時代的到來。\n\n一百年過去了，他復活了。他可以隨意變成蝙蝠、狼或霧，生活在黑夜裡。他喝了少女的血，獲得了永生。惡魔城領主、邪惡之神德古拉伯爵重生。",
    "desc_source": "api"
  },
  "ImageFight II - Operation Deepstriker (Japan)": {
    "key": "ImageFight II - Operation Deepstriker (Japan)",
    "original_name": "Imagefight 2 - Operation Deepstriker",
    "name": "Imagefight 2 - 深擊者行動",
    "name_source": "api",
    "original_desc": "An enemy armada approaches Earth bent on the destruction of the human race. In this sequel to Image Fight, players take control of the most advanced spaceship in the fleet. Destroy \"POW\" cases for items and special weapons. Obtain Red and Blue Pods to equip your ship. Red Pods fire the opposite way your fighter is moving, and Blue Pods only fire forward. You can also change the speed of your ship, to adjust to different battle conditions. Defeat the alien invaders once and for all and bring peace back to the Galaxy.",
    "desc": "一支敵方艦隊接近地球，一心要毀滅人類。在《Image Fight》的這款續集中，玩家將控制艦隊中最先進的宇宙飛船。摧毀裝有物品和特殊武器的“戰俘”箱。獲取紅色和藍色豆莢來裝備您的飛船。紅色吊艙向戰鬥機移動的相反方向開火，藍色吊艙僅向前開火。你還可以改變你的船的速度，以適應不同的戰鬥條件。一勞永逸地擊敗外星入侵者，為銀河帶回和平。",
    "desc_source": "api"
  },
  "R-Type Complete CD (Japan)": {
    "key": "R-Type Complete CD (Japan)",
    "original_name": "R-type Complete Cd",
    "name": "R-type Complete Cd",
    "name_source": "keep",
    "original_desc": "R-Type Complete CD combines part I and part II of the japanese PC Engine HuCard releases. It also adds remixed music, fully voiced cut scenes, an extra boss fight, and some other minor changes.\nAn alien race called the Bydo attacks humanity without mercy. The prototype space fighter R-9 must stop the Bydo and save the human race.",
    "desc": "R-Type Complete CD 結合了日本 PC Engine HuCard 版本的第一部分和第二部分。它還添加了混音音樂、全語音過場動畫、額外的 Boss 戰鬥以及其他一些細微的變化。\n一個名為 Bydo 的外星種族毫不留情地攻擊人類。原型太空戰鬥機 R-9 必須阻止 Bydo 並拯救人類。",
    "desc_source": "api"
  },
  "Godzilla (USA)": {
    "key": "Godzilla (USA)",
    "original_name": "Godzilla",
    "name": "哥斯拉系列",
    "name_source": "wiki",
    "original_desc": "This interpretation of Godzilla takes form of a fighting game, only instead of the usual brave martial artists the players control horrifying monsters from the traditional Toho lineage.\nThe combat system is similar to other fighting games, with various combinations of buttons executing different moves. Naturally, the normal \"punch-kick\" scheme is modified to suit the monsters' shapes and biological peculiarities. For example, monsters with tails can use tail spin attacks; fire-breathing monsters have a range fire attack, etc. Most of the monsters have a move when they hold the opponent and suck its blood.",
    "desc": "這種對哥斯拉的詮釋採用了格鬥遊戲的形式，只不過玩家控制的是傳統東寶血統的可怕怪物，而不是通常勇敢的武術家。\n戰鬥系統與其他格鬥遊戲類似，通過不同的按鈕組合執行不同的動作。當然，正常的“拳打腳踢”方案會被修改以適應怪物的形狀和生物特性。例如，有尾巴的怪物可以使用尾旋攻擊；噴火怪物有範圍火焰攻擊等。大多數怪物在按住對手並吸其血時會有一個動作。",
    "desc_source": "api"
  },
  "Spriggan Mark 2 - Re Terraform Project (Japan)": {
    "key": "Spriggan Mark 2 - Re Terraform Project (Japan)",
    "original_name": "Spriggan Mark 2 - Re Terraform Project",
    "name": "Spriggan Mark 2 - Re Terraform 項目",
    "name_source": "api",
    "original_desc": "Once again get to pilot a mecha in a war between two opposing armies, in Spriggan mark 2: Re-Terraform Project, this time to decide the fate of a distant colony in outer space. As in the first game, other AI-controlled mechas join in the fight and even talk to the protagonist with full voice-overs to advance the plot. The color-coding weapon system of the original is gone, replaced with a standard collectible power-up system. No options are available to watch the player character's back, but it is possible to change the direction the player-controlled mecha faces, allowing the player to deal with threats from behind.",
    "desc": "在 Spriggan mark 2: Re-Terraform Project 中，再次駕駛機甲參與兩支敵對軍隊之間的戰爭，這一次將決定外太空一個遙遠殖民地的命運。與第一款遊戲一樣，其他人工智能控制的機甲也加入戰鬥，甚至通過全程畫外音與主角交談以推進劇情。原版的顏色編碼武器系統消失了，取而代之的是標準的可收藏的強化系統。沒有選項可以觀察玩家角色的背部，但可以改變玩家控制的機甲所面對的方向，讓玩家能夠應對來自後面的威脅。",
    "desc_source": "api"
  },
  "Mad Stalker - Full Metal Force (Japan)": {
    "key": "Mad Stalker - Full Metal Force (Japan)",
    "original_name": "Mad Stalker - Full Metal Force",
    "name": "PlayStation游戏列表",
    "name_source": "wiki",
    "original_desc": "Mad Stalker: Full Metal Force is a Japanese beat 'em up video game originally produced by Fill-in-Cafe and published and distributed by FamilySoft for the Sharp X68000. The music was composed by Keishi Yonao.",
    "desc": "本電子遊戲列表列舉了索尼 PlayStation的電子遊戲。索尼PlayStation最早於1994年12月3日在日本推出，之後於1995年9月9日在北美推出。",
    "desc_source": "wiki"
  },
  "Summer Carnival '93 - NEXZR Special (Japan)": {
    "key": "Summer Carnival '93 - NEXZR Special (Japan)",
    "original_name": "Summer Carnival '93 - Nexzr Special",
    "name": "夏季嘉年華 '93 - Nexzr 特別節​​目",
    "name_source": "api",
    "original_desc": "Released specifically for Naxat Soft's Summer Carnival of 1993, Nexzr Special is a collection of short stages and modes that share their basic gameplay system and visuals with Nexzr. The regular mode introduces familiar regular enemies and a few new bosses. The \"Carnival Mode\" contains Score Attack and Time Attack modes, both requiring the player to focus on attaining the high score rather than just surviving. For that reason the difficulty in these modes is more forgiving; they allow more continues and have more generously placed power-ups. These modes also offer more destructible objects on the screen, as these specifically serve to increase the score.",
    "desc": "Nexzr Special 專為 Naxat Soft 1993 年夏季嘉年華髮布，是一系列短關卡和模式的集合，與 Nexzr 共享基本遊戲系統和視覺效果。常規模式引入了熟悉的常規敵人和一些新的首領。“嘉年華模式”包含得分攻擊和時間攻擊兩種模式，這兩種模式都要求玩家專注於獲得高分，而不僅僅是生存。因此，這些模式的難度更容易被接受。他們允許更多的繼續，並有更慷慨的放置能量提升。這些模式還在屏幕上提供了更多可破壞的物體，因為它們專門用於提高分數。",
    "desc_source": "api"
  },
  "Ys Book I & II (USA)": {
    "key": "Ys Book I & II (USA)",
    "original_name": "Ys Book I & II",
    "name": "PlayStation Portable游戏列表",
    "name_source": "wiki",
    "original_desc": "Ys: Book I & II contains enhanced remakes of two games: Ys: The Vanished Omens and its sequel, Ys II: Ancient Ys Vanished - The Final Chapter. The enhanced versions were not released separately.\n\nThe players controls a young red-haired hero named Adol Christin, whose task is to find the six books of Ys, an ancient paradise-like land that mysteriously disappeared long time ago. It is said that whoever possesses the six books can gain access into Ys. In the first game, Adol is on the quest to find the books and to enter Ys. The second game takes place in Ys itself, and Adol must defeat an even greater evil and liberate the land.\n\nThis release features enhanced CD-quality sound, higher-quality graphics, and new anime-style cutscenes.",
    "desc": "伊蘇：第一冊和第二冊包含兩款遊戲的增強重製版：《伊蘇：消失的預兆》及其續作《伊蘇 II：遠古伊蘇消失 - 最終章》。增強版並未單獨發布。\n\n玩家控制一位名叫阿多·克里斯汀的年輕紅發英雄，他的任務是找到伊甦的六本書，這是一片很久以前神秘消失的古老天堂般的土地。據說，誰擁有這六本書，就可以進入伊蘇。在第一款遊戲中，阿多爾正在尋找書籍並進入伊蘇。第二款遊戲發生在伊蘇，阿杜爾必須擊敗更強大的邪惡勢力並解放這片土地。\n\n此版本具有增強的 CD 質量聲音、更高質量的圖形和新的動漫風格過場動畫。",
    "desc_source": "api"
  }
}