{
  "The year is 2031 and the world is near the brink of economic collapse. To avoid this, the president comes up with a plan to stop the disaster - but before applying it, the long-term impacts on the world need to be validated. This is done with a simulation visited by the computer project PRISM, designed to be a true AI. The game starts when PRISM awakes from a simulation of his own, human life and is told that he is in fact the world's first sentient machine. At this point, the player takes control over PRISM. A Mind Forever Voyaging is a text-based interactive fiction game. The player reads descriptions which detail the surroundings and communicates with the game by typing in commands. Most of the time is spent in simulation mode where the player repeatedly visits the town of Rockvil and needs to record situations of everyday or special activities going on. If the player has recorded enough, the game progresses and the simulation ten years ahead can be visited. However, the recording device has no unlimited capacity - when full, the player needs to exit the simulation and let the recordings review by the project leader. Then the current simulation can be simply started again from the start to find new situations - the same applies when dying. Between simulations and toward the end there are situations outside the simulation, but overall the game is light on puzzle-solving and more about experiencing how said plan changes Rockvil and its people over time. Outside the simulation there are three more modes to enter: communications (switching to various video/audio units to examine other locations and people), library (various documents and other information to read) and interlace (communicating and giving orders to the own subsystems).": "",
  "ABM is an EGA graphic remake of Missile Command. In this game you must stop missiles from coming down to destroy Shield Generators. You can use your mouse, or your arrow keys to aim where you want to fire, then click on the mouse buttons to fire and destroy the missiles. There are infinite levels and no high score table. When you get a game over their will be Statistics showing how many missiles you destroyed and how many interceptors you launched.": "",
  "A graphic dungeon quest inspired by the old mainframe game of the same name, Adventure is a graphic action-adventure game where you use your joystick to wander around, collecting keys to explore castles, labyrinths and everything in between, whilst slaying anything that moves (i.e. Dragons & Co.) to get treasures. The game has 3 difficulty settings:Level 1 (Easiest)Level 2: The Kingdom is larger than Level 1, containing secret rooms and hidden items to add difficulty.Level 3 (Hardest): Similar to Level 2 but all objects/items are placed randomly throughout the Kingdom.Gameplay revolves around picking up (and dropping) items, hacking your way though dragons, finding keys to open the castle gates and using magic (i.e. reincarnation) in case you get swallowed by failing-to-follow-their-diet-plan-dragons.": "",
  "Once, the land of Akalabeth was peaceful and quiet. But then came Mondain, an evil and ambitious man who created dungeons and populated them with foul creatures. The noble warrior British was able to drive Mondain from Akalabeth, but the monsters he brought with him remain. As either a fighter or a mage, it is your job to explore Akalabeth, descend into the dungeons and vanquish the beasts dwelling within. On an overhead map of the land, one can find the dungeons, towns where one may buy supplies, weapons and armor, and a castle, where one will be given quests by Lord British. To fulfill such a quest, a certain type of creature must be destroyed in a dungeon. Inside the dungeons, the view switches to a first-person perspective. Fight, explore and find treasure on your way to complete a quest. Each successive quest will require you to destroy a stronger monster, which will reside on a deeper dungeon level than the one before it. Akalabeth is the precursor to the Ultima Series.": "",
  "Alice in Wonderland is an adventure platformer based upon the two Alice books by Lewis Carrol and created using the same engine as Below the Root. However, whereas that game had more of a focus on role playing, Alice has more of a focus on puzzle solving. Puzzles come in a variety of forms including many inventory based puzzles, and more appropriately, given the subject matter, riddles. Also, there are many physical puzzles primarily taking the form of how to get from here to there through jumping and using inventory items to change Alice's size. The plot is more inspired by the Alice books than strictly adapting them. Especially the game tries to adapt Carrol's sense of humor in its rhymes and puns. Interestingly, Alice's end of conversations are driven by selecting emotions rather than typing words, and it is possible to anger NPCs and have them stalk off, leaving you to wait until a pre-appointed hour when they will reappear. The time can be discovered by looking at one of the various clocks throughout the game. Time is important because the game must be completed before the Red King wakes, although this isn't much of an issue especially since the game can be saved whenever and mistakes easily taken back.": "",
  "This short text adventure casts the player as the sole survivor of a space disaster involving the luxury liner \"Adonis.\" Stranded on a hostile planet full of monsters after a lifepod landing, the player must reach the planet's only other human occupants and find a way home. The game features a simple two-word parser, lots of \"instant death\" locations (making mapping important) and relatively few puzzles.": "",
  "Alien Typhoon is an enhanced version of Apple Galaxian,with more aliens on screen. In essence it is a variant of the arcade game Galaxian. It is a shoot-'em-up where a formation of alien ships attack your lone starship at the bottom of the screen. The aliens peel off from the formation and attack you in different patterns, depending on the color of the ship. The two ships at the top are the motherships and they bring an escort of two red aliens with them to guard them, but if you can shoot the escort and then the mothership, you'll score lots of points.": "",
  "Alter Ego is a game which tries to simulate life itself. The player creates a character with different personality statistics, either by assigning them randomly or by answering a few introductory questions. They then guide this character through seven life phases, from infancy to old age. The gameplay consists of a series of situations where a decision has to be made. This is done by choosing one of multiple answer possibilities, sometimes accompanied with a mood. Then the player gets presented with the outcome and goes on to the next situation. Every decision has long-time consequences and influences the personality, health and which situations await further down the road. Some decisions may even result in an early death or instant game over. Every life phase is represented by a life tree where the situations are lined up; the motive of the situation card shows the general theme of the situation. After reaching a certain age, additional life options can be undergone at any time. Here the player can change his lifestyle and manage his love and professional life. The game exists in two variations which depict a male or female life.": "",
  "ATC is a text-mode Air Traffic Controller game. Aircraft appear periodically and must be directed to the correct exit gate according to their flight plan. Aircraft can be given direct commands (e.g. turn left), relative commands (e.g. turn towards exit #2), or delayed commands (e.g. at beacon #1, turn left), as well as commands to adjust altitude. As the game progresses, more planes will enter the control area at a time. The game does not end; the goal is simply to direct as many planes as possible to their desired exit. As soon as a mistake is made, the game ends.": "",
  "The protagonist wakes up in a hotel room in midtown Manhattan with no clothes and no money, and what is worse, no memory. Soon he discovers that some man wants to kill him and he is wanted for murder in Texas. Now his quest is to find out what exactly is going on, who he is and how to set things right. The defining feature of Amnesia is the inclusion of the whole of Manhattan, more specifically about 4000 separate locations, 650 streets and the subway system. For this reason the original package includes a map and the \"X-Street Indexer\" (a code wheel for finding the nearest cross street when aligning the avenue name with the street address number), so that the player can find his way. The game also simulates the time of day which, for example, means that stores close and open at the correct time. Most puzzles are inventory or conversation-based and it is often required to be at right place at the right time. Additionally the player needs to take care about surviving, so he needs to take jobs to earn money, buy food and find shelter at night. This is represented by the score which is divided into three parts: detective (plot advancement), character (how he interacts with Manhattan's citizens) and survivor.": "",
  "Andromeda Conquest is a strategy / conquest game in which one to four players build galactic empires by establishing and defending space colonies, managing resources, and battling other players for control of star systems. Before every turn, players receive resources from all their colonies. Those have to be used up during the turn or they are lost. Depending on the numbers of players the galaxy consists of 12 to 48 star systems. The layout is grid-based, and the package includes a pad of graph paper for keeping track of ship and colony locations.": "",
  "Played from a 1st person perspective at a bowling alley. A throw indicator scrolls slowly along the bottom of the screen. The player controls the power and spin of the ball using the game paddles, and the game attempts to accurately simulate the physics of bowling, and follows standard 10-pin bowling rules.": "",
  "The player as a spider has to make their way through several obstacles to the top of an apple cider conveyor. Therefore the apples on the conveyor, the squeezing mechanisms and various living creatures disturb the player. Jumping over obstacles and climbing the thick threads, the player struggles doughtily, gaining points and progressing from level to level.": "",
  "The original Breakout concept involves controlling a bat at the bottom of the screen and using it to catch and direct a ball so as to hit all the bricks which are arranged at the top of the screen. It was unpopular for over a decade, before Taito revived it with some new ideas in this arcade game. The game's plot redefines the bat as a Vaus spaceship, the ball as an energy bolt, and the bricks form a mysterious wall stopping the ship from progressing to safety. By the mid-80s, power-ups were popular in most types of arcade games, and Arkanoid features them. They are caught by positioning the bat below them as they fall (meaning that you risk missing the ball if you go for them at the wrong time). The power-ups include lasers (which are mounted to each side of the ship and allow you to shoot out the blocks), a catching device (so as to be able to fire the ball off at a different angle every time you hit it) and one that slows the bolt down.": "",
  "Unlike Activision's earlier remake of an Atari arcade classic, Battlezone, this one stays close to its namesake. Take the original, Atari coin-op game Asteroids, add in the features of the Atari 2600 cartridge, then give it 3-D graphics and a bunch of power-ups, and you've got Activision's Asteroids remake. You are an employee of the Astro-Mining Corporation. Your mission is to simply go to an assigned area of space and clear the area of asteroids and the occassional debris. The game consists of five zones, each with a different background and some with special features. Each zone has 15 levels. In addition to the standard asteroids, there are also mined asteroids that explode; indestructible asteroids that are, well, indestructible; fireball comets; crystal asteroids that regenerate; alien egg asteroids containing deadly baby space worms; and ancient energy asteroids that shoot back! And there's plenty of enemies in addition to the asteroids, such as Standard and Super Saucers, Asteroids Tugs, Fuel Transports, Hexes, Nuke Drivers, and Vulturoids. There are three types of ships to choose from, each with different strengths and weaknesses. There are also three skill levels. If you beat the game at Expert or higher, you gain access to a fourth type of ship. All ships features the standard laser, shield, flip (instantly flips your ship 180 degrees), and hyperspace. There are also limited power-ups you can pick up such as GunSat, Mines, Homing Missiles, Plasma Drill, and Trigger Bombs. The game supports either one or two players. In two player mode, the object is to simply outscore your opponent in a random zone and level. You cannot directly kill your opponent by shooting him, but there are other ways.... Lastly, if you shoot the classic-style asteroid in level 15 of the first zone, you'll find the option of \"Classic Asteroids\" now appearing on the main menu.": "",
  "Autoduel is a hybrid game based on Steve Jackson Games board game Car Wars. It incorporates elements of role-playing, driving and action-based combat. The game is set in a futuristic version of USA, where gangs and vigilantes rule the wilderness, and people's only protection are armored cars with mounted weaponry. The player is cast in the role of an average person who must at first earn enough money to buy an own car, and then perform courier missions throughout the country. The game's progression is fairly open-ended: the player is free to visit different cities, explore highways, participate in car Arena battles to earn money, take on gangsters in the wilderness, salvage car parts, etc. A few courier missions must be completed in order to advance the story. The player can construct and customize vehicles using guns, mine-layers, smokescreens, oil slicks, rockets and other accessories, choosing between various body and chassis types for the car. The entire game is viewed from a top-down perspective.": "",
  "A simulation of WW2 air-warfare in which the player flies a B-24 as part of the 460th Bomber Group missions to Ploesti in Romania. The game operates on several levels, and the player will be required to act as a pilot, copilot, navigator, engineer and bombardier at different stages of each mission. The performance of your B-24 influences the effectiveness of your Group, Wing and ultimately the Air Force itself. B-24 is a simulator with a difference - you control your bomber (and the Group) from a top-down perspective rather than from a 1st person perspective.": "",
  "The Bard's Tale II: The Destiny Knight is a fantasy role-playing video game created by Interplay Productions in 1986. It is the first sequel to The Bard's Tale, and the last game of the series that was designed and programmed by Michael Cranford. The game features Dungeons & Dragons-style characters and follows in the footsteps of its predecessor, The Bard's Tale, also created by Michael Cranford. The Bard's Tale II takes place on a larger scale with an explorable wilderness, six cities, and multiple dungeons which give this game its dungeon crawl character. The game has new features such as casinos and banks, and introduces a new magic user called an Archmage, among other changes from the first game in the series.": "",
  "The TurboGrafx-16 version of Batman: The Video Game is a top-down maze-like game, somewhat similar to Pac-Man or Bomberman. The game consists of five stages based on the movie: the Streets of Gotham, Flugelheim Museum, AXIS Chemical Factory, the Parade and the Cathedral, where Batman finally faces the Joker. The first four stages are divided into 12 sub-stages or mazes. Each main level has its own objective, which basically consists of finding items in the mazes: collecting \"smilex\" components in the streets of Gotham, cleaning paintings at the museum, planting bombs at the factory and cutting off the ropes of Joker's balloons at the parade. Before each level, a cutscene with scenes from the movie is displayed. Batman can attack his enemies with his Batarang. Through the levels, he will collect items which will upgrade his speed and give his Batarang a longer range and multiple shots.": "",
  "Battalion Commander is a real-time tactical (platoon/company level) simulation of modern warfare. The player is put in the role of a lieutenant colonel in charge of an entire armored battalion of either U.S., Soviet, or Chinese army. A combination of 5 scenarios and 40 maps of varied terrain (rivers, hills, minefields) is available, as well as infantry, tanks, APCs, artillery, assault guns, and other units. The commands are issued by pointing a spot on the map with the cursor (using the joystick) and then pressing a key combination selecting which company/platoon has to perform what action (these include fire support, smoke screen, laying bridges, digging in, etc.). A handicap can be chosen for either side to adjust difficulty.": "",
  "June 6, 1941. The start of D-Day. Depending on your choice you will either lead or face the largest amphibious force ever assembled. As the Supreme Allied Commander your job is to establish beachheads on Utah, Omaha, Juno, Gold and Sword, consolidate them, then move out to capture the strategic towns of Cherbourg and Caen, the roadnet at St. Lo, penetrate as deeply as possible into the continent and destroy and disrupt enemy formations. As the German Commander your hope for victory is to deploy your land forces and powerful panzers and contain the enemy and drive him back to the beaches. Either way you have until noon on June 30th (25 days) to accomplish your mission at which time your position will be evaluated. This game provides for solitaire play as the Americans and provides the player with several levels of difficulty.": "",
  "Battle Group is the sister game to Kampfgruppe but covers platoon level tactical combat on the Western Front from 1943-1945. This game includes practically all ground weapons used by Great Britain, US and Germany during this time frame. The game may be ended at any time but will automatically end after 30 turns. A game may be continued beyond its normal limits. At the end of the game victory points will be calculated to determine the margin of victory.": "",
  "Battle of Antietam is a grand tactical simulation of the bloodiest day of the Civil War at the little town of Sharpsburg, Maryland along Antietam Creek. The game is played in 11 turns each representing 1 hour of real time. Players are awarded points based on casualties and territorial objectives. At the end of each turn and the end of the game points are calculated and compared to a chart which determines your level of victory. The game can be played under 3 different sets of rules (Basic, Intermediate and Advanced) with 5 levels of difficulty for each and can be played against another person or the computer can play either side.": "",
  "Battle of Hoth is a Star Wars themed 1-player arcade game for the Apple II. Three columns of Imperial AT-AT walkers walk inexorably from the right of the screen towards the Rebel defensive positions on the left. The player controls a Rebel snowspeeder, which travels from the left to right of the screen, and can fire horizontally to the right. The player can move the snowspeeder vertically up and down, and must avoid fire from the AT-ATs and shoot them down. Whenever an AT-AT is destroyed, a new AT-AT immediately appears to the right of the screen in that row. The player's goal is to survive for 300 seconds to allow for the evacuation of Rebel forces. If an Imperial vessel reaches the left of the screen, the Rebel forces are routed, and the player loses the game. The player starts with a total of 9 snowspeeders, and if all are lost to Imperial fire, it's game over.": "",
  "Battlefront offers corps-level command of embattled Axis and Allied forces in World War II. As corps commanders, players issue orders to up to a dozen regiments, which then attempt to comply in the face of deadly opposition. Your objectives and timetable are already set; with an overview of the battle, you decide the roles which your regiments will play in attaining those objectives, while maintaining supply and command lines to keep them moving. Turns represent six hours, in which you make your decisions, combat is resolved, and troops move. Map terrain resolves to square kilometers, controlled by individual battalions. There are fourteen types of battalions, from artillery to infantry, with varying levels of experience and morale. The battalions, however, are not yours to command; you can only issue orders to their regiment, whose commanding officer decides the best tactic depending on his skill, the terrain, and enemy pressure. To receive your orders, the regiments must be connected to their divisional commanders. Orders are nuanced versions of attack and move, selected from short menus occupying the bottom quarter of the screen with terrain and unit information. The rest of the game screen is devoted to a scrollable map showing all units and terrain, aided by an included map card for each of the four historical scenarios. While enemy movement is not invisible, intelligence on enemy units is dependent on contact and cover. Lines of supply are crucial not only for command, but combat effectiveness and reinforcements. Also key are air and naval support, factored in as off-map resources assigned proportionately among the regiments. Victory, however, comes solely from reaching and holding territory on schedule. Besides solitaire with scoring handicaps, two-player play is available, along with an observation mode in which the computer takes both sides. The game includes a complete scenario editor, unusual in that it enables creation of new terrain types, and even can be invoked mid-game. Four separate scenarios are provided: Crete (1941), Stalingrad (1942), Saipan (1944) and Bastogne (1944-45).": "",
  "Battles in Normandy is a turn-based wargame employing hex grids, built on the Battlefront engine. It deals with the 1944 Allied landing in German-occupied Normandy during the Second World War. The eight scenarios included are: Omaha, Utah, Sword, Cherbourg, Carentan, Villers-Bocage, Goodwood and Epsom. As with Battlefront the command scale is at the corps level. The battle system incorporates the factors of adverse weather and terrain, supply, experience and morale. A complete range of unit types is provided. Victory depends on seizing the key locations within the turn limit.": "",
  "Steam Store Description (from Ad Blurbs) From original BATTLETECH/MechWarrior creator Jordan Weisman and the developers of the award-winning Shadowrun Returns series comes the next-generation of turn-based tactical 'Mech combat. The year is 3025 and the galaxy is trapped in a cycle of perpetual war, fought by noble houses with enormous, mechanized combat vehicles called BattleMechs. Take command of your own mercenary outfit of 'Mechs and the MechWarriors that pilot them, struggling to stay afloat as you find yourself drawn into a brutal interstellar civil war. Upgrade your starfaring base of operations, negotiate mercenary contracts with feudal lords, repair and maintain your stable of aging BattleMechs, and execute devastating combat tactics to defeat your enemies on the battlefield. COMMAND A SQUAD OF 'MECHS IN TURN-BASED COMBATDeploy over 30 BattleMechs in a wide variety of combinations. Use terrain, positioning, weapon selection and special abilities to outmaneuver and outplay your opponents.MANAGE YOUR MERCENARY COMPANYRecruit, customize, and develop unique MechWarriors. Improve and customize your dropship. As a Mercenary, travel a wide stretch of space, taking missions and managing your reputation with a variety of noble houses and local factions.TAKE PART IN A DESPERATE CIVIL WARImmerse yourself in the story of a violently deposed ruler, waging a brutal war to take back her throne with the support of your ragtag mercenary company.CUSTOMIZE YOUR 'MECHSUse your MechLab to maintain and upgrade your units, replacing damaged weapon systems with battlefield salvage taken from fallen foes.PVP MULTIPLAYER & SKIRMISH MODECustomize a Lance of 'Mechs and MechWarriors to go head-to-head with your friends, compete against opponents online, or jump into single-player skirmish mode to test your strategies against the AI.": "",
  "Your mission is to infiltrate Nazi headquarters in disguise, find the bomb agents have hidden there, and plant it outside the door to Hitler's bunker. If you go in shooting everything in sight, a guard is bound to raise the alarm and it's unlikely you'll complete the mission. Use stealth and the occassional bribe to work your way to Hitler. You might have to kill a few guards, but think before you do. Oh, and did we mention you have to escape the way you came before the bomb explodes?": "",
  "In The Bilestoad, players control \"meatlings\" that hack and battle with axes and shields from a top-view perspective. The name is derived from the German words Beil (axe) and Tod (death). The odd spelling reflects Goodman's idea of a future language similar to A Clockwork Orange's Nadsat in which English has been modified by the borrowing of foreign words. Although the game may seem medieval, the backstory in the manual explains that the axe fighting is actually a future virtual reality game designed to reduce real violence.": "",
  "In Black Magic your job is to move a little wizard using the joystick and collect up the diamonds in the upper and underworlds and fill baskets with them and then successfully find the exit to the level. Besides the standard blue diamonds, if you happen to collect a green diamond, the enemies stand still momentarily. A four-carat diamond counts as four diamonds which happens to be the maximum number of diamonds that you can carry, which makes it much faster than collecting them individually. Either find your four diamonds and exit or stay and eliminate all of the enemies before exiting the level. Collect helpful extras along the way to make your job easier. A shovel to help clear the way. A shot to destroy your enemy with one shot. A special shot will allow your shots to keep rebounding of the walls until they hit an enemy or until you intercept the shot. Lightning to destroy enemies to your right and left. Like fruit? A strawberry gives you an energy boost, a grape gives you 40 bonus points, while an apple can destroy an enemy if you are able to get it to fall on top of them. Are you up to the challenge?": "",
  "Bomb Alley is an operational level wargame built upon improved engine from Guadalcanal Campaign. It focuses on the battles between the British and Axis air, land and naval forces for control of the Mediterranean and North Africa in 1942, during the World War 2. There is a campaign game covering June 11 - August 31, 1942 and short scenarios covering the invasion of Crete in May 1941 and Operation Pedestal in August 1942. Each game turn represents the passage of 12 hours. A game turn consists of reinforcing your troops, moving troops into position, launching air missions and combat resolution. The map is a 40x40 grid representing the Mediterranean area. Victory points are computed at the end of each game.": "",
  "Borrowed Time is set in mid-1930's. The player assumes the role of a private investigator named Sam Harlow, who has to solve the kidnapping of his ex-wife Rita Sweeney. At the beginning, he runs away from two thugs, who want to kill him for an unknown reason. They fail, and he begins to search the town for clues, asking its inhabitants for information. But if the player makes a wrong move, Sam dies - killers come from nowhere and murder him... The player has to type in combinations of verbs and nouns to make an action. Locations are described in text form and presented by pictures, the latter often providing additional information not contained in the text description.": "",
  "You are Rockford, and you have to dig through monster infested caves in search of diamonds. In each level you must collect a certain number of these diamonds, in order to open a portal to the next stage. Enemies can be squashed by falling boulders, which are released when the ground below them is removed or they are pushed onto empty ground, but be careful because these can also squash you. In later levels, difficulty is increased by many puzzle elements and shorter time limits. There are 16 levels to be completed and five different skill levels available, which affect the number of jewels which must be collected and the time limit.": "",
  "Breakthrough in the Ardennes is a detailed regimental/brigade level simulation of the Battle of the Bulge. As the German Commander you win victory points by taking towns, exiting units, destroying American units and controlling specified road hexes and lose victory points for losing units and having a greater percentage of units destroyed than the Americans. When the game ends the German score is calculated and the level of German victory or American victory is displayed. The game covers 12 turns each covering a full day of operation. The game can be played solitaire as the American forces.": "",
  "Broadsides is a tactical simulation of ship-to-ship combat between sailing ships of the Napoleonic era (late 18th and early 19th Century). The game can be played as two different games. The first game is an arcade mode where you can sail right into the action, set your course, maneuver, and fire your guns as fast as your crew can load. For authenticity and historical detail, the tactical game puts you on the quarterdeck where you will make all the decisions real captains had to make. If you wish to depart from the historical ships provided, you can design your own frigates and ships of the line from the keel up to rigging, arming and manning them. The game ends when either ship wins or at 6pm, whichever comes first. You will win if you sink the enemy ship, or accumulate enough points to force the enemy ship to surrender. You will lose if your crew size goes below one quarter of its original size or if 11 enemy crew members manage to board your ship and there are no standing friendly crew members occupying any of the first 10 boarding positions on your ship. If both ships sink, or no one wins by 6pm, the game is a draw. The game can be played by two players or against the computer.": "",
  "Bubble Bobble is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave... Bubble Bobble is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.": "",
  "Bug Attack is a colorful shoot-em-up where you are assaulted by dagger-throwing millipedes, ants, and med flies. The game looks similar to the arcade game Centipede, but plays quite differently. In the first waves, you are a spider in a desert surround by cacti. First the ants come at you, wandering back and forth randomly between the cacti and chucking daggers at you if you get under them. If you dispatch the ants, you get to fight the millipede, which advances row by row, not stopping for anything including the plants (or your spider). It also throws daggers from time to time as it advances. The third wave pits you against the deadly med flies, which dance in a line around the screen. If you don't shoot them fast enough, they start to break off from the group, dancing wildly and raining daggers down upon you. Finish this last wave and you get bonus points for the amount of fuel you have left and get treated to a small interlude where a chorus of bugs sings to you as a med fly pollinates a flower. The second and third levels are similar to the first, except that they are tougher. The second wave takes place in a clover patch and the third wave puts you in the flower garden. The second and third waves also have tough bonus levels at the end. Once you finish the flower garden you begin all over again back in the desert, but the enemy is much more numerous and difficult this time around.": "",
  "Carrier Force is an operational level game featuring combat between American and Japanese forces in 1942. The game was later updated as Carrier Strike. There are 4 scenarios covered in this game, Midway, Coral Sea, The Battle of the Eastern Solomons and The Battle of the Santa Cruz Islands. Every major warship and plane is accounted for and accurately detailed. Each game turn represents one hour of action. The computer handles all the administrative chores while you give the orders and plot strategy. The game can be played by up to two people or in solitaire where the computer plays the Japanese. At the end of the game victory points are determined and the Japanese points are subtracted from the US points and compared to a table to determine the victory level. The game is advanced level and the playing time is 3 to 10 hours.": "",
  "Cartel$ & Cutthroat$ is notable for being one of the first business sims in existence. 1-8 players compete for profit in this simulation of cut-throat competition that is a simulation of the basic tenets in finance and economics. Understanding these concepts is key to winning the game, which involving setting your production level and price where marginal costs equal marginal revenues, borrow funds when prime rates are low to expand, and minimize cost per unit. You must also pay careful attention to the state of the economy and consumers' tastes, both of which change constantly. If you're unsure of what to do, your advisor in the game will guide you in the right direction.": "",
  "In this game, the player takes control of a lone prisoner who has been taking captive in a large castle occupied by the Nazis. Getting out of the cell and picking up a weapon is just the beginning; the ultimate goal is to acquire the war plans of the Nazis, and escape from Castle Wolfenstein alive. Castle Wolfenstein is notable for being the first game that incorporated stealth-based gameplay mechanics. The player navigates the hero through the top-down corridors and rooms of the castle. The main gameplay challenge lies in dealing with the guards who patrol the castle and will be alerted to any noise made by the player. It is possible to shoot the guards, but the ammunition in the game is scarce, and some guards are very hard to kill, so the preferred course of action is moving without being noticed. If the player surprises a guard with a gun drawn, the guard will surrender, and the player will be able to frisk him for valuable items. The player should also search the treasure chests scattered across the castle. Some of them contain war plans, which are essential for winning the game; others have useful items, such as bullets, grenades, bulletproof vests, and guard uniforms. The uniforms can be worn for disguise; however, higher-ranked SS guards will be able to recognize the intruder. Chests might also contain food and beverage; imbibing alcohol will result in a temporary loss of aim and balance for the player character. The game's sound effects include some of the earliest examples of digital voice samples. The guards would sometimes shout out short phrases in German in an attempt to stop the protagonist.": "",
  "The War of the Lance is over, the dragon armies have been defeated. But evil has not left Krynn. In northeastern Ansalon, outposts of the Knights of Solamnia remain to guard the fragile peace. Your party of adventurers is hired to carry out missions for the Knights. On your first mission, you stumble upon Draconians, long believed to have left the area. What are their plans? On your travels you have to face dangers in many dungeons and towns and might even meet some of the legendary Heroes of the Lance. Champions of Krynn is the first of SSI's \"gold box\" games set in the AD&D world of Dragonlance, with all the usual features: first-person view and movement in dungeons, towns and outposts, overland travel on a map of the area and tactical turn-based combat from a top-down perspective. As the first game set in Krynn, it has several features unique to that setting: In character races, one can choose from Kender, Silvanesti or Qualinesti Elves and Mountain or Hill Dwarves in addition to humans and half-elves. Special character classes include Solamnic Knights, clerics of the major deities of Krynn and mages of either the Red or the White Robe. The deities grant special spells and powers to their respective clerics. Red and White mages have access to different spells and the phases of the moons of Krynn affect their spellcasting abilities.": "",
  "Chivalry is a medieval-themed computer board game where players must rescue the King from the dreaded Black Knight. The game is set up as a standard board game for up to four players. Each player must take turns and roll the dice or spin the wheel to move the player in that set number of spaces. There are 35 spaces with over 40 challenges in total where each player must take part in a arcade-style mini-game challenge or make a decision based on the choices given. The tasks range from catching flour bags in a cart, finding the secret to evading a troll, or choosing the correct door to enter from a Wizard. Players are also given the option to take the high road or the low road in their travels, which also determines the challenges found. Depending on when players land on a space, random elements can affect the outcome, some helpful, others harmful. Winning the challenge determines whether the player will proceed further along the board. Losing a challenge can set a player back or lose a turn. The game is won when the player successfully beats the Black Knight by climbing the tower and saving the King.": "",
  "Choplifter! is a side-scrolling action/arcade game that puts you in command of an attack chopper. Your mission: Go behind enemy lines and rescue up to 16 hostages per level. Be careful, though, because tanks and enemy aircraft will try to stop you - and they won't stop shooting while you are rescuing those hostages! Originally released for Apple II home computers, Choplifter! was later ported to the arcades and a number of video game consoles. Many imitators and homages would follow.": "",
  "In Chuck Yeager's Advanced Flight Trainer you have the chance to test pilot 14 different airplanes, such as the Bell X-1 and the Lockheed SR-71. It features 10 different viewpoints both inside and outside of the plane, with a zoom of up to 256x, and different aerodynamics for each plane. You can do different things with the planes, from racing against a computer opponent, to practising formation and stunt flights. You can follow the testing and development programme through its evolution. There is a \"black box recorder\" to replay your flights, and analysis of your performance compared to an ideal one.": "",
  "Colonial Conquest is a grand strategy game set during the late 1800's and early 1900's that puts you in charge of one of the six Imperialistic powers of the time (Great Britain, France, Germany, U.S., Russia and Japan). Using diplomacy, espionage, armies and fleets, these six countries vie for control of more than 120 minor countries and each other. Your goal in the game is to conquer as many minor nations as possible and set yourself up as the mightiest ruler on Earth. There are three scenarios, and up to six people can play each as a separate nation - or the computer can take charge of all the other nations.": "",
  "Computer Air Combat is a simulation of aerial warfare during World War II. Players can choose from flying American, British, German or Japanese aircraft in a variety of different air combat missions. The game is played in a series of turns until all aircraft on one side are destroyed or the engagement is terminated by mutual agreement. Players take turns during the movement phase and then in the combat phase. During each turn you can check the status report and position report. Position reports display position and speed of friendly aircraft and all visible enemy aircraft. Status reports are for checking damage to aircraft and ammunition supplies. Final results of each game are displayed after all the enemies have been destroyed or you quit the game.": "",
  "Computer Ambush (Improved Version) is a computer tactical simulation of squad vs squad combat in France during World War II. You are a Sergeant and command a squad of 10 infantrymen (either American or German). Each man has a name, personal background (dossier), and comes rated with individual critical combat skills. You can also rate the soldiers to your own specifications for more flexibility. Computer Ambush is played as a series of turns until either one side is destroyed or one or both sides have completed their missions.The game can be played as two player ( 7 scenarios) or computer as opponent (5 scenarios). The game is advanced level and takes 1 -3 hours to complete.": "",
  "Computer Baseball is a game of both strategy and statistics. Managers manipulate pinch hitters, infield positions, relief pitchers and base runners. 28 major league teams are provided to choose from and data for new teams can be entered as well. Starting the game, you have four options to choose from: playing a game against the computer, playing a two player game, entering data for a new team and reviewing or editing data in an existing team data file. The display screen will consist of a scoreboard, batter and pitcher status information, and a representation of the playing field. The bottom of the screen is used for inputs on actions being taken. There are seven different defense actions to choose from: setting the infield position, setting the outfield position, how close to hold base runners, making pitching changes, making a defensive substitution, saving the current game status and how to pitch to the batter. Some of the defensive actions taken will branch out to further options to select. There are three different offense actions to choose from: selecting a base running strategy, putting in a pinch hitter and choosing how you want the batter to hit the ball. Selecting any three of the offense actions will branch out to further options to select. Player injuries are possible during game play, which the computer will specify while also determining how long the player will be injured (in days). It is also possible for a player to be ejected from the game for arguing with the umpire. On the event of a player being injured or ejected, the computer will ask for a substitute player. If a pitcher throws too many innings in one game, he will begin to tire, and another pitcher must be warmed up. Bringing in a pitcher who isn't warmed up in the bullpen properly will reduce his effectiveness. Before the game begins, you can stipulate which players and pitchers on each roster are unavailable for that game. There is no functionality to save statistics or game results.": "",
  "A naval combat wargame recreating the hunt for the Bismarck, fit onto the Apple ][ platform. The entire North Atlantic was displayed in garish HiRes color. The computer played the elusive German battleship, while the human player deployed forces to locate, pursue, and destroy it.": "",
  "Computer Quarterback is a real time strategy simulation of NFL football. There are three ways this game can be played. In the semi pro version, there are 18 offensive plays and 14 defensive plays. In the pro version, there are 36 offensive plays and 24 defensive plays. In the computer version, you play against the computer team called The Robots and this version plays the same was as the semi pro version. With this game you will have to name your own team and draft players with the money you start out with. There was an optional team disk you could order through the catalog that came with this game. The team disk has NFL teams you can choose from instead of creating your own.": "",
  "It is the year 2500 and the galaxy has been at peace for many years. Until now! A fleet of planet pulverizers has invaded the sector of the galaxy under your command. Reports are telling you of a massive wave of destruction. It is up to you to rid the universe of this threat of utter destruction. Conflict 2500 is a strategic simulation of conflict in the 26th century. The game can be played solitary or with up to 10 other players by giving command of ships to individuals. The computer controls a fleet of planet pulverizers and adapts its strategy to your actions. The game can be stopped during play or can continue until one side or the other is destroyed.": "",
  "Conglomerates Collide is a game of multinational corporation management. Or basically, a monopoly sim. You take the role a high-ranking executive in charge of company acquisitions and your objective is to acquire the most companies in the market in order to propel you to the role of chairman of the board and defeat the opposing corporations. You start the game with a base capital of 20 million dollars and through each turn you must decide whether to swallow companies or not depending on their current worth, which is determined by the ever changing market conditions. The trick is that you are not alone in the game as other corporations are on the hunt to acquire successful companies and it's your job to grow enough each year/turn so that you can take the poor workers away from the other corporations and ingest them into your own money-making monsters instead of the other way around. Remember! This is a game of multinational conglomerates so the bigger and badder the better. Features 3 modes of play: single player, vs computer and vs human opponents (up to 4-players hot-seat). Uses a simple text-based interface with small still graphics to commemorate events such as acquisitions and such.": "",
  "Congo Bongo is an arcade platform game similar in many ways to Donkey Kong, but with an isometric perspective. The player takes control of a safari hunter who is searching for an ape named Bongo, determined to punish him for setting the hunter's tent on fire. The game consists of four one-screen stages, each with an objective to jump on platforms and reach the top. Various animals will try to stop the protagonist: for example, in the first level a large gorilla throws coconuts at him. The hero has no offensive abilities and must jump or otherwise avoid enemy attacks. Stages may contain obstacles or hazardous spots that would kill off the main character.": "",
  "Conquest is a variant of Joust. The player starts with four lives and controls a giant bird (bigger than in Joust) in the prehistoric age to battle pterodactyl warriors. The giant bird has the ability to run and to fly by constantly flapping its wings. Defeating pterodactyls is done by slamming into the pterodactyls (which bears no visual resemblance to actual pterodactyls) from a higher altitude; a lower altitude will result in death, while vertical altitude will result in the player and the pterodactyl bouncing off each other. Successfully slamming from a higher altitude will turn the pterodactyls into eggs, which may bounce away, as well as award the player with points. Additional points may be gathered by collecting these eggs. The game is divided into different rounds which will introduce more challenges: additional pterodactyls, which will spawn at any one of the eight green spawning areas; the lower ground will disappear and introduce wind current affecting the gravitational velocity of all moving objects in the game; the default six platforms may also change into fewer platforms; and an indestructible dragon may occasionally appear, resulting in instant death when collided with.": "",
  "In Countdown to Shutdown, also known as Countdown to Meltdown, you control eight droids on the mission to find the core room of an nuclear power plant, in which a serious explosion has caused large casualties. The game is an arcade-like 3D adventure, you see always only the room your droid moves in, in the bottom of the screen you receive information like actual core temp and radiation level, time remaining, the direction you heading for, information about your shield level and others . Once you found the core room you must attempt to damp down the reactor temperature to avoid a major catastrophe a second explosion will cause. With the joystick you control all 8 droids, you have to switch several times between them because of the fact, that each of them has a special ability (like scientific, medical, technical, combat, intelligence, power, strength and mobility). Over 2.000 rooms on 8 levels waiting for you. Examine all rooms (press \"E\" on your keyboard) for useful and often required items and valuables (like weapons, medical or technical tool sets) - each of your droids is able to keep 8 items in his inventory. Beware of radiation (the closer you get to the core room, the more it increases, before entering the core room you need to find and activate radiation shields), defense droids which were installed to keep out intruders (like you!) and Plasma. Because of the first explosion some doors between rooms were blocked or damaged: Find the needed technical tool sets for example to fix such issues. Once you have found the core room, use the abilities of your different droids and the - hopefully found - correct tools to damp down the temperature and stop the disaster.": "",
  "Cricketeer is a Frogger variant where the player takes control of a cricket that like in the arcade original first has to cross a heavily trafficked street and then a river before jumping into one of five home boxes on the far end of the river. Unlike the arcade game the street and river sections take place on separate screens. A level is completed when all five home boxes are occupied by crickets and the game then moves on to a higher level. Lives are lost after being hit by a vehicle or jumping into the river and when they are all gone the game is over.": "",
  "Le crime du parking (The Crime of the Parking Lot) is a French text adventure where players need to investigate the death of the young woman Odile Conchoux. She is found in the parking lot of the supermarket where she worked, naked and inside a trolley. The game screen consists of a graphics area near the top, and a text area with a prompt near the bottom. The player needs to search the environment for clues and talk to the different characters to discover a lead. The game manual include a map of the different locations to make navigation easier, as well as a list of all the characters.": "",
  "Crisis Mountain is a classic platform game. Your task is to defuse bombs left by terrorists in mountain caverns when a dormant volcano above starts erupting unexpectedly. Time is limited as the bombs are ticking towards detonation. It contains nine levels of play.": "",
  "Crosscountry USA is an educational game for ages 10 and up, and the first in the Crosscountry series created by David Vincent. The player drives a 18-wheel truck picking up commodities across the United States of America and delivering them to their destination. Along the way, players learn geography skills, and the relationships between time, distance and money. The game responds to the player?s typed-in commands and includes a printed map of the United States of America.": "",
  "In this adaptation of the arcade game Targ your job is to defend your city from marauding alien beasts. You can simultaneously maneuver your craft and shoot in four directions while patrolling the regular grid of streets - the enemy has surrounded your city block, and attacks are coming in from all sides as the aliens swarm in with all guns blazing. To survive, you'll have to blast your way out by darting in and out of the line of fire and taking down the assailants with your own volleys: once they're all eliminated, you go forth to the next level, to face yet another wave. Ammunition is limited, and from time to time you'll have to restock by picking up a fresh supply. Every level contains four bonus crystals: as time goes by, they emerge one-by-one to be picked up, and each is worth twice as much as the last. The game starts you off with three ships, though you get a fresh one for every 5000 points you score.": "",
  "The first of the Command Series of tactical wargames released by MicroProse in the mid-1980s, Crusade in Europe is the descendant of Meier's first wargame, NATO Commander. Sid Meier and Ed Bever, Ph.D., collaborated on Crusade's design, which (along with the game's manual) shows an enormous amount of research and attention to historical detail. As the title suggests, the game's focus is the European Theater of World War II in 1944-45, and the Normandy Invasion in particular. Although there are only five scenarios, each can be customized through multiple variants (with different initial deployments and reinforcement schedules) and levels of difficulty. Another nice feature is the ability to play using either traditional boardgame symbols or unit icons. Both sides (Allied and Axis) can be played, and two players can play head-to-head in hotseat mode.": "",
  "The Crypt is a single player adventure game in which the player explores a series of dungeons collecting treasure and battling monsters. The game is entirely controlled via the keyboard and has six levels, each level protected by a password. The objective of the game is to locate the Sacred Crucifix and return to the first room. The password for the first level is supplied both within the game and in the documentation, the password for the level two is supplied at the end of the first and so on. In each room in the crypt is a monster which must be disposed of. Once the monster is dead the player's sword becomes useless and must be disposed of, additionally, Satan is none too pleased at having his minions slaughtered and sends fire bolts to avenge them. When travelling between rooms in the crypt the game may take the player into the Blood Cell Attack phase. Here diseased bats descend from numbered positions at the top of the screen and the player must defend themselves against their attack by pressing the appropriately number key.": "",
  "Based loosely on the famed Greek character, Crypt of Medea is one of the earliest horror-themed games released for the Apple II series. The plot is simple: you are trapped in an underground crypt filled with a variety of ghastly creatures and traps, and you must find your way out before you become just another nameless corpse--just like the ones you encounter all throughout the maze-like mausoleum. Crypt of Medea is a Hi-Res adventure game with color graphics, using the simple two-word \"verb noun\" parser that was common in these types of games. In its heyday, it was panned for its graphic depictions of gratuitous violence, but seeing as such material has almost become a standard in today's games, one could argue that Crypt of Medea was fairly ahead of its time.": "",
  "Outside of the town of Tilverton, the party of heroes has been ambushed, captured and cursed with five azure markings called \"bonds\". These bonds have dangerous magical powers that can take control of the heroes at the most inopportune times. They must now search for the source of the bonds, and free themselves from the curse. The second in the Gold Box series of role-playing games, Curse of the Azure Bonds is a sequel to Pool of Radiance. The gameplay is nearly identical to that of the predecessor and other Gold Box games. Following the AD&D rules of role-playing, the player creates a party of characters (up to the maximum of six). Two new character classes (Paladin and Ranger) are added to the four basic AD&D classes Fighter, Thief, Mage, and Cleric, which were available in Pool of Radiance. Exploration takes place in pseudo-3D environments, from first-person view. Battles (random as well as pre-set) take the player-controlled and enemy party to a top-down battle screen. Commands are issued in turn-based fashion, and the player-controlled characters can freely navigate the battle field. There is also an overview \"world map\" that allows instant traveling between cities.": "",
  "You live on a small seaport island called Hardscrabble -- hardly the hip place to be. Working as a professional scuba diver, you have the chance to salvage a sunken treasure from one of four shipwrecks, earn the respect of all the old farts and become wealthy beyond all imagination.": "",
  "The first real-time strategy game in history, Cytron Masters was the creation of legendary designer Dan Bunten (later Danielle Bunten Berry). In this game, the contestants face off on a futuristic battlefield. The object is to destroy the opponent's command center. The game can be played with two players, or one player competing against the computer. CYTRONS (short for CYbernetic elecTRONic units) come in five types: Mines, Shooters, Bunkers, Commanders, and Missiles. Shooters are constantly scanning for enemy units in their three space range. They will fire at the closest target. The Commander unit can relay orders from you to all Cytrons within three spaces of its location. Missiles soar above the battlefield. When detonated over an appropriate target, Missiles can destroy up to four Cytrons at once. The battlefield is a 2-D grid. One contestant starts on each side. The main features on either end of the field are the Command Centers. The goal of each manager is the destruction of the opponent's Command Center. The players can use energy to create more Cytron units during the battle. The battlefield has eight Power Centers, and by occupying a Power Center a player will accumulate more energy. Ahead of its time in many ways, Cytron Masters used multi-thread software routines to enable all the units to move in real-time. It also included an interactive tutorial. Dan Bunten went on to expand his ideas from this game in his later work Modem Wars, published in 1988.": "",
  "A strategy/war game where you must defeat your opponents and take over their territories. You select one of four territories to play as and up to 6 players can play. The 'Gruds' play the remaining teams. The game takes place on an overhead map of the land, with each country's territories color-coded. Each turn you get more men, move them from territory to territory, and fight to take over new territories. The goal is of course to defeat all your opponents and the Gruds, and own the entire land.": "",
  "The Dark Heart of Uukrul is a first person perspective, turned-based role-playing game (RPG), where the player takes control of a party of four specifically classed adventurers: a fighter, a paladin, a priest, and a magician. The player may use a pre-generated party or create an entirely new party. Four adventurers are sent by the Western Council to defeat out Uukrul, a great evil that once defeated the Ancients, thought to be destroyed, to possible invasion to the Western Lands. The last party sent by the council was lead by Mara, and it has been 18 months since they have sent word. The council assumes the worst. Now these adventurers must infiltrate the underground city of Eriosthe, continue to the eastern end of Eriosthe, the heart of Uukrul's stronghold, and destroy the evil once and for all. The Dark Heart of Uukrul is a first person perspective, turned-based role-playing game (RPG), where the player takes control of a party of four specifically classed adventurers: a fighter, a paladin, a priest, and a magician. The player may use a pre-generated party or create an entirely new party.": "",
  "The player has to reach the flag on the top. The guard sends the cannonballs down, so you must jump over them. Cannonballs roll on the floors which have hatches, that open randomly. Also cannonballs fall on the swings, so you have to use them for climbing to the upper floor. Finally you must catch the balloon to make your way up to the flag and to the next level. Moving options available are up, down, left, right and jump.": "",
  "From a time when the best graphics a computer game offered were on the front cover of the box, Avalon Hill's Close Assault offers a hybrid computer/board game experience by enclosing cardboard counters and a playing board. The result, per the manual, is a \"visual impact... much greater than on even the best of computer graphics displays\" while freeing for the processor, \"a huge amount of limited resources\" normally used to manage the graphical interface. Those resources instead are devoted to accounting for every soldier engaged in the scenario, and fulfilling a dream of the era's simulation board-gamers: realism in what you know and when you know it. In Close Assault, your opponent's units appear on the board only when they are spotted by yours, their morale is only evident by their behavior, and only your experience will tell you the odds of success. This is a far cry from the usual board simulation experience, where you could pour over combat success tables and footnoted modifiers to judge exactly where the chances break in your favor, and use the morale markers on your opponent's front line to decide where to push. Close Assault's combination of three scenarios and three forces allows representation of a dozen different historical situations spanning northern Europe in World War II. Squad-level tactics are simulated on a common map showing a small village and three levels of topography. Commands are entered numerically or as single letters in response to computer prompts, as each player proceeds through six phases of hotseat turns -- units moving, firing, and reacting -- which represent two minutes of battle. As the computer kicks out the results of your gambles and guesses, counters come and go on the map, squads being spotted and routed or destroyed. In that way, the game is a genuine hybrid, flicking players' attention back and forth between the cardboard map and the computer screen. Units also come and go from your command: when they become demoralized or enter close combat, the computer takes over. Meanwhile, the manual comes straight out of the board-game simulation tradition, outlined by topic and case with occasional lessons in history and battle science, such as (regarding morale), \"beneath the surface of any organized army lies a terrified mass of men who long for home and peace\". The game experience would be limited to the standard armchair-lieutenant's view, but for a simple number noted on the squad record pad (an analog device to help the humans remember casualties, equipment, experience, and leader placement). The number represents you on the battlefield. Somehow, this simple mechanism effectively engrosses players in the course of the battle. If you become a casualty, the computer finishes the scenario for you while you watch, possibly even carrying your soldiers to victory if you left your sergeants well-positioned. Besides two-player hot-seat, solitaire is available, wherein the programmers put the computer's capable calculations to work on multi-turn tactics, nuanced with the historical characteristics of the opposing nationalities, from equipment to morale to battle tactics.": "",
  "Copts & Robbers is similar to the Atari 2600 game Adventure with the player guiding a character (represented by a white square) through a maze from a top down view. The maze is located below an Egyptian pyramid that the player has fallen into when looking for the tomb of the Pharaoh Tuttut. The aim of the game is to escape the maze and to do so it is necessary to locate and collect four jewels and a vase and return them to the vault room.": "",
  "Crime and Punishment is a courtroom simulation, where you play the judge. The emphasis lies on deciding the punishment, rather than if the person is guilty or not - that has already been decided. The aim is to receive as many Gavels as possible (out of ten), by choosing the same sentence as a judge. Cases range from perjury and theft right up to murder and rape. To help you make your decision, you can receive information about the crime. This includes the damage caused by the crime, the villain's background and personal circumstances, and his/her motive. Be aware that the more information you ask for, the less gavels you receive. The AI can sometimes produce surprising choices of sentences.": "",
  "Having simulated modern-day planes with Flight of the Intruder, and World War 2 with Overlord, Rowan brought World War 1 to life in this flight simulation. It is structured around an illustrated book with pilot biographies, all of which modify as the game goes on and events unfold. 150 missions are featured, each with fully inter-linked briefings. There are 13 different fighter planes to fly, both Allied and German (Fokker Dr.I, Fokker Eindecker, Fokker D.VII, Albatros D.I, D.II, D.III, Royal Aircraft Factory SE.5a, Airco DH.2, Sopwith Pup, Sopwith Camel, Sopwith Triplane, Nieuport Scout, SPAD VII).": "",
  "You have 12 hours to solve the murder of Mr. Marshall Robner. If it was a murder... Mr Robner was found locked in his library, dead -- from a lethal dosage of anti-depressants. Friends and family are calling this a suicide of depressed wealthy industrialist. As Chief of Detectives, you find something just doesn't smell right about this case. You go out on a quest to find a suspect, his motive, method, and opportunity. Difficulty Level: Expert": "",
  "Death in the Caribbean is an old-style text/graphics adventure. You are an treasure hunter on an unnamed Caribbean island searching for buried pirate gold. You'll travel through numerous locales, a tricky maze, and past fierce alligators on your way to the chest of Doubloons. Puzzles range from \"find object and apply to situation\" to a doozy of a cryptogram. As for mechanics, the graphic section of the screen draws itself in visible pen elements (i.e.: Outline then fill, move on to next shape). Below the graphics window is a simple command line with a tiny bit of room above for the brief written description of the area you are in. Like every good adventure game, the puzzles start easy and get more difficult as you progress, until they get just plain silly hard. Play time is about 30 hours. It comes on 4 disk sides, the front and back of two floppy disks. This game does not innovate upon the genre, and is built on the gameplay of its predecessors.": "",
  "The year is 2082, and post-World War III atomic radiation has reduced the world's population to less than 10,000. You've been captured by corrupt land barons, and must escape their robot-protected castle. You hop into a turbo-car, and must navigate the 2 miles of twisting concrete jungle that surrounds the castle in every direction. Hiding out are robotic Death Squad cars armed with laserquark cannons, which will attempt to hunt down the player, and destroy them. The robotic lasers are so powerful, they can slice through solid walls to destroy the player.": "",
  "The evil magician Drax is terrorizing the jeweled city and cast a spell over the beautiful princess Marina who is forced to obey him. From the lands to the north, a hero is sent to help the city and free the princess. He is Gorth, the strongest of the barbarian warriors. With his sword in hand, he has to beat eight of Drax's best warriors and at last the magician himself. He will fight them in the woods, on the mountaintop, in the dungeon... finally reaching Drax's palace itself. This is essentially a one- or two-player fighting game where you control a big barbarian and fight another player or a computer AI. There are several kinds of hits, and some hits take off half a point while others take off a whole point. Each player has six of these \"power points\". They also have a special hard to perform \"death sword\" which decapitates your opponent, killing him with one fell swoop.": "",
  "An Ultima style RPG with an oriental flavor. The Deathlord and his army of demons are destroying the land and Emperor Nakamoto has called upon you and your party to fight back and defeat him. There are 8 races and 16 classes to choose from along with a handy translation guide that tells you a Genkai is really a Wizard and a Ryoshi is a specialized Fighter. The 84 spells also have Japanese names but their effects will be familiar to any fan of European style medieval adventures. In fact, Deathlord even includes a utility to import and Easternize your characters from Bard?s Tale, Ultima III, and Wizardry. One other thing to note is that Deathlord is quite large. The quest itself takes place on over a dozen continents each with multiple cities and dungeons. According to the estimate on the package, it is designed to fill ?a few hundred hours? of the player?s time.": "",
  "Decision in the Desert was the second installment in the \"Command Series\" of tactical wargames co-designed by Sid Meier and Ed Bever and published by MicroProse in the mid 1980s. The game covers the North African theater during World War II. The design is essentially the same as in the first Command game, Crusade in Europe. Five different scenarios with multiple variants can be played. This, along with multiple levels of difficulty, gives the game significant replay value. Battles occur in real-time, though orders may be issued while the game is paused.": "",
  "Defender put players in charge of a ship sent to protect mankind from wave after wave of attacking alien forces. Armed with smart bombs and the ability to use hyperspace to move quickly around the planet, the player ship must fight against Bombers, Pods, Swarmers, Baiters, and Landers - that can capture the humanoids and transform them into deadly and relentless Mutants. Fail to save the humanoids from freefall or Mutant transformation, and the planet is destroyed.": "",
  "The land of Ymros was first encountered in Shard of Spring, and it returns in this follow up, which is viewed from above, but has a game-world 32 times the size of its predecessor. Your characters can include Humans, Elves, Dwarves and Trolls, each with different skills as well as generated and varying statistics, and one of 10 different character classes - Barbarian, Wizard and Scholar for Example. You will need to choose the right balance of these for your mission, which involves tracking down Malifon and gain revenge on the damage he has done to Ymros. Combat takes place via close-quarters combat and spell-casting, depending on the character's abilities. Towns can be visited to buy weapons, and you can return to your camp to worship one of the various Gods and receive their gifts such as resurrection and protection. It has also a 'skill/item' menu in which items can be used on other items to solve problems.": "",
  "Depth Charge is a single screen game where you must protect five battleships that sail on the top of the screen from an attack by enemy submarines below the waves. Each battleship is on screen on it's own and you move it either left or right, while the various numbers of submarines move left or right across the screen at different depths. The submarines will release various mines which head to the surface but you are armed with five depthcharges which move down the screen trying to hit the submarines or mines. If you hit a submarine, mine or the depthcharge hits the bottom of the screen then you are re-armed with another one. If you are hit by a mine then that ship is lost and the next ship appears. Before you start the game you can select your skill level 91-4) with one being the easiest.": "",
  "Dig Dug is a 1-2 player arcade game in which you have to use your shovel to dig your way through the earth. Stopping you from doing this are two monsters, called Pooka and Fygar, who will continually chase you around. The only weapon that you carry is an air pump, which you can use to inflate the monsters to the point where they explode. (if you start to inflate them but stop doing so, the monsters will get turned back to their normal selves). Furthermore, rocks are scattered throughout the earth, and you can use these rocks to squash them. If the monsters do not find you for several seconds, they will eventually get turned into ghosts, which are able to walk through the earth. They are invincible and cannot be killed. From time to time, vegetables will appear in the center, and you can get these for points.": "",
  "While on an expedition through time to the prehistoric past, Time Master Tim accidentally brings a case of European Measles to that era. He has to return the Dino eggs to the present time in order to save them from this epidemic. Tim has to face the dino egg predators, such as spiders and snakes which will contaminate the eggs. The mother of the eggs also lurks by, and if a fire is not built, she may just step in. Will you be able to save the dinosaur race from extinction?": "",
  "The Dnieper River Line is a fictionalized engagement between German and Russian forces in the Southern Ukraine in late 1943. As the Germans you are challenged to repel Russian efforts to breach your critical defensive position. The Soviet units controlled by the computer seek to over run your thin German defensive line and capture sufficient objectives to assure victory. Dnieper River Line is a computer game which is played out board game style with a 8\" x 11\" mapboard and 240 5/8\" illustrated counters.": "",
  "In spite of what the name might imply, Dominos is not an adaptation of the tile-laying game Dominoes, but in fact a multi-player Snake game. One player can take it up against the computer or play against another player. The snakes continuously increase in length, causing the screen to slowly fill up. The goal is to make the opponent run into something, which scores a point.": "",
  "Dragon Wars takes place in the magical land of Dilmun, an island of salvation perverted into a world of horror by Namtar (as you might expect - the bad guy). The player starts with a party of four in the city of Purgatory, equipped with nothing more than.. well - nothing. Worst of all your magic users won't help you out, either, because magic has been banned (to correct this unpleasing situation is one of your main objectives). Other main targets are surviving, getting out of Purgatory and toppling Namtar (maybe getting some decent clothing, one or two shiny swords and the like on your way out). Gameplay instantly reminds of the Bard's Tale series. Step-by-step first person 3D, opponents materialize out of the air. The combat system is turn based. Unlike its (spiritual?) predecessors the game features a full-blown skill system, auto-mapping and many places to actually use all these abilities. Reasonable distribution of your skill points is rather critical.": "",
  "You have recieved word from a messenger that the \"last dragon\" has been kidnapped. You hold the scroll in your hand and read that you must travel with a special companion named Hawkwind. Only with him and yourself can you save the \"last dragon\" from never seeing the light of day again.": "",
  "Dreadnoughts allows you to recreate all of the surface naval actions of the early years of WWII in the North Atlantic. The game is designed to be played on both the strategic and tactical levels by one or two players. In the single player game you will command the German Navy and attempt to wrest control of the seas from the British Royal Navy. Over 40 major ships are represented. You can recreate a historical battle or a what if scenario.": "",
  "Sneak through unique maze after maze gobbling white dots while being hunted by the Mega-Bugs. Their job is made easier because The Mouth you pilot leaves behind a trail of colored dots which they will follow relentlessly the moment they come upon it. This makes the maze's dead-ends truly treacherous. Your job is made harder by the size of the maze (20x20), which requires a magnifier over your location to show the action, effectively creating a blind spot at a radius of three dots around you. To succeed, you must watch not only where you're going, but scan each randomly generated maze to plan your route and avoid the Mega-Bugs. If you do succeed, you're rewarded with a new maze and an additional Mega-Bug hunting you. If you fail, the bugs dance gleefully and shout, \"we gotcha!\" This ROM cartridge game was clearly inspired, but not limited, by Pac-Man.": "",
  "Released in the arcades in 1981, Donkey Kong was not only Nintendo's first real smash hit for the company, but marked the introduction for two of their most popular mascots: Mario (originally \"Jumpman\") and Donkey Kong. Donkey Kong is a platform-action game that has Mario scale four different industrial themed levels (construction zone, cement factory, an elevator-themed level, and removing rivets from girders) in an attempt to save the damsel in distress, Pauline, from the big ape before the timer runs out. Once the rivets are removed from the final level, Donkey Kong falls, and the two lovers are reunited. From there, the levels start over at a higher difficulty. Along the way, Mario must dodge a constant stream of barrels, \"living\" fireballs, and spring-weights. Although not as powerful as in other future games, Mario can find a hammer which allows him to destroy the barrels and fireballs for a limited amount of time. Additionally, Mario can also find Pauline's hat, purse and umbrella for additional bonus points. Donkey Kong is also notable for being one of the first complete narratives in video game form, told through simplistic cut scenes that advance the story. It should also be noted that in many conversions of the original coin-op game for early 1980's consoles and computer-systems, Donkey Kong only used two or three of the original levels, with the cement factory most often omitted.": "",
  "Search for the king's stolen Magic Orb.": "",
  "Geopolitique 1990 is an economical simulation in which the player takes the control over the USA and tries to overcome the USSR. There are seven scenarios, one representing the actual political situation of 1984 and six hypothetical 1990 situations. The success of the nation is measured with three values: Gross National Product (trade), Prestige (politics) and National Security (military). Before each match, the player chooses two of these three values, and when both reach a certain number (depending on the scenario), the game is won. Or, well, lost if the AI was faster. The game does not simulate all countries in the world, besides the two opponents USA and USSR there are only 14 \"minor countries\" which mostly represent certain regions like Western Europe. Actually, the game consists of two separate programs. Geopol is the initial one and handles all the political simulation. The basic goal is to make treaties with the minor countries, as each treaty improves the mentioned victory values. Accordingly, there are trade, military and political treaties (along with a neutrality treaty which cancels all other treaties). Negotiations are everything, and the player is free to decide how much pressure is in order. But failing hurts the prestige and the willingness of the minor countries to negotiate at all. The second aspect is building up military presence over the globe. This is both necessary to keep the USSR at bay and improve negotiation positions. However, all this belongs into the political phase of each year. Before it comes to this, the player needs to think about the economy. Here, the player manages the production of the three resources within the USA. The minor countries also produce resources which are then divided depending on trade treaties. In turn, those resources are used to produce five kind of points which are (mostly) needed for the following political phase. Directly used to restrict the player's actions are Military Maintenance (needed to maintain existing units), Military Mobilization (producing new military units) and Political Action (needed to negotiate with minor powers), Military Capacity restrict the number of units which can be mobilized in each year and Industrial Capacity does the same for the USA's own resource production. The player also has the possibility to wage war against one minor country to get all their treaties automatically. However, this has great effects on the world tension level (among various other factors). If it gets too high, political negotiations are thrown out of the window and the second program Geowar starts which is more similar to traditional wargames. The minor countries decide if they stay neutral or are loyal to one super power and a global war begins. Now the winning condition is simply to conquer and hold enough of the world first and each turn represents three months. Each round consists of the following phases: military buildup (using resource points, earned from loyal or conquered nations, to either mobilize new units, reinforce units or increase the USA's permanent resource points output), movement, management of air units and attacking. Obviously there is no going back when Geowar has been started.": "",
  "Based on the cyberpunk novel by William Gibson. In a grimy future, you play Case, a cyberspace cowboy who finds himself broke in Chiba City. Find yourself a laptop and the right software for it so you can hack into databases around the city to regain your access to cyberspace. Buy and upgrade brain implant chips to augment your computer skills, and sell your body parts to afford new technologies. When you get to cyberspace, you'll take on the nasty AIs that guard the most important databases. Within all this information is the bizarre secret of this world of inbred corporations.": "",
  "Your favorite Uncle, from whom you haven't heard from in years has just died. He left you a peculiar inheiritance: a painting of a beautiful woman. The following night, the painting is stolen, sending you on a world-wide journey to discover who has the painting, and why.": "",
  "Earthquake San Francisco 1906 is the fourth game in the Other Venture series, again by Jyym Pearson. This text adventure takes you back to April 19, 1906, San Francisco. One of the most violent earthquakes in recent history hit early that morning. Researched and historically accurate - the city is aflame, and you must escape and survive.": "",
  "The gateway to the New York Rocket Field is your first step of a space voyage in which you may choose one of three career paths to follow, here at the dawn of the interstellar Empire. Homesteaders must find a hospital planet on which to farm, raise a family and conquer the environment. Miners must find a high-density planet in a search for material wealth. Missionaries seek out populated planets to preach to the masses. Each path into the space frontier has its dangers, and a misstep may have bloody consequences.": "",
  "In starting Empire of the Over-Mind within a few short steps you are on a forest path with a red planet overhead, relishing the choice between a mountain trail and a cave. Adventure stretches out before you, forty characters of text per line, or maybe sixty. As in all text adventures, that particular stretch of forest path in Empire of the Over-Mind may become over-familiar before you get yourself to the right place with the right items to travel finally to the red planet. Empire of the Over-Mind departs from typical text adventures, though, in its movement. Cardinal directions are not used. Instead, one references the avenue of movement: the road, door, or even cliff-face which leads to the next location. Also unusual is the ability to look ahead -- e.g. down the road -- and see what is there before moving. The objects you see ahead can vary from game to game: sometimes the key glints enticingly while the skeleton hides in the shadows, other times you can only see the key if you bravely confront the skeleton. Menacing though the perils are, your mistakes are gently handled: even the crocodile only \"clobbers\" you. Typical of the era, the parser handles two-word verb-object combinations, or three words if an adjective is needed. Depending on the platform, item locations can vary from start to start, and getting clobbered means you have to hunt them all down again. Necessary clues are hidden in a long, printed poem which comes with the game. Avalon Hill's instructions are a fascinating artifact themselves. Besides the profoundly basic level -- covering the \"prompt character,\" the back-space key, and the exigencies of programming in 48K or less -- a memory map is offered. No simple \"Save\" command or hotkey here: a little assembly language saves the game state.": "",
  "You are a dim ignorant Apprentice Enchanter, but your task is enormous. You must save the world from the warlock Krill who is ruling the land with his evil powers. You are not the first in this quest but hopefully you will be the first to succeed, as the more experienced members of the Circle of Enchanters are powerless. You know the basics of magic and will have the chance to learn many spells. Keep your wits and use everything you can to your benefit! Enchanter is a text adventure set in the Zork universe, following the original Zork trilogy. As in the previous games, the player interacts with the environment by typing in text commands, usually combinations of verbs and objects. A new feature in the game is the player character's ability to cast spells. These spells must be memorized before the protagonist is able to cast them, and are learned during the course of the game. The text parser understands the names of the spells as verbs, and the player only needs to type in the spell name and the name of an object he/she wishes to cast that particular spell on.": "",
  "It's 1989, and there's good news and bad news. The good news: there's a spectacular meteor shower scheduled to light up the sky. The bad news: the meteoroids are bearing a rather deadly, virulent disease -- when they impact our planet, things might get ugly. It's up to you to contain the infection, and prevent mankind from getting its own museum display case, next to the dinosaurs. Your stint as head of the Global Disease Control Center lasts from 15 to 30 game turns (depending on the chosen skill level). One turn represents a day, and allows a limited number of actions: you'll be able to monitor approaching meteorites on the radar, target them with missiles before they hit, and enact emergency measures throughout the Earth's fourteen regions to curb the spread of the contagion. Disease statistics are updated on the world map on each turn, and various remedies can be deployed, ranging from vaccination, irradiation and body suits to genetic engineering, firestorms, and that perennial last resort... the nuke.": "",
  "This sequel to SSI's Wizard's Crown plays very much like the original. It's a fantasy RPG where you assemble a party of adventurers and explore a map. In this game, the world is being invaded by Demons coming in from a portal to another dimension, and your job is to find the one item that can seal the portal, The Eternal Dagger. Like Wizard's Crown, this game is notable for its detailed, tactical combat system. There was also a \"quick combat\" mode if you didn't want to spend the time in the tactical mode, allowing you to focus more on conventional RPG features such as exploration.": "",
  "Europe Ablaze puts hundreds of planes at your command to send out over the deadly skies of Britain, France, and Germany during World War II. Take the place of Reichsmarschall Goering or Air Chief Marshal Portal to plot campaign-wide priorities and set the tactical doctrines your fleet commanders must follow. Then sit back and helplessly watch the events of the day take their course: the successes, the devastation, and lost planes tallied for you tersely at the end of each day, like a report card on which the fate of your nation depends. If that's too much responsibility and not enough action, the role of fleet commander is available, too. To warm this seat, you need some real knowledge of air strategy. Plan night and day missions, approach vectors, and rendezvous. Balance wear and tear on your squadrons with the demands of your commander-in-chief. Select targets that maximize each squadron's skills and planes, but keep abreast of enemy flight paths -- your opponent has plans of his own. Up to twelve hot-seat players can split up the air command roles available in Europe Ablaze, or one player can take on all the roles or even leave everything to the computer to learn some strategy. Detailed hex maps included with the game lay out the targets in each scenario and provide a platform for planning the next day's strategy. The computer screen alternates between short menus leading to command and report screens, and a campaign-wide map on which the events of the day play out. Though the planning is turn-based, fleet commanders have access to \"run-time\" commands by halting the spinning clock which marks the progress of the day. Enemy strike plots can be examined, intercepts sent out, and patrols strengthened every five minutes if you like. Behind the scenes, accidents happen, crews gain experience, repairs are made, and the results are rolled into each day's report. Weather varies regionally and changes with the season and the hour. Ultimately, victory rests on destruction delivered; each air fleet commander is scored separately, and their contributions determine the commander-in-chiefs' scores, which decide the outcome of the scenario. A map editor adds complete design of new campaigns and a sample Mediterranean scenario.": "",
  "Evolution is an arcade style action game with six levels where you need to evolve from an amoeba to a human. Each level is a different stage in evolution with it's own unique goals. The first level is the amoeba stage where you need to eat all the DNA on the screen while avoiding the spores, microbes, and antibodies that are trying to stop you. The second level is the tadpole stage. The tadpole needs to eat three flies to move on to the next stage while avoiding the very hungry fish. Next is the rodent stage, where you need to eat five blocks of cheese while avoiding the snakes. In level four you need to guide a beaver across alligator infested waters to retrieve sticks and build a dam. The fifth level is the gorilla stage, where your gorilla has to use coconuts to fight off monkeys that are trying to steel its orange stash. And finally is the human stage, where you have to use a laser gun to fight off mutants that are trying to take over the earth.": "",
  "Expedition Amazon puts you in control of a team of 4 explorers on an expedition to map and study (i.e.: plunder) the ruins of the Incan civilization. Your team consists of a Medic, a Field Assistant, a Radio Operator, and a Guard. After equipping your team with all the necessary supplies (don't forget the mosquito netting!) you travel to your base camp at the edge of the jungle where you will begin your journey. You will quickly meet up with many of the hazards of the jungle as you explore, including hostile natives (hope your Guard is a good shot!), mosquitoes, disease, covered pits, wildlife, and more. Each of your team members has an \"EL\" rating which indicates how close he is to dying. Death comes quickly for new team members, but as your team gains experience by mapping more and more of the Amazon and Incan ruins, your EL rating goes up and your team members become quite a bit more effective at avoiding hazards. You also get an Efficiency Rating \"ER\" which is an overall score of your exploration completed and loot collected minus your money spent and the number of team members killed. Once you have mapped a few sectors of jungle you will find some ruins with passages leading underground. Underground is a lot more hazardous than the jungle, as many of the pitfalls you encounter mean instant death if you don't have the proper equipment or your team was not alert. The natives are also a lot more numerous underground as well. But don't worry, you can always replace members of your expedition. Besides, what does it matter if you lost your Field Assistant if the rest of your team is carrying out a bagful of gold and silver?": "",
  "Fastgammon is a computer adaptation of the board game Backgammon. The game follows the rules of the board game as can be expected with one player competing against an AI opponent, both attempting to move all their pieces of the board. It's entirely played with keyboard and to do a move the player simply enters the number of the starting point followed with the number of the destination. To move a piece of the bar the player enters B followed by the number of the destination point. To bear off a piece the player enters the number of the point followed by an H. Dice rolls are done automatically by the program (except for the Atari version where it's possible to turn on manual input of dice values). When starting a new game it's possible to reuse the dice rolls from the previous game.": "",
  "If you've ever dreamed of being in control of a wrecking ball, with blocks and blocks of defenseless buildings at your mercy, Fat City is your chance. You're placed in charge of the massive multi-ton instrument of metallic destruction, and get a first-person view of the proceedings as you gleefully unleash devastation on everything in your path. The playfield scrolls in four directions, and you proceed from city to city by mowing down every structure on the block (without running out of fuel). Evidently there's some resistance to the demolition plans, and various flying objects aimed at your vehicle attempt to convey the message. These will shorten your career if they hit, but can be deflected with a carefully-aimed swing of your wrecking ball. Fortunately, you can fill up your tank by finding fuel depots, so that the satisfying *crunch* of crumbling masonry may go on a while longer.": "",
  "Fax is a trivia game from Exidy. One or two players are asked multiple-choice questions that cover about four topics, including general knowledge, sports, history, and entertainment. There are more than 4800 questions and three difficulty levels. While players take the time to answer, two timers are shown. The timer at the top of the screen is shown as a bar and indicates the total time of the current round. The timer at the bottom of the screen consists of four digits, and indicates the score the player gets when they answer a question correctly. If this timer reaches zero, the player receives no score and the game moves on to the next question. The round ends when the top timer is empty. Depending on whether the player has enabled it, a cartoon is shown regardless of a correct or incorrect answer. This cartoon shows a person receiving either a dunce cap or graduation hat.": "",
  "Field of Fire is a historically accurate tactical game of WWII combat. You play the commander of Easy Company, one of the finest companies of the First Infantry Division. Your assignment is to lead Easy Company through eight of their historical battles in North Africa and Europe. The scenarios can be played separately (about 1-2 hours each) or can be played as a campaign (about 12-16 hours). There is a role playing element which allows you to change the name of each of your soldiers. Soldiers can also improve in skills from mission to mission. The enemy is directed by the computer and has three levels of difficulty.": "",
  "Fighter Command is a strategy game depicting the clash between the British RAF and German Luftwaffe during the 1940 Battle of Britain. The player is put in command of either air force: Germans need to strike British airbases, radar stations, and industrial centers in order to cripple their aircraft assets, while the Allies will try to defend themselves by wiping out the incoming Germans from the sky before they can reach the intended targets.": "",
  "As the Yellow tribe on a remote island, you must ultimately conquer every territory against your two rivals in this strategic God-game. The look has a very cutesy non-serious edge, and the whole feel of the game is casual. Your men fight with catapults and ride on horseback. You must keep some on guard duties, balancing this against how many you send off to attack other territories, in which case you must wait and see the outcome. You get more men as the game goes on, ultimately increasing the status of your bases, and this isn?t dependent on how many are kept back, unlike Megalomania?s breeding effect.": "",
  "Fortress of the Witch King blends strategy and role-playing. The basic premise is to build up an army to assault the Witch King's Fortress (think Mordor). Encounters are played out in text, but there is a map screen which gives an overview of the landscape. One must raise enough gold to hire wizards, warriors, scouts, clerics and raiders by defeating bands of roaming monsters and minions. In addition, a number of artifacts and special items must be found before entering the fortress. Up to four players compete in hot-seat play.": "",
  "Galactic Adventures is a sequel to Galactic Gladiators. This game blends role-playing and strategy elements in a science fiction setting. Players create characters from among seven races, explore a series of planets, interact with friendly and hostile aliens, shuttle personnel and cargo between worlds, take quests from guilds, pilot ships in space combat, and fight long, complex tactical battles. Successful adventures reward the player with money, equipment, experience, and increases in a wide variety of skills. The nominal goal of the game is to amass enough experience for \"Independent Adventurer\" status, but it encourages personal goal-setting, scenario-building, and open-ended gameplay.": "",
  "In this game you have to roam the space with your spaceship to conquer the universe. Progressing from one star system to another you'll discover new planets (friendly or hostile), engaging in space combat or conversation with other characters to further the plot. You are free to travel to wherever you please, but here the plot is much more linear, and you can't do much without running into the next event that triggers a plot advance.": "",
  "Early tactical combat game about humans and aliens duking it out with laser guns, melee weapons and special powers. Campy alien races included Viking warriors with horns, Denebian slime devils and space mutants with a killer touch. Much of the game would be spent watching the blinking words, \"PLAYER TWO IS PLANNING HOW TO DEFEAT YOU\".": "",
  "Galactic Revolution is the sequel to Galactic Empire and Galactic Trader and the third game in the Galactic Saga. The Central Galactic System is united under the rule of the emperor Tawala Mundo, but there's trouble brewing. Tawala's violent temper has cost many of his subjects their life. The military's support for the empire dwindles due to the popularity of the former fleet commander (and protagonist of the previous games), Julian du Buque. A growing bureaucracy makes times hard for trade and sees the rise of Jan Swart, leader of the Broederbund, a secret guild of traders. These three men now compete for influence and power in the galaxy, for a revolution is at hand. Galactic Revolution is a strategy game of political maneuvering and can be played by up to three players. A single player always plays du Buque; in two-player games the second player plays Tawala. Any remaining factions are controlled by the computer. The goal of the game is to control all 18 planets in the empire. Control over a planet is won through support of five power groups: manufacturers, military, peasants, traders, and bureaucrats. On each planet, a player's goal should be to increase the relative influence of those groups favorable to them while at the same time decreasing the influence of those favorable to the other factions. After a player travels to the planet in question, this is done through so-called \"administrative action\". For example, instituting a general draft increases the influence of the military but decreases the influence of the peasants and traders, since they get drafted. Other options are land reforms, lowering or increasing trade tariffs or taxes, reducing bureaucracy, and more. Besides the immediate effect on the power distribution on the planet, these actions also influence the galaxy-wide standings of the player to each faction. A planet falls to a player when a certain threshold of support is crossed, figuring in both local and galaxy-wide sympathies. At the end of each turn, planets under a player's control can be utilized to collect taxes, build ships and weapons and draft troops. These are necessary to build up one's legions: one legion requires one unit of arms, one ship and 10 troops. Taking administrative action is only possible on independent worlds or worlds not controlled by another player. While it is possible to take control by political maneuvering, there is also the military option. Winning the battle for a planet not only allows the victor to take local administrative action (temporarily), but also increases support from all power groups in the galaxy. On the other hand, losing a battle decreases support across the board. A planet's defender may choose to order a tactical retreat, in which case a loss has no influence on the power groups. Another option involving the military (which is not available in the single-player game) is the blockade. A blockaded planet cannot be used by its owner for collecting taxes, drafting or construction. The blockade must be broken by sending the same number of legions used to establish it, but troops used to make or break a blockade are always lost. Another political option is the alliance (not available in the single-player game). Allied players share their resource pool of ships, troops and arms, allowing for the forming of larger numbers of legions in the case of an uneven distribution of resources. Each faction begins the game with different starting conditions, requiring different strategies for play. Du Buque, for example, controls only one planet at the beginning, has strong support with the military and medium support with the traders, and has a large number of troops, but only relatively few ships, at his disposal. Tawala controls the most planets, has strong support of the bureaucrats but lousy support of the traders, very little money, lots of arms, but only a handful of ships. Swart has the most money and ships, but the fewest troops, and his support among both the peasants and the bureaucrats is low.": "",
  "Galactic Trader is the sequel to Galactic Empire and the second game in the Galactic Saga. The planet Galactica's forces have conquered the Central Galactic System, but with the new empire now established and at peace, the fleet commander responsible for the campaign finds himself without a job. Left with only a small personal ship, some fuel and a few credits, a career change from conqueror to trader is in order. The goal in the game is to amass the number of one billion credits within 1000 years. Profits are made by transferring cargo from one planet to another - the farther away a commodity is sold from its source, the more profit is to be made. Keeping with the absence of faster-than-light travel or communication established in Galactic Empire, it is impossible to know what a commodity goes for on a certain planet unless it is visited. While the ship computer keeps track of prices, these might be out of date when a planet is revisited. The prices follow a dynamic economic model of supply and demand. Finding a good trade route might invite to reusing it again and again, but there's a catch: if a big consortium gets wind of a profitable route, they can lay an exclusive claim to it, shutting it off from further use by the player. Flying around from planet to planet isn't free: an eye must always be kept on fuel consumption, which depends on distance traveled and the mass of the carried cargo. To avoid being lost in space when it runs out, fuel must be bought from the fuel cartel. They accept credits, but when cash flow is low, cargo can be traded in for fuel as well, but usually at less attractive rates. Bartering is also necessary on most planets, since only on Galactica cargo can be converted to credits. The game goal thus necessitates visits to Galactica from time to time, but this harbors another risk: the new emperor, jealous of the former fleet commander's popularity, might attempt to assassinate him. Each visit to Galactica increases the chance of an untimely death. The game interface is for the most part unchanged from Galactic Empire, but adapted to the new gameplay. The ship's console displays an image of the current locale, the current stardate, and statistics about cargo, cash and fuel. The ship's computer can be accessed to display the galactic map, give information about trading rates at planets already visited and calculate the fuel needed to reach the next destination.": "",
  "Galaxian is a shoot 'em up in which the player is at the bottom of the screen, with an arrangement of aliens at the top. The player moves left and right to aim at an alien, then shoots a bullet up the screen, and the alien it hits is killed. The aliens are classed as Drones, Emissaries, Hornets and Commanders, with those higher up the screen scoring more points when destroyed. At set intervals an enemy will move down the screen towards you, escorting a bomber, which is a moment of high danger. Clear a wave and another is generated.": "",
  "Gauntlet is an action game where players choose characters and fight their way through hordes of enemies that assault them on the way to the end of the level. One or two players must make their way through 100 levels of mayhem and magic. The game features a choice of four characters to play with, each with different weapons. Thor the Warrior has a bludgeoning battle axe, Thyra the Valkyrie has a close range sword, Questor the Elf has his long range bow, and Merlin the Wizard has magical bolts. Ghosts, goblins and even the life-draining Death are among the enemies. Enemies stream out of generators, so destroy these before tackling the rest. Keys are needed to open the many doors within the levels, and in some situations a door will contain only bonus items, not a progressive route. Scattered magic potions act like smart bombs and clear the screen of all enemies. Beware of poison though, this reduces the character's energy level. Treasure is abundant throughout the levels and adds to the player's score.": "",
  "First of SSI's \"When Superpowers Collide\" series. Strategic simulation of a conflict between US and Soviet forces. In Germany 1985 the Soviet forces attack NATO in West Germany in two different scenarios. In the first, Advance to Combat, Russian and US forces of similar strength race to establish a cohesive front line. The second scenario, Invasion, begins with Soviet airborne divisions landing behind NATO lines to block key roads and capture towns in preparation for the main advancing force. In both scenarios, the victory conditions are the same: the player controlling the greatest number of towns after a certain number of game turns is the winner.": "",
  "Ghost Town Gold is a text adventure for the Apple II. The player comes across the abandoned western town of Sandy Valley, population 0. Commands are via VERB NOUN commands, and the player's goal is to search the town for gold, and then leave. The player must explore a number of old buildings, including an abandoned hotel, barber shop, food store, jail, and clothing store.": "",
  "Based on the 1984 film of the same name, the Ghostbusters are the ones to call to \"bust\" any ghost hauntings. They do this through the use of nuclear-accelerated \"proton packs\" and \"ghost traps\", whereby the ghosts can be captured and transferred to a secure storage facility at their Headquarters. However New York City has suddenly become a very haunted place, and the number of ghosts has suddenly and dramatically increased. The Ghostbusters must reduce the paranormal psychokinetic energy, the \"PK level\" in the city, which represents ghost power, before the Temple of Zuul awakens and resurrects an evil goddess called Gozer. Ghostbusters is an action game that features an overhead-view and a side-view. From Ghostbusters HQ, the player must monitor a map of midtown Manhattan for \"ghost alarms\", as well as for casual, roaming spirits, and plot a route to the alarmed area. Once the route is plotted, the player then controls the purchased Ghostmobile as it drives through traffic. Here, the player is able to capture casual ghosts on the way if they are en route. When the haunted location is reached, the game switches to a side-view. Two of the Ghostbusters will take position, activate their proton beams, and toss a trap to the ground. The player must then use the two Ghostbusters to attempt to lead the ghost(s) over the placed trap. Once activated, the trap springs to capture any ghosts directly above it. A successful capture will earn the player money, which can then be used to purchase new Ghostbusters vehicles and new modifications for it. An unsuccessful capture will see the ghost fly away (after nastily sliming one of the Ghostbusters). As the game progresses, the PK energy in the city increases. The Ghostbusters must keep it under critical levels by being constantly successful at busting ghosts. Eventually the Temple of Zuul will activate, and if the PK levels are still manageable, the Ghostbusters can venture there for a final showdown with Gozer.": "",
  "An early Risk clone for the home computer. Players compete for 42 numbered territories on an Earth map. Reinforcement armies are awarded every turn based on the number of territories and continents controlled. Following the reinforcement phase, players have the option to attack an enemy territory. Simulated dice rolls (not shown on screen) determine the outcome of the attack. The player's turn ends with the movement phase, in which armies can be moved into old territories or newly conquered ones. There is no AI opponent, but the game supports up to 9 different human players.": "",
  "Based upon the popular boardgame, Gulf Strike allows you to examine every aspect of the complex Persian Gulf region. Complete air, land and sea orders of battle for more than a dozen nations allows you to fight each conflict to its unpredictable conclusion. The game will end when one of the following occurs: After 25 turns have been completed, the Soviet/Iraqi side gains 9 victory points, or the players choose to end the game.The game is for 1 or 2 players and usually takes 1-5 hours to complete. Avalon Hill rated this game a 7 on their 1(easy) -10(hard) complexity scale.": "",
  "You play as a worker at a gumball factory, where you must move through the ranks of the factory by successfully sorting colored gumballs using a Rube Goldberg-esque gumball sorting machine. The player starts each day at 0830 with a set quota of gumballs they must successfully sort through the day. Gumballs of different color are expelled from the machine in the top left corner, and they work their way through a series of complex devices to eventually be deposited from various slots at the bottom of the machine. The player controls the motion of various levers within the machine to control the pathway of the different colored gumballs. The player must then also move the colored carts at the bottom of the screen so that the correct colored gumball is deposited in each cart.": "",
  "Hacker is an adventure/trading game based on what was then a unique idea. You're starting into the adventure as a real hacker would do, lacking information of what is to come, only driven by your ambition. Consequently, the game opens with a plain text screen, prompting you for the login password. To break into the system is the first puzzle you've got to solve. Once in, you'll soon find out that you've accidentally stumbled upon a conspiracy of global impact. From then on, you'll maneuver a robotic drone around the globe through a tunnel system deep in the earth. In major cities, you may surface and talk to contact persons, who'll trade items for cash. When delivered to the correct city, you can exchange these items for a piece of evidence. If all evidence is collected, you're to inform the FBI. As if figuring out the correct routes and trades wasn't hard enough, frequent system malfunctions and security checks test your skill as well...": "",
  "Hadron is space based shoot 'em up game played from a first person perspective. The objective of the game is to follow enemy fighters back to their base and then destroy it. On the way there are numerous enemy space ships that the player can attempt to shoot down. Doing so reduces enemy flak which might prevent the player from reaching the base. Among the enemy ships there are different types of fighters, saucers, sensors and robots. Each ship has a specific target area that has to be hit such as the antenna of the surveillance ship. The player's ship has a limited amount of ammunition and fuel which decreases when steering or changing speeds. If successful in destroying the enemy base, the player's ship is refuelled and gets an ammunition refill before heading out to the next level which is at a higher difficulty.": "",
  "Halloween is a first-person shooter with a Halloween theme. The gameplay is a bit different from other 3D shooters as it involves a time limit. The game world is set in a medieval setting - so you get maces, bow+arrow, etc. Many Halloween monsters will stand in your way, including spiders, mummies and giant bats. More than 10 levels are to complete.": "",
  "The military is often painted in terms of precision. Orders are expected to be followed exactly. But what happens when those giving the orders are blind? Blindness is a fact of life for commanders, who have to wait for their men to call in with information. This game puts the player in the shoes of a Corps commandera man responsible for several divisionsfor the lives of thousands of men. The player will command some of the most famous battles in U.S. history, and will have to deal with the same lack of face-to-face contact that plagues every higher-level military leader. In this game the player replays historical battles in the wars with Mexico, World War I, World War II and the Korean War.": "",
  "Head-On is an arcade racing game and the first known game where the player has to collect dots (a year before Pac-Man). Viewed from a top down perspective, the player has to race around a circuit consisting of five lanes and collect all the dots that lies scattered around. At the same time he has to watch out for the jam cars that move in the opposite direction. To dodge the jam cars the player swap lanes which can only be done in the middle of each straight. To move faster it's possible to accelerate but then it's only possible to change one lane at a time. At normal speed two lanes can be crossed in one move. A level is completed when all dots have been collected and when colliding with a jam car a life is lost. The game is over when all three lives are lost. As the player progresses through the levels he will come across more and faster jam cars. In later levels as many as three fast jam cars will be in his way.": "",
  "Heavy Barrel is a shooter with a top-down view similar to Commando and Ikari Warriors. Terrorists have seized the underground control complex of a nuclear missile site. It is up to the player to infiltrate the installation and eliminate the leader of the terrorist army before they can launch the missiles. To stop the terrorists you will need the powerful weapon Heavy Barrel. The problem is that the weapon still is in the installation. Before the fortress fell the weapon was taken apart and locked in six different storage lockers. To defeat the terrorists you must collect all keys and reassemble the weapon. The game supports co-op for two players.": "",
  "Games back in the early 1980s often had descriptive titles. Helicopter Rescue is one of them: you have to use an helicopter to rescue stranded pilots in the desert and in the sea. The player controls the helicopter with the joystick, moving up to fly up and down to land. Once the helicopter is in the air, the player can choose to go left or right. Going left takes the player to a desert scenario, where the game field is in 2.5D. Moving the joystick up flies the helicopter ahead, moving it down lands the helicopter to pick up pilots. In the desert, tanks will try to shoot the helicopter down and capture the pilots before the player can rescue them. To shoot them, the helicopter must be moving vertically. Flying to the right of the main screen takes the player to a sea scenario, where the same rules as the desert apply, but as expected, instead of tanks the enemies here are ships. The helicopter has a fuel meter which, when depleted, will make the helicopter crash. The helicopter gets refueled when the player lands on the home base and returns rescued pilots. Each round has the player trying to rescue 8 pilots. The round ends when all 8 pilots are either rescued or killed.": "",
  "I.O. Silver is a puzzle game, that comes with two modes: The Arcade Workshop, which is your basic game and Strategy Lab, where you can train in the levels and think of the best way to solve them. In the game you play as a professor, who has to make his way out, by pushing the right puzzle tiles together, till none is left. Those tiles can also be used to squash enemies, but be careful, as the very same tiles can also squash you. The game features a month-system. After December 31, the game is over for you, if there are still tiles left. You can also go on vacations, which are basically the pauses in the game.": "",
  "Not to be confused with the much, much later Imperium Galactica, this was the first fully-functional commercial \"4X\" space game to hit the U.S. Many of the most important features in later 4X games appeared in this one: ship design, guerrilla warfare on captured planets, troop transports. It did not feature tactical space battles, however. The main game screen displayed a grid of dots, with star systems shown by a larger circle with a color representing the star's type. Stars could have zero, one, or two inhabitable planets. Warships could be custom designed and were tracked individually with a maximum of 255 war ships per player in existence at one time. Transports could carry either colonists and troops and traders carried metal or food surpluses to where they were needed. During an invasion, the respective armies from each player would fight until one force was destroyed. However, planets thus captured could suffer from guerrilla resistance for several turns and if not eradicated could overthrow the invaders or assist your opponent's armies in the event of a counter invasion. Given the tiny systems it ran on, this game did a very good job of simulating many important considerations, and was the first introduction of some of the things that have become staples in 4X space games; most notably ship design and refits.": "",
  "Indiana Jones in Revenge of the Ancients is a text adventure game. Hack your way through the steaming, tangled Mexican jungle. Fight off the onrush of vertigo as you grope through the treacherous, tunnel maze in the treasure-laden Tepotzteco Pyramid. Tighten your grip as you dangle from the wing of an airborne World War I DeHavilland. Whatever it takes, Indiana Jones must stop the cruel Nazi, Plebinheim, and his SS thugs from unleashing the power of the Mazatec Power Key against the world. Vicious bats, venomous snakes, marauding bandits - even for the daring Indiana Jones, this is going to be tough!": "",
  "A clone of Pac-Man, where you as jaws must collect all points and escape lethal heads. There are also magical points to break heads by your jaws during some time. You have to collect the points, magical items, and progress from level to level.": "",
  "Based on the well known game show of the same name. The basic idea behind the game is that you are given a choice of categories, each with an answer to a question behind the square. Your job is to figure out the question that corresponds to the given answer (for example, the answer is Star Wars. The question would be: George Lucas' Trilogy?, or something like that.) There are over 3500 answers to find questions to, in different game types including Tournament, Speed Match and Single Round. And in every case, Alex Trebek (the host) is there to tell you if you are right or wrong.": "",
  "Jungle Hunt offers four unique adventure experiences, which repeat with greater difficulty once all four have been survived. If you don't survive these adventures, you will not only lose your own life but that of the lovely Penelope, who has been captured by cannibals! The first part challenges your Tarzan skills - can you swing on the vines without plummeting to your doom? The second part pits you against a whole bunch of nasty crocodiles in a mighty river. Fortunately, you have a knife to fight back with. Don't forget to go up for air! In the third part, you face a battle against oncoming boulders of varying sizes and physics. Once you've cleared all these treacherous hazards, you still must confront the dreaded cannibal, who is armed with a wicked spear. Can you get past him and save the lovely Penelope? Gameplay involves much strategic jumping and knife play (in the river/crocodile phase). The view is always a side view, much like Pitfall! and later platform games.": "",
  "You are code-named Orion, an adolescent agent of ACT (the Adventure Connection Team), summoned straight out of the hallways of your high school by Max Huntington to participate in a mission taking you to the darkest jungles of Africa, to locate and defuse the limitless energies stored in an alien artifact there before sinister competing agents of BRUTE (the Bureau of Random Unlawful Terror and Evil) beat you to it! Other members of your team include an archaeologist (\"Digger\"), an environmental scientist (\"Erda\"), a nuclear engineer (\"Celeste\") and Olano, your guide. You, of course, are the computer expert, and your skills will be put to the test, typing in included BASIC programs to decrypt secret messages, weigh tolerances, plot courses through labyrinths and calculate necessary angles of deflection. The abilities of the whole team will be called for to overcome natural obstacles, untrusting natives, the sapping effects of the Devorim Force, BRUTE agents, a traitor in your midst, the perils and traps of the golden lost city containing the artifact, and the deadly artifact itself! Though the story shares the dynamic 2nd-person perspective (\"You try to talk, but you cannot make a sound\") of Choose-Your-Own-Adventures, the text (like most books) is a non-interactive fixed-rail trip of zero interactivity -- however, some of the type-in programs included offer numerous outcomes, moving into the \"game\" field what might otherwise be best categorized as an elaborate set-up for low-impact programming exercises. An appendix is included describing how to modify the BASIC program listings for greatest compatibility with 10 of the most popular home microcomputer BASICs, as well as describing what each program does and how it works. Hey! You got your education in my adventure!": "",
  "In Kamikaze, the player flies their small plane toward the left edge of the level, shooting or avoiding other planes, as well as soldiers and missile launchers on the ground. The player also needs to look out for a certain plane carrying dynamite and shoot it down. Once the dynamite has been collected, the player makes their way toward the left edge of each level where they have to crash into the castle gate in order to rescue the hostages trapped inside. Another plane takes the place of the damaged one, and the players uses this plane to take the hostages back to base. The plane can only carry two hostages, so return trips to the castle are usually required. Once all hostages in the level have been returned to base, the player proceeds to the next level.": "",
  "A platoon-level tactical game of armored warfare that encompasses almost all ground weapons used on the Russian Front from 1941-45. Kampfgruppe puts the player in command of either a German or Russian battle group, providing four historical and an infinite number of randomly created scenarios. The historical scenarios: Meeting engagement east of Bryansk (July 7, 1942). Attempted relief of Stalingrad (December 17, 1942). Attack toward Kiev (November 3, 1943). Attack toward Berlin (March 22, 1945). The game will automatically end after 20 turns (after 30 if there is an assault battle being played). However a game may be ended earlier or continue after it has ended if all sides agree. At the end of the game victory points will be awarded which will determine whether the battle was a draw or a marginal, substantive, or decisive victory.": "",
  "The evil Akuma has destroyed the protagonist's homeland, killed many of his friends and kidnapped the princess Mariko. Fortunately, the hero is skilled in martial arts, so his inevitable quest to reach Akuma's palace and rescue Mariko has a chance of success. Karateka is viewed from the side and features a succession of increasingly difficult opponents. Three types of punches and kicks are available to both the player character and his foes, differentiated by their height (low, medium, and high). The protagonist has a health bar, which refills itself gradually when he stands still.": "",
  "Sir Graham is a brave knight who is sent on a quest to retrieve three treasures that were stolen by deception and stealth: a shield that protects its bearer from invaders, a mirror that foretells the future, and a treasure chest that is forever filled with gold. If Graham takes these treasures back to the royal castle, then the ailing King Edward the Benevolent of Daventry will hand over the crown. During his travels, Graham will meet characters that will either help or hinder him. King's Quest is commonly considered the progenitor of third-person-perspective adventure games. As opposed to earlier graphic adventures, the player is able to navigate the protagonist on screen in eight directions, creating an effect of three-dimensional exploration. The player character can also be obscured from view when hiding behind an object, is subjected to gravity, and has different animations for actions such as picking up an item, falling, swimming, etc. Graham can be moved around with arrow keys and perform various actions when the player types commands, normally consisting of noun and verb combinations (e.g. \"Take flower\", \"Talk man\", etc.). The game world consists of a cyclic outdoor area with places of interest (houses, characters, etc.) that must be found through exploration. Much of the kingdom is accessible to Graham from the beginning, and there are only a few restrictions imposed on traveling. In order to complete the game, the player has to procure certain items and use them in correct situations or with specific characters. Some of the puzzles rely on fairy tales, and a good knowledge of those makes them easier to solve. The game awards the player points for most of the actions he makes Graham perform. Since some of those are not crucial to completion, it is quite possible to finish the game without having attained the full score. Some of the tasks in the game have multiple solutions, though the game may grant the player less points if he chooses the simpler one. Many hazards await Graham on his journey, and death is frequent if the player is not careful. The game can also be rendered unwinnable by failing to collect a specific item or wasting it.": "",
  "As a knight, paladin, barbarian or sorceress, amass an army of creatures to take on the local baddies and search for the Sceptre of Order. A turn based game with a time limit that decreases depending on the skill level you play at. Depending on your allegiance, you will initially start with a different set of creatures, though the king will not mind whether you're his knight or barbarian. Game consists of four maps, each with more mean creatures to control and meaner opponents to fight, but acquiring those maps early will let you find and buy some mean creatures that will help you easily conquer prior maps. You can see all the enemies on the map and can literally clear the map of enemies, though random can appear in your castles if you leave them unprotected after the conquest. With each conquered castle (assuming the castle is occupied by the enemy you are currently after), you will get a level up, after first two level-ups king will promote you and you'll be able to recruit cavalries from the castle, after four more promotions you'll be able to recruit knights. All the other creatures are found outside the king's castle and can be recruited no matter the level, although your level determines the quantity of creatures you can find for recruitment, but take care of your money because if you don't have enough for your army's salary, they will desert or turn against you. There are also two artifacts per each map that will also uncover the map of the place holding the King's Sceptre. The moment you find the sceptre and bring it back to the king, the game will end even if you happen to find it very early in the game. As for tougher enemies, like the final one having hundreds of dragons and demons, they can also be defeated, but not by the army you can muster in one go. But when you're defeated, you respawn back at the king's castle and start with almost nothing but your money, however, the enemy in the castle will be left without those creatures lost in the battle, unless some of the new comes to aid him as every week the population increases.": "",
  "King Graham and Queen Valanice had two children, Alexander and Rosella, and the kingdom was once peaceful. It wasn't long until Alexander was snatched from his crib and things started to take a turn for the worse. A three-headed dragon threatens the ever-peaceful Daventry, and requires a maiden to be sacrificed every year. Rosella is the chosen one. Meanwhile, in a secluded house atop a mountain in the land of Llewdor, the evil wizard called Manannan keeps a young lad named Gwydion as his slave, forcing him to do menial tasks as he prepares his spells and observes the country through his telescope. Gwydion must find a way to outsmart the wizard, escape, and eventually discover the truth about his own identity. King's Quest III: To Heir is Human is an adventure game similar in basic gameplay mechanics to its predecessor The player navigates Gwydion with arrow keys and interacts with the environment by typing verb and noun combination commands. Llewdor consists of interconnected screens that loop once the player character reaches the border of the land. Throughout the course of the game, Gwydion will also travel to other locations and have a magic map at his disposal, allowing him to teleport to different areas. There are more items to collect in this installment, and more complex actions required to execute, raising the difficulty level. A large part of the game proceeds in real time, with Mannanan following his own schedule, forcing the player to plan and time his actions. There is also a time limit imposed on the game's first major quest.": "",
  "The Bungeling Empire has stolen a huge cache of gold from its rightful owners, and your mission is to infiltrate its treasury and recapture it. This entails progressing through 150 screens of platforms, ladders and ropes. The Empire has sent robotic guards down to protect the gold, and contact with any of these will cost you a life. Your method of escaping them is to press fire to dig a hole in their line of movement, thus causing them to fall in briefly, allowing you to move across the gap safely. Once all the gold has been collected, a ladder allowing you to move onto the next screen is added. Completing these screens often requires forward planning and precision. This was one of the earliest games to include a level editor, allowing the creation of new level designs with no programming skill.": "",
  "After your death in hospital, you have been wrongly sent down to Hell from the gates of Heaven where you find Lucifer himself has his own problems. He has discovered that Adolf Hitler is attempting to raise an army including Mussolini and Reverend Jim, to overthrow Lucifer and take over Hell. He has tasked you to stop Hitler in his power struggle and as a reward you can return back up to Heaven. Lucifer's Realm is a graphic text adventure where you see pictures for each location while text below describes what you can see in the location. You type commands with the keyboard to control your hero and interact with various locations.": "",
  "This adaptation of the classic Chinese board game offers 100 level for single-player sessions, with three difficulty levels. The levels can also be played in a campaign mode, with twelve illustrated stations. The main aim of the game is to make pairs of blocks disappear on a board where they are stapled on different layers. Removing matching blocks reveals the ones below, until the entire board is cleared or the player is stuck. The game includes a help function and blocks can be immediately selected using the stylus. There are different themes of blocks to choose from, including classic Chinese characters but also more general symbol. The game keeps track of the remaining blocks, the score, and there is an undo function.": "",
  "The Edison mansion has always been a creepy old house on the edge of town. There have been rumors of strange experiments going on and of odd creatures living amongst the Edison family. There is even a story that a meteorite once crashed near the home nearly 20 years ago. More immediately, a girl named Sandy has gone missing from the local highschool and her boyfriend Dave swears that he saw Dr. Fred abducting her. Dave knows that he cannot do it alone and will need help from two other students if he has any hope of infiltrating the mansion and rescuing Sandy. Players start by choosing two students to accompany Dave to the Edison mansion, and can then switch between these three characters at will. Most actions are carried out by selecting verbs on the screen and applying them to an object (such as \"OPEN Door\"). Each character maintains a separate personality and may have a different way to solve a problem from his classmates. Thus many of the puzzles can be overcome in different ways depending on the character being used. If any one of the kids are captured by the Edisons, they are thrown into the dungeon and must be rescued themselves by any character who still has their freedom.": "",
  "Captain C T Cobra has the task of travelling through planet Mergatron where the jewels of Ozymandias have been placed by their captors. The road is long and tough but he has a Battlecar at his disposal. You play Cobra as he journeys vertically, taking out the mounted turrets and enemy cars as he goes. There are also colored turrets to shoot at - each colour represents a particular change to your car's performance (there are a few temporary negative ones alongside the upgrades). You have 16 smart bombs, which may sound generous, but just watch them go. A boss must be beaten at the end of each level.": "",
  "The idea of this arcade game is deceptively simple: Guide a marble down a path without hitting any obstacles or straying off the course. The game is viewed from an isometric perspective, which makes it harder to stay focused on the direction the ball is to follow. There are tight corridors to follow and enemies to avoid. There is a 2-player mode in which players must race to the finish, otherwise you're racing against the clock.": "",
  "A side-scrolling, jumping game in which you help Goofy climb the treacherous slopes of the Matterhorn. Using keyboard or joystick, make Goofy climb ropes or jump to ledges, empty bobsleds or gondolas. Jump over goats or snowmen before they push Goofy off the ledge. At higher levels of difficulty, watch out for falling icicles or loose ledges. To win the game, collect all the flags along the way and claim the Mickey flag at the summit.": "",
  "Mech Brigade is a platoon level tactical simulation of armored warfare, depicting a hypothetical battle between the forces of NATO and the Soviet Union. The game may be played by up to 2 players (both of which may be human or AI), who can either choose to play one of the 4 historical scenarios or may elect to build their own scenario. NATO players may choose a nationality from France, Great Britain, the United States, or West Germany. The game also has 5 handicap (difficulty) levels. Gameplay consists of two phases, the orders phase, where player(s) give orders to each individual unit under their control and the combat phase, where all units carry out their orders one unit at a time. Units, although in majority are armored vehicles, may also consist of attack helicopters, artillery, and infantry. The game will automatically end after 15 turns (20 if there is an assault battle being played). However a game may be ended earlier or continue after it has ended if all sides agree. At the end of the game victory points will be awarded which will determine whether the battle was a draw, marginal, substantive, or decisive victory.": "",
  "Walking along one day, Mickey and Pluto come across a spaceship. After boarding the ship, they are given a quest by XL30 from the planet Oron. A long time ago, a thief stole the planets memory crystal and broke it up into nine pieces, hiding them on each planet in the solar system. It is Mickey's job to travel to each planet and locate the crystals so the inhabitants of the planet Oron may receive their memory back. Information about the different planets and locations visited are displayed on arrival, and XL30 may occasionally give clues through the ships computer. The interface for the game doesn't use a text parser, instead short sentences are created by using the cursor keys to highlight the necessary words from a selection on the screen. The game will also suggest better options if an illogical or impossible action is requested.": "",
  "In Miner! the player's goal is to earn as much money as possible. To do this the player must mine for gold and sell when gold prices are high. The game uses a side view and the player owns a mine with an elevator that can be sent to various levels. The player can dig through the soil removing block by block. When digging there are various surprises the player can encounter. The most important is of course gold, but others like impenetrable granite, cave-ins, easily dug-out sandstone and loose footings will also be encountered by the player. Outside of the mine the player can sell the gold he or she found. Gold prices fluctuate, so the player can try to find the best moment for selling. Each digging action the player undertakes costs money, so the player cannot wait too long or the mining operation will go bankrupt.": "",
  "You play the part of Bounty Bob, and it is your mission to explore every inch of an abandoned mine. As you walk over floor sections in the mine, the floor will change color. When all of the floor sections have been changed in color, you can move on to the next, more challenging level. To reach all of the floor sections, you will need to figure out how to get there. You can jump (be careful not to fall too far though, or you will be squished), climb up and down ladders, and use different transportation devices that can be found on the levels (such as an elevator, slides, a springboard, or a cannon). Wandering around the mine are numerous radioactive creatures which get in Bounty Bob's way. Also scattered throughout the mines are various artifacts left behind; if Bounty Bob collects one of these, the creatures will temporarily become vulnerable. If Bounty Bob runs into one of the creatures in this state the creature will be destroyed, but if he runs into a creature while it is glowing Bounty Bob will be destroyed. There is a total of ten different levels, and to complete them all you will need quick reflexes as well as to figure out a unique strategy for each level.": "",
  "Similar in gameplay to Minesweeper, Mines has you finding all the mines in a minefield. Your goal is to cross the minefield without stepping on any mines. Any space that you have seen will tell you how many mines are surrounding it. Use this to your advantage to determine where the mines are located. Step on a mine and it is all over. The game allows you to choose how many mines there are in the level... from 30 to 160 mines in a 16x16 grid. Unlike in Minesweeper, you cannot just click anywhere on the field to free up a space. Your feet must \"walk\" around the field as if you were really there; finding mines. Your objective is to walk from the top left corner of the field to the bottom right corner without stepping on any mines. Not all mines have to be found to succeed.": "",
  "This is a computer game simulation of a miniature golf course. It attempts to refine your sense of timing and your perceptiveness in judging distance. As in a traditional miniature golf course, a variety of obstacles are placed in your path to the cup. Depending on the game that is selected, the course can be played solo, or a two player competition can be initiated. Rather than a full 18 holes, this miniature golf variation has a nine-hole half-course. Your goal is clear: taking the various obstacles into account, hit the ball through the course and complete each hole by knocking the ball into the cup. The number of attempts you make for a single hole is tallied as strokes. While total strokes are unlimited, each hole still has a specific par assigned to it. So ideally, you should make it your goal to not exceed the par assigned to each hole. Using the standard joystick controller, you can position the club to adjust the strength and angle of how the ball is hit. Remember that no matter how many strokes have accrued, it is necessary to get the ball in the cup before the game continues on to the next hole.": "",
  "Tie-in of the popular movie Mission: Impossible, this is a third-person action stealth game with 24 levels. Playing the secret agent Ethan Hunt, the player has to fight international terrorists. Assisted by his IMF team, he sneaks into enemy bases, blows up ammunition depots, retrieves stolen information and takes out the terrorists. The plot is loosely based on the movie; Ethan Hunt is framed and has to prove his innocence which he is only able to do with the help of his good friends from the IMF team.": "",
  "This game is an historical piece of video gaming all by itself! Mystery House is an adventure game released by On-Line Systems in 1980. It was designed, written and illustrated by Roberta Williams and programmed by Ken Williams for the Apple II. Mystery House is the very first graphical adventure game and the first game produced by On-Line Systems, the company which would evolve into Sierra On-Line. It is one of the earliest horror video games. The game starts near an abandoned Victorian mansion. The player is soon locked inside the house with no other option than to explore. The mansion contains many interesting rooms and seven other people: Tom, a plumber; Sam, a mechanic; Sally, a seamstress; Dr. Green, a surgeon; Joe, a gravedigger; Bill, a butcher; and Daisy, a cook. Initially, the player has to search the house in order to find a hidden cache of jewels. However, terrible events start happening and dead bodies (of the other people) begin appearing. It becomes obvious that there is a murderer on the loose in the house, and the player must discover who it is or become the next victim.": "",
  "Tamara Lynd has recently become engaged to Jack Tresyllian, a wealthy owner of the Tresyllian Castle in Cornwall, England. Shortly afterwards, she began seeing a ghost-like figure, a mysterious White Lady, who has allegedly been haunting the castle for centuries. A series of events and dark suspicions involving hidden treasure convince Tamara that her life is in danger. She contacts a friend of hers, a young American detective, asking him to travel to the castle and investigate the mystery. Moonmist is a text adventure game. In the beginning the player chooses between four different scenarios, represented by the colors red, blue, yellow and green. Each scenario has different tasks, a different criminal, and different treasure. The game has a built-in clock, and must be completed before 6:00 am in-game time, otherwise it ends prematurely. Depending on the player's choice of the protagonist's gender, characters may react differently to his or her actions.": "",
  "The year is 1966, shortly after USA deployed its troops to participate in the Vietnam War. Alan \"The Bear\" Westmoreland, a Marine Corps sergeant, is sent behind the enemy lines. He is known for his high endurance, achieved by ingesting various stimulants. As long as these drugs keep him going, the Bear isn't afraid of danger, and is used by his superiors for missions with overwhelming odds. The raid turns into total warfare; with only a small team at his side, the Sergeant will have to do everything he is capable of in order to survive. NAM is a military-themed first-person shooter that uses the Build engine. The protagonist has to fight his way through the jungle, with various weapons such as M16, M60, M79, LAW, and others. The missions range from urban gun battles to sneaking in the thick jungles and man-made tunnels under the ground. The battlefields are frequented by air strikes, anti-personnel mines (which the player can spot with a mine detector), fire fights, ambushes, snipers and tanks. Fellow soldiers will aid Alan in battle, though for the most part he'll have to depend on himself. A multiplayer battle is included, featuring 19 multiplayer levels with different game modes like Gruntmatch, Capture-the-flag and Fireteam, where each player is allowed to select a soldier type and is sent on different missions.": "",
  "Guderian simulates the critical campaign near Smolensk on the road to Moscow during WWII. As the German player you are at the head of the panzergruppe invading central Russia and must master blitzkrieg tactics to encircle and overrun Soviet divisions and drive deep enough into Russia to make the capture of Moscow possible. The Soviet player must work to counter the German threat and make attacks that will cut off the supply of the German forward units. The game can be played solitaire as either side.": "",
  "In The Lurking Horror, you are a student at G.U.E. Tech. You have braved a snowstorm to get to the Computer Center and finish work on an assignment. But the snowstorm has turned into a raging blizzard, and has trapped you in a complex of buildings late at night. You are not alone, fortunely ... or perhaps, unfortunately. Thus you begin the story, unaware that anything may be wrong beneath or within the veneer of the quiet campus.": "",
  "Nibbler is a variant of Rock-Ola's arcade game of the same name. A cruel witch has turned everyone around her, including the player, into strange animals known as wondrous wurpels. In the garden of the witch there are many charms lying around and if these are collected the spell can be lifted. The player himself can't move though, so he has to get help from a snake, Nibbler, who has to make his way through the nine sections of the garden and collect all the charms. The game plays similar to Pac-Man albeit without any enemies that chases the player. For each level Nibbler has to collect most of the charms (a few can be left behind). The problem is that the snake grows every second, making things harder since it will lose a life if it collides with its own tail. A life is also lost if the snake stands still too long without moving. The game is over when all five lives are lost.": "",
  "Night Mission Pinball is a pinball game simulation. You can change many physical parameters of the machine to suit your playing style or your whim such as the number of balls, ball speed, the incline of the machine, the kick off the bumpers, etc. It supports 1-4 players and is controlled by the keyboard or joystick.": "",
  "This interactive fiction game is based on Roger Zelazny's fantasy novels Nine Princes In Amber (1970) and The Guns of Avalon (1972). The game begins with you as Prince Corwin forced to compete against your eight scheming noble brothers and sisters for the throne of Amber at the center of the one true world. Corwin must travel across the dimensions to this fascinating realm and from there rally forces against those who would oppose him. Unfortunately, things do not always proceed as planned. When you wake up, you know little of this, as you have been knocked unconscious and pummeled with drugs. All you have is the address of your scheming sister. The game is largely based around interaction with other characters, and can end in 40 different ways depending on how these work.": "",
  "Nord and Bert Couldn't Make Head or Tail of It is a text adventure game revolving around puns and wordplays. Idioms and clichs have become real-world objects in the town of Punster, and the player has to sort them out in order to win. There are seven separate scenarios that can be played in any order, as well as the final one that can be accessed only after having completed all seven. These scenarios are: The Shopping Bizarre: Products in a grocery store have been replaced by nonsensical homonyms (such as \"chocolate moose\"), and the player has to revert them to their normal form. Playing Jacks: Equipped with an item called \"Jack of All Traits\", the player has to construct words beginning with \"Jack\" to solve puzzles. Buy the Farm: Clichd expressions must be used in their literal meaning while exploring a farm. Eat Your Words: More literal idioms used in a diner. Act the Part: The protagonist is teleported into a 1950's-style sitcom, where he must perform visual gags. Manor of Speaking: The protagonist explores a strange house in a more traditional humorous Infocom-style manner. Shake a Tower: Letters in expressions have to be re-arranged to create humorous new meanings. Meet the Mayor: The final chapter of the game, mixing elements of the others as the protagonist faces the mayor of Punster..": "",
  "This operational level turn-based strategy wargame represents a fictional conflict between Soviet and NATO air, land, surface-naval and submarine forces for control of the North Atlantic. The NATO forces must be commanded by a human player. The Soviet forces may be commanded by either a human or the computer. Players need to organize their ships into task forces to perform various missions: sea lane interdiction, land bombardment, supply/troop transport, evacuation, etc. Gameplay revolves around the creation and manipulation of these task forces and the effective concentration of air power. Included are campaign games covering September 7 to December 31, 1986 and November 1 to December 31, 1986, mini-games covering the invasion of Iceland in November 1986, and a North Atlantic convoy operation in September 1986. North Atlantic Theatre is represented on a 40 x 40 square grid map. Each square measures 100 km in width. Squares are land, ocean, bases, Soviet task forces, and NATO task forces. The range between squares is calculated as a distance between their centers. Each game turn represents the passage of 12 hours and consists of: building and adjusting friendly task forces; moving these task forces; launching air missions; launching missile attacks; combat resolution. Upon completion of the combat phase of each turn, the game progress may be saved to restore it later.": "",
  "Last of SSI's \"When Superpowers Collide\" series. The Soviets invade Norway! In this strategic simulation of a hypothetical war between NATO and Russia, the Russians invade using Ski troops, and NATO responds in kind. The player controlling the greatest number of towns after a certain number of game turns is the winner.": "",
  "The time is the late 20th century. You and a neighboring country have developed a nuclear capability. Your neighbor's sole objective is to utterly annihilate you. As the tension mounts while you are conducting espionage, building bombers, missiles, submarines and anti ballistic missiles either you or your neighbor launch a pre-emptive first strike.The nuclear destruction continues until either all weapons are expended or a truce is negotiated. Victory is determined by population remaining and world political opinion which is usually against the side that started the war. If both sides lose enough people neither will win.": "",
  "Objective: Kursk is a grand-tactical level game covering the Fourth Panzer Army attacks against the Soviet forces on the south flank of the Kursk salient. Each game turn consists of 12 hours of operations. Operations consist of suppling and moving combat forces, changing formation, planning assaults, air strikes, artillery bombardments and resolving air combat situations. The game map covers the battlefields on the south flank of the Kursk salient, from Kursk in the north to Belgorod in the south. Movement around the map is controlled by a hexagon grid system with each hexagon representing three miles. German forces are controlled by the human player and the Soviet forces can be controlled by either computer or human. Forces on both sides are pre-assigned at the beginning of each game. Each opponent will have five phases to prepare for battle and then a combat phase starts after. Game will end on 7-15-43 or you defeat your opponent before that date. Victory points are awarded for the control of towns and for surviving combat forces.": "",
  "Ogre is a 2D turn-based strategy game, and a direct computer conversion of Steve Jackson's board game of supertanks going against conventional infantry with howitzers. It plays exactly like the board game - on a hex-based board one player controls ordinary military units (soldiers, tanks etc.), and defends against the second player, who controls a supertank named \"Ogre\" - Ogre is very powerful, and can easily destroy normal weaponry and ground forces.": "",
  "Old Ironsides is a two player game that simulates nineteenth century naval combat. The action takes place on a single screen in which each player controls a three-masted sailing vessel. The speed and movement of the ships is determined by the wind. The wind is always blowing from south to north, making southward movement difficult unless a player tacks and navigates his ship in a zigzag manner. Each ship is equipped with twelve cannons, six on each side of the ship, and a supply of powder. The goal of the game is to defeat the opposing player in battle. A player loses if either their ship is sunk or if they get lost in the fog. Sinking a vessel can be achieved by cannon fire or by ramming. Cannons fire perpendicular to the direction of travel. As a ship takes damage, a status indicator will slowly fill with red and a ship will lose cannons, thereby decreasing their firepower. Occasionally, an especially accurate broadside will hit an opponents magazine, instantly destroying the adversary's ship. As players fire cannons, their powder supply will deplete. Powder regenerates itself at a rate much slower than the rate of fire, so players must always be aware of their stockpile. If a ship moves off the edge of the screen, it is said to be, \"in the fog.\" A ship that stays in the fog too long loses the battle. A series of increasingly higher pitched beeps warn the player that their time is running out. Navigation in the fog is aided by a compass display at the top of the screen. This indicator shows the ship's bearing at any given time and can be switched off if a player wishes to hide their movements in the fog.": "",
  "A simulation of the 10-event Olympic Decathlon, this early game was basically a series of 10 arcade games back to back. The player used the keyboard to control how fast the character would go in a race or when to throw the javelin, for example. Decathlon also had a training mode which let you play any of the events individually. A nice feature about the game is that up to six players could play the game in hot seat mode. Several of the events were one player at a time, but many of the races were two at a time, giving you some live competition. You were scored based on your performance at each event and the player with the highest total at the end was awarded the gold medal. The ultimate challenge was to try to beat Bruce Jenner, winner of the Decathlon in the 1976 games.": "",
  "Omega is usually considered the first roguelike game (CRPG dungeon crawls with top-down or isometric graphics and a high degree of randomization; Rogue and NetHack are examples) with a traditional plot. In it, you play a person from Earth that has been transported to another world by the Omega Project (this part of the plot is explained in the intro). You are trying to become an Adept, a person of immense power who follows the Buddhism-like principles of the Lords of Omega, by undergoing a series of quests.": "",
  "One of the most popular and influential games of the 1980's, Pac-Man stars a little, yellow dot-muncher who works his way around to clear a maze of the various dots and fruit which inhabit the board. Pac-Man's goal is continually challenged by four ghosts: The shy blue ghost Bashful (Inky), the trailing red ghost Shadow (Blinky), the fast pink ghost Speedy (Pinky), and the forgetful orange ghost Pokey (Clyde). One touch from any of these ghosts means a loss of life for Pac-Man. Pac-Man can turn the tables on his pursuers by eating of the four Energizers located within the maze. During this time, the ghosts turn blue, and Pac-Man can eat them for bonus points. This only lasts for a limited amount of time, as the ghosts' eyes float back to their center box, and regenerate to chase after Pac-Man again. Survive a few rounds of gameplay, and be treated to humorous intermissions between Pac-Man and the ghosts.": "",
  "The young sorceress Nikki, the court jester Fargus, and his side-kick Sid the puppet are the three main protagonists of this 3D platform game. While attending a \"Wizards in Training\" seminar, Nikki accidentally casts a powerful magic spell, which results in a giant monsters swallowing the whole village. The three friends must now travel to a place called \"Wishing Engine\", and be granted a wish to revert the world back to normal. The characters each have a special movement to kill enemies with. The game uses floating camera angles through a vast Prince of Persia-style world. The goal of the game is to clear the various levels, avoiding spikes and enemies and collecting coins for extra lives. Unlike most 3D platformers, Pandemonium offers only two-dimensional movement, rather than complete freedom of movement. The characters move along a curving 2D course within a 3D environment.": "",
  "Panzer Grenadier is a solitaire wargame of German armored infantry warfare on the Eastern Front during WW II. You command a regiment of Panzer Grenadiers (elite armored infantry) attached to the Grossdeutschland Panzer Grenadier Division. You will also be given elements of a panzer regiment and an artillery battalion. Your forces include mortars, artillery, Panzer IV, Panther and Tiger Tanks. There are five historical scenarios provided with three levels of difficulty. One of four levels of victory attained is determined after every turn and at the end of the game.": "",
  "Phantoms Five is a vertically scrolling action game where the player controls a plane and has to bomb various targets beneath him. The plane is set on auto-pilot and moves automatically forward with the player only controlling the horizontal movement with a paddle. Points are earned for successfully hitting targets such as headquarters, fuel dumps, post offices and roads. There are also some targets to avoid such as red cross hospitals and prisoners of war camps. Hitting these will lead to a loss of points. At the same time the player has to watch out for fire from anti-aircraft guns. Getting hit will lead to a loss of a life and a restart at a lower level. At times the player will encounter enemy fighter planes. The game then switches to a first person perspective where the player aims left and right with the paddle and has to shoot down the fighters with the machine gun before they shoot down him.": "",
  "Each level of this abstract puzzler challenges the player to set up a network of pipes to allow an unspecified substance known as 'flooz' to flow through as many of those as possible. The pieces are offered in random order, and there are seven different types - straight lines going horizontally or vertically, corners rotating in each of the four directions, and cross-over pieces which carry the flooz straight across horizontally and vertically. Each of these can be entered from either side. When the flooz hits a gap, or a piece which the previous piece can't flow into, the pipe is finished. Before the flooz starts flowing from its randomly-selected starting position, the player has several seconds to start placing pieces. They can be put down anywhere. However a situation that can often occur is there will be a long and complex piping arrangement set up, yet a gap somewhere remains to be filled. Players are able to replace a piece with another in the same square (to make it easier to flow the flooz that way), but for a slight scoring penalty. Bonuses are awarded for looping the flooz through both sides of at least 5 cross-over pieces, or passing the flooz through every square on the screen. Later levels have some squares on the grid blocked off, a few gaps in the side-wall (allowing flooz to thread to the other side of the screen). After every four levels there is a bonus game for points, in which the player can only place the pieces in the lowest open space in each column, similarly to the board game of \"Connect 4\".": "",
  "It's January 1, 2050, and after many decades of research and development of space travel, mankind is ready to reach out to the planets of the solar system to establish mining bases. Up to four players compete with each other and the computer to stake valuable mining claims throughout the solar system, while the mining council has stationed patrol ships throughout the system to make sure everyone follows the rules. Thus begins several weeks of intensive exploration, political maneuvering, sabotage, and claim jumping which will decide the course of the economic exploitation of outer space for the next hundred years. You have the opportunity to guide your family to a commanding economic position in the solar system. The game can also be played solitaire against the computer.": "",
  "It all started with your great-great-grandfather who was a High Admiral and one of the founding officers of the Patrol. All generations since then have served in the Patrol. Now it's your turn and two years into you are still a lowly Ensign Seventh Class. Your direct report, Blather, is really making your life miserable. Are you really Stellar Patrol material?": "",
  "Planetoids is an early Asteroids clone for the Apple II. The gameplay is the same as in the arcade original with the player having control of a ship that has to destroy the surrounding asteroids. The ship can be rotated and is moved by using thrust to send it forward. There is also the possibility of entering hyperspace which sends the ship to a random location on the screen. Larger asteroids break into 2 smaller pieces if shot, and they 2 smaller pieces again. These final tiny pieces can be shot and destroyed. In addition to the asteroids there are star dockings which appear that are worth bonus points if shot. The player moves on to the next level when all asteroids in a field are destroyed. They start with 3 ships, and when all are lost it's game over.": "",
  "The film Platoon featured a squad of five soldiers on their mission for the US Army in Vietnam. In this action game based around the film, you take control of these five guys in turn, with the chance to switch between them as they each take one of the 3 hits that would kill them. The game recreates each of the sections of the film, starting with a side-scrolling journey through the jungle, with paths to cross both horizontally and vertically, and the ability to jump or duck hazards. You will need to blow up a bridge and then locate a village, which contains a torch, a map and a trap-door. The enemy has booby-trapped the area and are launching airstrikes, so the danger is not all from enemy ground soldiers. The next section is in first-person 3D, as you move through a network of tunnels in search of flares and a compass. There are 3 distinct control methods, changing from the standard motion when an enemy appears (this puts you in control of a cross-hair for more accurate targeting), and when you enter a room to search. After escaping this you settle in a bunker overnight, and have a limited amount of flares with which to locate incoming enemy, and must then shoot them before they can shoot you. The jungle airstrike from the film is the next moment - you have two minutes to rush into a safe position to the north, using your compass for guidance. Finally you face the treacherous Sergeant Barnes, and must hit him with grenades 5 times whilst trapped in a foxhole to prevent him wiping you out.": "",
  "Plundered Hearts is a text adventure game set in the late 1600's. The player takes control of a young Englishwoman who finds out that her father is sick. In order to take care of him, she travels to the West Indies. But on the way her ship is attacked by pirates, and she is carried away by their captain. Though still determined to find and help her father, the young woman discovers that perhaps she may find romance where she least expected it.": "",
  "Located on the northern shore of the Moonsea in Forgotten Realms, Phlan was once a flourishing trade city. However, lately monsters began settling in it, gradually turning whole districts into ruins. Only New Phlan remained under human control, but its inhabitants are afraid to venture into the monster-infested areas. In order to clean the nearby Barren River and rebuild Phlan, local authorities spread rumors about alleged riches hidden somewhere in the city. A party of adventurers, attracted by these news, sails towards Phlan and accepts the quest. Pool of Radiance is the first adaptation of the Advanced Dungeons & Dragons role-playing system in a computer game format. In the beginning of the game the player can use a pre-made party of six characters or create each of them from scratch. Six races (human, elf, dwarf, gnome, halfling, and half-elf) and four classes (fighter, cleric, wizard, and thief) are available. The player can tweak the attributes of the characters and assign a moral alignment to each one. Exploration of the town and hostile areas (dungeons) is viewed from a first-person perspective in a pseudo-3D world. Enemy encounters are random and take place on separate isometric combat screens, where player-controlled party and enemies take turns fighting each other. Experience points are awarded for defeating enemies, and characters level up after having accumulated set amounts. Fighters gain more attacks, thieves become proficient in backstabbing, while clerics and wizards can memorize more spells to cast before they need to rest. Non-human characters can also \"multi-class\" (learn the abilities of another class) when leveling up. The NES version was substantially different from other versions. It removed references to the Adventure's Journal and some of the more complex features of the computer versions, like different currency units. Battles were significantly reduced in size, the graphics were overhauled and redesigned so that the game could be controlled with a control pad, and music was written for it. A randomly generated dungeon feature was also removed.": "",
  "As Popeye, you are trying to win Olive Oyl's love! She is at the top of the screen dropping tokens of her love, and you need to collect them before they hit the ground. After you have collected the required number of items, you can move on to the next, more difficult level. There are many obstacles trying to stop you from completing your task, though! Brutus wanders around the screen and is constantly trying to catch you. If you collect a can of spinach, you can temporarily knock him out, otherwise Brutus will knock you out. Other objects such as bottles or birds are also flying around the screen and will cause you to lose one of your lives if you are hit. Each level features a different layout of platforms and ladders, and will have you collecting different items as they float towards the bottom of the screen!": "",
  "A political simulation of the US presidential elections, President Elect allows you to simulate any campaign from the 60's to the upcoming (at the time) 1984 election as the campaign manager for any of the candidates featured in said elections. You can also create a custom candidate by completing an RPG-like character creation module and have him/her face off against actual politicians rated in a series of stats according to their political views and ideologies. Using a series of text-based menus you can run the campaign from labor day to the election night and allocate funds, agree to debates and perform other money-raising / PR stunts in hopes of conquering as many votes as possible.": "",
  "High-resolution graphics remake of the text-based adventure game inspired by the cult-classic British television show about a former spy who is abducted and sent to a resort-themed \"prison\" where his captors attempt to get him to reveal why he resigned from his classified job. The game takes place on \"The Island,\" where the player travels from building to building, each hosting a metaphorical quest in which the player's creative thinking skills are tested. Players demonstrating individual thinking eventually gain access to the Island's \"Caretaker,\" and their ensuing conversation (using a language parser) can lead to the player's freedom.": "",
  "Sunningdale and Pebble Beach golf courses are provided in this strategic golf game. Up to four players can take part in single round, tournament (featuring 18 players over four rounds), or practice modes. The game is viewed from overhead, with the entire hole on a single screen. The player must choose a club, then a shot power, and then a shot direction, before executing the planned shot by pressing space once to start the swing, and again to execute it ? imprecise timing can impart draw or fade onto the shot. On the green you must choose the shot power before the direction, taking an overall slope into account. There is no indication as to how far the ball is from the hole.": "",
  "Prohibition is a shoot'em up taking place in New York in 1930. The town is overrun by gangsters and you're hired by the police to rid the town of them. The gameplay is simple: you're facing a row of buildings, a gangster pops up and you have to shoot him before the on-screen timer goes empty and he shoots you first. You can hide until the timer restarts but this is limited too. At the end of each stage is a bonus round where you have to shoot gangsters in a room, with no more ability to hide and a faster timer. As you progress through each stage, the game will become faster, and enemies will become harder to find and to hit. Of course, your goal is to reach the end of the game with the highest possible score.": "",
  "Project: Space Station casts the player into the role of a NASA Administrator, charged with the task of designing and building a space station. The project will span 15 years, during which time the player must plan shuttle launches, recruit personnel, manage the budget, conduct research and development and, of course, design and build the station. A very deep and involved game for such an early effort.": "",
  "Pursuit of the Graf Spee is a strategic game that allows the players to recreate the historic search for the German pocket battleship, Graf Spee, in late 1939. In the game, players will control individual ships moving on a map of the South Atlantic. There are two scenarios to choose from: The December 1 AM - December 25 PM or The December 13 AM -December 25 PM. Each game turn consists of sevens phases. Victory points are determined at the end of each game. Game will end on December 25 PM or if both the Graf Spee and the Altmark are sunk.": "",
  "In this game, you guide a marker which must draw rectangles and other weird objects in order to claim your territory, and you can either draw these rectangles fast or slow. Drawing the rectangles using the \"slow\" method awards you the most points. Once a rectangle has been made, it will be colored in to show that you have claimed your territory. While drawing the rectangles, you need to watch out for Qix (pronounced \"kicks\"), a series of colored lines that crawl the screen. In addition to Qix, you also need to avoid the Sparks who travel around the border, as well as any lines that you have made, as well as The Fuse, who travels along the line that you are drawing. Once you have claimed enough territory, you proceed to the next level.": "",
  "In this role-playing game, the player begins as a peasant whose land is under attack by monsters. After killing one, a princess names the peasant champion, and issues a quest, to rid the country of enemies. She can provide no map, but says that part of the quest involves learning the layout of the land by traveling it...and so the game begins. The ultimate objective is to find and defeat the wizard Mantor, and recover a magic book which gives him the ability to flood the land with monsters. Questron is played on a two-dimensional top-down map. Everything is represented by tile graphics: towns, monsters, trees, hills, etc. The sprite that represents the player changes, depending on which mode of transportation is used -- beginning, for instance, on foot. Dungeons in the endgame are done in a three-dimensional first-person style similar to The Bard's Tale. The player may be a rising hero, but even heroes need money to buy tools and weapons and even food -- starvation is a real possibility! One source of food and gold is hunting game animals -- some can be eaten, and many carry gold. Then there are further opportunities in the various towns. The hero of Questron does not have to be perfect; the game makes concessions to moral ambiguity. In towns, the option of robbing the merchants is given to the player; of course, there are guards... Money can also be raised by gambling.": "",
  "In 1988 a sequel was made for the Apple II, Apple IIGS, Atari ST, Commodore 64, IBM PC and Amiga computers. It featured similar gameplay to the original with improved graphics and features. This game's programming, artwork and rules are credited to Westwood Associates[5] while the storyline and original design are credited to Quest Software. This game was also produced by Strategic Simulations, Inc The premise of this game is that the player's character has been sent back in time to defeat six \"Mad Sorcerers\" before they can create the \"Book of Magic\" featured in the original game.": "",
  "RDF 1985 is the sequel to Germany 1985 and is the second game in the When Superpowers Collide series. The game is a strategic simulation of a conflict between the forces of the United States and the Soviet Union. While the battle rages in Germany, Soviet paratroopers land in the Middle East to capture strategic oil fields. The United States responds by sending in the Rapid Deployment Force (RDF) to recapture the oil fields. There is only one scenario. Victory conditions are simple: the player controlling the greatest number of towns and oil fields after a certain number of game turns is the winner.": "",
  "As Tal, your job is to single-handedly clear out the aliens who have invaded a desolate and destroyed post-nuclear earth. To have any chance of this, he must locate a sacred suit of armor. Not only will this protect him from radiation, and allow him to withstand some enemy contact, it also heals him, and enables him to float. This means that the game has two distinct styles, with your character limited to jumping, and with only rocks (located around the screens) to throw. Once he finds the suit he can fly around the ledges, shoot the inbuilt Pulsar beam, and survive within the volcanic hideout the aliens have based themselves. You will need to recharge the suit at times, and also take it off to pass through tight caverns.": "",
  "The USSR has launched a huge attack on the USA, and the only hope for the free world is for you (as leader of a US Squadron of fighters) to destroy their defense bases. This is done in a multi-stage action game with some similarities to the same developer's Beach Head. All the mini-games must be completed before the time limit on the bomb is expired. The first thing you will see is a missile being launched; the game then takes you to your hangar, from which you must quickly launch as many ships as possible, a task made difficult by the limited gravity. You must then fly it into Soviet airspace in a side-view shoot 'em up section, in which staying low keeps you safe from radars, and quick reactions see you shoot enemy fighters and avoid trees. The next scene takes place on a single-screen view, with five windows to shoot through, and enemies aiming at you to be avoided. You then reach the base, and must shoot out approaching enemies. Finally, you must use discs onto a wall, such that they rebound to hit maintenance robots, with the ultimate goal of causing the base to overheat, the Soviet attack to be thwarted, and the US to be saved.": "",
  "Rails West! is a simulation game about the 19th century speculation in railroad financing. It allows for 1-8 players, with up to 4 under computer control. The long scenario starts in 1870 and ends after the 1900 turn (with 31 turns total). The short scenario starts in 1890 and ends either in 1895 (6 turns) or 1900 (11 turns). The objective is to accumulate cash, stocks and bonds and to control viable transcontinental railroads through strategical decisions.": "",
  "George, Lizzy and Ralph were just ordinary Americans, until an experiment went wrong, turning them into a Gorilla, Lizard and Werewolf respectively. Following this, the three of them plan to go round destroying buildings, and up to 3 human players can join in. Smashing at the edges of the buildings for long enough will make them collapse. The police and military are after you, and will shoot at you, so try to destroy them (failing that, you can avoid the bullets). You will need to eat regularly, with things like plants on offer, to avoid shrinking back to being human.": "",
  "Realms of Darkness combines traditional RPG gameplay (party, stats, and combat system) with some elements borrowed from text adventures. Assemble a party of one to eight characters and go on quests to gain power and riches and magical items by defeating monsters. The game consists of many scenarios, each requiring several hours of playing to be completed. Move around in the realms using your keyboard or joystick or both. Travel and explore cities, dungeons, caverns and other types of dwellings. and talk to city inhabitants. Creating characters requires that you determine their traits and abilities which are defined as six attributes: Wisdom, Intelligence, Agility, Strength, Vitality and Luck. Choose their profession or class. Your choices are Fighter, Sorcerer, Priest, Thief, Champion, Knight, Barbarian or Friar. Finally, decide what race they will be, Gnome, Dwarf, Elf or Human. Once that is done, choose the sex and type your characters name. Once you have assembled your party, your adventure can begin. Certain situations require the player to type very detailed, context-specific commands (such as for example \"shout\") in order to solve a puzzle or otherwise advance in the game. This feature gives Realms of Darkness a flavor of an adventure game. The player can also split the party in two and control both while exploring different locations.": "",
  "Rebel Charge at Chickamauga is a tactical simulation of the South's last major offensive thrust during the American Civil War. The game uses a refined version of SSI's Gettysburg game system and is played in 13 turns each representing two hours of real time over a two day period. Players are awarded points based on casualties and territorial objectives. At the end of each turn and the end of the game points are calculated and compared to a chart which determines your level of victory. The game can be played under 3 different sets of rules (Basic, Intermediate, and Advanced) and can be played against another person or the computer can play either side.": "",
  "Reforger 88 is grand tactical game of combat between the forces of NATO and the Warsaw Pact, which takes place at the Fulda Gap in the year 1988. The game covers the first week of the war. The Warsaw Pact attacks with 12 divisions in an attempt to capture Frankfurt and destroy Rhein-Main Air Force Base. NATO, defending with 5 divisions, must fight a desperate delaying action. Each game turn consists of 12 hours of operations. Operations consist of supplying and moving combat forces, changing formation, planning assaults, air strikes, airborne missions and artillery bombardments and resolving combat situations. The game map covers the battlements in Central Germany, from Kassel in the north to Wurzburg in the south. Movement around the map is controlled by a hexagon grid system with each hexagon representing 6 kilometers The NATO forces must be commanded by a human player. The Warsaw Pact forces may be commanded by either a human or the computer.": "",
  "Regatta is a boat racing game. Four players play on a single PLATO terminal and race their boat along three numbered buoys in numerical order. The first who crosses the finish line wins the race.": "",
  "Player(s) travel the land of Greece to accomplish the 12 tasks assigned to them by Zeus and the other gods. Gaining fame and fortune by fighting strange beasts and completing the tasks, the player(s) get help on completing the quests from the Oracle at Delphi. Several human players can play together on the same computer. You control up to 19 mythological heroes in an effort to perform all the tasks of Heracles. You can visit sites such as Mt. Olympus and Troy, recover the golden apples, and even combat famous creatures such as the medusa, the Minotaur, and the hydra.": "",
  "Reversi is a computerized version of the board game Othello. During the game, two players take turns placing game pieces on the board in an attempt to trap pieces of their opponents color. Any trapped pieces will then be reversed in color. When the board becomes completely filled up, whomever has the most pieces of his own color on the board wins. The game can be played by two players, or one player against the computer. There are three skill levels the computer can use, and three different board sizes are available, 6 by 6, 8 by 8, and 10 by 10.": "",
  "Rings of Zilfin is an unusual, but relatively unknown early fantasy solo RPG by Ali N. Atabek, who went on to create the Magic Candle series. It was meant for beginners to computer RPGs, featuring no character creation, simple game play and movie-like cut scenes, concentrating more on atmosphere than on character stats. The background: Long ago, the Zilfins (mighty wizards) established an enchanted realm of peace and property in Batiniq. They created two rings of power which, worn together, made the wearer invincible. Unfortunately, the evil necromancer Lord Dragos has found one of these rings and has come to great power. The only hope to prevent him finding the second one is Reis, a young boy possessing some innate magical ability. In the introduction, Reis barely escapes Dragos' minions, and leaves his home village. After \"character creation\" (giving Reis an optional other name and selecting one of 10 difficulty levels, which affect your starting resources), you start your quest to find the Zilfins and their second ring and to develop your magical abilities on the way. The game features a huge world with over 100 villages and towns in four kingdoms. Each town has up to three buildings you can enter -- shops with items to buy and sell, inns to eat and drink and rest, amongst others --, and also people you can talk to (careful, some are shape shifters!), sometimes offering valuable information. There are also a few dungeons and some caves to explore, but most of the game is played in towns or travelling between them. When leaving a location, the game shows a map where you can select the direction off your next target. While travelling between locations, the game shows an interesting side scrolling view. You can set your walking speed, which influences your fatigue, and stop when you encounter pools or plants. Pools can be drunk from (may have positive or negative effects), and the plants can be gathered and eaten later. Some plants have special effects, there are \"magic mushrooms\" and some other healing and boosting plants. This plant system is one of the things that distinguishes this game. While travelling, you may also encounter Lord Dragos' minions, which results in some pseudo-real time combat. The monsters are often quite unusual, like Barvils (mutated bats), Basurs (flying skulls) or Zumagin (the death ray demon). Protected by different armors, you can attack with arrows or swords or by casting spells. The game makes a difference between ground-based and air-bourne monsters -- the latter cannot be attacked with swords, of course. The spell system is quite simple. There are three spell levels: Apprentice, Master and Grand Master, each one lets you know more and more powerful spells. Casting a spell always costs some fatigue, and you have to prepare the spell first. The game is highly non-linear and there are several approaches possible. For example, it is possible to make money by trading, buying cheap items in one town and selling them in another town -- which, in fact, is the only way to make money in the beginning. All commands are given by pressing keys, like \"G\" for getting things or \"C\" for casting spells. The game may be saved when exiting towns and loaded at the main menu.": "",
  "Ringside Seat is a realistic simulation of professional boxing, allowing the player to manage the greatest fighters of all time - the game includes data for over 45 great fighters past and present. It can be played as a two-player, one player against the computer, or a no-player (computer managed fight) game. Select a fighter, choose one of eight weight classes or divisions, the number of rounds (3-15) and, should your fighter have the ability to fight as either a boxer or slugger, his fighting style. You will then decide whether you prefer to have the cumulative judges' scores displayed while the fight is in progress or at the end of the fight. Both managers select their fighter's strategy each round. Strategy options are Fight Flat Footed, Cover Up, Charge In, Stick & Move, Stay Away, Go For The Knockout and Protect Cuts. Once both managers have selected their strategy, the round bell will ring and the two fighters will approach the center ring. Using text and semi-animated screen display, you will see the fight in the ring as it happens, blow-by-blow, round-by-round. Each fighter is rated in over 25 categories such as strength, stamina and style. You have the ability to save our fighter and are also given the ability to save a fight in progress to resume at a later date.": "",
  "Patrolman Alex Murphy was killed on the streets of Detroit. The major corporation there, Omni Consumer Products (OCP) saw an opportunity to sell a new kind of law enforcement officer to the troubled city. They took what was left of Murphy, encased it in titanium armor, wiped his memory and created RoboCop. Now it's up to RoboCop to clean the streets of Detroit and eliminate the one responsible for his murder, Clarence Boddicker. But it looks like Clarence might not be the kingpin of this town... Based on the 1987 movie of the same name, RoboCop allows the player to control RoboCop. The majority of the game is a side scroller. RoboCop can punch unarmed citizens and shoot armed citizens. He can move left, right and duck but can not jump. Different weapons can be picked up from enemies, and power-ups to restore health and/or energy. Following levels, RoboCop will have to match a criminal's face to the proper mugshot and engage in a first-person shooting bonus round. Amiga and Atari ST versions are faithful to the original level design of the Arcade game, but they also add first-person rescue hostage scenarios, and a mini-game where the player needs to match the suspects' faces": "",
  "Robot Battle was a programming game in which players used RSL (Robot Scripting language) to create robots which they then used to battle other player?s creations on-line. A fee was charged for entry into these contests, early contests cost $10 to enter but this was reduced to $5 in 1995. The game was developed and released by Brad Schick in 1994 and at that time the robots were 2D and were viewed top down. It went through many upgrades and versions before being sold to GarageGames in 2004. There is a story behind the game which sees robot fighting become legal in the year 4000. As a newly graduated programmer you have been asked to build a fighting robot to represent the Vega system in the Intergalactic Robot Battle Contest. Succeed and you may never have to work again, fail and ?you'll probably end up writing new versions of Vega Calculator in some half-forgotten VegaSoft building on one of the twenty moons of Vega Panet.? Robot Battle (version 1.2) of the software came with these pre-configured robots Corners, Events, Fire, Rammer, Shell, Side and Target. The scripting for each could be viewed and used as the basis for new designs which could then be tested in a local battle and/or be swapped with other members of the community. It came with three .exe files;winrob.exe: This is the main game and is used to set up local battles between robots distrib.exe: Is a program that scrambles a robots code, this is used when swapping robots with other members of the Robot Battle community. Robots scrambled by this process could not be entered into contests, 'plain' code had to be used for that.. contest.exe: Used to submit player details, robots, and make payments when entering competitions.": "",
  "Control a Robot Rascal in a turn-based scavenger hunt that mixes strategy, action and board-game elements. The game included a set of physical cards, which told you what you needed to hunt for in the field or Laustenfownd. The first to find all the objects in their hand of cards wins. Luck cards can affect the outcome of the game. They give the player the chance to modify their hand, often at the expense of another player. Steal card, Force Swap among players or pass your trash either left or right are examples of the effects of a Luck Card. Each player must draw a Luck card at the beginning of their turn. The game allows you to choose among 10 different types of robots to use in your hunt, each with their own personality and style. You must also mind the type of terrain you wander into, because some types may damage your robot. The game also featured handicapping options, and, like most common card games, featured many variations of the original game by changing the way the cards are discarded, exchanged or displayed on the board.": "",
  "You are a mutant human, who by some freak of nature has the ability to shoot energy pulses from his body in eight different directions! Your job is simple: save humanity from their own creation -- the ROBOTRONS! The gameplay is pretty unique for the time. You can move and fire in any of eight directions. You get thrown in a room with various evil baddies strewn about, you've got to kill all the robots while at the same time finding some way to grab humans and avoid death.": "",
  "It is May 8, 1941 and you are Captain of the mighty German battleship Bismarck the single most powerful ship in the Atlantic. Hitler has given you the nearly impossible task of fighting through the British Home Fleet and sinking enough convoys to force Britain to surrender. Your level of victory will be determined by how many merchant ships and battleships you can sink. Your decisions will determine the fate of the Bismarck.": "",
  "Operation Apocalypse is war simulation game based on WWII land operations. There are four separate solitaire scenarios to choose from: Advance To Contact, Bridgehead, Invasion and Highway. You have four levels of difficulty to choose from. In each scenario, the computer assigns the forces for both opponents which are completely equal in size and strength. At the start of the game, you have to place your troops on each game hex. There are variable terrain hexes for each game that poses a challenge for each game.": "",
  "A side scrolling shoot 'em up inspired by Defender, but adding much to the concept. You fly across a looping horizontally-scrolling landscape aiming to protect your base. There are a total of eight enemies on screen at any given time. The Quarriers try to build the enemy base by stealing parts of yours. The Drayns steal energy from you and then supply it to the enemy. Fortunately you can steal back the energy they take, but you can't steal back parts of your base. The other six enemies just try to kill you. The bigger the enemy base gets, the more rapidly and accurately they can launch enemies at you.": "",
  "Round About is a fixed screen shoot 'em up. What sets it apart from other shooters of its time is that the player isn't restricted to the lower parts of the screen. Here he can move along every side of the screen, around the enemies that move around in the middle. The enemies are abstract shapes that move in packs swarming around the screen in specific patterns while the player tries hitting them. Once one swarm has been killed there's another one taking its place. The player has three lives at the start and earn new ones after completing every few levels. The game has 24 levels in total and after that it starts over.": "",
  "The player controls a gun turret at the bottom of the screen. The turret can swivel to cover a large area of the screen, but cannot move from its base. Helicopters fly across the screen at varying heights, dropping paratroopers. The gun may fire multiple shots at once, and the shots may destroy helicopters or shoot paratroopers. Paratroopers may be disintegrated by a direct hit, or their parachutes may be shot, in which case they will plummet to earth (splattering and dying if they were sufficiently high when the shot hit). Furthermore, destroyed helicopters turn into shrapnel, which may destroy other helicopters or paratroopers. Periodically, jets may fly by and drop bombs; the jets and bombs may be shot as well. The player earns points by shooting helicopters, paratroopers, jets, and bombs. Firing a shell costs the player one point, so if one is playing for score, there is an incentive to conserve ammo. The game ends when the player's turret is hit by a bomb, when a single paratrooper lands directly on the turret, or when four paratroopers safely land on either the left or right of the turret (that is four on one side, not four total). Once this happens, they are able to build a human pyramid and climb up to the turret and blow it up.": "",
  "In The Seven Cities of Gold the player takes on the role of Christopher Columbus and the later Spanish conquistadors, exploring the New World (or a randomly generated map). As the player establishes forts and missions, bringing back gold to Spain, he or she would receive promotions from the Queen of Spain. The game features a large world to explore and comes up with some arcade sequences to simulate the interaction of the Natives and Spanish who did not speak the same language. The historical map accurately spreads out the Native population of the New World in 1492 and some historical situations can be simulated, such as whether to get the gold of the Aztec and Incas by trade or conquest.": "",
  "Shanghai is one of the first video game adaptations of the tile-based game played with the Chinese mahjong stones - essentially a puzzle game that has little to do with real mahjong rules. The gameplay involves 144 tiles, each depicting different images, which have to be removed by matching them into pairs. The tiles are arranged in a gridded pattern, which is higher near the centre. A tile can only be removed if it has no tile next to it on at least one side. This computer implementation can generate a random board layout to take on and features five preset challenges, some of which have time limits of five or ten minutes, as well as a multiplayer mode.": "",
  "Sherwood Forest is an graphic adventure game with a text parser. You play Robin Hood and your goal is to marry Maid Marion. The regular Robin Hood cast makes an appearance: Little John, Friar Tuck, the Merry Men, and Sheriff of Nottingham. Your travels take you through forests, up mountains, into caves, and you even get to fly in an albeit unconventional way.": "",
  "The major battle in Western Theater of American Civil War fought on April 6-7, 1862 near church Shiloh in Tennessee was the bloodiest battle between Union and Confederate forces. Historically Union forces lead by Maj. Gen. Ulysses S. Grant won in the battle and finished Confederate's hopes to block the Union invasion of northern Mississippi. The game is played as Confederates, as Unions, both sides, or having the computer choose. Two scenarios are available: the Campaign Scenario April 6-7 (Confederate's attack and Union's counterattack after Union supporting forces arrival) and First Day Scenario April 6 (Confederate's attack only). There are three difficulty levels and five levels of different options such as Conf/Union Ammo Supply, Union Arrival, Conf/Union Effeciency. During war gameplay you move the troops on the map with rectangular grid using your tactical/strategical skills by turns, after that combat is flowing, and statistical results of the combat are shown. Map represents nature of the locality. Each turn takes some amount of time. Your actions increase your score according to successfulness.": "",
  "You are now a member of the Silent Service, the US Navy Submarine command. For a long while after Pearl Harbor, you are the only forces capable of striking back at the Japanese in the Pacific. Take one of the \"fleet boats\" and go on extended patrols of up to 2 months from Hawaii, Australia, or New Zealand. Set your difficulty/realism level and time period (early means less tech for juicier targets, later means tougher escorts, more tech, lousier targets). Contend with factors like dud torpedoes, maximum depth, and more. You can choose among practice run against some old hulks, recreate historical convoy attacks, go on a single patrol, or go on your own campaign, which lets you go multiple patrols until you die, get promoted, or survive the war. How well will you do when matched against history?": "",
  "Six-Gun Shootout is a turn-based strategy game of man-to-man combat, using the setting of the American West in the 19th century. It offers ten scenarios which can be played against the computer or a human opponent. The scenarios are loosely based on historical situations, like the Gunfight at the O.K. Corral, or entirely fictional. Some are based on movies, for example the 1959 released \"Rio Bravo\".": "",
  "Sky Destroyer is an aerial combat game. Players take the role of a warplane that has to defeat various enemy combatants in the air and in the sea. The player's warplane is equipped with machine guns and can also fire off torpedoes. The main goal is to destroy a fortified island at the end of each scene by firing a torpedo at it. Gameplay is viewed from a behind the plane viewpoint. While flying. players will notice time elapses by the background changing from day to night and then back to day again. The is to help indicate to the player that they are making progress throughout the level. When the player cycles to the next daytime sequence, the player will be able to know a island should be coming up soon. After taking out the fortified island, players will get a chance to play a bonus stage where the objective is for the player to destroy as many planes of an incoming enemy fleet as possible, with each destroyed plane adding to the player's score. Managing to destroy every single plane in this bonus round will also give the player additional bonus points to add to their overall score. The player starts with three lives and can lose them by either getting hit by incoming enemy fire or crashing into the water that is below them.": "",
  "Aliens have invaded your beloved homeland, and you must help save it. You are flying the Skyfox, the most advanced attack fighter plane available to the Federation, from within the cockpit. Skyfox is complete with deflection shields, laser cannons, five guided and five heat-seeking missiles and a top speed of Mach IV. The 15 scenarios can be played at 5 skill levels. You will have to fight tanks, enemy planes and the mothership. Use the radar to locate enemy vehicles, and the long-range scanner to ensure that no wave reaches your base before you can take it out. Keep an eye on your shields, and on fuel levels - you can dock at the base to refuel.": "",
  "Sneakers is a variation on Atari's classic Space Invaders. Move your ship to the left and to the right and shoot enemies who try to fall down and kill you. There are eight types of enemies, each one using a different tactic to destroy you. You start with the relatively harmless Sneakers and gradually work your way through Cyclops, Saucers, Fangs, H-Wings, Meteors, Scrambles, and Scrubs. After you finish off the Scrubs, you proceed to level 2, which follows the same pattern, but with an increased difficulty level.": "",
  "Softporn Adventure is a comedic, adult-oriented adventure game, originally written by Chuck Benton for Apple II and became the inspiration for the animated Leisure Suit Larry series. Players must type the verb and the noun to do different actions and finally break virginity of protagonist. The player's name is not yet Larry, but the plot of the game is very similar to Leisure Suit Larry in the Land of the Lounge Lizards. The player has to collect items to win over women in creative ways.": "",
  "This is a version of the classic Sokoban, written in FORTH for the VG5000 home computer. Your job, as a smiley face with sunglasses, is to push all the shopping carts to the parking position. But it's easy to get stuck since you have to shuffle the carts around or you can't move freely, and carts in a corner can't be pulled out. All the graphics are in character intervals, making the playfield a rather small part of the screen. The game also includes a level editor.": "",
  "Three of the key battles of the American War of Independence are recreated here. The British army and American patriots can be played by either human or computer (with 3 skill levels). Each side's level of reinforcements and ammunition can be set on a 5-point scale. The smallest and shortest battle is Bunker Hill, while the Battle of Monmouth is distinguished by harsh weather, and Saratoga requires a different fighting style to the highly regimented one the British unsuccessfully used.": "",
  "Following the defeat of the evil krill in Enchanter, the intrepid apprentice have become a full member of the Circle, under the command of the famed Necromancer Belboz. Very soon, however, the hero notices that something strange has been happening to the master. He frequently talks to himself and seems to be under some sort of a malevolent influence - until one day, he is mysteriously kidnapped. Looks like the brave Enchanter must venture on a perilous journey once again, and bring back the leader of the Circle. Sorcerer is a sequel to Enchanter, and is part of the Zork universe. Like its predecessors, it is a text adventure, in which the player interacts with the game world by typing combinations of verbs and objects. The spell system from the previous game is back; a new feature is the protagonist's ability to drink magical potions, which must be done sometimes in order to solve the game's puzzles.": "",
  "A wargame simulating a specific battle during the 1967 Arab-Israeli war, with hexes and unit statistics like a paper wargame plus a more detailed combat resolution system taking advantage of the computer's number-crunching abilities. The human player controlled the Israeli forces, while the computer controlled the Arab ones. Like many paper wargames, the disparity of forces was balanced by the victory conditions and the rules of engagement - for example, Israeli units could not cross the border before an Arab unit had done so, and still gain the highest victory level.": "",
  "The Princess Blue was a trading vessel. While cruising through space, it happened upon a derelict ship floating in space. Only one crew member was allowed to investigate the abandoned ship. Suddenly, Manchi raiders appeared on the viewscreen. The Manchi managed to ambush and destroy the Princess Blue. The only surviving crew member from the Princess Blue swears revenge and is determined to do everything in his power to defeat the Manchi. Space Rogue is a hybrid game that combines space flight and combat simulation with trading and RPG elements such as interaction with characters and a quest-based structure with a main plot line. Space flight takes place in two different modes: Cruise Flight, which is ideal for travelling quickly, and Newtonian Flight, which works best for combat and precision flying. There are also three different camera views for the 3D exploration and combat. Each planetary system has a variety of destinations and obstacles to travel through via a top-down navigational map. Traveling to an outpost, a space station, or any other location with the star system can be done simply by selecting it and charting a course, or in real-time 3D flight mode. Interstellar travel between systems, is done by finding a Malir Gate and using it to reach hyperspace. While in hyperspace, the game becomes a simple 'tunnel' game where the player must manually control the ship not to hit any of the walls. Also hyperspace travel eats away at the ship, so the faster the player can get through them, the more armor the ship retains. While traveling in space the ship may get attacked, or the player may opt to assault any other ships first. It is also possible to buy and sell various goods, earning money and spending it on outfitting the ship with weapons and various upgrades, such as for example a device that allows it to move more stealthily through space and avoid detection by hostiles. The player character has a reputation rating with various factions such as the Imperium, the pirates, and others. This rating is affected by the player's actions towards them and can be raised or lowered by helping specific factions fight others. When docked at outposts or stations, the view shifts to top-down, and the player navigates the protagonist through the location in an adventure or RPG-like fashion, examining objects and talking to characters. Conversations may have multiple choices, and a few instances require the player to type in keywords, though for the most parts responses are selected from a menu. The game has a main plot line that requires finding, talking, and performing tasks for characters, as well as sub-quests that may result in various rewards such as money or ship upgrades.": "",
  "You are in command of Space Station Zulu and its 43 man crew orbiting a huge gaseous giant in a farflung corner of the galaxy. Shortly after an exploration ship leaves the station the onboard computer notifies you that the sanctity of the station has been violated by unknown alien lifeforms ( which find your crew very tasty). Now you must direct your crew in a desperate struggle against this deadly peril. There is only one way to win and that is to rid Space Station Zulu of all the alien intruders. The aliens win by taking over the ship. There are 3 levels of difficulty (normal, difficult, and little hope) and this is a one player versus the computer game.": "",
  "In Space Vikings the player flies a space craft with the ability to shoot at other ships. The goal of the game is to take over a planet so you can loot it to get things to sell for credits which can be used to buy troops, tanks, missiles, transports, and fighters.": "",
  "Spectre is a 3D shooter where the player drives a little red car/tank and blasts away enemies. The gameplay is similar to Battlezone, and obviously inspired by it. There is a selection of three tanks, each with three values (speed; armor; and firepower) balanced out to match its name: Tough Guy is heavy on armor, but slow and not very powerful; Speedy is fast, but low armor; and Balanced combines both strengths, but decreased. A fourth tank allows the player to design a custom variant. Every level consists of a large plane filled with enemy tanks, several psychedelic walls with odd images that often flicker or warp resembling an acid trip, and tacky 3D models like windmills. The object of each level is to either destroy all the enemy tanks in the level, or to collect all the flags. Every level has a certain theme to it, anything from plain green to a colorful blinking eye or images of sand dunes are to be found on the walls, windmills and flags throughout the level. With every passing level, enemy tanks grow smarter and their rates of fire increases. Also in later levels, new, smarter, more powerful enemy tanks join the skirmish. The player has a limited amount of ammo, but driving over ammo deposits replenishes a small amount of ammunition, as well as driving over shield deposits grants additional shields. The three different views (first, third, and top-down) allow the player to incorporate additional strategies into the battles. The game boasts having supposedly an infinite amount of levels, though anything after level 80 is almost instant death. A high score table is also included. An additional note-worthy feature of this game is the multi-player mode. Up to eight players are supported over IPX, or NetBios (or two via modem or serial port). The network option offers three Cyberspace Scenarios: Arena - free-for-all battles, get one point for each opponent destroyed.Flag Rally - a match point given for collecting six flags, destroy someone to get any flags being carried.Base Raid - Akin to \"capture the flag\". Two teams, two bases; get match point for destroying opponent base.The CD-ROM manual includes a \"Cyberpunk story\", to give background information on the game which consisted of a cyberjock named Hart who lived for the battles in the Arena.": "",
  "Originating in the arcades, Spy Hunter is a driving action game played from an overhead point of view. Your car is equipped with machine guns to help you get past the numerous enemies out on the road (be careful not to shoot any civilians, though!) Occasionally you will come across a weapons van, and if you drive into the back of the van your car becomes equipped with a second weapon (such as smoke screen, oil slick, or missiles). At several points the road splits and you can enter a boathouse which transforms your car into a boat temporarily. If you drive far enough the seasons change as well (watch out for icy conditions during winter!). The enemy cars will do anything to stop you, including running you off the road, firing guns from the back of a limo, or dropping bombs from a helicopter.": "",
  "In this budget Breakout-style game use your bat to hit the bouncing ball in an attempt to destroy a wall of bricks. Each wall cleared moves you to the next colorful level. As the game progresses alien enemies appear which can be destroyed with your ball, though interfering with its path. Use falling pickups to enhance your bat's abilities, adding features like speed-up, lasers, and level jump.": "",
  "In the distant future, a small group of human exiles have been doomed to fight for survival on the edge of the galaxy. Through military strength, espionage, and deceit, a unified Terran government has maintained an uneasy peace. But a previously unknown species, the Zerg, has started overrunning their colonies. Furthermore, a second alien species, the enigmatic Protoss, became intent on stopping the Zerg. The Protoss solution, however, is to extinguish all life on Zerg-infested planets, including many surviving resident Terrans. At the same time, rebel factions within the Terran government are gaining popular support during the Zerg crisis. The time for war has come! Gameplay in StarCraft has clear similarities to Blizzard's earlier WarCraft II. Building units requires credits and a power source, and once completed you can direct them into combat against foes. You only know the layout of terrain you have visited, and only the exact whereabouts of enemy units which are range for one of your units, due to the Fog of War. Each of the three races has a distinct range of units and general strengths: Zerg units are quick to build, Terran units cost the least, and Protoss units are the most powerful individually. In a change from many strategy games, the base style for each race also varies significantly, resulting in a very different playing experience with each. Missions vary from destruction to infiltration. Realistic line-of-sight calculations make the correct result more likely. A full map editor is provided, with many user-created maps available online.": "",
  "The year is 2186. Humanity has established colonies on the moon, Mars, and several of the larger asteroids. Earth's sky is dotted with space habitats, and the spaceways are always busy. As usual, there is the urgent need for energy to power this advanced civilization; one of the primary sources of that energy is quantum black holes. In Starcross, you are a miner of black holes, scouring the asteroid belt in your one-man survey ship. Finding and harnessing a single black hole can make a person's fortune. It's a lonely business, fraught with the known and unknown hazards of space. You've equipped your ship, the M.C.S. STARCROSS, with the best gear you could afford. You've put everything into this venture, and though you've tried before, you somehow sense that this time will be different. The ship's computer handles the functions of navigation and routine maintenance. You watch the sophisticated mass detector as it unceasingly scans the vicinity for uncharted masses. To assuage the tedium of your long trip, you browse through the compact tape library, a compendium of human knowledge and culture. But the drone of the ship gradually lulls you into a deep sleep. As you sleep, you dream of the riches which would be yours if your search for a quantum black hole is successful. Little do you suspect that the alarm on your mass detector is about to jolt you out of your dream - but not to grapple with the long-sought black hole. Your quest has taken an unexpected turn, for you are destined to rendezvous with a gargantuan alien spaceship from the outer fringes of the galaxy.": "",
  "The Planet Novenia has been attacked by the Egrons, who snuck in by disguising their craft as the protected Starglider species, which Novenia's automated defenses were programmed not to shoot. Your task is to fight them off using only an obsolete Airborne Ground Attack Vehicle. This was designed as the ultimate combat machine, with sophisticated hardware up to Draziw Yarg's high standards. It has a fully-rechargeable shield, plasma drive unit, an inbuilt scanner and 10,000-sector map, a top speed of 2550 Urads and two homing missiles. The game is viewed from within AGAV's cockpit, with control over speed, weapon targeting and firing. There are several control options to decide exactly how the craft works, with fixed or floating sighting, and the option of automatic centering, allowing you to balance the game between easy sighting and advanced shooting ranges. Repair depots must be visited frequently, as they can refill the weapon bays as well as repairing the ship. Crucially, the Egron Stargliders need 3 missiles to shoot down, so at least 1 visit to a depot is required to complete this job, at which point you move up to the next, harder, level.": "",
  "Starship Commander is a 1-player space-themed strategy game for the Apple II. The player controls the USS Ranger in turn-based space combat against 1 - 3 enemy Vegan vessels. All gameplay is via Apple paddles from menu commands. The player controls movement of the vessel in 2-dimensional space, and must control direction and acceleration of the ship. The player controls the communication, defense, engineering, life support, navigation, science, and weapons stations of the their vessel. The player's crew has a total of 120 crew members, who must be assigned to different stations. The player can attempt to bluff or threaten enemy vessels, and must carefully control the different stations, the number of crew devoted to each area to keep their ship in fighting condition.": "",
  "Taking basketball out of poshly-decorated arenas with hotdog sellers, cheerleaders and pre-game entertainments, Epyx presented basketball played as it is by kids all over America. Four different courts are provided - the schoolyard, the alleyway, the parking lot and the backyard. Each of these has its own hazards to play around, such as oil slicks and potholes. The standard basketball dunks, passes and steals are on offer. An opposition player drilling the ball into you sees you gain possession. One or two players can join in, choosing their team of 3 from the 10 kids you are offered, each with different abilities. There are 3 computer difficulty levels.": "",
  "Summer Games allows up to eight players to compete in a series of summer themed Olympic events. The gameplay is similar to the other entries in Epyx \"games\" series. Each player can choose a country to represent, and then takes turns competing in various events to see who will win the gold medal! The game allows you to compete in all of the events sequentially, choose a few events, choose just one event, or practice an event. The events available vary slightly depending on the platform, and may include:Pole vault Platform diving 4x400 meter relay 100 meter dash Gymnastics Freestyle swimming Skeet shooting 100 meter freestyle Rowing": "",
  "You just inherited a one-man star freighter - the SunDog - from an uncle who died under mysterious circumstances. You also inherited the contract he signed to aid in the building of a colony for a religious group. You have three tasks to perform: find the location of the colony; find, buy, and deliver goods needed for its construction; and locate the cryogenically-frozen colonists needed to populate the colony.": "",
  "A maze top-down dungeon crawl computer game for the Apple ][. In \"Super Quest\", your objective is to penetrate the maze of Saladin and activate the fabulous Mega Crown, the one device that might restore the balance of technology and magic. The maze has more than one-thousand chambers and corridors arranged in four large sections or \"levels\". Throughout the labyrinth are treasure chests containing gold, jewels, and other valuable items as well as weapons, vials of healing elixir, and a magic lamp. Some chests, however, are full of junk or even empty. Monsters guard the treasures to guarantee that only a hero of tested mettle reaches the Mega Crown. There is only one known entrance, through an underground passage to the middle of the first level. The Mega Crown is said to reside somewhere in the fourth level. Just outside the maze is a bazaar and inside it are two hospices (the latter are maintained by maze gnomes). These are places where you may rest (do a game-save), sell treasures, and bargain with greedy merchants for weapons and other supplies. The hero can be one of four races: Human, Hobbit, Dwarf, or Elf.": "",
  "On a space settlement named Contra, a human being serves as a regulator for the planet's vital systems: he controls transportation, weather, and manages resources all while being in a deep sleep, through the neural power of his brain. Such a regulator is called Central Mentality. However, after five hundred years of stasis, the current Central Mentality suddenly awakens, greatly troubled by reports of computer malfunctioning and resulting problems in weather condition, food production, and transport. He must now act, and act quickly: the crew members assumed that he has gone insane, and are coming to disconnect his mind. But what can he do if his state of suspended animation prevents him from moving? Suspended is a text adventure game with a twist: instead of navigating the protagonist, the player indirectly controls six robots that do his bidding, exploring the environment and interacting with it. Each robot has different functions and has its own way of seeing reality and reacting to events around it. Iris is the only robot that can see and therefore visually describe locations and objects; Whiz can provide technical information obtained from computers; the sonar-powered Waldo is good at holding items; Auda is an expert in sounds; the cryptically speaking Poet senses the flow of electric currents; finally, Sensa can detect magnetic and photon emissions. The player advances in the game by using the different abilities of the robots and solving puzzles.": "",
  "Swashbuckler is an early fighting game. The whole game takes place on the same screen. You're in the center and enemies such as humans, snakes, and rats come at you from either side. You've got a sword that can strike high, low or center, or block. As the game progresses the number and speed of the enemies increase until they're too fast for a human to handle. This was pretty similar to another Datamost title, \"Aztec\" which was an Indiana Jones type side-scroller.": "",
  "SwordThrust is a commercialized and enhanced version of the Eamon RPG. Your hero begins in the land of Diurla at the Main Hall, where he (or she) must register, roll up stats, equip, and buy spells before going on one of many adventures. Like in its predecessor, your main stats are Hardiness (the number of hits you can take before you die and your carrying capacity), Agility (affects your chance to hit monsters), and Charisma (affects prices at the Main Hall and the friendliness of monsters). SwordThrust also adds another ability called Left Hand, which affects your chance of hitting with weapons in your left hand. All the standard weapon categories (Axe, Bow, Club, Spear, Sword) are inherited from Eamon and work in similar ways. Your weapon score is a percentage chance for you to hit with that type of weapon, and it has a small chance of going up each time you hit. SwordThrust adds many new spells to the standard Eamon spellbook of Blast, Power, Heal, and Speed. Some examples of the new spells are: Charm (makes monsters friendlier towards you), Fear (makes monsters run away), Thickskin (increases your armor), This greatly expands your options in the game as well as giving you something to spend your extra gold on since the most powerful spells can cost 30000 or more gold pieces. Adventuring is very similar to Eamon. The dungeons are all text-based, similar to an adventure game. You move and fight through the dungeons with commands like NORTH, INVENTORY, ATTACK RAT, and so on. Some improvements over the Eamon interface are that the room description and character status are displayed in a window at the top of the screen so you don't have to constantly be LOOKing to figure out where you are. Another gameplay change is that your character can get fatigued. When your fatigue gets too high, you pass out which may end up killing you if monsters find you. Stopping and RESTing is necessary, but it is easy to get very fatigued in a difficult battle and pass out when you have to run away to rest. Equipping items is also much different than in Eamon. You can now equip weapons in your left hand if you don't use a shield, potentially doubling your number of attacks. Armor is also now equippable, so it is possible to find better armor during your adventures instead of being stuck with what you bought at the Main Hall. SwordThrust had several adventures written for it, including The King's Testing Ground, a beginner's adventure that came with the game. Other adventures included:The Vampyre CavesThe Kidnappers CoveThe Case of the Sultan's PearlThe Green PlagueThe Eternal Curse, andThe Hall of Alchemie": "",
  "Loosely based on Clavell's Taipan, this game is a trading simulation set in the Far East during the 1800s. The player is based out of Hong Kong and has a single trading ship with which he can transport one of four cargoes from place to place. There are different cargoes to be traded, from the cheaper general goods to the more expensive arms and silks, culminating in the opportunity to trade in the illegal opium trade. Generally, the strategy here was buy low, sell high. To add some tension to the game, there is a random chance that you will encounter several obstacles to your trading empire. Random pirates, pickpockets, and thieves who rob you and your warehouse are all out there for their own benefit (and your detriment!) Li Yuen acts as the local mafia boss, extorting increasing sums of money for his \"protection\". Local authorities will seize your opium and fine you if you're caught, ruining an otherwise successful voyage. Local market conditions can render a price extremely high or low, giving you a chance to make a quick buck. You have the option to trade up to a larger ship as time goes buy, as well as outfit your current ship with guns. However, beware! The larger the ship, the more pirate ships it attracts! Also, the larger ships are more expensive to repair. You can play as long as you want--you're given the opportunity to retire once you reach one million. You're given a score at the end of the game based on your net worth, your ship size, and a few other factors. All in all, this is a pretty decent trading simulation, even if the monochrome graphics left something to be desired. Although some parents may want to avoid a game with opium in it, overall it's great for teaching basic economic concepts to kids.": "",
  "You're a wizard's apprentice whose Master has taken access to your spells. To get them back, you need to complete three quests. Create your character by assigning points to Strength, Intelligence, Speed and Charisma, before setting off. This role-playing title is specifically aimed at younger people and non-hardcore roleplaying gamers. The screen display is split into a text window, a graphical window and a movement window. A comical mish-mash of characters ranging from knights to surfers await, each with their own part in solving your quests. You must learn new spells and fight when required, also recruiting people and spending money at many stages of the adventure, which takes in over 100 screens.": "",
  "Tanktics is a game in which you are required to design and create tanks which can then be used to defend your base. To carry this assignment out you must gather resources which can then be dropped into a crazy machine called the Part-o-Matic. This machine also acts as your base. This game seems to be aimed at more casual or younger gamers, as the graphics are very simple and, when complete, you can give your tanks just two commands: move and shoot.": "",
  "Tarturian was a follow up to Highlands Computer Service's first game, Oldorf's Revenge. It was largely an expansion of the ideas introduced in Oldorf's Revenge. This was a very early hi-res vector graphics and text adventure game of the same era and style as Mystery House. Intriguingly, Tarturian, like Oldorf's Revenge, allowed you to choose to switch between various types of characters, such as the Wizard, Thief, Strongman, Elf, etc. The game has two mechanics limiting the number of times you can \"change\" into each character, which layered on an element of resource management that was unique for an adventure game of its day. Each of these characters allowed certain specialized text parser commands. For example, only the Wizard can \"cast\" (a spell) while only the Thief can \"unlock\", \"pick\", \"open\", etc. This list of text commands is only knowable if you have the instruction manual for the game. This also allows for multiple solutions to the same puzzle. For example, the initial door can be unlocked by the Thief, or blasted off it's hinges if the Wizard casts a spell. This is very much unlike more popular games of the era like Mystery House, which allowed for only one solution to each puzzle. Additionally, the manual provided other info about how to play that is essential knowledge for gameplay. (Unlike the modern gaming era, in 1980 it was expected that players would read everything provided with a game.) From that point on, Tarturian becomes a graphics + text adventure game, with some interesting elements not commonly found in more standard examples of the era. For example, the game introduces randomized monster encounters that can instantly kill the character you're playing as, forcing you to switch to another character to proceed. The game finishes with what is one of the very first \"boss monsters\" found in computer gaming, with a very satisfying animated conclusion.": "",
  "Tawala's Last Redoubt is the fourth and final game in the Galactic Saga. In the previous game, Galactic Revolution, the emperor Tawala was ousted from power by his former fleet commander, Julian du Buque. Now the fallen monarch has fled to the planet Farside. Due to unusual solar conditions, Farside is cut off from the rest of the galaxy. Now it falls to the planet's inhabitants, and the insurrectionist leader Benthi, to finish Tawala once and for all. The player takes control of Benthi and commands her forces and agents. The ultimate goal is to attack and take Tawala's redoubt, located at the other end of the map from Benthi's camp. Resources at the beginning are meager, though: Benthi only has 100 credits, 100 troops and 15 weapons at her disposal. She must gather the resources of Farside's various chiefs to stand a real chance. Communication with the chiefs (or any friendlies not in Benthi's camp) is done by sending messengers. The chiefs can be asked for money, troops or arms, and be given money as an incentive. The messengers can be asked to threaten reprisals in the case a chief refuses a request - not acting on such a threat might damage Benthi's reputation with all of Farside's chiefs, though. How a chief deals with an offer can be deduced from personality dossiers provided by Benthi's chief of intelligence, Paoli. Paoli also is responsible for sending out spies. They can be sent to any village on the map and will report on any movement of Tawala's troops. It is also possible to send them into the redoubt itself. Risk of capture is high, and an agent cannot be recalled from the redoubt, but he will give a full report on Tawala's overall strength. Next to troop strength and movements, agents will also provide additional information, like the locations of a hidden arms cache or the lair of independent war chief Vyl-ourmani, as well as the passwords needed to access those locations. Regarding troops there are two options: they can be sent to only secure a town, meaning they only fight if Tawala's forces are present. In the case of uncooperative chiefs, they can also be sent to loot & pillage, in which case they attack the local militia, and, if successful, secure any loot they might find. Should Benthi's camp come under threat (as indicated by agents' reports), it can be moved. If Benthi is still present when Tawala's forces attack, the game is over. It is necessary to move the camp in any case, because the redoubt can only be attacked when Benthi has gathered her forces in the town closest to it.": "",
  "Taxman is a pretty accurate clone of the arcade smash hit Pac-Man where the player takes the role of the \"Taxman\" and has to collect tax from the rebellious citizens. You control the now famous circular dot muncher that has to go around the maze and collect all the \"tax pellets\". He is chased by four ghosts that will kill the poor taxman on touch. If the Taxman eats a power pellet, the roles are reversed and he can chase the ghosts and eat them in return. Levels repeat with increased difficulty and once three lives are lost, it is Game Over.": "",
  "Techno Cop is set in the near future. You are a cop who seeks to clear his town of all the criminal scum. The game consists of two parts; one driving-action and one sidescrolling-action. In the first part you drive around in your red Ferrari and destroy hostile cars; in the second part, you turn somersaults over gaps, use elevators and shoot lots of enemies until you reach the boss. After having killed / caught the villain, it's back to the road again for the next mission.": "",
  "Tharolian Tunnels is an action game that contains five parts with varying gameplay. The player's task is to enter the planet Tharolia through a tunnel and reach the centre of it where its defense systems has to be destroyed. On the way to the centre the player has to avoid getting killed by the defenses and avoid crashing into the tunnel walls or running out of fuel. The game starts out in space with the first part being a shoot 'em up similar to Space Invaders where the player has to clear out two rows of enemy ships that move back and forth across the screen. Once it has been completed the player enters the planet and has to navigate a space craft through a small tunnel that scrolls from top to bottom while not crashing. It's possible to use guns to destroy walls but it will lead to fuel being depleted. In the third part the tunnels widens but here there are torpedoes launched from above and fighters that have to be either blasted or avoided. It is followed by an automatic sequence where the ship is refuelled. The final part of the game involves navigating through lasers and land into a docking compartment. Here thrust controls are used and it's necessary to land with minimum speed to avoid crashing.": "",
  "This is one of the earliest electronic adaptation of the Theseus and the Minotaur pencil-and-paper maze puzzle by Robert Abbott, based on the concept of logic mazes where certain limitations in movement apply. The game consists of ten mazes to solve, designed by the original author as well as Toby Nelson. Players need to guide Theseus (represented by a red circle) towards the exit of the maze, while avoiding the minotaur (represented by a black circle). The goal of each level is to reach the exit, but this cannot be done by travelling towards it directly. Theseus is only able to move one tile at at time, while the minotaur can do two. To reach the exit, Theseus has to outsmart the minotaur by luring him into a specific position, exploiting the internal movement logic. The minotaur will not chase after Theseus directly, but approaches him based on rules of vertical and horizontal movement. For instance, when Theseus is on the same horizontal line as the minotaur, but with a wall between them, he is able to move left and right as much as he wants without having the minotaur move. At certain moments it is also needed to delay an action or skip the turn, to lure the minotaur into a certain path without moving Theseus. The game is entirely controlled by the keyboard for movement. Other keys are used to reset the maze, move on to the previous or the next one, and delay a turn (sometimes needed to lure the minotaur into a specific direction). The basic graphical design of the game went through different stages over the years.": "",
  "A platform shooter from Japan, Thexder offers many levels and diverse enemies that gradually increase in difficulty. You pilot a Battletech-style robot capable of switching from a mech into a jet at any time. Your weapon auto-aims, but uses up a fixed amount of rechargeable energy; if you run out of this energy, you'll have to wait a few seconds before you can fire again. Your mech also contains a shield that can be activated to protect you from harm, but this lasts for a few seconds and uses up some of your life energy.": "",
  "Space Shuttle is a simulation game where you are the pilot of the space shuttle Discovery. Your goal is to launch the Discovery, establish an orbit around the Earth, open the cargo bay doors and recover a satellite to perform repairs, and finally land the Discovery successfully, all while using as little fuel as possible. Each time the complete mission is accomplished, it will then repeat at a higher difficulty level (in the higher difficulty levels the satellite has a more erratic flight path). The game is played from a first-person perspective in the space shuttle cockpit where you can control everything from the shuttle's engines to cargo bay doors. When the game is over you will be given a ranking which is based on the number of successful dockings and the amount of fuel that was used. In addition to the full flight mode, two easier game variations (auto simulator and simulator mode) are included. The auto simulator mode is the easiest; the computer will control the flight (you can take over at any point you wish) and the controls are simplified. The simulation mode is closer to the full game, however, you have an unlimited amount of fuel so there is no time pressure, and the computer will help compensate for inaccurate maneuvering.": "",
  "Star Wars is a first-person shooter based around the final scenes of the original Star Wars film. It first appeared for arcade coin-operated machines and was subsequently converted to other gaming platforms. You take on the role of Luke Skywalker, aiming to destroy the Death Star. In the first phase you have to pass swarms of TIE Fighters, including dogfighting the one piloted by Darth Vader himself. In the second phase the station's surface is protected by laser towers, third involves attacking its weakest spot - the unprotected exhaust port - with proton torpedos. Your X-Wing starts with six shields, but more can be awarded for good performance. Complete the game and it loops back around at ever-increasing difficulty. The game uses vector graphics, which allow lots of action at high speed on comparatively slow systems.": "",
  "Threshold is a simple shoot'em up game. You are in control of a spaceship at the bottom of the screen and have to shoot several formations of enemies at the top of the screen. To make things more difficult you have limited time in form of a fuel tank which will get refilled after you cleared a number of waves. Besides that, your spacecraft is equipped with a laser that tends to overheat. Every shot makes the heat bar of the laser increase a bit. Once it reached its maximum you can't fire anymore and are forced to wait until it cools down while slowly running out of fuel.": "",
  "Someone has chosen you to secure the Earth's future by destroying the evil ruler of the planet Neburon. He offers you the ability of time and space travel in order to do so, and has placed a time machine in your home so that you can travel to different time periods. In these periods, you will meet such famous names like Julius Caesar, Christopher Columbus, Cavemen, Robin Hood, Benjamin Franklin, and Cleopatra. Like other Hi-Res Adventures by On-Line Systems, you can switch between graphic and text modes. You are required to type a one- or two-word command to perform actions. The game can also be saved with a floppy disk, but with one that is specifically designed for use with the game.": "",
  "The Kingdom of Albereth was under attack of barbarian forces. King Valwyn drove the barbarians away, but was wounded in battles. Searching for a place where he could rest and restore his strength, he left the city - but never returned. Now, a new hero must rise and defend his homeland. Times of Lore is an action game with light role-playing elements, which follows the adventures of a young warrior (strong barbarian, armored knight, or quick valkyrie) to assist a weakened kingdom from various threats, and to recover special Artifacts that once made the kingdom strong. Gameplay consists of moving the protagonist in real-time (day and night) through various terrains, like forests, towns, and dungeons. The player character gathers basic items, like health and magic potions, and increasingly powerful weapons as he completes tasks and advances the plot. Conversations are handled through key phrases. Battles involve a few types of creatures (skeletons, orcs, rogues) of which there can be various flavors.": "",
  "Top Fuel Eliminator is a drag racing game. Select your tires, engine, and other stats before the race and try not to crash in the final race. It has both a first person view (at the bottom) and a third person side view (at the top) during the actual race. You are entered into a 16 race bracket, win four races to take the title.": "",
  "Torpedo Fire is a turn-based tactical game of WW2 naval warfare focused on submarine vs. destroyer combat. The player may take the role of either a submarine commander or a destroyer captain in any side of the conflict, while at the same time send orders to other ships in the player's command. The game allows playing against a fellow player (hot-seat multiplayer) or the computer AI in turns that simulate 60 minutes of actual combat. The game features different interfaces for the sub and destroyer players (a periscope interface for the sub and a radar/sonar screen for the destroyer) and comes with a single introductory mission to hone your skills. The game nonetheless includes a hefty database of ships and weapons which can be put to use in the included SSI Shipyard program that allows the player to design campaigns and scenarios.": "",
  "Towers of Hanoi is a puzzle game where the idea is to move a pyramid of seven disks of varying sizes in order from Peg 1 to Peg 3. You can move a disk to Peg 1, 2 or 3 but you can't place a disk on another disk that is smaller. As you move a disk your moves counter increases so the aim is to complete the puzzle in the fewest moves.": "",
  "Experience the thrills of space flight with this realistic space flight simulation. You pilot the Lunar Excursion Module (LEM), a sophisticated cargo vehicle that shuttles astronauts and equipment to and from the moon. Colorful graphics and real-life controls make every flight an adventure. Land on the foreboding lunar surface or rocket from Tranquility Base into moon orbit. Tranquility Base portrays space flight and lunar landings with true-to-life accuracy. The laws of motion and gravitation affect the LEM spacecraft much like they influence an actual spacecraft in outer space. Using keyboard or joystick controls, you can increase or decrease engine thrust, change the pitch -90 to +90 degrees, and roll from -10 to +10 degrees, refuel your spacecraft, and start the engines.": "",
  "Transylvania is an adventure with optional graphics, and a VERB NOUN interface. Two weeks ago, Princess Sabrina suddenly vanished and remained unseen since. King John the Good asks any travellers to help in locating her - you volunteer. As you begin your quest in the dark forests of Transylvania, beware of the evil that lurks. You will encounter strange creatures like a vampire and a goblin, and experience strange things. Most importantly, a werewolf is constantly chasing you, until you find the pistol and bullets necessary to kill it. Remember fellow traveller, take care...": "",
  "Treasure Island is a platform game, enriched with motives from other genres. The story begins with the hero being kept under lock and key on a ship captured by pirates. A sudden storm thwarts robbers' plans, and the ship, carried by troubled waters, wrecks on a rock. That accident results in a failure of on-board machinery, the door to hero's cell opens, he grabs the opportunity and breaks free. His first task is to get out of the ship. It won't be easy, considering all the pirates running around. When he finally manages to leave the ship, it becomes clear that it's just a beginning of his adventure. He finds himself on a strange island, full of spooky places, weird creatures and very unusual constructions... The game consists of 13 diverse levels, and one bonus stage. The player will have a possibility to visit environments like ship's deck, sea deeps, old castle, caves, jungle, ice land, mine, and so on. Each one of these areas presents different challenges, and requires unique abilities. The player will have to run, jump, swim, fight, play the ice organ, ride a mine cart, face an ancient deity and operate unusual machines. Also, scattered through the island is a treasure. In fact - seven valuable artifacts hidden inside the island. If the player manages to find and get them all, it will reveal an entrance to a huge vault. It's definitely worth trying... The game features 3D pre-rendered, high resolution (640x480) art with multi-layered backgrounds (so called parallax scrolling). Also included are full motion, full screen movies played at the beginning, the end, and at key moments of the game.": "",
  "Based on the 1982 Midway arcade game based off the Disney film, players take control of TRON in four different game grid scenarios: Light Cycles: race TRON's blue Light Cycle against one or more enemy Cycles in an attempt to have them crash and de-rez against their own light walls. I/O Tower: blast through numerous Grid Bugs in an attempt to get into the I/O Tower. MCP Cone: blast through the defensive walls of the MCP in order to get into its central cone. Battle Tanks: maneuver TRON's tank against one or more enemy tanks (or Recognizers) to be the last one standing. The Xbox Live version offers competitive or co-op play to go for the highest score, and a mode that features enhanced graphics.": "",
  "Typhoon of Steel is a tactical level simulation of small unit actions during WWII. It is a sequel to the best selling Panzer Strike and the rules are very similar. Three theaters are covered: the Pacific Theater (Americans vs Japanese), the Asian Theater (British vs Japanese) and European Theater action involving American vs German troops. Typhoon of Steel includes practically every ground weapon used by the combatants in this theater (over 220 weapon types). Units consist of infantry squads or single guns and tanks. You can choose to simulate either single battles or entire campaigns spanning several years. In the single battles you can play against another person but in campaigns you play against the computer. The ultimate objective of the campaign games is to fight and win as many battles as possible before the war ends. If you suffer heavy losses during one battle it will take a long time to replace and upgrade your forces before you can fight the next battle. Single scenarios can last from 30 minutes to 2 hours with campaigns lasting up to 30 hours. Like Panzer Strike, the gameplay is considered to be advanced level.": "",
  "Ultima revolves around a quest to find and destroy the Gem of Immortality, which is being used by the evil wizard Mondain to enslave the lands of Sosaria. The game was one of the first definitive commercial computer RPGs, and is considered an important and influential turning point for the development of the genre throughout years to come. In addition to its influences on the RPG genre, it is also the first open-world computer game.": "",
  "The plot of Ultima II revolves around the evil enchantress Minax, taking over the world and exacting revenge on the player for the player's defeat of Mondain in Ultima. The player travels through time to acquire the means to defeat Minax and restore the world to peace. Ultima II has a larger game world than Ultima I, and hosts advances in graphics and in gameplay.": "",
  "After the defeat of the evil wizard Mondain and his mistress Minax in the previous two Ultimas, peace has returned to the land of Sorsaria. Times passes and eventually geological disruptions and a resurgence of the monster populace occur, and it is soon learned that Mondain and Minax had conceived a child named Exodus before their death. Now that child has become an adult with the power to avenge the death of his parents. Obviously, it falls upon the hero from Earth to find and stop him. The third title in the Ultima series was the first to feature a party of adventurers instead of a single player character. The party is created at the beginning of the game by assigning various class combinations and determining the characters' attributes. The game has larger and more detailed towns, populated by NPCs the protagonist can converse with to obtain clues. Like in earlier Ultima games, exploration is divided between top-down overworld locations and first-person 3D dungeons. This installment introduces separate combat screens where player-controlled party fights multiple monsters in a turn-based tile-based system.": "",
  "The fourth game in the Ultima series features an improved game engine, with color graphics and enhanced character interaction: the player can have conversations with non-playable characters by typing names of various topics. However, the main difference between Ultima IV and its predecessors in the series (as well as other role-playing games) lies in the game's objectives and the ways to fulfill them. Instead of building up a character by any means possible in order to face a villain in the end of the game, in Ultima IV the player is trying to become the Avatar, a role model for people. This means upholding the Eight Virtues, basically trying to become a better person. Making morally conscious decisions and helping other people is not done expecting a material reward, but because it is the actual goal of the game and the main focus of its gameplay. The game frowns on behavior typical of most other RPGs, such as backstabbing fleeing enemies or picking up everything that isn't nailed down even if it does not belong to the protagonist. This different approach established the game's reputation as the first \"true\" Ultima, influencing the design philosophy of later installments and the overall spirit of the series.": "",
  "The Avatar, the embodiment of the Eight Virtues and the hero of Britannia, is called back to deal with a grave threat. Lord British, the country's benevolent monarch, has disappeared, and a man named Blackthorn has usurped his throne. The tyrant rules the land by enforcing the virtues upon the will of the people, corrupting their meaning in the process. His fundamentalist visions led him to create a police state, where failure to adhere to the virtues is punishable by death. Behind Blackthorn are the three Shadowlords, anti-thesis to the three principles of Truth, Love, and Courage. The Avatar must understand their meaning and origins, find a way to defeat them, rescue Lord British, and restore the former ethical principles of Britannia.": "",
  "Under Fire is a tactical simulation of WW II land combat. Men and weapons from the United States, Germany and Russia are represented. There are nine scenarios in the game which range from open field firefights to house to house conflict. Victory is a subjective affair in Under Fire as there is no declaration of victory. The victory screen basically tallies up losses and objectives gained the rest is left to argument. Under Fire can be played by one or two players. Playing time can range from 10 minutes for a two squad battle to five hours for a 32 squad firefight.": "",
  "VC (Viet Cong) is a distinctive simulation which puts the player in a position to manage both military pacification forces and the public civilian political climate. Your task is to manage a Province with ARV (Army of the Republic of South Vietnam) forces along with U.S. Air Calvary and U.S. Field Artillery Battalions. The NVA (North Vietnamese Army) and VC controlled by the computer will make this guerrilla/terrorist warfare difficult and try to turn the civilian population against you. Your goal will be to destroy all enemy forces while preventing half of the civilians you are here to protect from joining forces with the NVA and VC. This must be accomplished in turn based fashion of one week per turn.": "",
  "The Count of Monte Cristo was eventually consumed entirely by his drive for revenge. Count Cristo, on the other hand, is merely the victim of a Voodoo curse an enemy hexed him with... an external plague more possible to reverse. Starting the game standing over his coffin, you wander the length and breadth of his castle in pursuit of a recipe and the verbal and material components needed to cast an antidote to counter his occult menace. It contains good-luck charms, the sorts of mad scientist chemical concoctions that might well yield a Jekyll-and-Hyde transformation, a flighty medium and her crystal ball, and no small quantity of juju, useful for all sorts of voodoo applications. All that and a chimneysweep trapped in the flue! The player will navigate all these and more with the trademark Adventure International VERB NOUN two-word text parser.": "",
  "War in Russia is an operation level (division/corps) wargame played in turns (representing a week) on a hex grid map (each 50 miles wide), simulating the Axis vs. Soviets clash on the Eastern Front of the Second World War. The campaigns included are Operation Barbarossa (1941), Fall Blau (1942) and Operation Zitadelle (1943). Apart from the two player mode, the single player option is available, however only from the German side. The game takes into account the factors of experience, fatigue, supply, harsh weather and rugged terrain. New units (infantry, armor) may be built in the cities, their strength is shown in point value - battle worn units need replacements. Soviet side will receive Lend-Lease support, while German supply lines will be sabotaged by partisans. The winner is declared using a system of victory points, yet the game may end earlier when the key cities are captured by a given side. The game was later remade for PC using updated Second Front engine.": "",
  "Take command of United Alliance of Planets, the Klargon Empire, the Reman Star Empire, the Imperial Pirates, or the Freemen planets in the game of tactical starship combat. Engage other starships and even starbases and outposts with phasers, photon torpedoes, disruptors, drones, and plasma torpedoes. Freeman planets have defense fighters to defend against pirates.": "",
  "War in the South Pacific is an advanced strategic simulation of the land, sea, and air campaigns in the South Pacific from May 1942 to March 1943 between Japan and the United States. Players choose from 79 different ship types and 17 different aircraft types. The game comes with 3 mini campaigns. Upon the conclusion of the game the computer will display the total points for each side and the net points scored. The net points will determine the level of victory. The game can be played solitaire or against another person and there are 5 levels of difficulty. Playing time is 25 to 100 hours.": "",
  "Tactical wargame of naval engagements in the WW2 Pacific theatre. There are four historical battles to choose from, plus a custom scenario builder to make 'what-if' scenarios. Both, IJN and USN forces, can be controlled by humans. The game-engine is much the same as the one used in SSI's Battle Cruiser, which wasn't released for IBM PCs.": "",
  "Wasteland takes place in the future after the nuclear holocaust of World War III. The player guides band of Desert Rangers from town to town, gradually uncovering a sinister plot that threatens what's left of mankind. Much of the game is played like most other RPGs of its time: the player navigates the party through the top-down world, fights enemies (which appear randomly in hostile areas) in turn-based style on combat screens represented by enemy pictures, acquires information, equipment, and items from NPCs in towns, etc. The player can create a whole party of adventurers and/or recruit some of the characters that populate the game's world. However, Wasteland also introduced an original skill system that has had a significant influence on the genre. The game makes use of the skill system in conjunction with traditional character attributes to achieve goals and get past obstacles. Beside helping the characters to fight more efficiently, main attributes sometimes have an impact on activities used outside of combat. For example, high strength can be applied to break a heavy object, charisma rating might influence the way NPCs interact with the main character, etc. The skills work in a similar way: some of them improve the characters' proficiencies with different types of attacks and weapons, while others are needed to solve and/or by pass certain situations during interaction with the game's characters and objects. These skills are rather diverse, ranging from physical abilities such as swimming to more complex actions (medic, lock-picking), or even psychological states (confidence). Skill learning and progression depend on the main character's IQ rating.": "",
  "A very basic translation of the popular game show Wheel Of Fortune, where you guess letters until you can guess the phrase. This CGA version has three old-school rounds of Wheel of Fortune (where the puzzles are simply \"Phrase\", \"Title\", \"Person\", etc.) and then a bonus round. You can compete against 2 computer players or up to three people can play against each other.": "",
  "Carmen Sandiego is a master thief who leads the criminal organization V.I.L.E. This organization specializes in stealing the world's treasures without a trace. Alarmed by this, the A.C.M.E. Detective Agency makes it their personal mission to foil Carmen Sandiego's plans. Where in the World is Carmen Sandiego? is a game that tests the player's knowledge about geography and general knowledge about different countries. Missions will begin with a treasure being stolen and the player flying to that location. A time limit counts down while they must search the area and interview witnesses to find enough clues to figure out what country the thief flew to next. The player always has a limited selection (usually three or four) of flights available in any given country. This process is repeated until either the villain is found or time expires and they are able to get away. Along with finding out where the thief has headed, the player must discover who the thief is, by best matching personal characteristics (gender, hair color, eye color, hobbies, notable features) to dossiers on Carmen's gang. There must be enough characteristics matched in order to obtain a warrant, which is essential to legally arrest the suspect once they have been found. Progress in arresting VILE members will expose other members, eventually leading up to Carmen Sandiego herself.": "",
  "Roger Rabbit has been framed for the murder of Marvin Acme, head of the Acme Corporation. Acme's will states that upon his death, Toon Town would be left ot the Toons, but the will is nowhere to be found. You have to find the will and save your wife, Jessica, from Judge Doom and his weasels. The game takes place in Hollywood, 1947, where Toons are alive. There are 4 levels in the game, 2 of which are driving levels (levels 1 & 3). Roger and Benny the cab have to beat the weasels to the destination, while dodging cars, trams and Judge Doom's dip which is scattered on the road. There are pick-ups to help you on your way. Level 2 is the Ink & Paint Club. The will is on one of the tables. Roger has to pick up all the pieces of paper the penguin waiters put down, whilst avoiding the alcohol and gorilla bouncer. Level 4 has you in Judge Doom's warehouse trying to save your wife, Jessica from the dip truck. You have to use gags to progress and make the weasels laugh themselves to death, literally!": "",
  "You are Werdna, the evil wizard who once decided to conquer the entire world. You were busy trying to unlock the secrets of the magical amulet you \"acquired\" from your nemesis Trebor when an unruly mob of adventurers burst into your inner sanctum and defeated you. At first they thought you were dead. Foolish mortals. It is most difficult to kill a master of the arcane arts! When the authorities realized that your indestructible body lay in a deep trance, they adapted an ancient subterranean ruin into an escape proof prison. They surrounded your bier with patrols, traps, and guardians. You awake in a small room at the bottom of this prison maze, a room with no doors. You are as weak as a newborn babe, your magical powers drained from you. Getting out of this room won't be easy; escaping from the rest of prison may prove near impossible. But you are undaunted. You want revenge and the amulet back!": "",
  "The sequel to Moebius, Windwalker combines role-playing with side-view beat 'em up gameplay. You are accompanied by Moebius on a quest to master the martial arts. Hostile persons including thieves, guards and assassins will be encountered; you fight them in real time using moves such as cartwheels and flying kicks. This can be played either as a continuous battle, or with short breaks to catch your composure. The role-playing elements eschew the Ultima-style plan view in favor of a pseudo-3D system. Deism and Shamanism are just some of the included magic disciplines. Magical vehicles help you get around the 100 landscapes more quickly, although you spend much time on foot. The game takes place in a fully active universe of characters such as villagers and giant beetles, all getting about their business within a day/night cycle and variable weather.": "",
  "Wings of Fury is an action game with some minor simulation aspects, in which you are the pilot of an American F6F Hellcat plane. The setting of the game is the Pacific during World War II. It is your job to defeat the Japanese by destroying enemy bunkers, machine gun nests and barracks on a series of islands. Barracks and gun nests can be bombarded with regular bombs, while you'll have to use rockets to take out the concrete bunkers. After a successful bombing run, return to mow down the Japanese soldiers with your machine guns. You also have to sink Japanese battleships with torpedoes and engage in dogfights with enemy fighter planes. You start each mission by taking off from an aircraft carrier, which you'll have to protect from assaults by Japanese torpedo planes. Whenever you run out of fuel, bombs, rockets or machine gun ammo you can replenish those by returning to your carrier. Your carrier is also the place to repair damage to your plane. The Gameboy Color version of Wings of Fury has a toned down violence level. You no longer mow down Japanese soldiers with your machine guns, instead you bombard jeeps & trucks. Also missing in this version are the Japanese torpedo planes and the small 1st-person view window. New are some extra manoeuvres for your plane like a barrel roll and a review of your ammo consumption after each mission. Using less ammo than allocated gives you bonus points.": "",
  "In this game, the player controls a postal clerk in the small fishing village of Festeron. The postmaster, Mr. Crisp, orders the player to deliver an envelope to the owner of Ye Olde Magick Shoppe. However, this seemingly innocent task inexplicably leads to a strange phenomenon: as the hero steps out, he finds that Festeron has been mysteriously transformed into a dark, ominous town called Witchville. Even cute little poodles have turned into hellhounds! Finding the Wishbringer, a stone that grants seven wishes to those who possess the right objects, seems like the only solution - or is it? Wishbringer is a text adventure set in the Zork universe. The player types in commands to navigate the character, interact with the game world, and solve puzzles. The game has a rather open-ended structure, with many situations possessing several solutions; the player can opt for a \"magical\" approach to the tasks, using the titular stone, or attempt to solve the game in a more straightforward way.": "",
  "The Witness is a text adventure in which the player takes control of a police detective working near Los Angeles. The year is 1938, and on this stormy February night a wealthy but frightened man has asked the detective for protection. In spite of his best efforts, a death occurs, and the hero has twelve hours to solve the mystery and try to arrest the killer. If the player thinks there is enough evidence against one or more suspects to convince a jury of their guilt, he can arrest them and conclude the case.": "",
  "Wizardry: Proving Grounds of the Mad Overlord is the first game in the Wizardry series of role-playing video games. The game was one of the first Dungeons & Dragons-style role-playing games to be written for computer play, and the first such game to offer color graphics.It was also the first true party-based role-playing video game. After equipping the characters with basic armor and weaponry, the party then descends into the dungeon below Trebor's castle. This consists of a maze of ten levels, each progressively more challenging than the last. Classes have multiple spells, each with seven levels, that characters learn as they advance.": "",
  "Wizardry: Knight of Diamonds is the sequel to Wizardry: Proving Grounds of the Mad Overlord. It is an early example of an expansion pack, requiring the player to have the original Wizardry installed to play. It uses the same engine and spells, but is scaled for importing existing characters rather than creating a new party. Players explore a 3D wire frame maze searching for a key item, the Staff of Gnilda, required to complete the game. The player creates a party of up to 6 characters of various classes, and then gain experience points by fighting random encounters. The maze has many hidden doors and secrets, so the player is encouraged to map out each floor on graph paper to find their way.": "",
  "A generation has passed since your band of adventurers reclaimed the Staff of Gnilda and the armor of the Knight of Diamonds, and the land has been at peace. But now nature itself seems to be attacking the land of Llylgamyn, as earthquakes and tidal waves ravage the land. The Sages believe the Orb of Scrying is the city's salvation, but it is guarded by the dragon L'kbreth. A band of explorers must once again venture forth in search of the Orb. Legacy of Llylgamyn is the third entry in the Wizardry series. Like its predecessors, it is a first-person dungeon-crawling role-playing game in which the player assembles a party of up to six characters and explores a large maze-like dungeon, fighting randomly appearing enemies in turn-based combat and occasionally returning to the game's only town to rest, buy supplies, and outfit the characters. Characters must be imported from either the first or the second game. Character classes, combat system, and overall gameplay mechanics are very similar to those of the two previous games. Good, evil and neutral alignment, however, plays a larger role. While the first level of the dungeon is accessible to everyone, the other five levels impose alignment restrictions, requiring the party either to have at least one good or bad character, or contain no neutral characters.": "",
  "Before the long-running Links series, Access Software produced the Leader Board lineage, which concludes here. Wind, snap and power are the main considerations as players dodge the bunkers, water and rough, which make for more complex courses than the 8-bit versions of the original. A course editor is included. The courses provided include real locations: St. Andrews (Scotland), Cypress Creek and Doral Country Club (USA) and a fictional one, The Gauntlet, which, as the name suggests, is designed to push the player's skills to the maximum. The PC version utilizes the PC speaker to reproduce voice samples via the company's patented RealSound process. Quips like \"No doubt about it, he's deep in the sandtrap\", \"Straight onto the fairway\", and \"Looks like he hit the tree, Jim\" are used to provide running commentary on the gameplay.": "",
  "World Games is an Olympics-style sports game with arcade-oriented gameplay. The events players can compete in include: Barrel jumping Bull riding Caber toss Cliff diving Log rolling Platform diving Pole vault Skiing Sumo wrestling Weightlifting": "",
  "The objective of World Karate Championship is to get the highest possible dan (karate grade, determined by belt colour) and become the world champion - and of course, to get the highest score. Karate fighters compete against each other on side-view screens, the scenery representing real world locations (New York, Egypt, Japan, etc.). In between the fighting stages, there are short action sequences, during which the player can gather bonus points. These include deflecting bouncing balls, breaking wooden planks, and others.": "",
  "A hundred thousand years ago, an ancient civilization prospered on our Earth, their product being GAMP (General Artificial Matrix Producer). In order to survive the Ice Age, most of the Earth's inhabitants have decided to leave it, finally settling on a planet called Xevious. A group of humans remained, becoming our own ancestors. Many years have passed, and the Xevians are now planning a massive comeback to their long-lost homeland. The pilot Mu, his android companion Eve, and Mio, a Xevian who opposes the GAMP regime, are back from a space travel just in time to warn the Earth of the upcoming invasion. The prototype fighter craft Solvalou is going to be used as the main weapon against the Xevian attack. Xevious is a vertically-scrolling shooter which is notable for being the first game of that type to feature an aircraft flying over the Earth (as opposed to the outer space in other games), displaying views of South American nature. It also introduced, for the first time, two types of enemies to fight: aerial and ground-based (the menacing SOL towers invoked by GAMP to aid their planes). The player-controlled ship, Solvalou, is equipped with two weapons, each assigned to a button: the Zapper for air enemies, and the Blaster, which drops bombs on ground targets with the aid of a lock-on. The aerial enemies are divided into sub-categories distinguished by their attack and behavior patterns. Certain enemy types are immune to Solvalou's weapons, and must be avoided.": "",
  "Xyphus is a 2D fantasy RPG where the player can develop up to four characters with attributes such as hit points, endurance, strength etc. The available races are humans, dwarves and elves, with a mix of melee fighting and the use of magic for the professions. Slaying monsters is rewarded with experience and gold, used to upgrade and acquire new items. The game is divided into six scenarios to defeat the evil demon lord Xyphus and free the lands of Arroya. The characters can be moved separately or as a group in a top-down environment built up out of hexagons.": "",
  "The Zaxxon defence system must be destroyed in this isometric-viewed shoot 'em up. The game has three stages, first taking you through Asteroid City, which is heavily protected by aircraft, guns and missiles. Many barriers are alarmed, leaving you with limited space to progress through, and fire must constantly be dodged. Stage two is a space shoot out against hordes of enemy aircraft - those you failed to destroy in the first part of the task. Complete this and you reach the final battle with Zaxxon, the game looping with increased difficulty if you can survive the first time. There are three distinct skill levels, while controls involve using forward to dive and back to climb, in the manner of flight simulation.": "",
  "You are a Skyfighter patrolling the airspace above the city Zenith as it's being built. Aliens are invading and your job is to shoot every single object above the city to prevent it from harm. Zenith is a pseudo-3D space shooter similar to Horizon V gameplay-wise, the main difference being the player's ability to rotate the controlled ship left and right.": "",
  "It beckons you into a world fraught with danger and discovery. Using all the cunning you can muster, you'll plunge far below the surface of the earth in search of the incomparable treasures of Zork. But this is no mere treasure hunt. During your amazing journey, you'll come face to face with creatures so outlandish, they defy description. And you'll wander through an underground domain so vast, with so many twists and turns, it can offer you new surprises no matter how many times you explore it.": "",
  "Zork II: The Wizard of Frobozz is a text adventure, a sequel to the classic first Zork. Once again, the game is set in the Great Underground Empire, but this time the main goal is to face off against the titular Wizard. Like its predecessor, Zork II plays like any other text adventure: there are no graphics - only text - and the player types commands such as ''lift cage'' or ''examine robot''.": "",
  "In the third game of the adventure game series Zork, you are once again a nameless adventurer, only this time you won't travel through a beautiful magical land, but are immediately cast into a deep dungeon. Like in a dream, you hear a mysterious voice telling you that you have passed all the tests but one. When conscience returns to you, you find yourself on the endless spiral of stairs, with only your trusty lantern near you... will you be able to survive the horrors of the Dungeon?": "",
  "Bad Dudes is a six-level action game originating in the arcades. The gameplay involving beating a succession of guys to complete the level, then an end-of-level bad guy. The action takes place on two different levels of the screen, which can be jumped across or navigated using ladders. Moves such as punches and kicks are on offer. The control method makes jumping sideways quite tricky.": "",
  "Ballyhoo is a mystery text adventure in which you play a disillusioned circus goer who decides to help find the owner's kidnapped daughter. Gameplay involves searching for clues in the circus arena, the tents and other back areas trying to locate the girl. The game features a \"Standard\" difficulty level. The original Commodore 64 Grey Box Contents included: The Traveling Circus That Time Forgot Inc. Official Souvenir Program Circus Ticket (Sec.24 Row AA Seat 4) Purple Circus Balloon Advertising Card for Dr. Nostrum's Wondrous Curative": "",
  "Third of SSI's \"When Superpowers Collide\" series. Similar to Germany 1985, this installment focuses on a NATO rescue of the besieged city of West Berlin. There is only one scenario. The player controlling the West Berlin after a certain number of game turns is the winner.": "",
  "Your job is to guard the supplies at the lunar base. Bandits of various sorts arrive in waves and descend, trying to get the goods. Armed with a mobile laser gun and some shielding, you score points by blasting the bandits. Bandits has 28 levels of play. You begin with 5 ships and acquire a bonus ship for every 5,000 points. The game is similar to Space Invaders.": "",
  "Eagles is a game that simulates the dogfights and melees that occurred in the skies over France and Germany in the latter half of WWI. There are three scenarios to choose from at the start of game: Over There, Voss's Last Fight and Red And Black. In addition, there are four different mini-games to choose from: Bloody April, Sausage Run, Contact Patrol and The Eleventh Hour. During game play, you will face many of the situations that the period's pilots had to face. A dogfight in Eagles can involve as many as twenty planes. Each aircraft will have an ID number on them running from 1-20. 1-10 are always the Allied aircraft and 11-20 are the Germans. Play proceeds in rounds from the lowest number aircraft going first and continuing all the way up to the highest number aircraft doing the last move. Play continues in this fashion until all planes have been shot down or returned to base. The play field is defined in squares running north, south, east and west. Each square represents an area roughly 50 yards on a side. There is also a third dimension of squares, which is altitude. Each level of altitude is 25 feet high. Pilots can see targets four squares out and can fire their weapons one square out. Weather conditions, like clouds and wind, will also play a factor in game play. At the end of each game, scores show how many kills were made, the time frame for completing each mission and ranks. Ranks are determined on successful missions you have completed. There is also an optional section for creating your own planes at the beginning of the game.": "",
  "\"Past and Present often meet in the old historic streets of London. However, people still stare at you strangely. You clank as you walk and the weapons you carry are centuries out of date! \"Because you've heard rumours of an impending attempt to steal the Crown Jewels from the Tower of London, you decide to go there... \"To prevent the theft? \"Or to steal them for yourself!!\"": "",
  "Gobbler is a Pac-Man clone that is mostly identical to the original arcade game. The maze layout is slightly different but otherwise it offers the same gameplay. The gobbler has to clear the maze of all dots while avoiding the ghosts that chase him. Picking up a large dot energizes the gobbler for ten seconds, allowing him to go after the ghosts. Dots are worth five points, ghosts are worth 200-800 points and fruit is worth 200 points. The gobbler has three lives. The game can be played with either keyboard or joystick.": "",
  "A very early clone of the arcade game Defender for the Apple ][ written in E-Z Draw assembly language. The player controls a spaceship that must protect civilians on the ground from aliens that drop from the top of the screen and try to carry them off.": "",
  "Guadalcanal Campaign is a turn-based wargame simulating the 1942 Battle of Guadalcanal during the Second World War. It lets the player command American land, sea, and air forces between August 7 and December 31, pitting them against the Japanese (controlled by second player or the computer). Alternatively, a short campaign (October 1 - December 31) and short scenarios (Coral Sea, Eastern Solomons, Santa Cruz) are also available. Each game turn represents 12 hours (the full campaign lasting 147 days, 2 turns per day). A game turn consists of reinforcing your troops, moving task forces (numerous ships are included, from destroyers to aircraft carriers) and troops into position, launching air missions and patrols (each side has one fighter type and four bomber types, plus recon floatplanes) and combat resolution. The map is a 40x40 grid stretching from Truk to northern Australia shore, with key ports and airbases. Victory points are computed at the end of each game.": "",
  "Hong Kong Mahjong is a single player, shareware, mahjong game that can be played either with the keyboard or with the mouse. As with the later game from Nine Dragons Software, Hong Kong Mahjong Pro, this game plays similarly to the card game Gin where you must accumulate straights or runs to win. There is an in-game help text which explains the game and the scoring in detail.": "",
  "The earliest commercial home computer port of the first mainframe adventure game, Colossal Cave. Players explore said cave, searching for treasure, solving puzzles, using magic, avoiding threatening little dwarves, and navigating mazes of twisty passages, all alike.": "",
  "Midway Campaign is a computer simulation of the Battle of Midway Island in June 1942, arguably one of the most decisive battles in the history of warfare. The computer controls a huge force of Japanese ships whose objective is to invade and capture Midway Island. You command the badly outnumbered and outranged American forces with your only advantage being the element of surprise. The game ends if either all of one side's Aircraft Carriers are sunk, or any part of Japanese TF exits map to west or US TF exits map to east with no airstrikes in the air. At the end of the game a summary of all carrier damage, aircraft losses, and victory points from other targets and the Midway invasion are output followed by an evaluation of results.": "",
  "Based on Arthur C. Clarke's classic science fiction novel Rendezvous With Rama. After an uncatalogued giant asteroid is discovered approaching Earth, scientists soon realize that it is in reality an alien starship. As commander of the spaceship Endeavor, and being the nearest to the gargantuan ship, it is up to you to rendezvous with it and explore it before it leaves the Solar system.": "",
  "This is the scrolling beat 'em up by Technos which started the Kunio / Nekketsu High series. The original takes takes place in a Japanese city, whereas its western version named Renegade is set on the mean streets of Brooklyn. This conversion later produced unofficial sequels Target: Renegade and Renegade III: The Final Chapter. You must venture through to meet your girlfriend, and then rescue her from her kidnappers. This is split into five levels, taking you through the subway and the docks as well as some inhospitable streets. A wide range of aggressive moves are on offer, including headbutts, kicks, punches and flying kicks. Much of the game's violence is depicted in a fairly tongue-in-cheek style, with an element of attempted humour along the way.": "",
  "PC translation of the popular board game you may know as Pentem, where the objective is to place 5 consecutive stones in a vertical, horizontal or diagonal line. Includes 1 or two player gameplay and numerous single player options such as 10 difficulty settings, the choice to see the computer's thought process, undo moves, suggest moves, save positions, etc. Graphics consist simply of a 2d top-down view of the gameboard with your choice of a color background.": "",
  "Risk is a turn-based strategy game based on the board game of the same name. The players participate in a virtual world conquest: each player chooses a country to control, with the goal of engaging in war against the other countries, eventually dominating the whole world. The players are able to draft troops, build armies, move them on the map, and fortify their positions. Dice rolls are absent from the game; the victory depends on the player's actions more than on luck.": "",
  "Roadwar 2000 is a post-apocalyptic strategy game. In the year 2000, bacteriological warfare has nearly destroyed civilization. Crime flourished, and highways turned into battlegrounds between different gangs. The protagonist is a leader of one of these gangs. More patriotically inclined than other criminal lords, he accepts a mission from the FBI: locate eight scientists who might be able to develop a vaccine against the deadly disease. The player commands the gang in tactical combat against rival gangs, mutants, and cannibals. It is possible to assign player-controlled characters to vehicles and move them on the battlefield. Combatants can use firearms and crossbows, as well as use the vehicles to ram each other. Boarding the opponents' vehicles is also possible.": "",
  "An intermediary step in complexity between the brutally basic HAMURABI and more sophisticated modern titles such as Civilization, Santa Paravia and Fiumaccio ushers you into a Merchant Prince setting, governing over a 15th-century Italian city-state, competing with the savage forces of nature and against up to 5 (7 in some later versions) other players in the hot-seat, seeing who can rise through the ranks to claim titles from COUNT, to MARQUIS, GRAND DUKE (and, finally, H.R.H. KING). At its heart the game is, as are its predecessors, about bean-counting -- weighing your current reserves of grain (measured in steres) against your population's food demands, wondering how many gold florins the market price for your surplus will net, and how many hectares of land that'll permit you to purchase... and whether that investment will come back to haunt you the following turn if the weather shifts from feast to famine, when you have plenty of dirt and nothing growing in it to feed your grumbling populace. However, the game cleans up real nice, and cute graphical depictions may help you to forget that your debauched Renaissance rule largely consists of moving debits and credits back and forth across a virtual ledger. Varying difficulty levels help you find your own comfort zone in which to engage bad harvest conditions, worse real-estate prices and, worst of all, the endless appetites of what must amount to hundreds of thousands of rats, endlessly nibbling at your reserves. Surplus capital can be sunk into blue-chip investments such as marketplaces and mills, palaces, cathedrals and private armies. If, after commissioning them all, you find you don't have so much surplus capital after all, you can always cook the books by adjusting several different flavours of taxes, tariffs and customs fees... but tamper too much and your local economy will be stifled! Nearly every downturn in this game has an equal and opposite check, or at least a balance, to keep it from demolishing your estate in a single swoop... however, early versions of this game, as with many titles of its era, may cruelly and arbitrarily cut your rule short with a random death. All the more reason to carpe diem and do the best with what you've got, while you've got it.": "",
  "The Sargon series were the connoisseur's chess games at the time. This edition includes variable move times, ranging from 5 seconds to infinity. Moves can be undone and you can swap sides during the game. The search feature displays its calculations as you play, which can be useful to learn from. Special tactical situations, opening move sequences and checkmate practices can be loaded in for learning purposes.": "",
  "You must save the Aquadome! But is it in more danger from an inside traitor, or a vicious sea monster? As a famous inventor and scientist, you will use your inventions and skills to save the day.": ""
}