{
  "A top-down maze game, made remarkable by the fact that the randomly generated maze sometimes completely blocks the exit..": "",
  "3D 3D! is a maze game where the player simply has to find his way out of the maze. The game is played from a first person perspective and the maze is three dimensional meaning it's designed as a cube with multiple levels. The player starts at the lowest level and has to get to the exit at level 10. A map can be used to show the player's position in the level and it's also possible to show the locations of shafts to the upper levels. A score is calculated based on how many steps the player takes and adds penalties for reading the map. The game uses absolute orientation and the player looks around by pressing six direction keys. Pressing enter moves the player one step forward and for every action made the screen is redrawn. The game has both fast and slow modes and it is possible to turn on shaded walls for enhanced, but slower to draw, graphics.": "",
  "You have to save your home planet from marauding Alien spacecraft.": "",
  "3D Grand Prix is a 1st person perspective driving game where you must race against various other drivers over five laps to win the race on a randomly generated track. You start on the grid and when the lights turn green you accelerate away changing up the six gears your car has. As you accelerate you need to keep an eye on your rev counter, have it too high and your engine will blow and it is race over. As you approach a bend you are told the recommended speed to take the bend and you are updated regularly the weather with updates. As you finish a lap the road surface becomes checkered indicating you can stop your car to use the pits.": "",
  "A simulation of a F1 racing car. Vertically scrolling track with bends in it. Speed controlled by the gears selected. Gameplay is good with control of speed making it more involved than some ZX81 racing games.": "",
  "It's 1849 and the American gold rush has just started. The player in this game is one of the many that set off to the west coast in search for the precious metal. He must dig his way through the earth and excavate the gold but at the same time avoid the creatures that move around under ground.": "",
  "Space Invaders es un matamarcianos clásico en dos dimensiones. El jugador controla un cañón que puede moverse a la derecha o izquierda y un botón de disparo. Tiene que ir destruyendo los extraterrestres invasores (de los cuales hay tres tipos: con forma de calamar, de cangrejo y de pulpo) que van acercándose a la tierra cada vez más rápidamente a medida que el jugador los va destruyendo. Este ciclo se puede repetir en forma indefinida. Si los invasores llegan al cañón controlado por el jugador, el juego termina. Cada cierto tiempo aparece en la pantalla, por encima de los invasores, un platillo volador que se mueve aleatoriamente de derecha a izquierda o de izquierda a derecha y que no agrega una puntuación definida, sino puntos extras en cantidades aleatorias. Además se tienen cuatro escudos de protección terrestre (más parecidos a búnkeres) que cubren al jugador del fuego alienígena, pero que son destruidos gradualmente por los disparos de los invasores y el cañón del jugador.": "",
  "RPG-style adventure. King Arthur must collect 5 items from around the map in order to return to his castle.": "",
  "1K hires game where you race 5 minutes to get the highest score": "",
  "Namtir Raiders is a fixed screen shoot 'em up. The objective is simply to shoot down as many enemy raiders as possible and save the earth. There are four waves of enemies and each wave has a different kind of enemy. The movement of the ship is a bit different from other shoot 'em ups. Rather than having keys for up, down, left and right, they here lead to diagonal moves (for example up and left, down and right). The player has five lives and earns more when all four waves have been completed. Once they have the game starts over with the first wave. A difficulty level between one and three can be chosen before the game begins. The higher levels run at a higher pace.": "",
  "Night Gunner is set in World War II, and loosely simulates the Lancaster plane, but despite this, and despite being from Digital Integration, the game is more of a shoot 'em up than a flight simulator. It's primarily split into shooting and bombing phases, the first of which is viewed from the cockpit, and sees the player shooting at balloons, planes (which are hostile) and big bombers. Damage can affect the engines, which affects the player's performance - when 3 engines are destroyed, the plane crashes. Damage to the gun turret causes slower shooting, and eventually deprives the player of the ability to aim. The bombing sections include high-level and low-level attacks, each with limited ammunition. High-level runs often involve intercepting shots before they can hit you, while on the low level runs there is a constant risk of hitting the ground, or being hit by enemy fire.": "",
  "Your aim is to cross Nightmare Park from S to F without dying by completing various tasks that you come across. A map of the park is shown and you move in a North, South, East or West direction along the paths. As you move you will come across creatures a": "",
  "Dominoes is an adaptation of the traditional board game where the player competes against one computer opponent. The two players take turns laying domino bricks so that they create a chain of bricks. The bricks are placed so that adjacent numbers match. To win a game the player has to score exactly 72 points. Points are scored when the end dominoes totals a multiple of 3 or 5. So for example if the sum of the bricks is fifteen then the player scores eight points (15/3 + 15/5 = 8). If the sum is not divisible by 3 or 5 then no points will be given. If a player scores higher than 72, the score will be 72 minus the number of points above 72. When the player has used all his bricks a new game is started but the score will be kept.": "",
  "Old fashioned western style gunfight either against the computer or another player (on same keyboard). Surprisingly fun fast moving gunfight game. can set the game difficulty and speed. Dodge the opponents bullet whilst shooting yours past the wagon to hit them.": "",
  "Four-directional scrolling shooter: protect the convoy from marauding space bandits.": "",
  "Simulation of a catering business. Simple. Text based.": "",
  "Your mission is fly above the surface of a mountainous planet and destroy buildings on the surface by dropping bombs. Viewed from the side with the screen scrolling left to right constantly, you will also encounter alien ships firing at you as well as missiles but these can be shot with your laser. Overuse of your laser though will make it overheat and you will be unable to use it for a short time. If you are hit by any bullets, missiles or hit the surface then you lose either one or two shields from five and if your shields run out then you lose one of five lives. Scattered on the surface are Atomic Power Stations and these must not be destroyed or you will blow up the planet and lose a life. There are five skill levels (1-5) with one being the easiest.": "",
  "ZX-Galaxians is as can be expected a variant of the arcade game Galaxian. It's a fixed screen shooter where the player move his spacecraft down the bottom of the screen and has to shoot at the aliens moving back and forth above him. Aliens will at time leave their formation and swoop down towards the player try to collide with him or hit him with bombs. Aliens in formation are worth ten points while attacking aliens are worth twenty. When all three lives have been lost the game ends and the player gets to enter his name for a high score.": "",
  "Clone of Donkey Kong for the ZX81.": "",
  "You are a Knight from Camelot and you are on a quest to search and find Merlin's lost treasure. In this three part text adventure you must move about the surrounding areas to fight monsters, rescue a Princess and encourage others to follow you. Each scree": "",
  "The game is set in a ammunition compound viewed from above with the whole compound on the screen. You have the choice of playing either as a saboteur trying to place an explosive and cause as much damage as he can, and a guard trying to prevent the saboteur from succeeding. Playing as the guard sees you trying to predict the movements of the Saboteur in a set number of moves. You are armed with a truncheon and if close to the Saboteur then he will move out of your hitting range. You must try to corner the Saboteur or prevent him moving to his target as he will blow himself up. Points are awarded or deducted for any prevention or damage caused. Playing as the saboteur now has you trying to place the explosive while avoiding the guard who now is armed with a rifle in a set number of moves. Once again points are awarded or deducted according to how much damage is caused or if you are caught or shot.": "",
  "Computer versus player tic tac toe (noughts and crosses) game simulation. Take your turn by selecting 1-9 and the computer plays its go. You can go first or let the computer go first.": "",
  "The Tomb of Dracula is an arcade adventure where the aim is to explore vaults over various levels of Dracula's Tomb to find the Vampire's Treasure worth half a million pounds. At the start of the game you are presented for a limited time, a map of the fi": "",
  "A \"bomb the buildings to make a runway\" game. Simple.": "",
  "Airline is an economic strategy game, with the player taking the role of a Chairman for L-AIR, an air company whose business starts off with £3 million. He has 7 years to increase his net assets to £30 million. The player can charter, buy or sell aircraft, as well as managing staffing, maintenance and insurance. Situations in game (like hijacks, air crashes and sabotage) and costs (of fuel and aircrafts, tax demands etc.) are realistic.The graphics are simplified, made ​​up almost entirely of tables and texts.": "",
  "Alien is a game inspired by the movie with the same name but without a license. The game takes place aboard the transport ship Nostrodamus and the player's objective is simply to destroy the alien. The game is viewed from a top down perspective where the whole ship is visible. The player character and the alien are represented by flashing squares although the alien is only visible when within ten moves from the player. The player can also see various letters that represent weapons although the player won't know which weapon is which before picking them up. To attack the alien the player has to pick up a weapon and then use it in the direction of the alien. The player can only carry one weapon at a time and won't know what effect it has until he has tried it out on the alien. Once the action has taken place the weapon is automatically dropped and another weapon has to be picked up and used to further damage the alien. The player has four crew members and when they have all died the game is over.": "",
  "Alien Attack is a Space Invaders clone where your craft sits at the bottom of the screen while aliens above move in formation across the screen getting lower. You must blast all the aliens while avoiding their missiles that drop down or you lose one of there lives. At the start of the game you have shields above your craft but will slowly disappear from being hit from your shots or the aliens missiles. At the top of the screen, a mothership moves across the screen and when shot gives you extra points. There are 9 speeds to choose from (1-9) with 9 being the slowest.": "",
  "The Ultimate Multi-Level Graphics Adventure. You are alone and lost in the CATACOMBS. how much Gold can you find? How long can you survive before you starve to death or one of the many Monsters gets you! Each Level can include up to 9 Rooms, 8 Passages, 7 Monsters, Phantoms, Traps, Food, Gold, an Exit (to the next level!) and there's an infinite number of levels! This is one Adventure you won't get bored with!": "",
  "A 1st person shooter where you move your sights around the screen to blast alien ships that come into view to save your civilization. You must destroy as many as you can before your energy reaches zero. Simple shoot-em-up: get the bad guy in your sights and fire.": "",
  "Bugaboo (The Flea) is the crew member of the spacecraft \"Cebolla X7\". Everything begins when detecting life on a planet in the sector Almak-1 tries to land. Then it suffers an accident and falls into the deepest part of the planet. From then on, The Flea must ascend and reach the exit. This is the first game in history created in Spain in 1983 by Paco Suárez and Paco Portalo. It is also the first Spanish game to be published in England.": "",
  "Simulation of the classic Tower of Hanoi or pharaohs pyramid puzzle.": "",
  "Jump with Q Bert to all fields and colour them black, but avoid the snake and the ball.": "",
  "Text based snooker simulator game. Yes it is text based so you only select with typing which ball you attempt with no pictures!": "",
  "Farmer is a simulation game where the player has to run a wheat farm profitably. The objective is to increase assets to £500,000 in 50 to 75 weeks (depending on difficulty). The game is text based and played by entering commands. Commands are entered weekly (monthly in some versions). For each week three decisions can be made. Possible options include buying land, seeds, tractors and harvesters, hiring labourers, planting seeds, fertilising, harvesting, irrigating, spraying against insects and selling crops. Problems that might be encountered include drought, insect attacks and rats eating seed corn.": "",
  "Reversi is a simulation of the classic nineteenth century Othello board game. Strategy game.": "",
  "Invaders is a Space Invaders clone: In the game the player controls a gun which can move left and right to hide behind bunkers, then shoot at the advancing ranks of aliens; watch for their mothership. The game includes ten difficulty levels and the player": "",
  "A city in the jungle is losing it's power due to Leeches on the grid. In this maze game you must move along the grid and damp the dotted lines which turns them solid. As you move around the grid, Leeches also move about and if you touch one then you lose": "",
  "The Damsel and the Beast is an arcade adventure where you must search 35 rooms of a a darkened Palace to kill a Beast and rescue a Damsel before escaping the Palace. The whole Palace is in pitch blackness and you must move about feeling your way with wall": "",
  "Puzzle maze game with monsters to avoid. Monsters move very fast and getting past them to safety is the key to gameplay. Fiendishly hard.": "",
  "In this adventure you must try to find and restore two jewels to the source of evil in the kingdom of Kwantos, a skull called Yoric. The jewels were stolen and hidden many years ago. If you manage it king Kraktups sanity will return, he may give you a knighthood.": "",
  "You have crashed on a insland. The insland is inhabited by man eating zombies. The zombies are blind but they detect you by the sound of your heart beat. Your only hope is lure them into a potholes.": "",
  "A Pac-Man clone that has you moving about a maze eating all the dots to clear the maze. As you eat the dots, Gloops move around the maze as well and if you touch one then you lose one of three lives. There are power-pills and if you eat one then you can eat the Gloops for a short time.": "",
  "Based on the classic pen and paper game, Battleships has you competing against the computer on two 10 x 10 grids to sink all the computer's ships before it sinks yours. You place your various length ships vertically or horizontally on one grid while the c": "",
  "Arcade Game: Shoot-em-up. Fly your craft over a perilous landscape and shoot anything that moves. Don't forget to refuel.": "",
  "Hopper borrows the Frogger style of gameplay, for one of many games inspired by the arcade hit. The road has six lanes to cross, each very densely populated with traffic. Permanent logs and temporary turtles are used to get across the river, and reach one of the five home cells. After filling all of them the game moves up to a higher difficulty level. A range of keys can be used for each control function.": "",
  "Classic Black Jack card game simulation in Hi Res (Hi Res for the ZX81).": "",
  "Pac Man game for the ZX81. This version is fast playing and works well. Slows down when you gobble up a ghost, but good to play within the limitations of the ZX81 graphics.": "",
  "Run through the maze to get the treasure before the Mazogs eat you.": "",
  "The original future sport game, Speedball is played out on a small court with five players on each team, making it more frantic than the more famous sequel. The ball must be thrown into the goal at your opponent's end. Any amount of physical contact can be made, and there are no illegal ways to get the ball or the goal. Before each match you can bribe the referee into awarding you a head-start or strengthening the abilities of your players. You compete in a simple knockout cup tournament, or in individual 2-player games.": "",
  "Simulation of Conway's game of life on an 8x8 grid, which runs very slowly generation by generation.": "",
  "Today you have the privilege of driving this famous train from lonoon to edinburgh. Distance is 400 miles and scheduled time 450 minutes with one stop, at newcastle. You also have speed restrictions for three major stations and two track repairs.": "",
  "8 way scrolling routine. Simple.": "",
  "In this 1st person shooter, you are in command of a Laser-Cannon Platform and you must defend your city from alien invaders attempting to destroy it. Controlling your sights, you must move about the city, scrolling left or right, in search of the invaders": "",
  "Simple platform game with ladders and spiders. Dig holes to make traps. Similar to a simpler version of the later Horace and the Spiders for ZX Spectrum.": "",
  "Fast moving race track arcade game for ZX81. Steer around the course picking up as many points as you can.": "",
  "A simple car racing game simulator. Race your F1 style car on a straight vertically scrolling track avoiding the other cars as you overtake them. Surprisingly hard to survive more than 30 seconds without crashing.": "",
  "Arcade shoot em up. Fungaloids - a brilliant mix of City Bomber, mushrooms and Haemorrhoids. Bomb the Fungaloids to the ground before they reach the sky.": "",
  "Quicksilva have produced an excellent version of Galaxians for the ZX81. The action is fast and responsive, and it is a pleasure to play. Two types of galaxians move, in formation, across the top of the screen, and swoop down, attacking your base. You have three lives available, while the speed, firing-rate and the number of swooping Galaxians are adjustable by the player. Points are scored, in the usual fashion, by blasting the Galaxians as they fly. However, more points can be scored if the Galaxians are hit as they swoop down from the top of the screen. Scoring is displayed on the screen, and at the end of each game, your score is entered into a league table which can cater for up to fifteen games/players. The first batch of swooping Galaxians are particularly good at searching out an destroying your base, and some deft manoeuvring is required to avoid their attack. Thereafter the battle is fierce but a high score can be achieved by the experienced player. If it becomes too easy, the level of difficulty can be soon increased.": "",
  "Galaxy Invaders is a Space Invaders clone where you control a craft on the bottom of the screen moving left or right, blasting aliens above in formation. The aliens move across the screen slowly descending downwards. As you blast the aliens, you must avoid the bombs that they drop because if you hit one or allow an alien to land on the bottom of the screen you lose one of three lives. Between your craft and the aliens are five shields but parts disappear when hit by your bullets or the alien's bombs. Before the game you can choose the speed of the game (0-9) from easy to very hard.": "",
  "This is noughts and crosses on a 4x4x4 cube. Each move is entered as a 3 digit no. The digits indicate the level, row and column, respectively. You must try and get 4 of your counters represented by \"o\" in one three dimensional line.": "",
  "Vous devez désamorcer une bombe posée par l'infâme Boris, dont les exactions menacent de faire exploser toute la ville. Bien que vous ne soyez pas vraiment rompu à ce genre d'exercice périlleux, vous pourrez toutefois compter sur les conseils de l'expert en démolition Frank et en faisant appel à votre logique pour déterminer le code de désarmement correct.": "",
  "A classic bomb the buildings to clear the runway game. Fly across the top from left to right and bomb buildings to clear the landing. Crash into buildings if you are not fast and accurate.": "",
  "Booster is a follow up to Rocket Man. Like that game it is a platformer where the player uses a jetpack to fly between platforms. The objective of the game is to collect fuel cells that appear at random positions on the right side of the screen. These then have to be transported back to the player's flying saucer which is located on the left side. In the way there are plenty of hazards and bad guys that the player has to avoid. These include spiders, skulls, pests and nettles. The player also can't take too long as he has a limited supply of air. Another way of dying is crashing into a platform with the jetpack. The game has five levels that can be played in any order.": "",
  "Two player top down tank versus tank game. Rotate your tank and move forward to get in a position to shoot your opponent. Shoot only in 4 cardinal directions. Two player controls on the same line of the ZX81 keyboard make it challenging!": "",
  "You must attempt to land on the moving objects and avoid the barriers in the middle. You only lose point if you land on an illegal object and not if you go through it. If you get over 6000 points on your first jumps then you get 10 more. You must also try and miss the barriers above the landing.": "",
  "A classic Tower of Hanoi game. Simple controls based on text to move from tower A,B and C. Shows your last moves.": "",
  "The object of the game is to cross the road by going through the gaps between the cars. Then you must go across the river by jumping on the logs and turtles and into a gap in the river bank.": "",
  "Train A is ZX81, Train B is You, You have 4 seconds to do the sum. If it's right your train moves, if it's wrong or you don't answer, the ZX81 train moves.": "",
  "Micro Mouse Goes De-bugging is an action set inside a computer program. Software bugs are trying to destroy Micro Mouse's programs and it's up to the player to help him out. In the middle of the screen there is a short Basic program with some letters missing. It's the player's job to collect these letters, which can be found in four cages at the corners of the screen, and put them back into the code. To make it easier to see which letters needs to be retrieved they are flashing in the code. At the same time the bugs run around and attempt to steal the letters and put them back into the cages. When more than a certain percentage of the letters are missing there will be a system crash and the player has to start again. To stop the bugs the player can pick up a can of datakill and shoot at the bugs. Problem is that it is not possible to both carry datakill and letters at the same time. When a bug carrying a letter is killed the letter automatically returns to the code. Once the program is complete it will run and the player can move on to the next level which has a more complex program and more attacking bugs.": "",
  "Classic lander sim. Land your lunar module safely by controlling its speed.": "",
  "Popular Computing Weekly said of Psion's Flight Simulation on the ZX81 \"No words can do justice to this most elegant of programs ... You will not see a better computer game till Psion produce one for the Spectrum\". Here it is. Learn to fly, bank, dive and climb, see the world outside through the cockpit windows, land and take-off with the aid of the many cockpit instruments.": "",
  "Run up the slope avoiding the falling boulders by jumping. Simple gameplay. Has an Indiana Jones feel to it.": "",
  "Dallas is a simulation game where the player takes control of a company in the oil business. The game shows a map over Texas and is played by choosing from a text menu and entering coordinates on the map.": "",
  "Pac-man style clone. Capture the ghost before time runs out. Your score is the remaining time, so the faster you get the ghost the more points you score. After each ghost the game will go a little faster until top speed is reached.": "",
  "A Pac-Man clone where you have to move about a maze to eat all the dots while avoiding three creatures moving about the maze. If you touch a creature then you lose one of three lives but there are power-pills that can be collected and this allows you to e": "",
  "Krazy Kong is based on the arcade game Donkey Kong where you have to move from the bottom of the screen to the top to rescue a Princess held by a giant ape. To move up the screen you have to climb ladders and move along platforms while avoiding or jumping barrels that roll down the platforms and ladders. There are also stars that move from the bottom of the screen and move upwards and if you touch a barrel or a star then you lose one of three lives. Later levels see moving platforms as well as spikes that shouldn't be landed on.": "",
  "This game is the first in Artic's Adventure series. You play the role of a spaceship pilot in the future who has been marooned on a hostile alien planet and must find his spaceship and fix it to escape. To hinder your progress are fiendish puzzles and a handful of alien NPCs.": "",
  "Starting off in a South American Jungle, near an as yet undisturbed Inca temple, your aim is to enter the structure and go treasure hunting. Inside the temple is lots of such treasure (each worth a certain point value), but also traps to catch the greedy. You will encounter a Sacrificial Chamber, a Fire Room and a Pool. Gather as much treasure as possible and return to the jungle clearing to finish the adventure. The game features a simple 'Verb Noun' command interface, and no graphics of any description. Instructions such as 'break door with rock' have to be split into two commands.": "",
  "While on a reconnaissance flight, your ship has been drawn by a Graviton Beam onto an Alien Cruiser. Fred, your pet android, informs you that the cruiser is on a Humanoid slave mission, its aim to seek out Humanoid planets from which samples are taken and their brains replaced by microchips. Your aim is to free your ship by pressing the control button in the main computer room. Of course, expect various hazards and puzzles to be in your way. The game features a simple 'Verb Noun' command interface, and no graphics of any description. Instructions such as 'insert key into hole' have to be split into two commands.": "",
  "While on a recce mission to investigate a secret enemy location, your plane is shot down and you are sent hurtling towards the island's surface. This is where you come in, and through text commands you must initially bring the plane under control. After this you must locate the stronghold, retrieve the information needed and then get to your aircraft carrier. To get back past enemy fire, you must return in disguise, so you must also avoid your side shooting at you by mistake. The game features a simple 'Verb Noun' command interface, and no graphics of any description.": "",
  "Western style shooting game with two players having a duel. Shoot bullets at your opponent, but the bullets may get trapped by the wall between you. Once there is a hole in the wall you can shoot your opponent. Seems like a rather safe way to have a duel!": "",
  "On your way home back to your planet in your spacecraft, you have encountered an asteroid field with the asteroids together in clusters. Viewed from above, you scroll down the screen as the asteroids move upwards but you are able to move left or right and shoot them with your destructer. Your main problem though is your craft only has 500 energy units remaining and you need at least 100 to land on your planet. Every movement you make, firing the destructer or using shields when you hit an asteroid decreases your energy and when it reaches below 100 then it is game over.": "",
  "Your task in this arcade game is to guide a frog across a treacherous road and river, and to safety at the top of the screen. Both these sections are fraught with a variety of hazards, each of which will kill the frog and cost you a life if contact is made.": "",
  "Munchees is a Pac-Man clone where you must move around a maze to clear it by eating all the dots. As you eat the dots you have to avoid ghosts and if you touch one then you lose one of three lives. There are power-pills that can be eaten and these allow you to eat the ghosts for a short time. You have a choice of how many ghosts on the maze (1-4).": "",
  "The aim of Murgatroyds is to move around a grid avoiding the creatures but trying to get them to hit mines scattered on the screen. You move using a compass direction (North or South West etc.) one place at a time and once you have moved then all the cre": "",
  "Deathrider is a light cycle game where one player competes against the computer. The player has to steer his bike (whose tail continuously grows) around an arena while avoiding crashing into the AI rider, the walls or the bike's tail. The player earns poi": "",
  "Breakout is a clone of the arcade game of the same name for the ZX81 and has you controlling a bat at the bottom of the screen, moving it left or right.": "",
  "Very simple archery simulation game. Line up the dot on left side of screen with target dot on right hand side of screen and fire. Line drawn between the two dots to see if you hit target.": "",
  "Invasion Force is a fixed screen shoot 'em up where the player, as so often before, has to defend the earth from an army of hostile aliens. The player moves his laser base along the bottom of the screen. At the top there's a large enemy ship that is protected by a moving force field. In addition to this there are smaller ships that drops bombs towards the player. The objective of each level is simply to destroy the large ship, but to be able to reach and damage it the player first has to shoot holes in the force field. Hitting the force field causes the missiles to ricochet back towards the player. The force field also has black parts that should be avoided, since hitting them will fully repair the enemy ship. To take down the enemy ship the player has to hit the control area located in the centre of the ship. The game is over when the player has lost all of his three ships or when the time runs out.": "",
  "Scrolling plane over a landscape, bombing the enemies on the ground and avoiding their missiles. Control your height and when to bomb to win. Simple text based graphics and quite fast moving.": "",
  "Rocket Man is a platformer where the player has to collect diamonds. The diamonds are located on the far left side of the screen and the player starts out to the right. The right side consists of platforms and ladders but to get to the diamonds the player will need a jetpack to fly across the gap that separates them from the rest of the screen. To use the jetpack the player first has to collect fuel cans which appear in random positions. Once the gauge indicates there is enough fuel in the tank the player can pick up the jetpack and go get the diamonds. When the fuel runs out the player has to go back and collect more fuel. Beneath the platforms are water that the player has to avoid. There is also a bubble that moves around the screen trying to catch the player. When it succeeds it drags the player down into the water. Contact with water leads to a lost life. The game consist of six levels each with a different platform layout. On the first three levels the bubble gets increasingly better at homing in on the player, making the game harder. On levels 4 to 6 the jetpack is replaced by a vulture and instead of collecting fuel the player has to collect lamb legs to feed the vulture.": "",
  "In Roman Empire the player is put in the role of the emperor of Rome, in the first century BCE. Your goal is to successfully expand the empire by occupying neighbouring countries. Each year you must make decisions (using text menus), whether to assemble armies from legions, appoint generals to command them, and finally launch campaigns against your foes (which last more than one turn, you can reinforce or withdraw armies). Battles are resolved each turn by the computer. Troops are characterized by quality, morale and fatigue levels. With your armies fighting abroad, watch out for barbarians!": "",
  "Lunar Rescue is a clone of Taito's arcade game of the same name. The aim of the game is to evacuate humanoids from the surface of a moon. From a mothership at the top of the screen, the player drops down lunar modules that he has to safely land on the moon's three landing platforms. This works similar to Lunar Lander but here the player has to navigate his way through an asteroid storm. The player can steer left and right and use the thrust to hover in the air. Once the player has landed successfully the humanoids will enter the module and the player takes off again. But now the scenario has changed. Above him he will find waves of aliens that drop bombs. To survive the player has to dodge the alien ships and make it back to the mothership. Now thrust isn't available any more. Instead the player can use a gun to shoot at the aliens. There are six groups of humanoids. The player gets points for each successful landing and each alien shot down. When the last humanoid has been rescued the player gets bonus points for every one he has managed to bring back. Bonus points are also awarded based on the amount of fuel that remains. For each group that has been rescued the game goes on with increased difficulty and bonuses.": "",
  "Breakout clone for the ZX81. The ball bounces side to side rather than up and down. Five layers of bricks to break through. Ball bounces off your bat if you get the timing right.": "",
  "Travel your starship savely trough the asteroidbelt.": "",
  "Asteroids is a clone of the Arcade version which sees your craft in the middle of an asteroid field and you must destroy all the asteroids to survive. The asteroids start off large and when you shoot one then it splits into two, and shooting an asteroid this size splits it into two again before being destroyed with another shot. Occasionally an alien craft appears moving across the screen and this can be destroyed for extra points. If you are hit by an asteroid or the alien craft then you lose one of three lives. You are able to turn your ship 360 degrees as well as move forward.": "",
  "A 3D maze game with nice quick graphic updates, it is no DOOM, but is still a playable maze game. The mazes themselves are not too big as to make the game a chore.": "",
  "Another standard maze game. This one uses FAST mode to turn off the screen to draw the next area of the maze. The ZX81 worked slightly faster in this mode.": "",
  "A German rip-off of 3D Monster Maze, even going so far as to steal some of the graphics. This is a poor man's version and you are best to play J.K. Greye's hit instead.": "",
  "3D Monster Maze was one of the first computer games to use a first-person 3D perspective. After being introduced to the game by a circus crier, the player character is transferred to a randomly generated 16x16 maze and has to find the exit. There is but": "",
  "Dice game. Throw dice repeatedly until you get as close to but not over 21. Then the computer tried to beat you. Like the card game but with dice rolls instead.": "",
  "Bomb the buildings while flying over them to clear runway. Similar to Air Attack game.": "",
  "Board game simulation. Play the ancient African game against the computer. Contains instructions.": "",
  "Shoot your cannon at the castle based on the angle and speed you select. Keep trying until you get the aim right": "",
  "The Gauntlet is a clone of the arcade game Scramble which is viewed from the side with the screen scrolling horizontally constantly from left to right for one to two players. You control a spacecraft and you must fly over a mountainous planet's surface bombing various installations while avoiding missiles that fly upwards. As well as your bombs you are also armed with a laser that fires forward. As you fly, a fuel gauge decreases and you need to bomb fuel dumps to keep your fuel levels up. If you are hit by a missile, crash into the surface or run out of fuel then you lose one of three lives and it's the 2nd players turn if two player is selected.": ""
}