{
  "65536 glorious games packed into less than 60kB! The result is a consistent experience comparable to those chinese cartridges we used to buy in the 90s and early 00s with a ludicrous amount of games, some good, some bad. Figuring out the games is supposed to be part of the fun, like it was back in the day when you didn't have the manual.": "",
  "Remember the table Air Hockey games? Yeah, now you can play on the Uzebox too...": "",
  "Alter Ego is a unique platform puzzle game. Players will use their alter ego to swap position, collect pixels, and solve levels. The gameplay explains itself starting from very easy to some difficult parts later on. At the time of original release, all 25 levels from the original Alter Ego are included. The following episode includes all the levels from Alter Ego 2 with all the new gameplay elements supported.": "",
  "The classic arcade game ported to the Uzebox. There's no enemies though due to RAM and CPU limitations.": "",
  "Logical puzzle, goal is to build molecule of atoms. 50 levels (by Andreas Wuest) Status of each level (if is done) is saved in EEPROM. Counting moves, distance and time in level": "",
  "B.C. Dash is a platformer game that pits you against the environment as you race against the clock for the fastest time. On your hazardous journey you will negotiate all manner of awkward terrain and encounter a host of strange artifacts that may aid or ail. You must combine your swift feline reactions with the cunning of a ...snail? Yes, a snail, in order to achieve the fastest dash since Thor and Grog! Bob B.C. Dash was originally named B.C. Bob and was to star Bob. But Bob lost his stone wheel... maybe he'll find it again at a later date. B.C. Dash was made with the help of the Platz toolset.": "",
  "Babylon Tower is a puzzle game where the goal is to line up colored balls 5 in a row either horizontally or vertically. All balls are inside movable rings that can rotate on 1 axis. There is an additional ring with a cutaway that can be used to move a ball from one column to the next.": "",
  "Port of the C64 \"Back to nature\" game from the year 1982.": "",
  "Block Boy is a puzzle game based around lifting, moving, and dropping boxes. The goal of each level is to reach the door way, which will be accomplished with intelligent moves and an understanding of the nuances involved in the gameplay. The game is inspired by \"Block Dude\" for the TI-83 series of graphing calculators. All graphics, code, and sound effects are original from scratch.": "",
  "Bomberman II is a re-make of the NES/Famicom Bomberman II. I tried to keep most of the graphics, and there is ROM for more, but have problem to go any further with the 4k of RAM.": "",
  "A version of the classic Boulderdash game from the C64 era. Collect diamonds and don't get crushed!": "",
  "A little program that should give hours of enlightenment!": "",
  "Bugz is an all-original 2D platformer, written specifically for the Uzebox. It has 21 levels, and the object is to collect all the cookies in each level without dying. If you can finish the level before the time bonus reaches zero, you'll get a higher score. Killing the bugs will also increase your score. Includes single player, and multiplayer modes.": "",
  "'Candle Burner' it's a small sleight game inspired by this homebrew game for the Commodore C64. Of course with better graphic as the C64 version ;-) and some additional twists.": "",
  "Castlevania fans rejoice! Seems it's been years we were talking about making a Castlevania game. This is a Demo of the port of the first original NES Castlevania level without enemies.": "",
  "The game chess4uzebox is implementation of well-known board game. 1 player game (player vs. CPU) / 2 player game (multiplayer on 1 or 2 controllers) / CPU vs. CPU game. 4 levels of CPU skills (ELO rating around 1060-1575 according to some position test). Option to temporarily disable display during computations, to make it faster. Demo mode (no music, no turbo, easy vs easy). Minimalistic chess engine - originally it was micro-Max by by H.G. Muller (http://home.hccnet.nl/h.g.muller/max-src2.html), ported to AVR by Andre Adrian (http://www.andreadrian.de/schach/#Selbstbau_Schachcomputer_SHAH). Full FIDE rules.": "",
  "Chuckie Egg is a home computer video game port initially released in 1983 for the ZX Spectrum, the BBC Micro and the Dragon. As Hen-House Harry, the player must collect the twelve eggs positioned in each level, before a countdown timer reaches zero. In addition there are piles of seed which may be collected to increase points and stop the countdown timer for a while, but will otherwise be eaten by hens that patrol the level. If the player touches a hen or falls through a gap in the bottom of the level, he loses a life. Each level is made of solid platforms, ladders and occasionally lift platforms that constantly move upwards but upon leaving the top of the screen will reappear at the bottom. Hitting the top of the screen while on one of these lifts, however, will also cause the player to lose a life.": "",
  "Columns if a fast paced competitive puzzle game for 1 or 2 players. Fight to the end, crush or be crushed!": "",
  "Corrida Nebososa is a racing game where you can race you friends or the computer. Race the computer or your friends. Create your own tracks and save up to two of them at the same time in just one EEPROM block. Four original songs.": "",
  "Donkey Kong is a re-make of the 1981 classic arcade game. Every attempt was made to keep the Uzebox version faithful to the original.": "",
  "This is a remake of Dr.Mario, a classic \"falling blocks\" game published by Nintendo for the NES in 1990. 2 player gameplay Original gameplay rules with virus numbers configurable per player Original music": "",
  "Fifteen Puzzle consists of a frame of numbered squared tiles in random order with one tile missing. The rules are simple: place the number in ascending order in the least amount of moves.": "",
  "Final Blood is a little arcade shooter which based on a small game of a 220in1 retro gaming console. Various enemies appear and drive from the left to the right edge of the screen.": "",
  "You are part of a firemen team and you must save people jumping out of windows and extinguish all fires!": "",
  "Frog Feast is a simple game where you control frogs intent on eating flies. The frog with the highest score at the end of the round wins, and perhaps even passes on his legacy to the high score table!": "",
  "The objective of the game is to guide a frog to each of the empty \"frog homes\" at the top of the screen. Losing them all ends the game. Frogger is a relatively close re-make of the C64 version of the classic arcade game. Beat your best score or play vs your friends.": "",
  "An implementation Conway's Game Of Life. It's not really a game per se, more a cellular automaton were you set \"cells\" and watch them evolve according to 4 simple rules.": "",
  "Ghosty Ghost is the epic tale of a brand new ghost who's just learning to fly... or something like that. Simple, familiar, and addictive gameplay. Avoid the obstacles to get as far as you can and beat the top score.": "",
  "Gorillas is a re-make of the famous QBASIC game Gorillas developed by IBM and published by Microsoft 1991 with MS-DOS 5. 1 player mode vs CPU 2 player mode original grafic and game play original sound tracks enhanced PCM sound effects wind speed simulation": "",
  "'Happy Easter' is a small arcade game. Help the Easter bunny! animated easter bunny, chicken and falling objects hall of fame with the names and scores of 3 best players 2 sound tracks and sound effects": "",
  "You are a mole with a jetpack! Dig as deep as you can and grab all the cash you can then use your jetpack to go back to the surface to recharge and power up before your power runs out!": "",
  "Iros is a platform and shooting game inspired by Solar-Warrior from Technos. It's played on and around 5 diverse planets featuring alternating stages of action platforming and space shooting. The 5 knights of Iros have stolen your power ups and fled to their home worlds. Destroy them and take back your swag!": "",
  "Joyrider is an action / driving game for the Uzebox, in the style of the original Grand Theft Auto and Driver games, created by James Howard for the Uzebox Coding Competition 2014.": "",
  "Lander is a remake of the 80's ATARI game Lunar Lander. land a space ship save on the moonnn7 levels with different backgrounds, ground profiles, fuel capacity and skillsnnSoundtrack: Rocket Man, Championsnnhall of fame with the names and scores of 3 best players": "",
  "Laser Puzzle is a Uzebox implementation of a laser-based puzzle game. It has 40 levels, and the object is to place pieces on the board in such a way that the laser beam is deflected into one or two targets from the proper direction. Pieces that aren't fixed in place (indicated by a lock icon) may be dragged and dropped onto any blank square, or rotated to face any direction. In order to properly solve each puzzle, the laser beam must pass through all of the pieces that aren't blockers.": "",
  "Lode Runner is a remake of the classic PC/Apple II/C64 game of the same name. The player controls a character who must collect all the gold in a level while avoiding guards who try to catch him. After collecting all the gold, the player must travel to the top of the screen to reach the next level. There are 50 levels in the game which progressively challenge players' problem-solving abilities or reaction times.": "",
  "Labyrinth game!": "",
  "Classical sokoban game with minimalistic engine and 999 levels. Simple game engine (copied from Sokoban for AVR TV Game)nnUnique level compression algorithm (average level has less than 27B, very cheap decompression)nn999 levels (selected levels from collections Microban, Sasquatch by David W. Skinner and Procedural Sokoban Level Generation - algorithmically generated by Joshua Taylor and Ian Parberry)nnCustom video engine (modified engine 5 with tile size 12x16 px and screen size 16x12 tiles, no scrolling or sprites - around 3KB of SRAM free!)nn1000 moves undo push ringbuffer (thanks to lot of free RAM)nnRemembers last opened level and state of completion (if was done) of each level in EEPROM (5 slots)": "",
  "Megatris is a Tetris clone. It was the featured Uzebox game when the console came out in August 2008. The gameplay mechanics closely resemble those of Tetris DS for the Nintendo DS.": "",
  "Melli's Retro Land is a platformer featuring 8 levels.": "",
  "Memory is an implementation of the card game Memory also known as Pairs.": "",
  "Ninja beatdown is a double-dragon type beat'em up where you kick Ninjas asses!": "",
  "A little game in which you control a bomb defuser. Bombs are activated in sequence, you need to have time to run to all bombs before the timer has counted down to zero (the timer counts your steps). The main feature of the game - a man leaves behind traces of which can not be stepped on. Therefore, you must calculate the correct path to the active bomb and not trap yourself!": "",
  "You get an action which includes: a move, teleport, or use of the Sonic Screwdriver. The Daleks will then move. If Daleks occupy the same space, they crash and die. Daleks are stupid and will run into other already crashed Daleks and die as well. The sonic screw driver can be used once be level, and will kill/remove all LIVING Dalek adjacent to the player. To keep order to the game, you need to press \"A\" to confirm your move, After all the Daleks are killed in a level, you start the next level which has more Daleks. You can teleport any unlimited number of times, but MAY teleport into a Dalek, including a crashed Dalek, and adjacent to a Dalek which will then move and kill the player.": "",
  "Laser Puzzle II is a Uzebox implementation of a laser-based puzzle game. Gameplay is very similar to Laser Puzzle, but there are additional tokens, and some behave differently. Tokens with a padlock overlay cannot be moved or rotated, but tokens with a rotation overlay can be rotated in place, but not moved. The laser itself is a now a token, there are two beam splitters, a double sided mirror, a checkpoint, combination mirror/target tokens, and a cell blocker (which doesn't block the laser). As one might expect, this provides for much more challenging game play! There are 60 levels, which include beginner, intermediate, advanced, and expert challenges. The controls and instructions are included in the game, though I still haven't figured out how to force people to actually read them before playing.": "",
  "Uze Snakes is a classic \"snakes\" game using mode 9.": "",
  "Pac-Man is a re-make of the 1980 classic arcade game. Every attempt was made to keep the Uzebox version faithful to the original. Pac-Man theme and intermission music converted by Uze.": "",
  "Pengo is an arcade game port originally developed by Coreland and published by Sega in 1982. The player controls Pengo, a red penguin that resides in the Antarctic. The game takes place in an overhead maze made of ice blocks, where Pengo fights the patrolling, blob-like Sno-Bees. The objective of the game is for Pengo to survive a series of rounds by bringing together the three diamonds dispersed in the maze or eliminating all opposing Sno-Bees.": "",
  "Pentago is simple 2 player implementation (no AI implemented nor planned) of Pentago (a Swedish strategy board game). It is a very simple game explained in 3 sentences on Wikipedia, though with a good opponent it can be very challenging.": "",
  "Pipes is an original game in the style of \"Pipe Mania\" aka \"Pipe Dream\" developed by The Assembly Line in 1989.": "",
  "A remake of the classic Pong game from 1972!": "",
  "Reels of fortune is a slot machine game which is known from the most casinos. Win as much money as you can with your 100 credits and finally climb the high score ladder.": "",
  "Welcome to Roguze. You are an adventurer. You've been asked by one of the gods, to travel deep into the earth, and get the sickle. You are represented by the symbol @. Explore the dungeon. When you see a monster, to attack it, simply walk into it. Find new weapons and upgrade your skills to make it to get to the bottom of the lair.": "",
  "Ruby Crush is an open source clone of Bejeweled (or any other match-3 game). It is currently single player, with two modes: Classic and Timed. Gameplay is more or less identical to Bejeweled, or any other match-3 games floating about. The goal is to get at least 3 gems of the same type in a horizontal or vertical row. You do this by swapping two adjacent gems. The only way you can swap a gem is if doing so would line up at least 3 gems of the same type in a row. Getting at least 3 gems in a row clears those gems, and new ones drop down from the top of the board. In both modes, you can get a hint about which gem can be moved to score some points. Note that this is not necessarily the best move possible, it's just *a* move, in case you get stuck.": "",
  "Simon is an implementation of the electronic game Simon says also known as Senso from the 70s...": "",
  "A simple snake game.": "",
  "Sokoban World is a logic game where the player must push blocks onto targets, whilst avoiding \"trapping\" a block. Players progress through sets of levels making up 5 worlds, ranging from America to the South Pole, each with it's own music and graphics.": "",
  "Solitaire is a classic card game where the goal is to get all cards onto the 4 home piles based on their suit. Strategy and luck are at play in this \"patience game\" that has been ported to a huge number of operating systems and game consoles in various forms. Also known as Klondike, it has proved to be a popular past time for those looking to burn 15 minutes or so.": "",
  "Space Age is an arcade style puzzle game. The goal of the game is to move diamond shaped block onto red platforms while avoiding the monsters and refilling on oxygen on time.": "",
  "Space Invaders is a re-make of the 1978 classic arcade game.": "",
  "Stormforce is a vertical shooter. Use your star fighter to fight your way through 4 levels. There are no shields, so use your 3 smartbombs and 3 lives carefully.": "",
  "Submarine is an action game that appeared on many older game consoles.": "",
  "Tank Fu is a tank-on-tank multiplayer deathmatch game. Best played with two players but also supports a single player against CPU mode. Challenge your friends to own bragging rights as Tank Fu master!": "",
  "Tetris is a Tetris clone and a modification of the game Megatris. While Megatris is designed for 2 players, Tetris has removed any multiplayer feature and replaced it with other display options such as Lines, Score, and Level. The gameplay mechanics closely resemble those of Tetris DS for the Nintendo DS.": "",
  "Tron is an open source competitive game based on the 1982 film of the same name. The goal of the game is to get your opponent to crash into a wall (either the outer rim, or one the tails left behind your light cycles).": "",
  "A game similar to Family Feud for the Uzebox, it supports up to 8 players, includes original art and music, but not original questions.": "",
  "Uzekickers: a Penalty Kick game": "",
  "Uzewars is a two player space shooting game using vector graphics. It ranked 5th at UCC2014.": "",
  "Uzebox Tactics is a turned based strategy game which is inspired by the game Advance Wars for the Gameboy Advance. Also some games like Batle Isle, Tom Clancy's Endwar or C&C took influence. It was started in 2014 by Edward Shin unfortunately not finished. Until now!": "",
  "Uzesweeper is close remake of the classic game Minesweeper. I tried to stay true to the original while adding my own little bit of design to the feel. It has been optimized for easy menu navigation and gameplay on the Uzebox.": "",
  "VectorGame is an enhanced port of the arcade classic Asteroids. The games uses a true vector based video mode developed specifically for this game (\"enhanced\" mode 6).": "",
  "Video Poker (based on the arcade version \"Jack's or Better\")": "",
  "Adaptation of the world famous game. This game is the first one to use the SNES mouse.": "",
  "XOR is a remake of an 8-bit game made by Astral Software back in 1987 for the BBC Micro, Amstrad CPC, ZX Spectrum etc. The object of the game is to pick up all the masks in the maze. That sounds easy but it can get devilishly difficult on later levels where you have things that can explode and turn the lights on and off. As you complete each level you are given a secret letter - once you have all 15 letters you can discover the hidden word - and become a member of the Order of XOR!": "",
  "Zombinator is a shoot-em-up game taking place in a cemetery where you must shoot onslaughts of zombies.": "",
  "Zooming Secretary is an action platform game reminiscent of earlier classic arcade games, with new original concepts. This game is based on the NES port(an original title) by Shiru(programming) and Pinwizz(media). You take the role of an overworked secretary who must answer phone calls before they hang up. Each phone call requires information related to 4 different topics: Earth, History, Literature, and Space. By going to a file cabinet with the specific icon, she will acquire the information related to the topic and can answer any phone call requiring this type information. The player will need to use quick thinking and cunning to minimize travel time between points and avoid unnecessary trips which may mean answering calls out of order or damage control sacrifices; too many failures and the secretary will be fired(though they have no replacement)! Avoid the boss who slows the secretary down with babble, the unmovable gossiper, the confusing assistant, the wreckless moving man, the creepy secret admirer....all while using healthy dosages of caffeine to speed through the level, and catch her dreamy but elusive \"bad boy love interest\". After all this, she is really going to need a vacation!": "",
  "2048 is played on a simple gray 4×4 grid, with numbered tiles that slide smoothly when a player moves them using the four arrow keys. Every turn, a new tile will randomly appear in an empty spot on the board with a value of either 2 or 4. Tiles slide as far as possible in the chosen direction until they are stopped by either another tile or the edge of the grid. If two tiles of the same number collide while moving, they will merge into a tile with the total value of the two tiles that collided. The resulting tile cannot merge with another tile again in the same move. (source Wikipedia).": ""
}