{
  "15 Puzzle is a simple slider puzzle game which features five different puzzles, each with it's own difficulty ranging from easy to expert mode. All the puzzles have a tropical and beach theme.": "",
  "177 is the number of the Japanese criminal legislation paragraph that forbids rape. The game, however, does just the opposite: it puts the player in control of a man who must pursue a fleeing young girl and rape her. The game has two gameplay modes. The first is a side-scrolling arcade sequence during which the player has to prevent the girl from reaching her house, and avoid the hazards on the protagonist's way. These include stones, barriers, animals such as dogs and turtles, etc., and can be avoided by destroying or jumping over them. The protagonist runs automatically, but the player can increase or decrease the distance between him and the running girl. In order to make the girl choose the wrong way and fail to find her house, the protagonist throws stones at her (these can also be used to kill animals and destroy obstacles). After the protagonist has caught the girl, the game switches into sex simulation. The player pushes arrow keys in a specific order to correspond with the protagonist's movements. The goal is to sexually satisfy the girl. If the player fails, the protagonist is arrested; if he succeeds, the girl marries the protagonist.": "",
  "After Burner II is an updated re-release of After Burner. Besides extra levels, a few new enemies, a few touches at the soundtrack and more disposable missiles, the biggest addition is the ability to slow down or speed up manually. The rest of the gameplay remains identical. Despite being called After Burner, most ports to home computers and consoles are based on this version. The NES, Amiga and Commodore 64 received two different ports with significant technical differences.": "",
  "The game takes place in a fictional 2007 where the Earth has been conquered by alien invaders. The player combats the occupation forces using vehicles under operation code named 'A-Jax' created to liberate the Earth. Game play is divided into two scrolling sections with two different vehicles: the first being a vertical scrolling section with the helicopter and a Rail scrolling stage with the jet/space fighter. The game spans eight stages and extends to 30,000 points, a second at 150,000 points. During the helicopter segments, the player has access to four different weapons including the Vulcan, Bomb, 3-Way, Triple and Laser. Each weapon is available through their own specific pick-up icon. However, the helicopter can only equip one firing weapon at a time with the Bomb being constant. The player also has access to Options which add additional firepower. The jet segments contrast highly from the helicopter segments, they have a complete lack of available power-ups and additional weapons beyond a machine gun and bomb.": "",
  "Akazukin Chachacha is a shooter based on characters from the manga and animated television series of the same name.": "",
  "Akumajou Dracula is the name of the 1993 Castlevania game released in Japan on the Sharp X68000 home computer system. It was a remake of the original Akumajou Dracula game. Due to the X68000 not being released outside of Japan, this game was never released outside of Japan either.": "",
  "Alien Syndrome is a scrolling shooter arcade conversion. Your job is to run around and rescue all the captives and make it to the escape hatch before the time bomb explodes. Then face the mother alien at the end of the level. You can play as a single player or two people, taking turns (Player 2 starts the game after Player 1 dies and vice versa).": "",
  "Wisperad is a small universe that consists of only a few star systems. Hundreds of years ago, light-speed travel was invented, allowing the inhabitants of different star systems to navigate spaceships and establish contact with each other. Three hundred years ago, a great leader named Dumna founded a centralized kingdom where the different races populating the universe could leave in peace. However, after his death political tensions have increased, eventually resulting in the dissolution of the kingdom and the partition of Wisperad into three spheres of influence: the Mars Confederation, the Kingdom of Willia, and the Empire of Zolius. A young man named Sion Asmarn lives in the town of Cosma on the planet Homu together with his father, a famous explorer. One day, a huge meteorite falls on the planet. Sion's father goes to investigate it together with the physicist Mamon Penrose. Sion and his girlfriend Shoko, Mamon's daughter, venture into the canyon where the meteorite has fallen, only to witness Mamon, apparently possessed by a mysterious force, killing Sion's father and escaping. Determined to get to the bottom of this terrible affair, the two embark on a journey that takes them to different corners of the universe. Alshark is a Japanese-style sci-fi role-playing game with several distinguishing features. The player controls a party of up to five characters, exploring a vast world consisting of several solar systems, each with its own planets and space stations, many of which can be accessed in any order. Navigation in space is done with the help of the space ship Atlia, which can be equipped with various weapons, engines and frames. From time to time the player will engage in random space combat against enemy ships, earning scrap that can be converted into money. These dogfights are automatic by default, but the player can choose to control the ship and fire its weapons manually, in an arcade shooter style. The bulk of the exploration, however, takes place on planet surfaces, which the party can explore on foot or in vehicles such as buggies, tanks or hovercrafts. Enemies appear randomly; combat is turn-based and is viewed from the same overhead perspective as the exploration. Only Sion is directly controlled by the player, while other characters follow AI routines, using normal attacks as well as offensive and healing techniques. Characters can equip head and body armor, futuristic melee weapons, as well as a variety of firearms. A \"party talk\" feature is available, with the characters being able to consult each other at any time. The game is also notable for allowing the characters to level up beyond the customary cap of 100. The Sega CD version has new anime-style cutscenes and audio music tracks. The PC Engine (TurboGrafx) CD version has a re-worked interface with full-screen navigation, as well as additional cutscenes and voice-overs. It also greatly reduces the amount of random enemy encounters during on-foot exploration, and generally lowers the difficulty level of the game.": "",
  "Angel Dive is a shooter game, with some interesting 3D effects. With a button you shoot, with the other one you can change the direction of shot. Unfortunately the complete game has only 4 levels (3 levels and final boss). Uses Midi sound output. Developed and published by Yamada Kikaku, which was released in Japan in 1996.": "",
  "Genghis Khan II: Clan of the Gray Wolf is an action / strategy game. At the beginning of the game, it is possible to choose between a world conquest, or the Mongol conquest. In the first one, you must conquer all countries in order to build the World as you wish it to be. In the second one, you play the great Temujin and you must unite all the little tribes of Mongolia.": "",
  "Become Genghis Khan and lead the most fearsome army in the known world. Use your Land of Mongols to build an empire on the bodies of your enemies and the rubble of their conquered cities. With skill, cunning, diplomacy and luck, all of Europe and Asia could be yours. Failure means shame in the eyes of your princess, or even death! Victory on the battlefield requires bold strategy and clever planning. Outmaneuver your opponent with cavalry, lay siege to his castle with archers or even challenge him to a duel. But success also requires brilliant political tactics and a sharp eye for business during times of peace. Genghis Khan is based on actual history and offers a blend of strategy and role playing elements. Make history as you play the great Khan himself or his rivals, Richard the Lionhearted, Emperor Alexious III, or Shogun Minamoto of Japan.": "",
  "In the year 2069, the British ship \"Elias Rits\" sailed to Kermadec Island on a private investigation mission. Shortly thereafter, satellites reported that beacon transmissions from the ship have stopped. Seeing that further investigation required exploration of hostile environment and deep sea, the authorities dispatched a special team known as W-ODL to find out what has happened to the ship. Navigating a powerful mecha, the American pilot Fredric von Nyuya has to get to the bottom of the mystery and report his findings to the crew. Aquales is an action platformer. The mecha is equipped with a default fist-like melee weapon and gains access to other methods of destruction later, including chainguns, rockets, homing missiles, and more exotic items such as a gravity flamethrower. The stages usually consist of series of platforms and are fairly large, with optional areas and power-ups (health, one-time attacks, etc.) in treasure chests. The protagonist's stand-out equipment is the grappling hook, which must be used frequently to access high platforms. The game also has a light RPG angle: the hero gains experience points from defeating enemies and levels up as a result. Each stage ends with a boss battle, after which the player's progress is saved.": "",
  "Long time ago, an evil sorceress Castomira decided to conquer the world. But a good princess revolted against her, and in a great fight defeated the sorceress. But in order to completely seal the sorceress' powers, the princess had to forge a magic sword. For a long time this sword guarded the peace of the citizens of Arcus. But now the followers of Castomira stole it, and the world is facing a great peril... This is a Gauntlet-like game: lots of action and magic, with items to collects, and many dungeons to free from monsters. The game is also viewed from an isometric perspective, typical for the genre. Choose one of four characters to battle your way through dungeons and castles, or play with a friend in a 2-player mode.": "",
  "An evil being known as Ligar is about to conquer the land of Argool. Such is his power that no living creature dares to cross paths with him. But the legendary warrior Rygar rises from his grave to restore peace and justice. Armed with his famed weapon Diskarmor, Rygar begins to traverse the vast lands that lead to the lair of the demon, as his minions are trying in vain to stop him... Originally released on the arcades, Rygar is a side-scrolling action game. The player controls the titular hero, advancing through stages populated by hostile creatures. Beside the Diskarmor, a weapon that looks like a shield with a chain attached to it, the hero can use a variety of other weapons, including projectiles that can be fired in four directions. Various \"powers\" are scattered through the levels and can be collected. The effects of these powers include increasing the fire power of the equipped weapon, adding time to the clock, temporary invisibility, extra points, etc. This game is also known as Rygar.": "",
  "A very obscure and short shooter developed for the Sharp X68000. Developed by Haiteidoradorazu and published in Japan by Team Alianhrod in 1996.": "",
  "Revenge of Doh is a direct sequel to the original arcade smash Arkanoid. Along with improved graphic engine, better sound and music, better hardware support and more levels, Revenge of Doh also features a built-in editor and allows you to create your own level sets! Revenge of Doh continues Arkanoid's plot as follows, directly taken (including typoes) from the game: A long time period passed and the dimension controlling force Doh has again come back to life. Occupying the huge starship Xorg, it has entered our universe from a different dimension. Mixtec, Arkanoid type spaceship, has lauched the craft Vaus II to make a preemptive attack on Xorg.": "",
  "Two young warriors, Notos and Ing, were traveling in a faraway country, when suddenly a giant woman-snake appeared in front of them. Ing escaped, knowing that Notos was probably killed by the monsters. Tortured by his conscience, Ing is found by a local young girl named Luna. But soon Luna and other young village girls mysteriously disappear, and Ing decides to help them however he can - not forgetting his quest for revenge against the snake... Despite this RPG-like plot, the game is strictly a Japanese-style adventure. At every given screen, there are the standard Look, Talk, and Think commands. It is typically required to go through all the commands multiple times, obtaining the \"Move\" command and advancing the story.": "",
  "Unlike Activision's earlier remake of an Atari arcade classic, Battlezone, this one stays close to its namesake. Take the original, Atari coin-op game Asteroids, add in the features of the Atari 2600 cartridge, then give it 3-D graphics and a bunch of power-ups, and you've got Activision's Asteroids remake. You are an employee of the Astro-Mining Corporation. Your mission is to simply go to an assigned area of space and clear the area of asteroids and the occassional debris. The game consists of five zones, each with a different background and some with special features. Each zone has 15 levels. In addition to the standard asteroids, there are also mined asteroids that explode; indestructible asteroids that are, well, indestructible; fireball comets; crystal asteroids that regenerate; alien egg asteroids containing deadly baby space worms; and ancient energy asteroids that shoot back! And there's plenty of enemies in addition to the asteroids, such as Standard and Super Saucers, Asteroids Tugs, Fuel Transports, Hexes, Nuke Drivers, and Vulturoids. There are three types of ships to choose from, each with different strengths and weaknesses. There are also three skill levels. If you beat the game at Expert or higher, you gain access to a fourth type of ship. All ships features the standard laser, shield, flip (instantly flips your ship 180 degrees), and hyperspace. There are also limited power-ups you can pick up such as GunSat, Mines, Homing Missiles, Plasma Drill, and Trigger Bombs. The game supports either one or two players. In two player mode, the object is to simply outscore your opponent in a random zone and level. You cannot directly kill your opponent by shooting him, but there are other ways.... Lastly, if you shoot the classic-style asteroid in level 15 of the first zone, you'll find the option of \"Classic Asteroids\" now appearing on the main menu.": "",
  "The game's limited story takes place at the Ryōran Private School for Women. This school has been established to educate the daughters of the upper levels of society. The school holds a martial arts tournament called the Club Rivalry Budget Contest Mega Fight every year. Each character employs a different fighting style and the techniques are unique to the fighting club that they belong to. The combat system follows a rather standard fighting game scheme; the girls execute a variety of kicks, punches, and attacks with special weapons, by pressing combinations of buttons. Girls might have unique weapons and techniques which are associated with the club/subject they represent; for example, a \"tomboy\" athletic girl will attack with baseballs and other sports accessories, etc. Asuka 120% BURNING Fest. is the debut title of the franchise. It was initially released for the Fujitsu FM Towns, but a short time later it was ported to the Sharp X68000 with three versions of its soundtrack, as well as slightly updated graphics.": "",
  "As the half-human half-cyborg flying machine of the title, you are faced with 28 levels to clear of enemies. The gameplay is horizontally scrolling. Your unit is able to fly and then hold at a certain level in space. Defeated enemies often release gems, which can be collected towards power-ups. These include more powerful or multi-directional firing.": "",
  "One windy day, there was an explosion at a nuclear power station, causing heavy doses of radiation to be poured over many people. One of these people was a coal miner named Chelnov. When he survived the deadly accident, he was possessed with abnormal powers. Having realized this, he decided to act in the cause of justice. He is determined to escape the Eastern Bloc country he called home and run and jump across the world to finish in the US.": "",
  "In the distant future, human beings invented space warps, which allowed space travel to long distances. On board the space ship Agamemnon, they started an intergalactic journey. But an accident happened, and the humans were thrown into a parallel universe. Years have passed until they have adapted themselves to the different civilization. This parallel world, composed of three huge continents, is called Babel. Zell is a teenage boy, an orphan who lives in a post-apocalyptic world riding his bike, together with his friend Alice, who is like a big sister to him. One day they meet a mysterious girl named Sefia who seems to be on an important mission. Their struggle against evil begins at that moment... Babel is a Japanese-style RPG set in a futuristic world. Zell and his party travel around the world, visiting large cities and encountering many randomly appearing enemies. During the turn-based battles, each character can use a variety of attacks with different weapons, as well as special techniques. The combat window shows animated moves of the party members. Unlike in most role-playing games, characters do not receive experience points from defeating enemies; only money is gained. The characters level up according to the player's progress in the narrative.": "",
  "Match the dice. Dice pop up and you need to try to match them, but you can switch the die in your hands.": "",
  "In Balloon Fight you need to fly around with the aid of two balloons and try to pop your opponent's balloons before they pop yours. Landing on top of your opponents will cause their balloons to pop and they will use a parachute to fall to safety. You then have to destroy the fallen opponents by running into them before they can blow a new balloon and rejoin the battle. Should both of your balloons get popped, you will fall into the water below and lose a life. There is also a second game variation called \"balloon trip\" where you need to collect as many balloons as possible while avoiding the ocean floor and lightnings that form maze-like walls.": "",
  "Baraduke is an action shooter game where the player takes control of a spacewoman (player 1 is Kissy and player 2 is Takky) moving around in a low-gravity environment with the help of a jet pack, as they investigate the once-peaceful Planet Paccet, which has been taken over by aliens known as Octy. The game consists of eight stages, each stage is split up into six floors, with five regular floors and a boss floor. In the first four floors in each stage, the player must clear the floor of Octy, then they can exit the level through a chute located at the outside walls of the level. In the second last floor, there are no Octy but lots of capsules, which can hold one of four things: a yellow coin object which gives the player 100 points, a ray gun that increases gun level by one, a Paccet, which can earn you extra shield in the end-of-floor bonus games or the Bagan, which is a Pac-Man-like creature that will attack the player. This game is also known as Alien Sector.": "",
  "Jeu de combat se déroulant pendant les jeux olympiques 1992 à Barcelone": "",
  "Battle Chess is a quite typical chess game, but it comes with a twist: all pieces are represented by small, realistic figures that walk around on the chessboard, and when one piece takes another, they both take part in an animated battle. There is a different animation for each permutation, depending on which pieces are capturing or being captured. You can also play in 2D without animation. The game's opening library includes 30,000 different moves, ensuring a variety of games will unfold across the 10 skill levels. Multi-player support can be extended to modem and/or serial port play.": "",
  "Battle City is a refined version of Namco's old arcade game Tank Battalion. Destroy different enemy tanks, while trying to keep them away from your base. When you have destroyed 20 enemy tanks you advance to the next level with different layout. In each level there's some obstacles which you can use to your advantage. Obstacles include red bricks which you can shoot out of your way, silver bricks which are highly armored, water and ice. You start the game with a basic tank, which you can power up to better one little by little. The NES game includes a construction mode, so you can make your own levels when you have played through all the 35 original levels.": "",
  "Battle Game is a game on the marapets.com website where the player's Marapets creature can engage in battle to earn Baspinar Points, used as a currency. In order to play, an account needs to be registered at the site and a pet must be chosen. Next it needs to be trained to gain health, strength, speed, defense and magic. In order to be able to battle with a pet, players need to place trading cards in their deck. Players face the enemy on the trading card that is added to the deck. Battles are fought automatically based on the different statistics, somewhat similar to My Brute, but without the fight visualized. The Baspinar Points provided as a reward will match the health of the enemy that is fought.": "",
  "Also known as MechWarrior. You are Gideon Braver Vandenburg, heir to the planet. While you were away, unknown attackers destroyed your home, killed your entire family, and stole the Chalice that you need to win the throne. When you are implicated in your own family's death, you are forced into exile. With a help of an old friend who contributed an old Jenner and some credits, you must become a mercenary. Within five years, you must travel the Inner Sphere in search of clues to who set you up, and eventually avenge your family and recover the Chalice. You travels to planets, searching for \"fixers\" who will set up some contracts with the local authorities. The terms are a flat payment and some salvage payments. Some houses may be very stingy but provide important information. Others pay well but may not be as helpful. It is possible to buy, sell, and repair 'Mechs, hire or fire pilots, and decide which planet to move to while trying to maintain decent relationships with all five houses of the Inner Sphere and uncover clues about the next destination. Each mission in the game is randomly generated.": "",
  "Bell's Avenue is a collection of three very short games, all of which play like minimalist Japanese-style adventures and have stories that revolve around sex. The interaction follows the standard verb-command \"Look-Talk-Think\" template, without any sub-menus that would allow interaction with different objects. The Lyrical Story After Rain, the shortest of the three, is an episode from the life of a lonely teenage girl, who meets another young girl on the train and later has erotic fantasies involving her. Paragon Wing Bird is considerably longer and has a sci-fi theme, the protagonist being a male adventurer from the Earth, who has encountered a race of human-like creatures in deep space and is interested in their sexual traditions. Kara is the longest of the three, is set in a high school, and describes a group of young girls who are eager to have their first sexual experience. This game allows menu-based navigation through various locations in the school and non-linear story progression, which can change depending on the player's choice and order of locations to visit. Bell's Avenue also contains Under Deep, a very short futuristic story, basically consisting of two bizarre sex scenes and having no interaction at all, and Minimum Hour, which presents, in a comical way, a few ideas for sex-based arcade games, which are not playable.": "",
  "Bleed Out Sakuretsu has a powerup system reminiscent of Gradius. As you continue scoring points, you can purchase a shot upgrade, a barrier, or other, even more powerful powerups. The opposition is a variety of ships, small shots, and guided missiles.": "",
  "Blodia is a puzzle game with similarities to sliding block puzzles. Each level is composed of a number of tiles and every one has a part of a pipe (straight or angular) on it - except one which is just a black hole. In one tile a red ball starts rolling and all tiles it rolls through become blank. The goal of each level is to let the ball roll through all pipe parts without meeting the hole or a blank tile. To ensure this, the player can move the parts while using the hole as buffer. So, as example, if the player clicks on a tile which is a few tiles away from the hole, all tiles between the clicked tile and the hole are moved by one towards the hole. Then the hole is at the place where the player clicked on. At the start of a puzzle, rolling out of the level boundaries is also deadly, but after a certain amount of tiles are cleared the ball comes out at the opposite side of the playfield. The game features all levels of the TurboGrafx-16 version plus additional ones.": "",
  "Blue Knights (Blue Wings Part 2) is a vertical scrolling shoot em up developed by O/S Software for the sharp x68000 in 1993. The game consist of 5 levels with increasing difficulty. In this sci-fi game you have 3 different types of spaceships to choose from, each one having its own capabilities (speed, firepower etc). There are several power ups to collect which will increase your firepower, ranging from multi-directional shots to powerful laser beams and homing missiles. Blue Knights is yet another budget shoot 'em up tribute, in which you shoot multiple enemies while dodging their fire which is incredibly difficult most of the times.": "",
  "Mobo and Robo Bonanza are enjoying their favorite television show when the picture crackles and a shadowy figure of a mysterious stranger appears on screen. This figure asks them to collect certain items that he has placed inside various buildings to test his security force. If they return the items successfully, Mobo and Robo will be rewarded. The two of them state that they will get the job done in just three minutes. However, little do they know that each building is packed with security guards who will raise the alarm if they are caught red-handed. Fortunately both Mobo and Robo are equipped with bullets that can knock the guards unconscious for a few seconds. An $100 reward will be given out if Mobo and Robo are apprehended. As either Mobo or Robo, you must collect all the treasures before leaving the ten buildings and shoot any security guards that get in your way. Remember that you are under a time limit. An in-game map will help you locate the treasures. There is a bonus stage after three buildings, where the object is to collect the gold bars in a limited amount of time without one of the three spotlights shining on you. If it is possible, hide behind open doors. If you manage to get all the gold bars, 10,000 points is added to your score. There are three of these bonus stages, but each of them varies.": "",
  "Bosconian is a space shooter. It's your job to destroy enormous enemy battle stations scattered throughout the galaxy, which is filled with meteors and space mines. You can either do this by destroying one by one their outer structures or with a single shot in their core. They are heavily defended however by guns, fighters and (in later levels) missiles. Destroying all battle stations, with the help of your radar, will bring you to the next level. Often the enemy will try to destroy you by launching attack waves. Keep your eyes out for the enemy spy ship, if it escapes your fire, you are really in for it.": "",
  "The island of Radja was a peaceful place, ruled by a benevolent king. But one day, monsters have invaded the island. Both the prince and the princess of the kingdom were abducted. The king summons Shami, who, despite being a cute young girl, is the most powerful warrior of the kingdom. Shami has first to rescue the king's children, and eventually to find out the source of the demonic invasion. Gameplay-wise, Branmarker mainly follows early Dragon Quest template: it is a top-down RPG with random turn-based battles viewed from first-person perspective. The player controls Shami and another character who joins the party. Shami can cast a variety of offensive and healing spells, the majority of which must be found in treasure chests located in the dungeons rather than bought or learned. The main gameplay takes part in hostile areas, which are reasonably complex and maze-like, taking a while to explore. Leveling up is automatic, and combat mechanics are basic Japanese RPG fare. What makes it different are the various anime-style cutscenes scattered through the game, most of which feature nudity and erotic content.": "",
  "Break Down is a variant of the \"concentration\" memory game. The player is presented with a screen covered by face-down cards, and has to click on them one at a time, matching two identically-looking ones to make them disappear. Each wrong move removes a life from the player character. Cards that can be matched are portraits of young women; other cards include Life Up (grants an additional life), Death (instant loss of life), and Shuffle (re-arranges all the cards). The player must complete a set amount of correct match-ups in a round before running out of lives. Doing that leads to a picture of a young girl who gradually undresses as the player wins more rounds. It is possible to play against four girls to view different pictures, but the gameplay and the cards are identical for all of them.": "",
  "Breed is set in the year 2610. After a long and costly war with the robotic alien race nick-named the Breed, your warship returns to Earth only to discover that the entire war only was a diversion. Now Earth has fallen into the hands of the Breed and only you and your men can stop it... To do this you must take control of a squad of soldiers and win 18 different missions. They take place on tropical islands, Antarctica and even outer space. There is a variety of vehicles including tanks, buggies and fighter jets, ensuring that a range of control skills must be mastered. Everything you see can be blown up, with weapons including plasma guns, assault rifles and grenades.": "",
  "Bretonne Lais is a role-playing game loosely based on the Breton lays, medieval European (mostly French or English) romance tales drawing inspiration from chivalric stories and Celtic mythology and folklore. Rather than presenting a single story the game is divided into several unrelated scenarios, each involving Celtic legends and mostly focusing on supernatural motives (floating islands, unicorns, popular Celtic figures such as Queen Mab, etc.). The player can choose between several male and female characters with pre-defined anime-style portraits, allocating points into their primary parameters. Much of the game is played solo, though a few NPCs can join the main character one at a time. Despite its Japanese origins the game takes cues from Western RPG design philosophy, offering non-linear exploration of vast interconnected areas. Battles take place on the same screen as exploration and involve turn-based navigation and simple attack commands.": "",
  "Bubble Bobble is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave... Bubble Bobble is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.": "",
  "The hero of this game is an ordinary high school student (the player has to name him by himself). He is mostly interested in pretty girls, in particular the lovely Mika, with whom he is even ready to discuss books just to get her attention. One day, a beautiful woman appears in front of him out of nowhere. She says that she is Venus, the goddess of love. She comes from a world called Cal, the eternal world populated by lovely girls. She tells the hero that soon he will be needed in that world... and disappears. Was that a dream? Or will our hero really travel to the magical world of Cal and encounter dangers he hasn't even imagined before? Cal is a visual novel, with the sole interaction consisting of choosing sentences to say and sometimes actions to do from a context-specific menu at the bottom of the screen. Usually only one such selection triggers the next event; some choices lead to Game Over. The game contains erotic pictures with nudity and sexual situations.": "",
  "The story of this game is simple. The protagonist is a lonely guy who constantly dreams about having a girlfriend but doesn't do anything to actually get one. One night, a fairy with bunny ears named Ariko appears in front of him and says she will fulfill one wish for him. Afterwards she simply guesses what the guy needs most badly: a girlfriend. So she gives him a magic book, which will give him information about five beautiful girls living somewhere in the city. With this book the hero's chances are increased. The quest for love begins! The game plays like a standard Japanese adventure (still shots of locations, menu-based interface), with some additions. The hero can buy items and give them to girls as presents to impress them. The conversations with the girls involve going through several topics to find out what the girl likes. Once a girl seems to be \"ready\", it's possible to directly use commands such as \"kiss the girl\", \"touch the girl\" (with body parts specified), and even \"***** the girl\", which speaks for itself.": "",
  "The fifth Can Can Bunny game is also the first direct sequel within the series. The story is very similar to the one of the previous game: once again, the hero is lonely and is anxious to get a girlfriend, or, to be more precise, to have sex with different girls. And once again, the benevolent and gorgeous goddess Swatty is here to provide assistance, together with her side-kicks, the Seven Lucky Gods from the Japanese mythology. Even though the story is pretty much the same as in the previous game, the gameplay underwent significant enhancements. The interface is still traditional Japanese-style menu commands, but there are many more locations now, many of which can be freely accessed by clicking on them while on the main map. Once the player has reached the point where he can begin the physical seduction of the girl, the interface switches to point-and-click, with context-sensitive cursor for touching, kissing, etc. It is necessary to try different actions more than once to understand what the girl considers pleasant and what not, otherwise the girl might get angry and the game will be over. There are many more girls to seduce here than in the previous game, ranging from a school girl to a Catholic nun (seriously). There are also various extras (as the title implies), including an extensive album that arranges various pictures of the girls so that they tell her story, and an additional collection of stories, in which the hero can learn more about the girls he had met in the main game, and even interact with them again.": "",
  "In this game, the player assumes the role of an ordinary Japanese young man who works in a restaurant. One day he comes home and finds seven strange creatures sitting at his table and discussing something you have no clue about. But before you decide to throw the uninvited guests out of your apartment, a beautiful green-haired woman appears. This is the goddess Swatty, and she has power over the Seven Lucky Gods, which the mysterious seven creatures turn out to be. Swatty feels pity for the lonely hero, and decides to help him to find a girlfriend. Can Can Bunny Premier is the fourth installment in the Can Can Bunny series. Compared to its predecessors, it is the most pure Japanese-style adventure, without the strategy parts of the previous game. The player chooses menu commands (\"Look\", \"Talk\", etc., as well as context-sensitive commands and dialogue choices) in order to advance the game. At several points it is possible to branch the story line, which mostly influences the amount of success the hero has had with a girl.": "",
  "The second game in the Can Can Bunny series follows the story of a young Japanese boy named Takeshi. One fine night he looks out of the window and notices a sexy girl undressing in the opposite building. \"Oh, if only I could get her\", sighs Takeshi. Immediately, the kind bunny-eared fairy Ariko from the Magic Land appears and... grants Takeshi's wish! He now possesses a Magic Book that will teach him ho to conquer the hearts of pretty girls... and not just the hearts! Compared to the first game, Can Can Bunny Superior plays more like a stereotypical Japanese adventure, without the complications of buying items and alike, and with simpler menu commands like \"Look\", \"Move\", etc. In the beginning of the game, the player can choose between different initial statistics for Takeshi, which will influence the difficulty of conquering a particular girl. The game itself is divided into three separate scenarios, with up to four different girls in each (the scenarios begin in a shopping mall, aboard a plane, and in an amusement park), but the goal is always the same: talk to the girl in such a way that she will become yours.": "",
  "In 2051, in the city of Neo Tokyo, there was a popular rock band called Caroll. One day, the lead singer of the group, Leyla, was kidnapped by an organization called Metal Cats. The police of Neo Tokyo tried in vain to rescue the singer: the kidnappers, utilizing a mysterious energy called ESP, were beyond their reach. The desperate police finally asked a young man named Akira to save Leyla - using his own ESP powers. Caroll uses a side-scrolling perspective for navigation, but it is not an action game, not even an action RPG; the core gameplay is that of a Japanese turn-based RPG. Enemies appear randomly, their portraits superimposed on whatever location Akira is currently in (effectively changing the perspective to first-person); a menu with battle commands pops up. Akira gathers money from battles (which can be spent in shops or hotels), as well as experience points needed to level up. Akira can execute various ESP techniques (such as healing); each time a technique is cast, an amount of his ESP points is depleted.": "",
  "Build a series of castles to gain dominion over all the land. You'll have to make decisions that will affect your favor with the Church, nobles, and peasants. Keep a strong military and a large workforce while watching the level of your treasury.": "",
  "Cat's Part 1 casts the player in the role of an unnamed protagonist, presumably young, male, and very interested in the members of the opposite sex. One fine day he meets Stella, the queen of magic world. She tells him that her duty is to sustain the balance between worlds, but now her power is fading, which means a new queen has to arrive and take her place. To find this queen, Stella tells her companion Pixie to open the gates to seven different worlds: three modern-day ones, three futuristic ones, and one \"past\", and sends the hero on the quest for balance in the world... and numerous sexually fulfilling encounters with pretty girls from different dimensions. The game plays like a traditional Japanese adventure, with still pictures, plenty of text, and the necessity to go through all the commands several times to trigger new ones and eventually advance the story. However, unlike most games of this kind, Cat's Part 1 features a point-and-click interface along with the usual menu-based choices. Thus, the player can interact with various body parts of the girls, as well as some objects, by simply clicking on them. The player must complete Modern World 1 first, but after that is free to travel to the six remaining worlds in any order. It is also possible to teleport out of the world at any time using a magic stone.": "",
  "One day, a lone traveler came from the desert to a small camp. There, he sat down, weary from his long travel, enjoying a short rest. \"Have you heard of the Tower of Ouroboros\"? - asked him a bearded old man who was sitting nearby. - \"A legend says that if fulfills all your wishes. Many heroes tried their luck there. None has returned. Dangers lure at every corner in the tower, deadly enchantresses who will bring demise on anyone daring to set his foot there\". Without answering, the young traveler left the camp, and soon he was standing at the tower gate... Chaos Angels is a semi-erotic RPG similar to the first two Dragon Knight games. The entire game is viewed from first-person perspective. You gradually explore the huge 3D dungeon, the Tower of Ouroboros, fighting enemies and gaining experience points. The combat engine differs from most other Japanese-style RPGs: for attacking, instead of choosing an appropriate command from a menu, you hit the enemy by moving towards it. You can also sometimes see the enemies approaching and turn to different sides during battle. Like in Dragon Knight games, the enemies are mostly sexy girls wearing revealing clothes or simply naked.": "",
  "As an undercover agent of Chase Headquarters, your job is to patrol the streets and track down five criminals. You are given a mission briefing before you start which gives information on the suspect and what car they drive. Then you drive across the city without crashing into other cars, and catch up with the criminal's car. To arrest the suspects, you must keep bumping into their car until it is no longer functional. And you have to do this under a strict time limit. You can't afford to crash into cars or buildings or you waste time getting on the road again. However, once you've caught up with your suspect, you are given more time. Your car is also equipped with turbo boosts, which you can use to gain extra speed if you are way behind the criminal. Each arrest is based on a \"suspicion\".": "",
  "Cho Ren Sha 68k (Ultra Fire 68K) is a top-down vertically scrolling DÅ jinshi shoot 'em up. It was originally released in 1995 and later it was ported to PC. It is a shooter with classic mechanics modeled after the Toaplan games. There is one ship and it can be moved around freely. Shooting needs to be done manually as there is no autofire. Points are earned by killing enemies, completing levels and collecting items. It has seven stages with up to eight loops and a final boss after a few. Red power-up ships that are shot leave behind one of three items: a weapon upgrade, a bomb that clears the entire screen and a one-hit shield that also explodes when it disappears.": "",
  "You play a small character who floats about on a cloud and shoots small balls of energy at bad guys who fly at you from the left and right of the screen. You can collect powerups and visit shops to upgrade your offensive and defensive powers. There are a number of different stages which are punctated by a mini-boss half way through and a big (literally) boss at the end. This is one of the only games ever made which features flying noodle bowls and bears with guns. This game is also known as Cloud Master": "",
  "You are Sid Chip and you are trapped in The Great Allonso's nightmare consisting of 20 circus rings full of platforms and creatures with the screen scrolling left or right when you move. You have to find the exit of each ring by using the various platforms and avoid the creatures that inhabit the nightmare. The various platforms consist of different shapes as well as disappearing and appearing ones and the exit has to be found before your energy counts down to zero. If you touch any creature then you lose one of five lives and the current ring has to be restarted. There is an extra life awarded for every five rings completed and the joystick is used to control Sid.": "",
  "In City Connection you must drive along on roads, painting them a different color. When you have all the roads painted, you go on to the next level. Cops are frequent along the roads, but oil cans will quickly stop them in their tracks. Avoid cats and spikes, and collect balloons to warp to further levels.": "",
  "Columns is loosely derived from Tetris, as it involves arranging falling blocks in such a way as to clear them. However, in columns they are groups of 3 same-size but varying color blocks, which must be arranged into sequences of 3 or more, either horizontally, vertically or diagonally. Sequences of 4 or 5 count for double or triple points, and diagonal sequences score the most. The real trick is to set up 'combos' - where one line causes other blocks to drop so as to create other lines. As well as the normal game mode, there is also a 'flash' mode, in which the aim is simply to remove a particular block from the base of the pre-formed pile of bricks. The difficulty of this can be determined by increasing the number of complete rows which are already in place.": "",
  "A brave young warrior (whom the player names in the beginning of the game) has had his share of epic battles, so he decides to relax in him own house in the imperial capital city, dedicating himself to his other interests (read: women). However, one day a pretty young lady (whom the player also has to name) storms into his house, saying she has a message from the Emperor himself. A princess is missing, so our two heroes have to find her. And the hero also has to face some of his old foes... Continental is a traditional Japanese RPG with a small party of heroes, top-down navigation, random turn-based battles viewed from first-person perspective, and no distinguishing characteristics but one: erotic scenes. There aren't as many here as in, for example, Lightning Warrior Raidy games, and they mostly occur in city brothels or after boss battles. The enemies, however, do look like pretty (although demonic) girls. Instead of undressing, though (as they do in Raidy games), they just shrink in size upon defeat.": "",
  "Cosmo Gang: The Puzzle is a follow-up, but otherwise unrelated, to Cosmo Gang: The Video. Gameplay is similar to Tetris, as falling pieces made of blocks fall from the top of the screen. The goal is to make left-to-right lines with the blocks, clearing them. Occasionally, a piece will contain either Cosmo Gangers or attack blocks. Cosmo Gangers block your way and make it impossible to progress. Attack blocks, however, get rid of Cosmo Gangers, earning many points. The game is over if the blocks hit the top of the screen, and to make it more difficult, the closer they are to the top, the faster they drop.": "",
  "Fantastic Night Dreams: Cotton is a 2D side-scrolling shooter in which the player takes the role of the young witch Cotton, who sets out on her magical broom on a quest to get her favorite candy. Fortunately for us her obsession gets her in the way of several world-threatening terrors that she must destroy in standard shooter fare. The game features an experience-earning system in which the more enemies the player kills the more he can upgrade his weapon by collecting power crystals. Players can also charge their weapon for special attacks and enlist the aid of Silk, Cotton's magical fairy friend who can form up in different \"option\" configurations.": "",
  "Crescent is divided into four unrelated stories, which can be accessed directly from the main menu in any order. The first story is set in a fantasy scenario with a protagonist who tries to defeat a sexy female magician and her equally sexy female demonic minions; the second story involves a visit to a female detective, which evolves into an erotic encounter and unexpected violence; the third story is a visit to girls' locker room in a school; finally, the fourth story features an Asian-style mansion inhabited by pretty young women. All the four stories are heavy on explicit sexual content and are almost entirely dedicated to erotic scenes. The gameplay is confined to repeatedly selecting context-specific options (sometimes up to six) until the next event is triggered. Story progression is linear, but a few times wrong choices can lead to Game Over.": "",
  "The protagonist of Crescent Moon Girl is a cat who accidentally walks into a tent and triggers the appearance of a mysterious female magician and her strange assistant. They turn the cat into a young man and tell him that in order to become a cat again he has to find three particularly well-endowed young girls and bring them to the tent. The ex-feline begins his quest in a town containing many female inhabitants, with only a select few answering to the requirements that are his ticket back to his native shape. The gameplay follows a Japanese template, with menu-based navigation and interaction with the environment. Each location offers various verb commands (Look, Talk, Enter, Touch, etc.), most of which can (and should) be combined with objects or persons in a sub-menu. Conversation topics can be selected as well; in particular, it is possible to ask most female characters about their age, hobbies, three sizes, etc. The game has scenes with explicit nudity.": "",
  "Fly your ship across a landscape whilst avoiding the many treacherous cubes which lie in your path. Swoop through narrow gaps using the built-in accelerometer . FEATURES: - Simple controls using the accelerometer - Various levels of difficulty - Downloadable level packs - create your own designs and share them with friends. NOTE - To listen to your own music you need to turn off both sounds and music from within the game first.": "",
  "Cyber-core is a vertically scrolling shooter in which the player fights insects. The basic idea is traditional: shooting everything before they can shoot/touch the player: after three hits the chitin armor breaks and a life is lost. Besides flying enemies which are disposed of with the standard gun, the player also has to deal with enemies on the ground which need to be hit with one of the unlimited bomb. The player has the choice between four insect forms which are changed by collecting the associated extra symbols. Collecting more of the same symbol upgrades the insect, but this also rises the difficulty level. Other extras include smart bombs, extra lives, armor refreshments or a protection shield. The game features the possibility to turn on rapid fire or to slow down the speed as well as big boss enemies at the end and within the levels.": "",
  "It gives plenty of simple gameplay, with powerups that can make your rod-shaped spaceship more powerful, with the company of a scantly clothed girl appearing every now and then if you succeed thru the levels.": "",
  "D.P.S is a collection of three short scenarios, which are unrelated to each other story-wise and can be played separately. Those scenarios are presented as cartridges played on a fictional console named Dream Program System. Each scenario allows the player to choose between two different protagonists, or two different personalities for the protagonist. All of the scenarios feature nudity and/or sexual situations.": "",
  "Three years have passed since Arthur defeated the Demon King Astaroth and rescued his beloved Princess Prin-Prin. A new villain, the Great Demon King Lucifer has become the new leader of Ghoul Realm. While returning from a journey, Arthur sees the Princess' castle and her village under attack by Lucifer's forces. While rushing towards her beloved knight, the Princess is struck by one of Lucifer's laser beams. Now, Arthur must venture back to the Lucifer's palace and destroy the demon in order to rescue the Princess' soul and bring her back to life! And it won't matter whether he fights in his shining armor or in his underwear alone...the bravest Knight in the land isn't going to be stopped by some monsters! Although the game starts with graveyard and marsh territory familiar from the first game, later levels are set in a tower, a mass of skeletons, and a castle.": "",
  "Daisenryaku II: Campaign Version is a turn-based war strategy game that relies on the gameplay template introduced in Daisenryaku II: up to four players engage in battles against each other or computer AI, represented by differently colored armies (blue, red, green, and yellow); the belligerents produce units and vehicles and navigate them on a hex-based grid, trying to occupy the enemy's major cities and harbors. The game includes a main campaign with introduction and background information about the fictional countries involved in the conflict. In addition, at least a dozen playable maps are included, some representing real geographical areas. The MSX and PC Engine (TurboGrafx) CD versions feature enhanced graphics, full-screen battle sequences with backgrounds, and many additional maps.": "",
  "A young man gets involved in a struggle between the gods Martis and Mira. Serving Martis, he believes that in order to restore the balance he has to unseal this deity, the protector of all women. Fourteen chosen girls must fight alongside the hero, venturing into the depth of a sacred mountain and helping him to defeat countless monsters who live there. Made by the creators of Rance series, Dalk is an erotic RPG. However, it is more heavy on strategy element than Rance games. Town navigation is done from first-person view. You choose your party members among the 14 available girls, and take them to fight in the mountain. Once you enter the dungeon, the game switches to top-down view, and you advance in turn-based mode, assigning commands to your party and waiting for the enemy party to move. You can attack when an enemy is in range, or cast spells with your magic users.": "",
  "Darius was Taito's effort to compete in the arcades against the likes of R-Type and Gradius. Technically impressive, it featured three screens depicting the largest playfield seen in a game so far (the same system was employed for Ninja Warriors), with the player sitting atop a big set of loudspeakers. Visually and audibly, it was a league above Irem's and Konami's offerings. When Taito (and others) ported the game to home machines, they were forced to shrink the playfield to fit in one single screen, and re-dubbed it Darius Plus. The plot of Darius involves the two heroes Proco Jr. and Tiat Young fighting the menaces posed by galactic fish and other sea animals again their homeworld. What sets Darius apart from other shoot'em-ups of the time is its way of letting the player choose his path with a certain amount of freedom. At the end of each area (level), you are able to choose between one of two worlds which the area branches into. This renders a higher replay value, since there are many paths to reach the end of the game by. Apart from this, the gameplay is on the simplistic side, both due to unimaginative attack waves and little interaction with the surroundings, but mainly due to the very basic powerup system, which is nowhere near the complexity of the aforementioned R-Type's and Gradius'.": "",
  "The Black Knight has brought misery to the land, and the end way to end this is to enter his haunted house to slay him. You are the brave adventurer taking on this quest through 14 increasingly-tough zones. The bulk of the game is side-viewed, involving single screens to pass through, which incorporate ropes, cages and trapdoor. There are enemies walking, flying and hovering through this, and many of them respawn. Unusually your weapon to take them on (rocks) can be thrown through 360 degrees, which aims to make the gameplay more realistic and methodical. The screens were linked by hub screens, which the player passes through simply by clicking on a door.": "",
  "Darwin?s Dilemma is a puzzle game, the goal is to push matching creatures together. Make enough matches, and the creatures evolve in to new ones, which must then be further matched to evolve into a more advanced creature up the evolutionary chain, and so on. There's also a limited amount of swaps which allow you to change creature place with Darwin.": "",
  "The land of Mezron is in turmoil. The evil wizard Azazael has been resurrected and is now on the search for five gems which will grant him ultimate Power. You are a adventurer that has the task to stop the wizard. On your way you'll face medusas, evil cults of priestesses and many undead foes. The game features a 3D view of the world, which can be explored step by step like in many RPGs of the time, e.g. Bard's Tale or Dungeon Master.": "",
  "In this game, you are the destroyer and must drop depth charges onto passing submarines. You time your drops so as they sink, they will hit the sub. You score more points for hitting deeper subs. On the bottom of the screen is your viewport. Think of this as your radar. You can see the subs approaching before they come into the game area. At the top of the screen are two scores. The top score is your actual score. The bottom score is the bonus score you will collect if you hit the bonus sub, when it appears. You cannot collect your bonus unless and until you manage to hit the bonus sub, which is a different color and makes a different sound than the other subs. At the bottom of the screen, below the viewport, are two numbers. The left number is how many subs can escape you before the game is over. This number starts at ten and counts down for each sub that escapes. When this number reaches zero, the game is over. The bonus sub doesn't increase this escape count. The number on the right is the sub speed. This number starts at zero and increases up to nine, depending on your score or bonus score. The amount of bonus you get per sub varies depending on how many subs you have hit before hitting the bonus sub. Once you hit the bonus sub, the bonus per sub amount resets to the lowest amount and begins climbing again. In the Arcade version the submarines will fire torpedoes at your ship, while in the Atari 2600 version they do not.": "",
  "There's plenty of reflection in this game, in both senses of the word. That's because this strategic puzzler involves using mirrors to direct a beam of light across a succession of 60 screens. Each mirror has 16 different angles it can be set at, each of which will send the beam around the screen in different ways. Before the exit is activated, all the mines on a screen must be cleared by running the beam over them. There are other devices built into the levels, including teleports and random angle-changers, as well as hazards to avoid (they cause the beam to overheat) and droids which go around moving the mirrors' directions.": "",
  "You have been selected as one of the few lucky male pupils to go to the famous Cybernetic Hi-School. But before you can enroll, you must undergo three tests executed by fellow female pupils. Each test has three rounds of 25 questions, of which 20 must be correctly answered. As you finish a round, your examinator takes off some clothes, until they are entirely naked. The questions are decidedly nerdy, pertaining mainly to science fiction, comics, animation and toys, as well as the technology used in such genres and media.": "",
  "Another top-down shooter in the TwinBee series of \"Cute'em ups\". Detana!! Introduces for the first time the characters behind the TwinBee & WinBee fighters, Pastel and Light, and chronicles their journey to save Princess Melora from an evil force that threatens the world. Nevertheless its still all about shooting the heck out of surreal and cute enemies through 6 stages of vertically-scrolling action. Power-ups and upgrades can be gained by shooting the colored bells that some enemies leave behind until they stay the color you want them to, with many combinations possible. A new charge-shot feature has been added to your basic arsenal, and the game features single and 2-player cooperative game play.": "",
  "Legend says that there exists an ancient world known as Vereator, powered by the mysterious energy Verbias. The treasure hunter Connor Macguire and his assistant Rania venture into deep space in search of riches. Their ship is trapped in Vereator, and the two begin to explore the strange world, hoping to find the source of Verbias. On the way they will have to defeat robotic legions of a malevolent professor who pursues his own agenda. Die Bahnwelt is a top-down shooter. The player navigates Connor through maze-like environments, shooting at frequently respawning enemies in eight directions. A second character participates in battles on his side, controlled by computer AI; general tactics can be assigned to that character by the player through conversation. Each of the two characters can hold up to four weapons, using various types of energy ammo that can be found in treasure chests or dropped by enemies. Weapons can be switched at any time. There are no healing items, but both characters continuously regenerate their health. It is possible to save the game at any time.": "",
  "Dig Dug is a 1-2 player arcade game in which you have to use your shovel to dig your way through the earth. Stopping you from doing this are two monsters, called Pooka and Fygar, who will continually chase you around. The only weapon that you carry is an air pump, which you can use to inflate the monsters to the point where they explode. (if you start to inflate them but stop doing so, the monsters will get turned back to their normal selves). Furthermore, rocks are scattered throughout the earth, and you can use these rocks to squash them. If the monsters do not find you for several seconds, they will eventually get turned into ghosts, which are able to walk through the earth. They are invincible and cannot be killed. From time to time, vegetables will appear in the center, and you can get these for points.": "",
  "Dig Dug 1 and 2 were released as a bundle for the Sharp X68000 in 1995. Dig Dug 1 was manufactured by Namco in 1982 and Dig Dug 2 in 1985. The sequel was not as successful as its predecessor Dig Dug. The player has a pump each time. To inflate a monster you have to press the fire button 4x. Inflated monsters - if they are not inflated long enough - become normal monsters again and can attack the player again.": "",
  "Dino Land is a dinosaur themed pinball machine. You basically have to shoot your pinball at dinosaur targets. As you go along, you get more points after you have hit all the dinosaur targets in the board. There are 4 pinball boards, one on ground with ground creatures, an air one that represents flying creatures, a sea level which has sea creatures, and a boss level where you are trying to save your girlfriend from the boss.": "",
  "DOME is based on Shizuko Natsuki's novel of the same name. The original work as well as the game's plot focus on the construction of a nuclear shelter called \"The Dome\", capable of protecting humans from an impending atomic war. The player takes the role of an employee in an advertisement company, whose job is to raise people's awareness of the shelter's importance, and donate money to the project. The game opens System Sacom's Novel Ware series, demonstrating its concept. Though its basic gameplay is that of a puzzle-less Japanese-style adventure, the game has extended dialogue and text descriptions that either do not contain any interaction or occasionally prompt the player to make a choice. Despite this visual novel-like feature, the game still retains considerable portions of interactivity, with verb-object commands, reviewing information concerning recent events and characters in the game, and even the possibility to take and examine objects. The game's graphics consist of digitized photos of people and objects, and are rather sparse.": "",
  "This edition of DOR is a collection of three short stories, taken from two different DOR games: From the first DOR: Kanako's Depression: You are visited by a beautiful vampire who wants only one thing: To suck your blood. In return, she will be your servant for one day. The Telephone Scandal: You call into a telephone dating service. You can choose to talk to a young schoolgirl or an older working woman. From DOR 2: Armored Fighter Gyleban: Parody of good-versus-evil anime, such as Macross. Each story can be finished in approximately ten minutes. DOR features depictions of sex, and is for adults only.": "",
  "The sequel to DOR is structured exactly the same way as the first game: play any of the three unrelated scenarios, accessible directly from the main menu. The first scenario takes the player into France of 16th century, during a witch hunt. The playable character is a young girl who is falsely accused of being a witch and is taken into a dungeon, interrogated, and tortured. The second scenario follows the adventures of a young boy who has lost his way in a forest. Suddenly he meets a cute little female elf, who is willing to help him find the right way, in exchange for some other favors... The third scenario is named \"Armored Fighter Gyleban\" and is in a way a parody on sci-fi anime movies. The player controls a commander of a unit of female fighters with enhanced abilities, that must stop an evil organization from conquering our world. Like in the first DOR, the gameplay is limited to selecting actions/answers from a menu at each screen. Correctly chosen actions will advance the story, while wrong ones will lead to a premature ending.": "",
  "DOR Special Edition '93 is neither a compilation, re-release, nor a remake; it is an independent entry in the DOR series. Typically for the series, the game consists of three completely unrelated scenarios. They can be accessed from the initial game \"hub\", which is viewed from a top-down perspective and allows the player to control the sexy demon Akuma, the series' mascot, as she runs around a small town, visiting houses that lead to the game's features: playing the scenarios, viewing the pictures, getting acquainted with the developers, etc. The first scenario tells the story of a Japanese businessman and treasure hunter named Hiroshi, who has organized a perilous expedition into South American jungle, hoping to find the legendary spring of eternal youth. However, on the way to their discovery, the group has to confront monsters and other dangerous specimens of the jungle... The second scenario is set in a pseudo Middle-Eastern environment, and focuses on a man named Farouk, who was cursed by an evil magician. In order to remove the curse, Farouk travels through a vast desert to a nearby town, hoping to find people who would help him in his predicament. The third scenario directly continues one of the scenarios of DOR 2. It is sub-titled Armored Fighter Gyleban, and is the second part of the story. The protagonist is the leader of a squad of female fighters, who confront an organization under the leadership of the evil Grauber. Grauber's warrior, a young girl named Meiya, switches sides and decides to help the heroes in their battle. The gameplay is mostly similar to other DOR games - picking choices from a menu until the next scene is triggered. However, during certain scenes the interface switches to point-and-click, with selectable icons (\"tongue\" and \"hand\"), which pretty much explains the direction those \"certain scenes\" lead into.": "",
  "DOR Special Edition: Sakigake is the fourth entry in the DOR series. Unlike all the previous games, it contains only one scenario instead of the usual three. The scenario follows the story of Kensuke Funaki, a young boy who attends a prestigious private high school, where the students specialize in sports as well as various theatrical activities. The biggest event of the school is an all-female wrestling competition. Kensuke finds himself in a promising situation: in order to secure his support, the young and pretty competitors are willing to go far - very, very far... The gameplay in DOR Special Edition: Sakigake is the same as in the previous entries. At every screen, the player reads a bulk of text (descriptions and dialogue), after which a menu with a few (usually three) selectable actions/responses pops out. It is often needed to go through the choices several times before the next event is triggered, and the player is taken to another screen.": "",
  "Double Eagle is a golf simulation game. The tagline \"2way Golf Simulation\" refers to the two game modes to choose from. GOLFLIFE is career simulation. The player's character starts out 20 years and 1 month old and with 100 yen, and has 30 in-game years to win tournaments, move up the Japan and World rankings and advance up the classes (Amateur class, Professional Class B, Professional Class A and Professional Class S) before retiring at age 50. There are four stats: physical, mental, technic (technique) and fatigue that affect your performance. To start out you need buy or rent a club at the golf shop. Extra money can be earned by doing one of the three side jobs. At first there is light work, hard labour and caddie, moving up the classes lesson, TV booking and commercial become available. Each job pays differently as well as affect your stats, most notably increases fatigue. To get rid of fatigue you can rest at home, hot springs or hospital. There's also three training options: gym increases the physical stat, image increase mental stat and course allows to practice on courses, thus gain technic. Each action advance the time by one month. The game features 40 tournaments, either two-day or three-day with all participants playing 18 holes each day. Some tournaments also require a qualifying round for the main competition. On the course you're joined by 2 or 3 AI players. PLAYGOLF allows 1-4 players (human and/or AI) to play an 18 hole round. There are 12 courses to select from as well as different seasons/conditions - spring, summer, autumn, winter and snow. When on the golf course the action is viewed from a top-down perspective, players can choose the club they want to use, direction of the shot, how the golf ball curves (fade/draw) as well as adjust the shot power and accuracy by stopping a moving bar at the right time. Wind direction and power must also be considered as you play your shot.": "",
  "Dans ce jeu, le joueur joue le rôle de Mickey qui vient de déménager sur New York. Maintenant, il veut devenir un dur et rejoindre un gang de rue. Mais ils lui ont lancé un défi: couper une boucle de cheveux de leur chef. Mickey se déplace de gauche à droite en se défendant contre des hordes ennemies. Le jeu se joue comme un Beat them all standard dans lequel Mickey combat au corps-à-corps contre les ennemis. Cependant, Il peut également utiliser d'autres objets comme des fusils, des bâtons de baseball ou des gaz lacrymogènes. Être frappé par des adversaires, qui se cachent parfois dans des poubelles, drainent l'énergie de Mickey et puis l'une de ses vies.": "",
  "In Dr. Stop! you control Takumi, who works in a hospital and whose mind is mostly occupied with female patients, most of whom are young and pretty. One day, during a visit to a patient, an explosion occurs. Who caused it - one of the patients or an outsider, or maybe a staff member? It's up to you to investigate, and win the affection of your lovely patients. Dr. Stop! is a traditional first-person anime-style Japanese adventure. You interact with the game by selecting commands from a menu. In some of the rooms you'll see backgrounds, while others have text-only descriptions. You move around the hospital by selecting destinations from a menu while looking at the hospital map.": "",
  "Dracula Hakushaku is FairyTale's own take on Bram's Stoker famous story. The powerful vampire Count Dracula returns to his castle, only to find dead bodies of the women he had relationships with in the past. The Count begins to re-create his adventures, remembering all the women he had seduced, killed, or turned into vampires. But his antagonist, the vampire hunter Abraham van Helsing, is retracing his steps as well... Dracula Hakushaku is an adventure game that mostly follows the Japanese template (minimal interaction, no puzzles). Less typically for Japanese adventures, the Count can pick up and carry items, which must be used at certain points in the game. The interaction is performed by selecting icons that represent verb commands, as well as directional arrows for navigation between screens. During the numerous sex scenes, additional icons appear, some of them being of a sexual nature, but also a \"bite\" icon, which allows the protagonist to use his best-known vampire ability on the victim.": "",
  "Dragon is an action-puzzle game with an Oriental theme, based on the Ballistic concept. A dragon, made of a chain of colored marbles is moving along a curved track towards a temple. You must shoot colored marbles from your cannon at the bottom of the screen (which can move left and right) to prevent the dragon from reaching the temple (if it does, you lose a life); when you shoot a marble into the dragon, it becomes a part of it (replacing the marble that was there before), and if at least three same-colored marbles are next to each other, they disappear, possibly also causing neighboring marble groups to vanish. As you keep destroying the marbles, a bar at the top of the screen slowly fills itself; once it is filled completely, the level is finished. Power-ups, coins and bonuses fall occasionally from the destroyed marbles. Coins give you additional lives when you collect enough. Power-ups have a lot of various effects - slowing the dragon down, allowing you to shoot a destructive lightning beam, and more. Bonuses simply give you score. By achieving some difficult feats (like completing several levels without losing a life) you earn trophies which you can later view in your trophy room.": "",
  "Originating in the arcades, Dragon Buster is an action platform game composed out of several large levels, each one containing various stages: a cave, a tower, a castle, etc. The player's goal in every level is to reach the final stage where the protagonist faces the level boss. There are often several ways to reach the final stages, and not all stages are necessary to visit. Equipped with a sword, the player character moves through platform stages, clearing them of diverse monsters, collecting power-ups and trying to stay in good health until the level boss, since it is impossible to heal between the stages. The hero's life meter (called \"vitality\" in the game) is the first introduction of such a feature to action games.": "",
  "Dragon City is a monster breeding game originally dedicated as a Facebook application game. The player takes on the role of a dragon breeder. Monsters in this game wholly consists of dragons, which are hatched from eggs or breed between two different types of dragons. Dragons produce gold in their habitats, which will allow the player to purchase adjacent land, build more habitats to acquire more dragons, purchase food, and various other activities, all of which for the single purpose to help the dragons under the player's care grow larger and stronger. Speeding up activities or purchasing special items/dragons will require gems, which may be purchased with real currency. Dragons may also optionally be sent for player vs. player (PvP) combat. Hatching Dragons There are 12 different dragon elements, all of which may require specified habitats for them to live in. A flame dragon for example will require a flame habitat before an egg or dragon is purchased. Initially, the player acquires dragons by purchasing an egg and hatching it at the hatchery. Depending on the type of egg, hatching will require a specified of time for incubation. The hatched dragon may then be placed at a specified habitat, where the dragon will steadily produce gold for the player. Dragons will grow bigger when given a specified amount of food. The larger the dragon, the more gold it produces for the player. Breeding Dragons When the player possesses two types of dragons, preferably from two different elements, the player may opt to send those two dragons to the breeding mountain to mate. Dragons of two different elements will produce a new type of dragon. Mating will require an amount of time. This new dragon may be sent to live in either habitat of its parents. For example, a flame dragon and an terra dragon will produce a volcano dragon. This volcano dragon may live in either a flame or terra habitat.": "",
  "Dragon Eyes is a \"space opera\" kind of story, focusing on a young girl named Ines, who lives on the planet Miu of the Phi Sun. She grew up together with a space agent named Klind, to whom she refers as \"brother\". One day, her superior from the planet Garudoria informs her that Klind has disappeared during one of his missions and might be in danger. Ines travels to Garudoria to find additional information, and soon becomes involved in a vast space conflict... Dragon Eyes plays like a traditional Japanese adventure, with commands such as Examine, Talk, Think, and Move appearing on every screen. Choosing one of those commands usually leads into a sub-menu of objects. There is also limited usage of items, which is sometimes required in order to advance in the game. There are a few scenes with graphical nudity, but no explicit sex scenes.": "",
  "Strawberry Fields was once a peaceful land. Ruled by the lovely queen Luna and populated only by women, the country knew no trouble. The Goddess Tower protected the inhabitants of Strawberry Fields. But recently, something happened in the tower. It is said that a dragon descended upon it, spawning an army of dragon knights who were threatening the peaceful land. The queen Luna summons you, a wandering adventurer, to descend into the depth of the Goddess Tower and to purge the evil from the land. Dragon Knight marked the beginning of Elf's erotic RPG series. The game is played entirely from a first-person perspective. In the town, you move around by selecting destinations from a menu. Once you enter the tower, you navigate your character through 3D mazes, fighting random enemies in turn-based combat. Enemies in the game are scantily clad, attractive young women; there are also several scenes with explicit nudity.": "",
  "Dragon Knight 4 is a sequel to Knights of Xentar. Years have passed after Takeru (a.k.a. Desmond, the hero of the previous Dragon Knight games) defeated the ultimate evil. He married his sweetheart Luna, and they had a son named Kakeru. This fifteen-year-old boy has one weakness: he likes naked female elves. But soon he learns that the evil wizard Lushifon wants to turn all people into stones and control the whole world while nobody is able to stop him. Together with the mysterious swordsman Eto and many other heroes, Kakeru must perform his ultimate quest and defeat Lushifon and his minions. In this tactical role-playing game the player controls nine units in battles, assigned according to the class of the character who leads the unit. The opponents also form similar groups, and are also divided into classes. Each class has its own range, strengths, and weaknesses. There are many characters the players can recruit to the party, and they belong to different classes (barbarians, archers, magicians, etc.). The adult content (scenes which include nudity) has been removed from the console releases. The PlayStation version has updated graphics and CG animations.": "",
  "The mobile version of the original Dragon Quest role-playing game is the first standalone release of the game since the original version. It is based around the graphical style of the Super Famicom version of Dragon Quest III and features a more streamlined menu interface and changes to experience points and gold received from monsters to make the game more accessible.": "",
  "Dragon Slayer is commonly considered one of the progenitors of the action RPG genre. The premise is similar to Roguelikes: the player takes control of a knight who must fight his way through large overhead maze-like dungeons. Unlike roguelikes, the combat in the game is fully action-oriented: the player must approach the monster and \"bump\" into it in order to inflict damage, at the same time trying to avoid its blows. Combat takes place on the same screen as the exploration; monsters will also sometimes pursue the knight if he attempts to escape. Also contrary to roguelikes, none of the locations or items in the game is randomized. The player can collect power stones and coins during the journey; the power stones increase the hero's strength, while the coins increase his hit points (health). Defeating enemies also yields experience points, which determine the amount of maximum HP the hero is able to receive. The knight is able to cast magic spells, though they are mostly used outside of combat, for example breaking walls, teleporting, or creating a map of the area.": "",
  "Princess Alicia of the kingdom of Mitgult is kidnapped by the monster Zawell. It's now up to the heroic warrior Amul to transform himself into a blue dragon and go and rescue the princess. Dragon Spirit is a vertically scrolling shoot-em-up which consists of nine stages. Players fly around and destroy everything in their path. Much like in Xevious, action takes place on two planes, both in the sky (where the dragon is flying) and on the ground. The dragon has two different kind of attacks: fire that shoots up the screen, and fire that drops to hit a place on the ground in front of the dragon. Enemies exist both in the air and on the ground, and some can fly up from the ground to the sky. Players can pick up power-ups, or upgrades, that will help them in their fight. Upgrades can include extra heads on the dragon, health, faster shots, and more. At the end of each stage is a boss that needs to be defeated. Having good upgrades that are not lost from being hit before reaching the bosses will help. The NES version is unique in that it presents a somewhat altered story and an additional gameplay mode. Technically, it is a sort of sequel, with \"A New Legend\" being its subtitle. In this version, Zawell is already defeated and King Amul and his now wife Queen Alicia, have two children named Iris (a princess) and Lace (a prince). A new evil named Galda has decided to attack the Earth. Galda also has taken Iris captive and now Lace must go rescue her. The NES version also adds a new initial stage. If the player survives it, the game continues in a \"Blue Dragon\" game much like the original arcade game. If the player fails to clear this initial stage in one life, an easy mode called \"Gold Dragon\" begins, skipping about half the game's stages, giving the player extra hit points, and features a different ending. Also of note, the TurboGrafx-16 version's seventh and eighth stage are different than the other versions. The underwater and dark themed stages were changed to castle interior themed stages.": "",
  "Dragon Wars takes place in the magical land of Dilmun, an island of salvation perverted into a world of horror by Namtar (as you might expect - the bad guy). The player starts with a party of four in the city of Purgatory, equipped with nothing more than.. well - nothing. Worst of all your magic users won't help you out, either, because magic has been banned (to correct this unpleasing situation is one of your main objectives). Other main targets are surviving, getting out of Purgatory and toppling Namtar (maybe getting some decent clothing, one or two shiny swords and the like on your way out). Gameplay instantly reminds of the Bard's Tale series. Step-by-step first person 3D, opponents materialize out of the air. The combat system is turn based. Unlike its (spiritual?) predecessors the game features a full-blown skill system, auto-mapping and many places to actually use all these abilities. Reasonable distribution of your skill points is rather critical.": "",
  "The prophecy has been fulfilled. The world shall be ruled by the dragons. On an island far away, their lords prepare for the conquest of the lands. There is only one hope for mankind. The emperor sends out four heroes -- warriors and magicians -- to solve the puzzle of tears and prevent the invasion of the Drakkhen. Drakkhen is a role-playing game with a visual presentation that combines 3D landscapes and 2D interiors. The player's party will travel overland on a flat terrain made up of vectors, on which 2D objects are zoomed (The same type of engine was later used in Eternam). The player will encounter monsters and fight them in real-time combat, and discover the palaces of the dragon lords. Indoors, the player has to find a way through the maze of chambers, solving puzzles and defeating the minions of the Drakkhen. Party members are depicted in four status windows on the left side of the screen, thus allowing to see their current status and equipment at once.": "",
  "In the middle of the 22th century World War III began between the Allied Power and the Pact Power. Atomic weaponry was long abandoned, and neither side could gain the upper hand. However, twenty years later the Pact Power has constructed a deadly battle satellite on the Moon, aptly named \"Disastrous Disaster\". Fearing that the war will be lost if the satellite attacks their bases on the Earth, the Allied sends an Illieus fighter craft, navigated by the young pilot Unebi Kagurazaka, to counter the threat. D-Return is a horizontally scrolling shoot-em-up. The player controls an aircraft, moving in four directions, avoiding enemy fire and destroying enemies with primary weapon (vulcan gun or laser) and missiles, of which there is a limited supply. The player-controlled plane has a health bar which can be restored by flying over specific power-ups. The player can choose between four difficulty levels, amount of hit points and missiles, as well as the speed of the game. Stages usually end in boss battle.": "",
  "Dungeon Master is a role-playing game where the player selects four adventurers and descend into the depths of the dungeon. The gameplay is reminiscent of the 3D dungeon crawl type of role-playing games popularized by Wizardry and The Bard's Tale. However, unlike these games, Dungeon Master features real-time combat, which requires the player to click on the opponent in order to execute an attack. Another notable aspect of the game is its growth system: instead of gathering experience points and leveling up, characters improve by repeatedly using the same action. Spellcasting involves selecting and combining symbols, which can be arranged as rune sequences. The game also allows the player to directly interact with objects in the game world through a point-and-click interface.": "",
  "Duke, armed with a machine gun and cybernetic arm, walks sideways through enemy bases, shooting snipers and engaging in hand-to-hand combat with bosses and the occasional knife-wielding soldier. An over-the-shoulder perspective is used throughout.": "",
  "In Emerald Dragon the player takes control of Atrushan, a blue dragon who lives in the Dragon World. One day, he and his friends discover a ship wreck near a mountain. After examining the wreck, the dragons find a human child - a little girl. The wise White Dragon, the leader of the dragons, tells them that her name is Tamryn and that she will play an important role in their lives. The girl doesn't remember anything, and grows up together with the dragons. But when she turns fifteen, she decides to go back to her homeland - the Human World. Soon after Tamryn has left, Atrushan realizes he can't bear the separation, and asks the White Dragon to allow him to go and find Tamryn in the Human World. But a mysterious evil curse has been placed on the dragons - they can't appear among the humans in their true form. Atrushan agrees to become a human and goes to the Human World - to find Tamryn, and also a way to remove the curse... The game has many traditional Japanese-style RPG gameplay elements: Atrushan and his party travel around the game world, visit towns, descend into dungeons, and level up in an automatic fashion. One of the game's distinguishing features is its battle system. Characters are able to freely move over the battle field; the range of their movement depends on their agility rating. Only Atrushan can be given precise instruction during each turn. The player is able to position the characters strategically near or far away from the enemy, attack from different sides, and assign general strategies to the party members. Another notable feature of the game is the absence of a \"world map\": the game's locations are seamlessly connected with each other. The PC Engine (TurboGrafx) CD version of Emerald Dragon contains additional dialogue, scenes, and voice acting.": "",
  "Fail Land is a magical realm of island floating high in the sky. One day, Princess Rilule finds out that an evil witch has sent her minions to imprison female magicians. As a result, monsters are roaming the countryside and have even invaded cities. The princess, skilled in the arts of magic, leaves the palace, determined to destroy the monsters, free her fellow magicians, and put an end to evil in Fail Land. Étoile Princesse is an overhead action game. It can be considered a shooter, since all the controllable characters can only fight with projectile attacks: Rilule shoots stars that damage enemies in a straight line, her first companion has an area wind attack, etc. As the player completes stages more magicians join the party. Up to three characters can be taken to explore hostile areas; however, the player can only select one character at a time, switching between them at will. Every character also possesses a unique powerful magic attack, which depletes MP and is activated by pressing down the action key and charging power. Health- and magic-restoring items can be found in chests or dropped by enemies. Stage progression is for the most part linear; each stage ends with a boss battle.": "",
  "Race by yourself against the clock or compete with other motocross riders on 5 tracks full of long straights, large jumps and obstacles to win the Excitebike championship. Create your own tracks by placing jumps and obstacles of all different sizes and shapes on the track and choosing how many laps each race will have, then race against the clock or other riders to see how your track fares in competition.": "",
  "The second in the series features campaigns in Lybia, the Persian Gulf, The Middle East and Vietnam, making for a total of 250,000 miles of potential action and danger. Primary and secondary aerial and ground-based targets must be destroyed on each of these. You are armed with a cannon, AMRAAM long-range air-to-air missile, Sidewinder short-range air-to-air missile, and the Maverick air-to-ground missile. 11 camera angles including internal and external views of the plane exist. To help new players there is a training mode, with options to disable crashes and automate take-off and landing. Enemy AI is responsive, but a targeting computer helps you take them out before they can do it to you. The game incorporates two \"Director's Modes\" which cuts away from your cockpit to highlight special events occurring elsewhere in the game world, like enemy base launching fighters, SAM sites launching SAMs, and your missiles hitting the target.": "",
  "The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! Fantasy Zone is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world. At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.": "",
  "The streets of Metro City are filled with criminals who are part of a gang called Mad Gear. Former wrestler and newly elected mayor Mike Haggar tries to do something about it, much to the displeasure of the Mad Gear Gang who kidnap his daughter Jessica. Only three people are brave enough to venture into the crime-infested streets and try to bring Jessica back. Final Fight is a 2D side-scrolling fighting game. Taking on the role of either Cody, Guy, or the mayor Mike Haggar himself, you must advance through six areas of the city clearing out the gang infestation. You will have to cope with a variety of thugs, ranging from firebomb-throwing maniacs to behemoth wrestlers. To defeat these thugs, you have an arsenal of punches, kicks, throws, and jump kicks at your disposal. The SNES version has seen some significant changes.": "",
  "Fire! is a firefighting simulation in which the player is in control of a helicopter and must douse the fire that takes a grip on one (or more if you don't watch out) flats. The player can move the helicopter in four directions and also hover in place. Using the water cannon the player can douse flames. Water is in limited supply, but one of the rooftops allows the player to replenish the water supply. The fire, like a real fire, will slowly and erratically expand in all directions. The player wins when the fire is put out, but loses if unsuccessful within three minutes.": "",
  "Sequel to Flappy. Just like in the original, you control Flappy, a yellow mole who must complete each level by pushing a blue stone from its starting place to the blue tile destination. The big difference is that this Sharp X68000 exclusive sequel is viewed from an isometric perspective. There's also new enemies, obstacles and items.": "",
  "Flip-Flop is a strategical puzzle game with the aim to open all windows on the building's wall at each of three stages. The wall contains 4x4 windows, and by turns the player clicks on one window to toggle its state. But the other windows in the same row and in the same column will be toggled, too. After passing the first stage, the player is lifted up to the second stage, where one of the windows toggles its state randomly. Third stage is almost like the second, but more difficult to pass. The player has 99 turns on each stage before the game's session is over. More points are given to the player with a lesser quantity of turns made to open all windows on the stage. Although this puzzle has an analytical solution, the trick of the game is introduced on its 2nd and 3rd stages, and player should be quick to provide this solution taking into account a slightly dynamical influence on the given puzzle. The global goal is to beat the highest score.": "",
  "Flipull is an arcade-logic game, where the main goal is to destroy as many blocks as possible on the playing field. The more blocks you destroy, the more points you build up. Going from level to level, the number of blocks increases as does the difficulty. The game contains more than 100 levels and also offers the ability to add new levels. The game supports multiple skins.": "",
  "Fly! is a flight simulator released for both the Macintosh and Windows platforms, and simulates civilian airplanes and helicopters. New plane models and custom scenery can be added. Multiplayer is supported through the internet, with text chat or voice chat. Five main scenery areas are supplied: Chicago, New York, San Francisco, Los Angeles and Dallas/Fort Worth. Flight briefing and flight planning are included and can use many of the supplied navaids. The following planes are included: Cessna 172, Piper Malibu, Piper Navajo Chieftain, Beech King Air B200, Hawker 800XP. Aircraft systems are accurately simulated, and require proper sequence of actions to, for instance start the engine. The 288 page manual covers all aspects of flying such as aerodynamic forces, navigation, weather and aircraft control.": "",
  "In the near future, mankind has abandoned the Earth, which has become unsuitable for human life. Human beings began to build space stations. Thanks to the new space suits invented by professor Toujou, which allowed unrestricted presence in the space, humans could eventually spread over the galaxy. The planet Charon became the new center of science and culture. But soon, a mysterious organization known as \"Giras\" appeared on the stage. Their troops attempted to invade Charon, and at the same time professor Toujou has gone missing. His niece Lisa was determined to continue his research and discover his whereabouts; but was herself kidnapped by the Giras. Two of her friends, Kyouhei and Kamui, decided to lead an assault on a Giras stronghold and rescue Lisa... Foxy 2 is a turn-based strategy game. The gameplay is similar to its predecessor; it is confined to large-scale strategic battles, in which the player commands different types of units, in an attempt to reach the enemy base, protect his own, and exterminate all enemy units. Like in the first game, the units have distinct strengths and weaknesses, as well as attack range. The game includes even more various types of units, including the traditional infantry, rocket launchers (mobile and stationary), different kinds of tanks, planes, helicopters, etc. The plot is more elaborate than in the first game, and the cut-scenes between the battles typically include more plot-related information. Scenes with nudity and mild sexual content are kept intact.": "",
  "Frisky Tom is a 1981 arcade game by Nichibutsu. The object of the game is to provide enough water for a shower by crawling along a network of plumbing pipes and picking up/replacing loose pieces. Various types of mice are the game's antagonists, trying to thwart Tom in different ways: knocking pipes loose to disrupt the water flow, jumping down to fall on him, or setting a bomb to blow up the entire plumbing arrangement": "",
  "In this game, the player controls a frog who must eat bugs to survive. This can be done by using the 1-9 keys to control the frog's mouth and width of his tongue. The farther he has to reach, the more energy he uses. There are ten skill levels. The higher the skill level, the faster the bugs will travel and the more energy the frog consumes. The game is over when the frog loses all its energy.": "",
  "Your task in this arcade game is to guide a frog across a treacherous road and river, and to safety at the top of the screen. Both these sections are fraught with a variety of hazards, each of which will kill the frog and cost you a life if contact is made. The road is full of cars and trucks, at variable speeds. The river water itself is fatal, as are the snakes which hover within on later levels. Frogger must use the arrangement of logs, turtles (which are only there for a short time) and alligators (but stay away from their faces), and then jump into one of the open home-cells, ideally one containing a fly for extra points. Once all holes have been filled, you move onto the next, harder, level.": "",
  "Fruits Fields is a single-player, shareware, Soko-Ban type of puzzle game from Hong-Kong. The shareware game has fifty levels, the full game has one hundred levels. In each level the object is to guide Nic around the game area and collect fruit. In the way are crates which will only move in the direction of the arrow they carry. Some crates can be destroyed by pushing them into a wall or, in certain circumstances, another crate. Points are scored for each piece of fruit collected and for each crate destroyed but one point is deducted for each square moved. The level is complete when the last piece of fruit has been collected, not when all crates have been destroyed. For each level completed the player exposes a segment of a pretty picture. The game has a high score table, music, sound effects and can be played by the mouse or the keyboard in a window or full-screen": "",
  "Future technology paved way to the creation of hovercrafts, which began to gradually replace motorized vehicles. Ben is the leader of the Polecats, one of the toughest biker gangs on the road. One day he drives over and damages a hovercraft limousine which belongs to Malcolm Corley, owner of Corley Motors, the last domestic motorcycle manufacturer. Later, Ben is having a bit of good clean fun at the Kick Stand Bar when Corley drops by for a bit of reminiscing. This leads to a meeting with Corley Motors' vice president Adrian Ripburger, who has his own sinister plans concerning the company, the Polecats, and the future of motorized vehicles. Ben refuses to co-operate and must now face the consequences and do everything in his power to bring Ripburger to justice. Full Throttle is a third-person puzzle-solving adventure game. The graphics are cartoon-style, similarly to LucasArts' previous adventure games Day of the Tentacle and Sam & Max Hit The Road. The game features a revamped interface: instead of choosing a command verb or an action icon and then interacting with an object, the player can now simply point at it, and the available action icons will appear automatically. These include the standard \"use\", \"examine\", and \"speak\" actions, but also a separate foot icon for kicking. As in other LucasArts adventure games, the player can select different responses during most conversations. However, compared to their previous works in the genre, Full Throttle is more streamlined, with less exploration, dialogue options or puzzles. Cinematic cartoon-style cutscenes are used to advance the plot. The game also includes a few simple action driving sequences, during which the player is required to navigate a motorcycle and fight hostile bikers by punching and kicking them, as well as using crude weapons such as chains and planks.": "",
  "The game is based on the anime Nadia: The Secret of Blue Water. It features 50 different battle fields in which the players employ one character per turn. The characters can either move, use a skill/item, or enter a RPG-like round based close combat. For beating an enemy the characters will gain experience points and level up which will be kept for further sessions.": "",
  "Future Wars is a sci-fi turn-based strategy game in the vein of classical TBS games like Battle Isle or Advance Wars. The rock-paper-scissors principle makes Future Wars easy to learn but difficult to master. The campaign mode, which offers roughly 8-10 hours game play, is about the young cadet Max and his buddy Bud going to the academy of the global forces, the most important military unit, where ambitious, young recruits trained to reach the top of the Armed Global Forces. Beside a campaign mode the game offers several other game modes like Hotseat, \"Play per mail\" (sounds funny but it works), AI vs. AI etc. Also the game offers a wide range of customizing possibilities: an easy-to-use editor to create own maps, the possibility to create your own textures and/or balancing sheets till even the possibility to integrate your own AI.": "",
  "t is 100 years into the future. Nuclear weapons, missiles and other weapons of mass destruction are banned, but a new piece of military hardware is about to shape the future. The N.A.P. (New Age Power-Suit), is the newest weapon, a mechanical tank, able to destroy anything in its path. You play as a soldier of the El Shiria Military's \"Undead\" unit named Howie Bowie (no joke) as you are about to go on a urgent mission to destroy your enemies, The Bloody Axis, before they can strike at your nation. Using the newest N.A.P., the K-19 Phantom, you are dispatched to destroy them before it is too late. You can equip your N.A.P. with up to 14 different weapons including flamethrowers and landmines and has seven stages, fighting your way on the streets, through deserts and up to the Axis HQ and finally a mech-to-mech battle with the enemy.": "",
  "Gakuen Bomber begins with a dream; more precisely, the dream the protagonist of the game, an ordinary Japanese high-school boy, is having: that of his sister having passionate sex with... a female classmate. Since afterwards he begins to dream about spaceships and aliens, he assumes that dream had nothing to do with reality... or has it? Exploring the high school he attends, the hero makes some startling and not very unpleasant discoveries... Gakuen Bomber is set almost entirely in the high-school, and mostly consists of the protagonist wandering around and triggering event scenes (often of sexual nature) that advance the story. However, the player is given considerable freedom to explore the rather large school compounds, interacting with many on-screen objects in point-and-click fashion.": "",
  "In the future, the Earth became so over-populated that the governments started building space stations, to which people would be later transferred. Those space stations were protected by giant robots powered by special crystals. Academy Z specialized in educating its students in everything concerning those robots. Two teams - Red and White - are competing to gather crystals for the robots, and learning to navigate them to become future protectors of humanity. Aya is a young girl who just joined the Red Team - first training in safe areas, but hoping to become a real robot pilot later. The game plays mostly like a first-person dungeon crawler. The player navigates Aya's robot through pseudo-3D maze-like environments. Hostile robots appear randomly. The combat system is rather simple, with standard Japanese RPG-style options (\"Attack\", \"Flee\", \"Use Item\", etc.). Experience points are gained to level up and become stronger. There are also adventure elements in the game: at any time, pressing the Space key will bring a typical Japanese-style adventure interaction menu with options such as \"Look\", \"Talk\", etc. Movement outside of hostile areas is also done through menu commands.": "",
  "Galaga is a vertical arcade shooter from Namco. You control a space fighter at the bottom of the screen, scrolling left and right in order to avoid oncoming bombs and kamikaze attacks from alien invaders--and to fire your own missiles to fight back! There are an infinite number of stages to progress through. Every third level is a \"challenge stage\" in which you have a free chance to shoot as many aliens as possible and rack up bonus points. Certain aliens have tractor beams they can use to capture one of your ships. If that wasn't your last \"life,\" you can try to shoot that alien down and recapture your ship, giving you two ships at once and doubling your firepower. A summary screen appears when the game is over, giving you both your final score and you final \"hit ratio\"--the number of missiles fired, enemies destroyed, and the percentage of targets hit.": "",
  "Galaga '88 takes the basic gameplay of Galaga and adds higher-quality graphics, triple ship abilities, parsec progression, power-ups, asteroids, bosses and other enhancements. Periodically the player encounters Challenging Stages, which are set to music and feature \"dancing\" enemies. The objective is to shoot all 40 enemies before they disappear, for a bonus of at least 10,000 points. There are a total of 29 stages. The player can begin with one ship with two in reserve or start right out with a dual ship (but only one in reserve). Some enemies now have the ability to combine into a much larger single enemy that takes multiple shots to destroy. Others explode in a brilliant shower of fireworks when destroyed, and occasionally these enemies drop a small formation of much smaller enemies that \"wiggle\" their way down the screen. Some enemies arrive in spherical \"eggs\" and emit a loud, high-pitched noise when hit. These creatures take multiple hits to destroy in flight (just one hit in formation), and their main attack pattern is to move about halfway down the screen, stop, fire multiple shots at once, and then fly straight down off the bottom of the screen. Another type of enemy takes at least five hits to destroy, and it grows larger with each consecutive hit, making it both a larger target and allowing it to act as a shield to other enemies. Later in the game some enemies are equipped with armor that renders them invincible while in formation. When one of these enemies starts its dive, it will flip over and expose its vulnerable side, then flip over again and become invincible while it moves back up the screen, then flip one more time and finish its dive. While vulnerable, this enemy can be destroyed in one hit, scoring bonus points. In addition, many different kinds of obstacles appear throughout the game, including blue crystals, boulders and green blobs.": "",
  "Galaxian is a shoot 'em up in which the player is at the bottom of the screen, with an arrangement of aliens at the top. The player moves left and right to aim at an alien, then shoots a bullet up the screen, and the alien it hits is killed. The aliens are classed as Drones, Emissaries, Hornets and Commanders, with those higher up the screen scoring more points when destroyed. At set intervals an enemy will move down the screen towards you, escorting a bomber, which is a moment of high danger. Clear a wave and another is generated.": "",
  "The aim of this arcade game is to launch missiles from the bottom of the screen at enemy spacecraft located at the top. To get there, the missile must pass through a asteroid belt flying across the screen and avoid the shots being fired down from the spacecraft. It is the players job to control the missile. Once launched it can be moved left and right and can be sped up by using the boost to speed it's way out of trouble. Points scored depend on the location of the hit on the enemy spacecraft. The speed at which enemy spacecraft move increases as the number of them decreases. Once all spacecraft have been destroyed, another wave starts, the speed decreases again and the process repeats. A life is lost when a missile is hit by a shot or collides with an asteroid. On the SNES, three game modes are available, B&W and Color recreate the graphics and behaviour of the original arcade game in black & white and color respectively whilst Neo mode updates the game with improved graphics and slightly different behaviour. There's also a turn-based two player mode. Other options include changing the number of lives available at the start of a game and the number of points needed for an extra ship.": "",
  "Southtown City plays host to the King of Fighters Tournament. Andy & Terry Bogard take part in the tournament cause winning the tournament is the only way they can defeat Geese Howard. Geese Howard controls Southtown City and killed their father several years ago. Also taking part is Joe Higashi, a Japanese kickboxer. Select either Joe, Andy or Terry, visit several locations in Southtown City and win that tournament!": "",
  "Again, the Lone Wolves return! Geese Howard may have been defeated, but that doesn't mean all is peaceful. A new opponent, Wolfgang Krauser, has come forth to begin a new Fatal Fury tournament. The Lone Wolves return, with new faces amongst them. Only one can be declared the winner though. The player can choose one from eight playable characters: Terry Bogard, Andy Bogard, Joe Higashi, Big Bear, Jubei Yamada, Cheng Sinzan, Kim Kaphwan, and Mai Shiranui. The game has four bosses. The combat system is more complex than in the first game, supporting four keys to attack. The two-plane (foreground and background) battle system has been retained, but now, the player can move freely to the adjacent plane - just by pressing the Light Punch and Light Kick buttons simultaneously. The main principle remains the same - beat your opponent in a duel with fists and kicks.": "",
  "Garou Densetsu Special/Fatal Fury Special is an improved version of SNK's 2D one-on-one fighter Garou Densetsu 2/Fatal Fury 2. The objective is to win the tournament by defeating all other fighters including end boss Wolfgang Krauser. Garou Densetsu Special/Fatal Fury Special features a fairly large selection of fighter including being able to select the four bosses of Fatal Fury 2 immediately as well as 3 old characters from Fatal Fury.": "",
  "Gaudi: Barcelona no Kaze was the first adventure developed by Wolf Team. It takes place in the Spanish city of Barcelona, which just the year before the release of the game was chosen for the celebration of the 25th Olympic Games. This is important to mention as the game takes place in the summer of 1992, the time at which the Olympic Games were being held in Barcelona. The game is a classic graphical adventure with static images and text, with the occasional appearance of small menus that ask you which action you want to execute next. Hard-boiled stories will be touching each corner of the most emblematic spaces of the city (which had been digitalized for the occasion, with special mention to the monuments designed by Spanish architect Antoni Gaudí). The stories have all the elements of a thriller, including terrorist attacks, characters with a dark past, romance, crime, etc. all this accompanied by elegant Latin jazz throughout the adventure.": "",
  "Humans and aliens are living in harmony in the future, until a tabloid journalist stirs up hatred towards aliens. They respond by invading the planet, and it's down to the protagonist to clear up a situation scarily similar to reality in this arcade conversion. Gemini Wing is a vertically-scrolling shoot 'em up, which is distinguished by its unusual power-up system. Instead of gaining occasional tokens which lead to lasting weaponry improvements, occasional flurries of tokens are released to ensure a quick burst of improved fire. The organic backgrounds are detailed, and have many sections which fire at the player character.": "",
  "The game takes place in a cyberpunk future where humanity is suffering through harsh living conditions, an economical crisis between countries and countless wars. In the year 2121 A.D. in an effort to save the planet scientists across the globe spend 50 years to develop an A.I called \"Magnetic Extrasensory perception System Incorruptible A-class\" codnamed \"MESIA\" to maintain order in the world. However a terrorist organization known as the \"OROPPAS\" corrupted MESIA and gave it self-awareness, where it decided to wipe out the human race. In 2230 as a last resort to stop MESIA from destroying the last remnants of humanity an experimental battle armor was created called \"Randy\". Ken Ryugasaki was chosen to for this mission, to wear the battle armor and save humanity.": "",
  "The world is still recovering from war. The mega-corporation CONEX has been spearheading the rebuilding process, but their true intentions are far from altruistic. By gobbling up their competition, and with the help of new weapons technology, CONEX is on the cusp of controlling the world. Only a hero from the last war can defy them and stop their plans of conquest. Genocide 2 is a modified version of the PC release. The player takes control of a ten meter tall robotic ninja: the Tracer. Its only form of attack is a sword, but it can hold several extra weapons, and always has access to the Betty. The Betty can be fired in eight directions, returns to the Tracer after being fired, and can block enemy bullets. The objective of each stage is to reach the end, and some stages require you to destroy targets along the way. Any items picked up by the player, or damage done to the Tracer, carries over between stages, and each stage records your fastest time for beating them. Aside from the visual downgrade, Genocide 2 also lost many minor enemy types and one mid-boss in the transition to the Super Famicom. The first stage was removed, and the first two levels of stage 2 were reversed. The Betty now can only be used for a limited time, and must recharge when its time has run out.": "",
  "Geograph Seal is a mecha-themed first-person 3D shooter. The plot is rather simple and involves an unnamed enemy constructing weapon plants on the planet WS090. A lone mecha pilot is sent there to execute the project \"Geograph Seal\" and encounters fierce opposition from local robots. The gameplay system is similar to that of the better-known Jumping Flash by the same developer, although it involves more shooting and less platforming action. The protagonist can utilize various firearms such as vulcan gun, lasers, missiles, etc. The health of the player-controlled mecha is measured by its shield condition; the shield can be repaired with items dropped by enemies. Story progression is mission-based.": "",
  "In Glacier you control a heavily armed sports-car (the \"iceblade\"), and your goal is to drive down the so-called \"Mountain of Death\" without wrecking your car. Opponents will make this goal pretty hard (they use rockets, machine guns, mines, and more), but there are also the chasing Mounties (driving in 4WD-Grummers), helicopters, impressive cliffs and even enormous rocks that can fall on your roof.": "",
  "The people of Gradius are in trouble. The ameoboid Bacterions have launched an all out attack against the planet, and it's up to you to fly into battle and save them. Along the way you'll be able to power up your ship with hyper speed, force fields, lasers, missiles, double beam cannons and more to help you battle. Gradius is a side-scrolling shooter. Shooting certain enemies will leave a power up pod behind which can be collected to add more power to your ship. Each level features a wide variety of enemies trying to stop you, with a large boss at the end. Gameplay is for one player or two players alternating.": "",
  "Le joueur se retrouve une nouvelle fois dans le rôle du pilote du vaisseau Vic Viper pour affronter l'empire bactérion, nouvellement dirigé par Gofer. Gradius II possède un gameplay similaire au jeu original, mais incorporant des améliorations tirés du spin-off Salamander comme les deux configurations d'armes sélectionnables. C'est aussi le premier jeu de la série à intégrer le \"boss rush\", un niveau comprenant uniquement les confrontations contre les boss.": "",
  "In the year 2016, war has broken out in Africa over mining rights to rare metal. Machines of destruction called \"maneuver cepters\" have been developed as the primary force, but recently a mysterious maneuver cepter has appeared in the northern territories. It is known by the name of \"Granada\", and has been destroying the weapons of the factions on both sides. You are this machine's pilot, a man by the name of Leon Todo. Granada is a free-roaming scrolling shooter. You control the titular maneuver cepter Granada as you make your way through each stage, destroying the enemy's weapons. You have a map that tells you where your targets are on the stage, and once all the targets have been destroyed a large boss enemy appears which must also be destroyed. You are equipped with a standard cannon, as well as a more powerful blaster that will actually push your machine backwards with the recoil. There are also assist pickups which will follow you and reflect any shots you fire at it toward the nearest enemies. Of special note is the fixed cannon feature. Using this feature, you can hold the direction of fire while still moving freely. The game has nine stages and three difficulty levels.": "",
  "Grobda is a spin-off from Xevious, as the titular tank was originally an enemy in that game. The player takes control of the eponymous Grobda tank in an arena filled with numerous indestructible obstacles and several enemy tanks. When an enemy tank is killed, it will cause an explosion which can destroy other tanks as well as the player if positioned in the blast radius at the time. There is a shield that offers temporary protection from enemy fire, but constant firing from enemies will make it disappear. The game consists of 99 rounds, called \"battlings\".": "",
  "Guardian is an arcade action game for one or two players. In an intergalactic war, an enemy ship called Dromeda is attacking your home planets and you need to defend them! The planets are located at either the top or the bottom of the screen, and are defended by a shield. Dromeda is in the middle of the screen, and will be launching explosive devices at the planets. You control a spaceship which is the last hope to save the planets. Unfortunately, your ships lasers are unable to reach Dromeda, so you you must shoot the explosives as they come in. If you miss any explosives, they will destroy part of the shield. If a large enough hole forms, an explosive could get through and destroy an entire planet. The game ends when all of your planets have been destroyed.": "",
  "Guardians is a puzzle game in which the player takes the role of a guardian who is tasked with containing the so-called \"Triffids\", balls of pure energy. The game is played in a top-down perspective and has two plains. The upper plane is where the player is active and has to build walls. There are blocks of five colours which can be freely moved over the area. If multiple blocks of the same colour come together, they fuse together and are no longer mobile; those fusions are called \"cohesions\". Some blocks can be combined with any colour. The player can both use blocks which are already on the plain and place bricks from a reservoir. One to three triffids are on the lower plain and bounce up and down. If they bounce up and there is block hindering them, they are lost and give minus points. Regular blocks are destroyed when they come into contact; only cohesions are a permanent wall. The goal of each level is get a certain amount of points (by creating cohesions) within a time limit.": "",
  "Gunship depicts one of the Western world's finest attack helicopters: The AH-64A Apache. This simulation recreates the weapons, flight systems, and performance of the real machine. The player controls an arsenal that includes laser-guided Hellfire missiles, a 30mm cannon controlled by helmet gunsights, clusters of bombardment rockets--even air-to-air missiles for duels with enemy helicopters. The game starts with flight training at a base in the United States. Tutorials teach the player to handle the copter; once the controls and flying skills are mastered, there are escalating challenges and hundreds of missions in any one of four regions of the world, including Southeast Asia, Central America, the Middle East, and the Soviet Union and its Warsaw Pact allies in Western Europe.": "",
  "Harukanaru Augusta is a golf game which allows the player to participate in a tournament on the Augusta National course. The interface consists of three windows: the 3D window where the golfer and the ball movement is shown, an overhead map of the hole and a status window which shows where the ball is (e.g. on the green) and the wind direction. The controls follow the usual formula: first the player sets the used club, the feet position and the direction of the shot. Then the power (a moving line on a scale) and the drift (a moving dot on a golf ball) is determined by clicking with the correct timing to stop the line respectively dot.": "",
  "Heart of Saphilamun is an Adventure game, developed and published by Annandule Project, which was released in Japan in 1991.": "",
  "In an era of frequent alien attacks, the Earth has a unified Government, which relies on a line of cyborgs known as the Heavy Dolls for defense. The greatest of these are known as the Heavy Nova, a title earned by passing a rigorous training regime. You are taking on the simulated proving grounds, which are split into two styles of alternating action. In the first you must progress (initially purely horizontally, though later with vertical flick-scrolling as well) through a hostile environment of enemies, bombs and traps, gaining points for doing it quickly and with lots of energy left. Initially you can fly and kick as needed. Once this section is complete, you move on to one-on-one combat of the Street Fighter 2 style. The early foes have far less energy than you begin with. As you progress through the game, you are awarded extra attacking moves, in a manner similar to Brutal: Paws of Fury.": "",
  "Hextris is a falling block puzzle game just like Tetris, except with hexagons instead of squares. One point is awarded for each piece placed, and 25+ (current level) points are awarded for each line eliminated.": "",
  "A high-school student named K?suke had a dream, in which he saw a beautiful woman talking to him. The next morning he found out that the new teacher looked very similar to the woman he saw. After overhearing a conversation, K?suke realizes that the new teacher is in fact a detective sent to investigate the murder of a female student that occurred in the gym. The young man has to play his cards right in order to become part of the investigation, solve the mystery, and perhaps impress the attractive teacher in other ways. Himitsu no Hanazono is essentially a visual novel. There are no verb commands and no real interaction with the environment. The choices are rather frequent and fairly numerous (usually four or five choices at most screens). Most of these choices, however, do not affect the plot, though they may alter subsequent dialogue. The player is also able to navigate the protagonist on school grounds and inside the main building in a top-down fashion, visiting locations in any order.": "",
  "Gengorou Imai is a 19-year old lad who wants to have a simple life, his only passion being young pretty women. He stays in a boarding house in the country, enjoying the quiet life, the sea, the beach, and the abundance of those he likes most... So all goes well, until one of the guests who was staying at the boarding house is killed. Not entirely trusting the police, the owner of the boarding house asks Gen to look into this. Gen knows that the deceased was having a relationship with the owner's daughter. The young man begins his investigation, saying good-bye to quiet life - but not to the seductive young female tenants of the boarding house... Hoshi no Suna Monogatari is the first in the series of adult detective/mystery adventures by D.O.. The game world is composed of still screens viewed from first-person perspective; navigation is done by selecting locations from a menu. At every screen, a full list of commands is available, from the standard \"Look\" and \"Talk\" to the more specific \"Kiss\", as well as \"Ask\", \"Use Item\", and \"Show Item\". Advancing in the game usually means investigating the locations, talking to everyone, asking the right person about the right topic, and showing the right person the right item.": "",
  "The second entry in the adult detective/mystery series describes another case in the life of the young amateur detective and nearly professional seducer of pretty women, Gengorou Imai. The stage of events is once again a boarding house in the country, this time in the winter season, with skiing and other attractions. Gen is having a good time with the young, but \"demanding\" Reiko Honda, when the news strike: a family friend, a young foreigner named Eddie, is stabbed by an unknown assailant. The only clue Gen can find right away are strange letters written in blood: H and O. What do they mean? Why would anyone want to harm the young boy? With the help of the many pretty girls at the boarding house and its surroundings, Gen begins the investigation, determined to find the criminal... Hoshi no Suna Monogatari 2 plays almost identically to the first game, the only interface-related difference being the addition of a mouse. Otherwise, the player follows the same procedure: look at everything; talk to everyone; find the items needed to advance the investigation; ask the right person the right question, and show the right item to the right person - all done by selecting commands and topics from the extensive verb menu.": "",
  "An evil demon named Varalys casts a curse upon the princess Ann, turning her into three fairies. You control Sir Jim and set out to find the fairies, and then slay Varalys. Only by vanquishing Varalys can the curse be lifted. Once the princess is restored the kingdom will be saved. Hydlide is an action game with strong role-playing elements. The player has to explore vast wilderness areas, descending into dungeons and eliminating enemies on the way. Combat system is similar to the one implemented in Ys series: attacking enemies requires the player to \"bump\" into them, at the same time preventing them from attacking the playable character from the sides and the back. The player can change between defensive and offensive stances by pressing a single button. Magic spells can also be used to dispose of the enemies. The player character grows stronger and gains better parameters as he advances in the game.": "",
  "Hydlide II: Shine Of Darkness is an action RPG, and the second installment in the Hydlide series. In a different space a wonderful world existed, called Fairy Land, which was dominated by swords and magic after the times of domination by monsters and evil had ended. The people of Fairy Land were intoxicated with peace. At that time an incident occurred. A Consciousness filled with evil awoke and it created new monsters, brought the dead back to life, and wanted to dominate Fairy Land again. The monks were one of the first who noticed this and warned the people about it but they didn't listen and left the monks disappointed. The monks prayed to God and asked Him if there was a Savior. God, impressed by the monks prayers warped the space-time of Fairy Land with the human world and selected an innocent boy who lived there. The player controls the innocent boy, who must roam the lands of Fairy Land and free it from evil. The player has to create a character before beginning the quest, customizing his parameters - life, strength, and magic. As in the previous game, the player slays enemies by \"bumping\" into them or using magical spells. It is possible to change between attacking and defensive stances on the fly. The hero can become stronger and gain additional powers. In the villages there are shops where the protagonist can buy and sell weapons, armor, and items.": "",
  "A young man wakes up, only to find himself in a bed, in an unknown house, in an unknown place. A lovely girl enters. She says that her name is Ryuuna and that she is practicing the art of White Magic as a priest. However, the young man cannot remember anything. He cannot even remember his own name. Ryuuna says that he was found unconscious outside of the village, with a pendant lying nearby. There is just one name written there, his name: Seraphis. Also, there is a strange engraving on his hand. Who is he really? Illumina is a rather basic Japanese-style RPG. The party of the heroes walk over the top-down world map, visiting towns and descending into dungeons. With a few exceptions, the towns are displayed as identically-looking pictures of locations, with menu-based navigation, Wizardry-style. The random, turn-based battles are also first-person, but the dungeons have the same top-down view as the map. Playable characters belong to defined classes (such as Ryuuna being a priest with various white magic spells that can be leveled up). If any character is killed in a battle, it's Game Over. There are several scenes with nudity and sexual situations in the game.": "",
  "Image consists of three short episodes; each episode, in its turn, contains two different scenarios. The two scenarios within each episode are similar to each other, featuring the same main female character, and sharing many of the scenes (mostly of sexual nature); however, the identity of the protagonist, the circumstances leading to the development of the story, the dialogue, and the commands required to choose in order to complete the scenario are different. All the three episodes are rather minimalistic, featuring only the protagonist and the female character; the object is always to have sex with the latter. The first episode introduces a girl from the tennis club, the protagonist being either an older boy or a younger classmate. The second revolves around a female high school student who stays in the school after classes; the protagonist can be a male classmate or a male teacher. Finally, the third episode is dedicated to the lovely school nurse, with the protagonist taking two alternate routes to win her graces. The gameplay usually involves selecting verbs from command menus with different options and sometimes vast sub-menus of objects. The sex scenes (and some others) are handled through a point-and-click interface, with the player selecting an appropriate command (\"Look\", \"Touch\", \"Kiss\", etc.), and clicking on an object on the screen to interact with. Many choices the player is able to make in the game are \"wrong\", leading to Game Over.": "",
  "A mysterious alien life form is spreading across the galaxy, trying to conquer the world. It took control of the moon base and is threatening to descend on the Earth. The humans have sent the most advanced fighter jet to oppose the aliens: the OF-1. The OF-1 has the ability to change speed at any time and equip different weapons and pods. OF-1 is humanity's last hope! ImageFight is a top-down vertically scrolling space shooter. On every level there will be enemy ships, turrets, robots, and other machines shooting projectiles or trying to ram you. But there are also power-ups scattered around in small green containers. You must destroy these containers before you can obtain the power-up. Those power-ups include pods that add extra attack power or speed, new kinds of weapons, the ability to fire in different directions, etc.": "",
  "Ishin no Arashi is set during Bakumatsu period (around 1850 until the Meiji Restoration of 1867), the final stretch of the Japanese Edo period, which was a turbulent time, a time of great struggle between the supporters of the feudal shoguns, the rulers of the country, and the adherents of the Emperor, which eventually won and carried through the Meiji Restoration, turning Japan into a modern, powerful state. In Ishin no Arashi the player can choose one of the three major battles of Bakumastu period, and decide which leader will eventually propel Japan towards the Meiji era. This strategy game is somewhat similar to the better-known Romance of the Three Kingdoms series and other historical simulation games by the same company, but also differs from them by having much less complex diplomacy options and focusing the gameplay on navigation and individual encounters. Before beginning, the player chooses a general and customizes his parameters (stamina, attack power, charisma, knowledge). The player then controls the general with soldiers of his choice, navigating him on grids representing towns and countryside of Japan in turn-based fashion. The grids can be occupied by shops, schools (to train the general), friendly and hostile characters and groups. Battles, as well as negotiations and diplomatic procedures, are carried out automatically, and their outcome depends on the characters' statistics.": "",
  "Jack Nicklaus Golf brings Accolade's golf series to the Game Boy with a selection of courses from the computer versions and most features and options also present. Four courses are available: Jack's Greatest, Castle Pines and Desert Mountain as previously seen in Greatest 18 Holes and Muirfield Village from Unlimited. Gameplay modes are skins (for two to four players) and stroke play (for one to four players). Players can choose their golfer's gender and select from beginner and expert skill levels and different tee modes (professional, men's and women's). Besides playing the complete course, there are also practice options for a single hole, the green, and a driving range. Playing a hole begins with a top-down overview of the hole, followed by the standard view from behind the golfer. Strokes are done with the standard three-click method: start, power, and accuracy. During play, it is possible to pull up the hole overview, look at the score card and statistics and change the weather conditions. The game also offers replays and mulligans.": "",
  "The protagonist of the game, a young Japanese male, visits a small town and witnesses two thugs assaulting a terrified young woman. Unable to help her, the hero leaves the town and forgets about the incident. Two years later, he is back in that town; but shortly after having arrived, he is attacked on the street, and robbed of all his possessions. Now he has to get to the bottom of the mystery, but first he needs money. Since the town is big on mahjong tournaments, the hero decides to get his money back by playing that game, at the same time investigating the townspeople... in more than one way. Jan Jaka Jan is a mahjong game in its core, the majority of the gameplay dedicated to mahjong matches (two- as well as four-people) against a variety of opponents. The player can navigate the protagonist around the top-down town and enter various locations, which are viewed from first-person perspective. The player is also able to buy items to increase his parameters during mahjong matches and encounters of sexual nature. Cut scenes occur before and after mahjong games, and many matches and other events are dictated by the story. Defeating a female mahjong opponent usually leads to cut scenes that depict nudity and sexual situations.": "",
  "Joker is set in the time period commonly known as the \"Old West\" or \"Wild West\" in the United States of America. The protagonist of the game is a young man nicknamed Wild, who lives in a quiet Native American village. Years ago, the village was hit by something its inhabitants have since called \"The Great Disaster\". In order to seal the forces that caused the catastrophe, Wild's father sacrificed his own life. Now, the ceremonial day of the White Magic approaches. The youngest in the line of witches, a girl named Laura, must predict the future for the village and the world. For an unknown reason, Laura is unable to see into the future. Concerned, the village elder sends Wild on a mission to the nearby town, to find out what could cause this and if there is a way to prevent the Great Disaster from returning... Joker is essentially a Japanese-style adventure, with strictly menu-based interface, still screens viewed from first-person perspective, and no real puzzles. However, the game offers more interaction possibilities and less linear progression than it is usually the case in comparable games. The player must explore the town and talk to its inhabitants in order to advance the story and get to the bottom of the mystery. The game has scenes with nudity and rather mild depictions of sexual situations.": "",
  "Joshua is a grand strategy game set on the fictional semi-medieval continent of the same name. The people of Joshua are skilled in sciences and technology, which were used for good and evil purposes alike, leading to the invention of wondrous flying machines, but also mechanical war devices that allowed certain nations to take over large portions of the continent. The player can choose between any of the three scenarios, taking place during the fictional 10th to 12th centuries of Joshua's history. The earliest scenario puts the player in control of the small desert nation Rujua; in the middle one the ruler of the Principality of Ashumenia fights against the kingdom of Ishtakar; the final scenario takes place on a part of the continent occupied by the powerful Barm Empire, and the player must resist their invasion as the leader of the kingdom of Ans. The gameplay is similar to Koei's historical simulation games. Much of the interaction is menu-driven, as the player conducts interior policies, diplomacy, and military actions of the controlled state. As the ruler of a nation, the player has to keep the population happy, fortify cities, construct catapults for protection, train soldier, supply money and rations to the army, and engage in large-scale turn-based battles that take place on separate overhead screens.": "",
  "Keeper is a cute action-puzzle game. A five-by-five grid fills up with colored blocks with different icons on them. Pikuru and Kintoto, the player characters, can move freely about the grid, climbing over the blocks, and pushing or pulling them in any direction where there is room. Line up three or more blocks of either the same color or the same symbol and they will disappear. If the entire grid fills up, the game ends. The game features a single-player mode and two-player battle and cooperative modes.": "",
  "Kiwame is a computer adaptation of sh?gi (\"Japanese chess\"). The player may compete against four different computer AI levels. It is possible to undo moves as well as let the AI make a move for the player for learning purposes.": "",
  "An action/puzzle game, the object is to catch assorted color falling tiles and create rows, columns, or diagonals of a single color. Each level requires a different pattern to be made, and the tiles fall faster, more at a time, and in an increasing number of colors as the game progresses.": "",
  "Knight Arms: The Hyblid Framer (sic) is a shoot-em-up in which the player controls a flying mecha who has to venture into deep space to sabotage alien installations and eventually save the Earth. The game's stand-out feature are its two gameplay modes. When in space, the protagonist is controlled from an over-the-shoulder third-person view in a 3D environment. Forward movement is automated, but changing altitude to engage aerial enemies in combat or blast stationary machines is essential. Once in an indoor environment, the player character is navigated in a more common side-scrolling fashion, though altitude continues to play an important role. Power-ups include health-restoring items (repair kits), additional weaponry, etc.": "",
  "The young Satoshi Kanou attends a prestigious art school. One day, the students are invited to a party in Professor Tsukishima's mansion. The hero becomes acquainted with the professor's young daughter, and her father eventually hires him as a private tutor. But it all goes wrong when a terrible accident involves the young hero into a net of mystery and intrigues. Soon he realizes that an innocent person's life might be in danger. The private tutor becomes a private detective... Kurutta Kajitsu is a rather standard Japanese-style adventure gameplay-wise. Typically for the genre, the player advances the story by repeatedly selecting verb commands (\"Examine\", \"Talk\", etc.) from a menu. Most of the time the player is free to move between various locations (also menu-wise) to explore the game world, talk to characters, and solve the mystery. The game has scenes with nudity and sexual content.": "",
  "Also known as Twin Cobra, is a vertically scrolling shoot-em-up. You pilot the TC-17 Twin Cobra assault helicopter to fight the forces of Commander Anziga, the myopic leader of the nation of Kaban. Your job is to fly into Kaban and take out the entire military base of Commander Anziga. You will fight small helicopters, tanks and stationary guns, defeat the large helicopters to get power-ups. By picking up colored icons (blue, yellow, red or green) you can change to different weapon types. Blue is a forward spread shot, yellow is a four-way shot, red is a wide forward laser shot and green is a continuous forward laser shot. At the end of each section, you land on a carrier ship and count up your bonuses.": "",
  "In the far off world of Lakeland, all was peaceful. This was until an evil being known as Zerah came and polluted all of the water, making people very sick. You play as Nasir, 'The Champion of Light', and are sent into the world to destroy the demons that seem to be linked to the muddy waters. On your quest of good you'll come across people in need and help them. Lagoon is an action role-playing game. The hero is able to attack, jump, and cast magic. Defeating enemies in action-based combat grants the player character experience points, eventually leading to leveling up. The hero can also equip weapons and armor of various kinds.": "",
  "The town Newcam, Massachusetts, 1924. On the outskirts of the town stands the Weathertop mansion. It was just an ordinary place until the last owner, Benedict Weathertop, started practicing black magic. He killed his parents and populated the mansion with all kinds of undead. Since then, nobody dared to approach the mansion. But a short while ago, two boys were found dead near this horrible place. Apparently, the boys had tried to enter the mansion. Another evidence pointed out that a girl followed them - but her body hasn't been found yet, and there is a slight hope she might be alive. This is where you, the hero of the game, decide to investigate the mystery, and to venture into the mansion... Laplace no Ma (Devil of Laplace) is a Japanese-style RPG with horror elements, somewhat similar to Sweet Home for NES. Unlike Sweet Home, this game is more oriented towards RPG gameplay. You are not stuck in the mansion, but can leave it, visit the town, and buy supplies. Later you also visit other locations such as a castle, etc. The battles are random, turn-based, and are viewed from first-person perspective. The hero of the game can recruit three other characters to the party of five available. Each character (including the hero, to whom you assign gender and class) belongs to one of the five character classes: Dilettante, Medium, Detective, Scientist, or Journalist. Dilettante is an all-around character with defensive magic, Medium is a kind of a black mage, Detective is a melee fighter, Scientist can construct powerful machines to perform various techniques, and the Journalist can take pictures of the monsters, which is the only way to gain money in the game.": "",
  "The Earth has changed. We don't know yet what happened to humanity, but we know it was eradicated. The new Earth is called Makai - the Demon World. Generations of mythological creatures dwell upon the planet, from which the human being has mysteriously disappeared. One day, a wave of energy hits the Earth. The leaders of the demons realize that a robotic alien race from outer space threatens their existence. The explosion turns earth into a wasteland. Many demons die in the chaos of destruction. It is now up to the remaining demons to fend off the alien invaders, to bring back peace to the demonic race, and perhaps to find out more about the tragic fate of humanity. Last Armageddon can be described as a post-apocalyptic Final Fantasy. Instead of a party of four light warriors who fight hordes of demons, you have a party of four demons who fight... no, not hordes of light warriors, but mysterious robot-like aliens. The turn-based fights are viewed from third-person perspective and are very similar to the battles of early NES Final Fantasies. The demons can attack, cast offensive and defensive magic, and use special skills. Once they reach a high enough level, they morph into stronger forms with more powerful skills. Dungeon areas are done in pseudo-3D and are viewed from first-person perspective. The player is able to set and use multiple parties of demons, some of which have unique skills. For example, a flying demon can take the party quicker to some locations, avoiding random encounters.": "",
  "Two jet fighters go on a mission together, each managed and controlled by a different player. The jets can be docked side-by-side or end-to-end for greater fire and fighting power. When docked one player is the pilot and the other is the weapons officer. The game can also be played by a single player. When you progress in the game you can select more advanced weapon systems to fight the over 50 different enemy characters.": "",
  "Your task is to rescue the Lemmings across 120 levels of fast-paced puzzling. These creatures simply walk blindly through the world in the hope of reaching safety at the end of the level - unfortunately these levels include steep drops, gaps in the ground, barriers and rivers amongst other hazards. You are in control not of any individual Lemming, but of a cross-hair, which can be moved over any of the Lemmings. Along the bottom are a selection of functions which can be assigned to a Lemming, including climbing, floating and bashing. You must click to select the appropriate function, then click on the Lemming to activate it. Each level has a different range of skills on offer, a different amount of Lemmings, and a different percentage target in order to progress.": "",
  "Libble Rabble resembles Qix in that it consists of a series of single-screen stages where the goal is to cut portions of the screen by moving markers around. The markers take the shape of arrows with a string attached between them; areas are cut out by wrapping the string on poles equally distributed throughout the screen. Each stage contains mushrooms and enemies. The stage is completed when all mushrooms have been trapped in enclosed areas and cut out. If an enemy touches one of the arrows a life is lost. There are also enemies that can temporarily disrupt the enclosure by cutting the strings. In addition, treasure chests can be spotted, enclosed and cut out to increase the time limit and other bonuses.": "",
  "In Lipstick Adventure, the player takes the role of Gorou, a young Japanese private detective. One day, a wealthy and powerful old man contacts him and asks him to find a box which - according to him - contained a family treasure. The young detective thinks that fortune has finally smiled to him, but when his pretty girlfriend Otomi disappears, he realizes that the mystery is bigger than he thought... The game is a traditional Japanese adventure, with the usual first-person view and \"Look - Talk - Think - Move\" interface. There are no puzzles, and the game usually advances the plot when all the commands at a given screen are depleted, sometimes requiring to visit different locations several times.": "",
  "This entry in the Lipstick Adventure series continues the story of the young private detective Gorou and his sweetheart Otomi. After attending a friend's marriage ceremony, they return to Gorou's office and find a strange package in the flowers. The package contains pictures of Otomi and several other girls, her schoolmates, some of them naked. Gorou heads to Otomi's high school to begin the investigation, without realizing that he will soon become involved in a sinister conspiracy... Lipstick Adventure 3 plays similarly to its predecessors, having typical Japanese adventure gameplay with menu-based verb commands. The interface has been slightly tweaked, allowing easier \"triggering\" of events by eliminating some unnecessary commands. Like the previous games in the series, Lipstick Adventure 3 walks a fine line between adult and non-adult games, having graphical nudity and plenty of sexual innuendo, but no explicit sex scenes.": "",
  "This is the second entry in Lipstick Adventure series. Once again, the protagonist is the young private detective Gorou. One day his girlfriend Otomi introduces to him a customer, a man who calls himself Sakamoto. When Gorou meets him at the train station, Sakamoto hands him a suitcase, saying he should deliver it to his company in Osaka. However, the suitcase contains a bomb, and the poor Gorou is brought to police headquarters as a terrorist suspect... Like the first game, Lipstick Adventure 2 is a detective/mystery Japanese-style adventure with comical and erotic elements. The player typically advances in the game by going through all the menu commands at a given screen. The commands are of a traditional \"Look - Talk - Think - Move\" variety, with sub-menus for object names.": "",
  "You are a fighter pilot going through wave after wave of enemies from a 1st Person Perspective. You control a gun-sight and you try to shoot as many planes and ground defences while you fly through the air. Your sights will automatically Lock-On to a target and you can fire a missile to hit them.": "",
  "The Bungeling Empire has stolen a huge cache of gold from its rightful owners, and your mission is to infiltrate its treasury and recapture it. This entails progressing through 150 screens of platforms, ladders and ropes. The Empire has sent robotic guards down to protect the gold, and contact with any of these will cost you a life. Your method of escaping them is to press fire to dig a hole in their line of movement, thus causing them to fall in briefly, allowing you to move across the gap safely. Once all the gold has been collected, a ladder allowing you to move onto the next screen is added. Completing these screens often requires forward planning and precision. This was one of the earliest games to include a level editor, allowing the creation of new level designs with no programming skill.": "",
  "Loop Eraser is a puzzle game consisting of 120 stages. Each stage is a screen containing puzzle pieces arranged in different patterns on a screen. Each piece has a line drawn on it, and can be rotated left and right to change its direction. A line that faces downward but is not connected to another one will automatically fall down until it becomes adjacent to another line. The goal is to connect lines together under correct angles to build \"loops\", i.e. complete forms out of straight lines that encircle an area of the screen. A loop disappears once formed. A stage is solved when all the lines have been arranged into loops and are therefore removed completely from the screen.": "",
  "A puzzle game where the main goal is to make loops! Random pieces are presented over a board, including simple lines and corners as well as S bends and other warped shapes, of varying sizes. It is up to the player to link them up in a loop form, then moving on to the next level. Pieces can be placed on any empty space on the grid, and rotated into one of the four main compass directions. Any pieces which are not part of the finished loop when a level is completed are left on the screen, so there is value in playing towards 2 distinct loops, to ensure that you have options depending on which pieces are drawn - unlike Pipe Dream there are no clues as to which pieces are coming next. Three play modes are available, two of which can be played with two players. Game A is freestyle - simply make loops, gaining extra points for size and style. Game B is about unlocking bonus boards of the game by reaching a certain score and uses a bonus multiplier method depending on loop difficulty. The third mode of play begins with an already made loop and then removes random pieces of it, so the player has to put them back in when they appear again. It is essentially a memory test and logic puzzle of fitting the pieces back as one remembers - although placing a piece where it seems to fit is also often effective.": "",
  "Macross: Countdown (released outside of Japan as just Macross) is a side-scrolling shoot'em up based on the classic anime series. Players control a Valkyrie fighter that launches from the Macross to rescue Lynn Minmay from the Zentradi. Many waves of enemies must be overcome by evading or shooting at them. A radar at the bottom of the screen displays incoming enemies and obstacles. As in the series, the Valkyrie can transform into one of three different modes, but cannot fire any weapons while transforming: in Fighter mode, it is fast and maneuverable. Speed and maneuverability are lower in Gerwalk mode, which can be useful for getting through tight spots. In Battroid mode, the Valkyrie's projectiles are self-seeking. Only in Fighter and Gerwalk modes, the Valkyrie can launch a powerful missile spread that can take out a lot of enemies at once. The spread is limited to three firings per wave, though.": "",
  "The game takes place in a post-war setting in the year 2142, where a warship built during the last moments of the war was discovered by the military, which contained several hundred mecha robots known as SlaveGears. These units were put under control of the current ruling government for power purposes, two of which are placed under police management for experimental use and given the names of \"Hound Dog\" and \"Rising Dog\" respectively. However the on-board computer at the unearthed warship, \"Omega\", suddenly becomes operational and accesses the military networks, freezing Artemis City and commanding Rising Dog on exterminating his enemies. The research facility is obliterated and Rising Dog manages to escape into the city, leading the police to recognize the emergency and ultimately deploy a SOS signal to Hound Dog in order to protect the city by destroying all enemy robots.": "",
  "Mahjongg Master recreates the classic Chinese game of strategy. Features include 18 original tile sets (everything from classic MahJongg tiles to all new designs), choice of 70 backgrounds (scenic, animals, textures etc.) and background music. This game was the first Mahjongg game in the long-running Game Master Series developed by René-Gilles Deberdt and edited by eGames, Inc. It was followed by Mahjongg Master: Egyptian Edition.": "",
  "The goblin empire became more powerful than ever thanks to the charismatic king Gobligan, a human who united goblins under his rule. King Caudwener knew that the goblins began mass production of magical weapons. Assassinating Gobligan seemed the only option. Four warriors volunteer to infiltrate the goblin empire and carry out this dangerous task. The game is a vertically scrolling shoot-em-up with a medieval fantasy and modern weaponry and devices mix. The player can choose to control any of the four characters: fighter Gain, witch Chitta, reptile samurai Miyamoto, or necromancer Bornnam. Each of the characters flies through the stages and attacks with three types of main weapons, distinguished by color and taking different shapes depending on the chosen character: accurate homing fire (red), side weapons (blue), powerful straight attack (green). The weapons are changed by collecting magic books, and their power is enhanced by flying over coins that appear on the stages.": "",
  "Mai is a little girl with cat ears who studies the art of magic. Unfortunately, she doesn't always do her homework, and sometimes loses control of her magical powers. This is precisely what happened one day, when she accidentally unleashed a magical spell upon terrified classmates. Now the poor girl is being hunted down by male and female students, teachers, and other people, and she has to fight for her life while perfecting her magic-casting skills. Mai is similar to the better-known Mad? Monogatari games in many ways: it is a solo pseudo-3D first-person dungeon crawl; it casts a little innocent girl with magical powers as the heroine; it displays no numeric statistics (damage feedback, the heroine's progress, etc. are shown only graphically or with the help of text messages); it has an overall \"cute\" theme with comical animations. However, unlike Mad? Monogatari, Mai contains graphical nudity and scenes with mild depiction of sexual situations.": "",
  "You control Mappy, a police-mouse whose job is to collect valuables (consumer electronics) from a cat's house. You are being pursued by a gang of five pink cats. Doors are your only defense against the cats. You get from floor to floor by jumping on one of the trampolines. Points are earned by recovering stolen goods. Other ways of earning points are bouncing on a trampoline, putting cats in the microwave, striking a cat with a door, striking cats with a bell, retrieving a treasure from the Boss cat Goro or dropping cats through a hole in the floor.": "",
  "The idea of this arcade game is deceptively simple: Guide a marble down a path without hitting any obstacles or straying off the course. The game is viewed from an isometric perspective, which makes it harder to stay focused on the direction the ball is to follow. There are tight corridors to follow and enemies to avoid. There is a 2-player mode in which players must race to the finish; otherwise you're racing against the clock.": "",
  "The game's story begins as Alice is awakened in the middle of the night by a voice from her mirror, it's Tokei Usagi (White Rabbit), he needs Alice's help to rescue the world of mirrors from the Dark Queen who has conquered it. Alice must knock enemies over the edge with her bubble blower through nine different worlds, collecting various power-ups, such as rabbit shields and super jump shoes, along the way. Holding down the fire button generates bigger bubbles, resulting in greater knockback strength. However, various enemies are also trying to knock Alice off by firing colored marbles that can push Alice over the edge unless they are avoided or jumped over. There's also a 3 minute time limit for each round and if you run out of time the invincible Jikangire Monster will appear and automatically force Alice off the edge of the platforms if he touches her.": "",
  "Marine Buster is a turn-based strategy game that builds upon the rules of the popular board game BattleShip. The basic principle is the same as in BattleShip: players position ships on a board and then take turns attacking enemy ships by guessing their location on the opponent's board. The game offers several types of ships as well as weapon variants with limited amounts of ammo and different damage properties. Erotic pictures serve as a reward for successfully defeating the opponent.": "",
  "Mario and Luigi, the best plumbers in the world, have a real job on their hands. A host of characters have taken over the sewers, and the brothers must clear them out of the pipes. The platform puzzle which first introduced Luigi to the world has both single and multiplayer action with two differing game types, but with the same objective. Crabs, turtles and fighter flies must be cleared out by jumping underneath the platform they sit on, then kicking them away. Each level is cleared when a set number of coins is collected. For the two player mode, the first to collect the set amount of coins wins.": "",
  "Masahito is a Japanese teenager who studies martial arts. However, instead of studying, he prefers to chase pretty girls. Finally, after a quarrel with his father, Masahito leaves his home. Accidentally, he bumps into Keiko Yashima, the principal of Yuai girls school. She tests Masahito in combat, and against all rules, accepts him as the only male student in the school. Naturally, our hero uses this opportunity to \"get lucky\" with his all-female school mates... Martial Age is a Japanese-style adventure game. Most of the time here is spent depleting menu commands (\"Look\", \"Talk\", \"Think\", etc.) in every given location, exploring the school and getting acquainted with the girls. There is also turn-based combat in the game, but no statistics of any kind. The battles work like mini-games, which require the player to guess the \"weak spots\" of the girls, after which they give up and the hero can initiate a sexual scene.": "",
  "A Japanese high-school student receives a letter from his sweetheart Mayumi, who has gone to study in a remote school as an exchange student. Something in the tone of the letter convinces the young man that Mayumi might be a trouble. He travels to her school, only to discover that Mayumi was kidnapped. Now it is up to him to investigate the school premises, talk to the personnel and other students, and rescue his beloved one. Mayumi is a Japanese-style adventure. Interaction with the environment is performed by selecting verb commands that appear as icons surrounding the viewable area. These commands include the standard Look, Talk, Use, and Move, as well as the less common Hear and Hit. In some cases it is necessary to click on an object on the screen to interact with it after having selected a verb.": "",
  "In Metal Eye, the player takes the role of a young weapons expert named Findhill. His father was apparently involved in a project that dealt with creating artificial life forms. But recently he has disappeared without a trace. Findhill remained alone, in a small town surrounded by vicious monsters. He wants to become a hunter, just like his father once was, to get rid of the monsters roaming the wilderness, and get to the bottom of his father's disappearance and his mysterious project. The game is a rather traditional Japanese RPG: Findhill and his companions, who join the party as dictated by the course of the story, wander around a vast world map, visiting towns, descending into dungeons, and fighting random enemies in turn-based combat viewed from a first-person perspective. The party can carry different types of weapons, including various guns (rifles, shotguns, etc.) with expendable bullets. Weapons and armor are shared by all the characters and need not be equipped on individual combatants. The player can also purchase robotic fighters (called \"Metals\" in the game) in shops, who would then join the party and participate in battles, controlled by the AI. There are scenes with nudity and sexual situations in the game.": "",
  "When the epic, thousand-year-old battle between different dragon clans was finally over, and the benevolent White Dragons started ruling the country of Akranis, it looked like the age of peace has finally arrived. But all changes when the dragon rider Kain finds an ancient weapon known as the Rune Blade. He brings it to the old white dragon Yoshua, who tells him that a powerful protective artifact has been stolen, and the fateful hour has come to Akranis... with the help of his dragon Sarken, Kain has to restore peace and save Akranis and the dragon race. The game is a rather unusual example of a side-scrolling action game, in which the player controls a dragon. Sarken is able to fly in any direction, but so are the enemies in the game, most of which are other dragons. The dragon has a HP bar which is depleted when he is damaged by enemy attacks or traps. Beside physically attacking, the dragon can also learn and cast offensive and protective magical spells.": "",
  "In the 19th century a young cavalryman gets raided. The robbers kidnap his girlfriend Jenny and now she is about to get sacrificed by a cult. Now the player has to rescue her and bring the culprit to justice. While searching the desert. Then he finds some odd balls, steps through a portal and has to activate so-called \"mirages\" which provide the back story of the game through live action videos or letters. To activate the mirages the player has to find clues in several scenarios. The goal of this scenarios is to find the exit, which is achieved by searching the stills after clickable objects and sometimes manipulate them with found objects. When clicking an object the game shows an FMV to show what happens. There are possible deaths and dead ends when choosing the wrong items on the screen. The scenarios are presented in high-definition stills and have the typical style of Western, including bordellos, saloons or gunmen.": "",
  "Moon Crystal is a platform action game where you control Ricky Slater on his mission to free his kidnapped father from the evil Count Crimson. The Count is forcing his father, a great scientist, to use the power of the moon crystal to turn the dead into living and rule the world. There are 7 stages, each ending with a boss fight. The themes of the stages follow the story closely. The player begins each stage with only small knife to defend yourself. The player can find power-ups that can extend the range of your knife, give additional health containers, allow Ricky to make double jumps etc. The player has 3 lives and also an unlimited amount of continues. The game is notable for its fluid animations and rich graphic cut scenes which moves the story forward. It was never officially released outside of Japan, but an unofficial English translation patch exists.": "",
  "Moria is a member of the roguelike RPGs. It features several innovations, like a town level and dungeons levels that are bigger than one screen, and was the first open source and freeware roguelike. The goal of Moria is to descend in the dungeons of Moria and defeat the evil Balrog who is cowardly hiding on the lowest level. Other than this, there are no other references to J.R.R. Tolkien in this game. You begin the game by creating your character, choosing your sex and one of eight available races. You can then roll your stats and, when you got some which suit you, choose your class from six available classes (you can only some of them, depending on your stats). After entering a name, you're ready to roll. The game is entirely played in turns, feature text-only graphics showing your environment from above, and is played by entering character commands. You start in town, where you can visit several shops to buy weapons, armor, torches, food and other useful -- and sometimes magic -- items. You can barter with the shopkeepers to get reduced prices. The dungeon levels are randomly generated. They contain a variety of monsters, some of which invisible, and items, as well as traps and secret doors. Each level has more than one exit. As in other roguelikes, you explore the dungeons, kill monsters as you go, and try to accumulate as much treasure as possible.": "",
  "In this game, you control a bumper car, and the object is to bump your opponents off the gameboard while they do the same to you, and once you have managed to bump all your opponents off the board, you move on to the next round. If you take too long to complete a round, a fireball will strike one of the tiles on the board, causing them to collapse and making it more likely that you or your opponents are killed. In some rounds, you can get power-ups that give you extra bumping powers and the ability to jump over gaps. When you jump, you can break a tile to the point where it collapses, making it easier for opponents to fall down the gap that will be left there.": "",
  "Rogles, the tyrant who wanted to gain control over the three worlds in the universe, was defeated by Yuko, an ordinary Japanese teenager who was chosen to become the heroic Valis Soldier. The dream world Vecanti fell into the hands of Emperor Megas. Driven by intense hatred to Rogles and his followers, Megas became an even more dangerous fanatic, imposing an iron rule on his realm. Yuko must now travel to the dream world and defeat the new tyrant and his minions. Like its predecessor, Mugen Senshi Valis II is an action platformer. Yuko fights and jumps her way through enemies and platform structures, acquiring various power-ups during the course of the game. Various weapons and armor can be found in the stages and equipped on a separate screen. Weapons have their own unique ranged patterns and are always attached to Yuko's default sword attack. Different types of armor may increase Yuko's hit points, offense, and defense ratings.": "",
  "A young woman named Ryouko is working in a research laboratory specializing in communication with aquatic animals. Recently she has made groundbreaking discoveries with one of the test subjects, a whale named Gigi. Ryouko managed to establish full communication with the animal and teach him information. However, other people involved in the project have their own ideas concerning the practical usage of the whale's intelligence, and are ready to use it to further their own shady agendas. My Eyes! plays similarly to visual novels, albeit with many more choices and interaction than it is usually the case with games of its type. There are no permanent menus and only a few instances where navigation is possible; however, the player is often presented with several context-specific commands and choices in each situation. Often it is necessary to go through commands multiple times to trigger the next events; sometimes wrong choices lead to Game Over.": "",
  "In 21th century the Earth became overpopulated, and humans began building colonies in the solar system. Technological expansion led to widespread pollution; in order to counter it, a powerful computer Naious was built. One century later, humans became completely dependent on Naious, and that was when it stroke unexpectedly. European cities were reduced to ruins after a single attack. The fighter spacecraft ASP and its pilot Manami Katagiri were dealing with a possible rebellion on Jupiter when it became clear that the future fate of humanity depends on them. Naious is a horizontally scrolling shoot-em-up. The gameplay is fairly traditional and involves navigating outdoor and indoor stages (often with narrow spaces), destroying mobile and stationary enemies on the way. The fighter craft starts with a vulcan gun and can later change to wide shot, laser, and homing missiles. Rather infrequent power-ups appear at set points on the stages and change or enhance the plane's weapons.": "",
  "In the year 2104, the Solar Union (the government of Earth and the solar system) faces trouble from three former colonies. Under the guise of negotiations, the colonies' forces attack and capture three mining worlds: Neptune's moon Triton, the Earth-like planet Romulous and the water world Pacifica. Earth's survival is at stake. It is the player's mission to strike back at the invaders and recapture the three worlds. Earth's full arsenal of ground, air and naval forces is standing by. This version of Nectaris is an updated and expanded version of the original game with a new background story, an entirely different graphical style and lots of new content. It includes all maps (the setting of which has been changed from the Earth's moon to Triton) and units from the original game. Two new sets of maps (the Romulous and Pacifica campaigns) have been added for a total of 96 levels. There are also many new units, more than doubling the number of the original. The non-lunar settings of the new campaigns allow for naval units for the first time (including submarines and ship-based aircraft), as well as such units as helicopters, jump-jet infantry and paratroopers. Gameplay is unchanged from the original. Units move and attack in turns on a tactical map. Each unit has different ratings for attack and defense as well as range. Combat is decided by various factors including the combatants' abilities, troop strength and experience, terrain, and the positioning of support units. Units cannot be created. The only way to gain new units is to capture depots containing neutral units. To win each map, either the enemy's headquarters must be captured or all his forces be destroyed. At any time between battles, the campaign can be switched among the three different worlds. The last mission beat on each world is automatically saved, and earlier maps can be accessed through passwords. It is also possible to save the game during a battle. In addition to the single player maps, there are also 8 special multiplayer maps, which can be played by up to four players (or AIs, if not enough people are available). In multi-player mode, various diplomatic relations can be set between the different parties, from alliances to all-out war.": "",
  "Nemesis '90 Kai is an enhanced remake of Nemesis 2. The main difference lies in presentation, with higher-quality music and significantly more detailed graphics. The gameplay is mostly unchanged, with the exception of the possibility to equip four options on the player-controlled ship (as opposed to only two in the original version) and a few tweaks to secondary weapons and power-ups. Two new stages and four boss enemies have been added to this version.": "",
  "Neural Gear is a pseudo-3D scrolling shooter similar to Space Harrier. You play as Emi T. Fonon, a futuristic soldier from the years after World War IV, who wears a bio-powered suit that can fly back in time and destroy time travelling robots. Each level goes back to an earlier date and has more numerous and powerful enemies. The game is completely controlled with the mouse. Left clicking fires the main weapon - yellow energy balls, while right clicking fires a sub weapon, which is chosen at the start of the level. There are four sub weapons to choose from: SPC that shoots powerful blue energy balls, Rockets, Homing Missiles and the most powerful sub weapon in the game \"???\" which is actually a bomb that can instantly kill all enemies on screen, including bosses but it also take out around 500-600 health. An interesting feature of this game is the health system. The timer at the top of the screen also acts as the health bar and it decreases faster when you get hit. Enemies come in large groups, sometimes in formations, and shooting twenty enemies will refill your timer 200 points. Getting to the end of a level also adds a certain amount to the timer depending on the level.": "",
  "The sequel to Bokosuka Wars, featuring all-new enemy characters, items and traps, as well as a more balanced level of difficulty. Gameplay-wise, it's mostly identical to the first game - you must walk 600 meters to reach the enemy castle and kill the Dragonet. The player controls three units: the King, Knight, and Pawn. When moving these units, you can either move your entire army at the same time, or move all of one type of unit. Only your own units can initiate battles. All units gain strength while fighting and after fighting a sufficient number of battles, Pawns and Knights will be promoted to stronger, golden forms of themselves. There are captive Pawns along the way that can be rescued to increase your ranks, but only Knights can break the gates in front of them. There's also barriers every 100 meters, which can only be broken by King Suren. The King is also the only one who can destroy large trees in some of the forest areas.": "",
  "Nostalgia 1907 is a visual novel that takes place in the year 1907 on board the ship \"Nostalgia\". While the ship was crossing the Atlantic ocean, an explosion damaged it. Taking the role of several characters, among them the ship's captain and a few passengers, the player has to find out who caused the explosion and why. The game is mostly composed of text accompanying still pictures; the interaction is restricted to several occasions during which the player has to make choices for the character currently regarded as protagonist. The game's graphics are done entirely in sepia tones. Despite its Japanese origin, the hand-drawn graphics of Nostalgia 1907 eschew the usual manga-style aesthetics.": "",
  "Nova follows a similar premise as Deflector, that is, the player has to manipulate one or or more beams of light in such a way that they reach a certain spot. This can be done by placing tiles on the playing field. There are tiles that change the direction of a beam by 90 degrees, blocks that cannot be penetrated, blocks that are destroyed by the light and slow it down for a moment, tubes that allow the light to pass through itself and \"bubbles\" that break the light and send it off into two different directions. The type of tiles available and the total number of tiles the player is allowed to use differs from level to level.": "",
  "Otoko Dama is a vertically scrolling manic shooter by Mitsuky. Released for the Sharp X68000 computer in 1999, it is exemplary of the popular doujin scene which the platform enjoyed for a long time. The gameplay is very reminiscent of the 'Bullet Hell'-style made popular by developers such as Cave.": "",
  "Jeu de course/arcade qui vous place au volant d'une Formule 1.": "",
  "Pac-Land is a side-scrolling 1-2 player game with a cartoony feel to it. Now equipped with arms, face, and legs, Pac must guide a fairy back to her home in Fairy Land, but this task will not be easy because Inky, Blinky, Pinky, Clyde, and Sue will pursue Pac-Man as he travels through Pac-Land. When he finally transports the fairy back to her home, Pac is given some magic shoes, which will help him get to his own home, where he will be greeted by his family: Ms. Pac-Man, Baby Pac-Man, Chomp Chomp, and Sourpuss. There are sixteen rounds to complete, with four trips each. During each round, he can grab a power pellet, which cause ghosts to turn blue, allowing Pac-Man to eat them for points. Points are also awarded by collecting fruit that appear, like cherries and strawberries. In some rounds, Pac must use a springboard to jump over a lake. He must also make it to the end of each round before time runs out, otherwise a ghost will chase him.": "",
  "One of the most popular and influential games of the 1980's, Pac-Man stars a little, yellow dot-muncher who works his way around to clear a maze of the various dots and fruit which inhabit the board. Pac-Man's goal is continually challenged by four ghosts: The shy blue ghost Bashful (Inky), the trailing red ghost Shadow (Blinky), the fast pink ghost Speedy (Pinky), and the forgetful orange ghost Pokey (Clyde). One touch from any of these ghosts means a loss of life for Pac-Man. Pac-Man can turn the tables on his pursuers by eating of the four Energizers located within the maze. During this time, the ghosts turn blue, and Pac-Man can eat them for bonus points. This only lasts for a limited amount of time, as the ghosts' eyes float back to their center box, and regenerate to chase after Pac-Man again. Survive a few rounds of gameplay, and be treated to humorous intermissions between Pac-Man and the ghosts.": "",
  "Pac-Mania is a variation on the game Pac-Man. You need to guide Pac-Man around a maze and eat all of the dots on the board in order to proceed on to the next round. Numerous, multi-colored ghosts also roam the maze trying to stop you. If you eat one of the power pellets in the maze, the ghosts will temporarily turn blue and run from you. Pac-Man can earn bonus points by eating the ghosts when they are in this state. The maze is now shown in isometric perspective and is larger than screen which will scroll to follow the action. To help get out of tight spots, Pac-Man now has the ability to jump. But be careful, because some of the ghosts have learned this trick as well and you could end up in a mid air collision!": "",
  "Parodius, ou Parodius Da! est un jeu vidéo de type shoot-em-up à défilement horizontal. Il s'agit d'une parodie de Gradius et d'autres jeux de tir. Le Grand Octopus menace la Terre. Pour aider Parodius à sauver la planète, le joueur et ses amis doivent commencer leur recherche à travers le monde pour trouver l'ennemi et le détruire. Parodius permet aux joueurs de choisir un personnage parmi quatre différents. De plus, il conserve le système d'armes sélectionnable de \"Gradius\"; un \"Power Meter\" au bas de l'écran permet aux joueurs d'acheter des armes et des mises à niveau en utilisant des capsules laissées par certains ennemis détruits.": "",
  "Parsec is a side-scrolling space shooter. Waves of alien craft swoop down from the top and the player must shoot them down without colliding with them or the ground, running out of fuel, or overheating the ship's laser. Some enemies are harder to destroy and shoot back. At the end of each level, the player must navigate through an asteroid field which can yield many points, but can also result in a loss of ships in the process due to collisions. The game takes advantage of the TI's speech synthesizer: a female voice occasionally makes comments such as \"Nice shooting, pilot!\", or \"Asteroid field ahead\" throughout the course of the game.": "",
  "A futuristic shooter, Phalanx is the name of the prototype starfighter flown by Wink Baufield, a genetically enhanced pilot. It is sent to protect and reclaim Delia IV, a planet in the Andromeda galaxy, which has been colonized by humans for interstellar research purposes. However, an unknown and powerful alien force has overtaken the planet, the military defenses have been completely overwhelmed, and all hope rests on the Phalanx. You fly through eight levels, first through various locations in Delia IV, and then you invade the aliens themselves. Like most shooters, you can upgrade your weapons by picking up bonus items dropped by enemy craft.": "",
  "After the evil Nikademus was defeated, the land of Scandor enjoyed a time period of peace, which lasted twenty years. However, when a ship sent to the Skull Island disappeared without trace, Scandor's inhabitants realized a new threat was rising... Phantasie IV: The Birth of Heroes is the fourth entry in the RPG series Phantasie, and the only one that was released exclusively for Japanese computers. Gameplay-wise and visually, the game is very similar to the previous installments. The player creates a party of adventurers (up to six active combatants, including the series' trademark \"random creatures\", such as ogres, minotaurs, lizardmen, etc.), which then roams the top-down world-map, descending into dungeons, and fighting randomly appearing enemies in turn-based combat.": "",
  "Hiroshi and Mayumi grew up together. They went to the same kindergarten, the same school, always spent time together, and naturally thought that they will never separate. Then the time has come when they both had to go to different colleges. They promised each other than they will still be together. But they both broke the promise... If jealousy and the knowledge of one's own betrayal were not enough to endanger their relationship, something far worse happened... the man with whom Mayumi spent the night was found murdered, and Hiroshi must forget his personal pain in order to solve the mystery... Pias is a traditional Japanese-style adventure. The gameplay consists of choosing verb commands (\"Look\", \"Talk\", \"Ask\", \"Think\", \"Move\") from a menu. Typically, events are triggered by depleting all the commands at every screen. The game has scenes with explicit sexual content.": "",
  "Nintendo.com Description (from Ad Blurbs)Guide the ball around the board collecting points, but be careful not to run out of time or land in the hazard zone. Endless fun for everyone!": "",
  "Each level of this abstract puzzler challenges the player to set up a network of pipes to allow an unspecified substance known as 'flooz' to flow through as many of those as possible. The pieces are offered in random order, and there are seven different types - straight lines going horizontally or vertically, corners rotating in each of the four directions, and cross-over pieces which carry the flooz straight across horizontally and vertically. Each of these can be entered from either side. When the flooz hits a gap, or a piece which the previous piece can't flow into, the pipe is finished. Before the flooz starts flowing from its randomly-selected starting position, the player has several seconds to start placing pieces. They can be put down anywhere. However a situation that can often occur is there will be a long and complex piping arrangement set up, yet a gap somewhere remains to be filled. Players are able to replace a piece with another in the same square (to make it easier to flow the flooz that way), but for a slight scoring penalty. Bonuses are awarded for looping the flooz through both sides of at least 5 cross-over pieces, or passing the flooz through every square on the screen. Later levels have some squares on the grid blocked off, a few gaps in the side-wall (allowing flooz to thread to the other side of the screen). After every four levels there is a bonus game for points, in which the player can only place the pieces in the lowest open space in each column, similarly to the board game of \"Connect 4\".": "",
  "You play a god, gaming against other gods in a celestial game of conquest. To win, you must help your chosen people take over the world and wipe out the vermin who worship that other god. Each god starts out with a single human, dumped into the middle of the wilderness. Sometimes there is inhabitable land in sight, sometimes not. To get a chance to win, you must change the landscape, creating flat land for your followers to build on. The more followers you have, the more powerful you will be, so take care of them. Build as fast as you can, because the other god is doing the same. When you have enough followers, you can make the leader of your people into a hero. He will then go around the land you have built, literally taking strength from the people into himself, and working his way toward the enemy. When he gets there, he will engage in holy warfare upon your enemy's people. He will burn; he will kill. And he won't stop until they're all dead... or he is. But you don't have to let your people have all the fun; the gods have other tools as well. You can drown your enemies one at a time with your land lowering powers, submerge their towns in swamps, or raise a volcano in the middle of their best farmland. Even better, you can flood the land and drain all the people who didn't build on high ground. And when you win, you'll have 500 more worlds to conquer. A god's play is just never done.": "",
  "PowerMonger takes the basic design and concepts of Bullfrog's previous game Populous, and places it in a war context. The game cast the player as a dispossessed warlord plundering his way through 195 territories on the way to world conquest. Several other leaders have the same goal. The gameworld is now made up of polygons, so the view can be rotated and moved with greater freedom than Populous. Trade, diplomacy, inventions, and scorched earth invasions all play a key role in how the player progresses through the game. Two-player games via modem links are available on computer versions.": "",
  "Premium consists of four scenarios, each one of which is dedicated entirely to sex (sometimes with a bit of conversation and very straight-forward seduction before). There is no real story, just a series of encounters of nameless protagonists with different types of young women. Each of the four scenarios is dedicated to a specific occupation, which are: school girl, maid, magician, and finally Buddhist nun. The gameplay is very simple; even though there are verb commands, they are always situation-specific, and the player can advance the game by going through the few commands to trigger the next scene, which makes Premium more of a visual novel than an adventure.": "",
  "While the Sultan of Persia is fighting a war in a foreign country, his Grand Vizier Jaffar orchestrates a coup d'état. His way to the throne lies through the Sultan's lovely daughter. Jaffar kidnaps her and threatens to kill her if she refuses to marry him. Meanwhile, the man the Princess loves is thrown into the dungeon. He has only one hour to escape from his prison, defeat the guards on his way, and stop Jaffar before the terrible marriage takes place. Prince of Persia is a 2D platformer that is commonly regarded as a progenitor of the cinematic platform genre. Rather than following the more common jump-and-run mechanics, it focuses on careful advancement through fairly complex levels, emphasizing the protagonist's vulnerability and survival aspect. Rotoscoping technique is used to give more realism to the animation of the characters' movements. The protagonist must avoid deadly traps, solve some simple jumping and environmental puzzles (such as stepping on pressure plates to raise portcullis), and engage in sword fights with the guards. The player character has an infinite amount of lives, but has to restart at the beginning of a level each time he dies, and must complete the game within an hour. The hero starts with three units of health, which can be replenished with small health potions or permanently increased with large jars. The Game Boy Color and SNES versions of the game feature additional levels and new enemies. The Genesis version has a new intro, an altered set of graphics and four new levels.": "",
  "By the end of the 20th century, radical educational reforms have transformed the Japanese society. Students were split into opposing groups, and the more aggressive of those eventually formed a dominant organization named Order of Black Phoenix, centered on the cult of a mysterious person known as \"The Queen\". Outcast students have escaped to a secluded island near Okinawa. A wandering lazy and lecherous manga and anime fan named Gor? End? teams up with a female teacher and a few students to lead an opposition force against the oppressive governing circles. Pro Student G is a Japanese-style erotic comedy adventure. The player guides Gor? through a series of locations and encounters, selecting choices from a menu to trigger the next event and advance the story. Some choices have a traditional verb-object structure, while others incorporate context-specific actions, many of which are included for humorous effect.": "",
  "Pro Tennis: World Court is a tennis game, it's an update of Namco?s 1987 game Family Tennis for the Famicom. The game features twenty different players (ten male, eight female and two robot) and three courts - New York (hard), London (lawn) and Paris (clay). You can either play Singles match (Player 1 versus the AI or against Player 2) or Doubles (Player Team versus Computer Team). The arcade version supports 2 players while the Sharp X68000 version supports 4 players via inputting a special code.": "",
  "Prostitute Maker is a life simulation game similar to Princess Maker: a heroic father, who has defeated the forces of Lucifer himself and restored City 13 to its former glory of frivolous pleasures, is entrusted with the task of bringing up his daughter. The distinction between the premises of the two games, however, is significant: the father sees it as his parental duty to turn his child into a prostitute. The game starts when the daughter is already a teenager. Just as in Princess Maker, the player has to make schedules for the girl, comprised out of various activities. These include part-time jobs of various (not necessarily lewd) kinds, studying, resting, taking a trip, etc. Such activities increase the girl's parameters, making her more attractive. It is also possible to buy items and clothes and outfit the girl with them. Once the player feels that his protegee is ready, a meeting with a client can be arranged. Unlike Princess Maker, there is no exploration, battles, or other RPG elements in the game.": "",
  "Puyo Puyo is a falling pieces puzzle, with basic similarities to Tetris. Pairs of puyos (monsters from Compile's RPG series Mad? Monogatari) fall down from the top into a cylinder. They can be moved left or right, rotated in either direction and made to drop faster. The goal is to get four puyos of the same color touching each other horizontally or vertically. Doing so removes them from the field. Making groups of larger than four, several at the same time or creating chain reactions nets more points. The game ends once the stacked puyos reach the top of the cylinder. The game offers an endless single-player mode, a two-player mode (first player to fill their cylinder loses) and a mission mode. Mission mode presents the player with a number of pre-filled playing fields with a preset task, like making a minimum number of puyos disappear in one move, or removing all puyos of a certain color.": "",
  "The object of Puzzle is to reassemble a picture which has been scrambled. The picture is broken into a number of pieces with one or more open spaces. Slide the pieces into the open spaces to rearrange them back into the proper order. If you're stuck, you have the option of challenging the computer to a game of chance like rock, paper, scissors or roll the dice. This will subtract 60 seconds from your time, but if won allows any two pieces on the board to be swapped. If you forget what the picture looks like, you can pause the game and see the completed version, but this can only be done five times per puzzle. There are eight different levels, plus two additional expert levels.": "",
  "Quarth is a typical puzzle/arcade game. Quarth can be moved from right to left while the screen scrolls down. The playing field is filled with different blocks and your aim is to fill them in so they form complete rectangles or squares. Only when you succeed in this mission, the concerned blocks will disappear. New 'unformed' blocks appear while the playing field scrolls down making you play into full action at all times. As soon as a line of blocks reaches the bottom line, it is Game Over. Then you'll be granted 10 seconds to decide if you want continue the level. Each Level consists of 9 Areas and you progress to the next level once you've cleared the last area. The Battle mode is a dual player mode.": "",
  "The year is 1944, and the landings in Normandy have begun, turning the tide of World War II. A German pilot named Michael Ilgner accidentally steers his plane into a mysterious vortex during the battle. He is then transported to the magical parallel world of Quintia, where he is requested by humans and other peaceful races to use the powers of his aircraft to defeat horrifying monsters that were unleashed upon the world. Quintia Road is an anime-style fantasy adventure game. The gameplay is quite straightforward, requiring minimal input from the player and offering no puzzles or other challenges. The player is normally expected to repeatedly select various verb commands (such as \"Look\", \"Talk\", etc.) from a text menu. There are no objects lists to combine these commands with. Story advancement is linear and only a few instances offer traveling choices. There are a few scripted turn-based battles in the game, which allow the player to select various types of attacks; however, these battles evolve in a prescribed fashion and the player's choices have little to no impact on the results. The game contains scenes with nudity and explicit sexual situations.": "",
  "It is the first game where a knowledge of the three Japanese writing systems (Kanji, Hiragana, and Katakana) is essential for players who wish to succeed in it - and the players must help two Japanese lords, Heihachi (red), and Nariyoshi (blue) finish seven rounds, by answering multiple-choice Japanese questions correctly. Each of the rounds is comprised of eighteen questions divided into four scenes - and the final scene for every round has four question categories for players to choose from. After completing a round, there is also a bonus scene (similar to Coconuts' Amida) which gives the players a chance to earn a bonus onigiri.": "",
  "You control a small car running around in a maze. What you have to is to pick up the ten green flags to get more points. While you try to collect the flags you are chased by hostile cars that try to crash your car. So dodge them by using your smoke screen. Other factors to take into account are a time limit, fuel gauge and that some roads are blocked by an rock! The right bottom corner of the screen shows a radar map that shows your position (black dot), the location of the hostile cars (red dots) and the position of the flags (green dots). Not shown on the map are the special red flags marked with an S. Collect those for bonus points.": "",
  "Georgie is a young man who lives with his fiancee Miria in the quiet town of Lakeside, repairing large combat robots which are strangely called \"steroids\". One day he discovers several such steroids in the forest, and as he decides to inspect them, unknown flying steroids kidnap Miria. Now Georgie has to pilot a steroid himself and to rescue his beloved one. Ray Gun is a traditional Japanese RPG, with top-down navigation, random turn-based battles viewed from first-person perspective, etc. The combat is usually between the player's steroids and enemy ones. Steroids can attack normally or execute special techniques. Many cut scenes feature nudity.": "",
  "Rotate is a puzzle game in which the player must get his ABCs in the right order. The first sixteen letters of the alphabet are shown shuffled in a four by four grid. The player must get them in the right order by making rotations of two by two blocks. Also once per game the player may switch any two adjacent letters. When the letters are ordered correctly the game will tell the player how long it took him or her.": "",
  "Rotation is a puzzle game where the player is shown a large disc, composed of little balls arranged hexagonally, which he must rotate by parts until it is identical to the little example disc, at which point the next level begins. Clicking one of the balls rotates the six balls around it counter-clockwise. In every level the player has 50 moves to get the disc into the right layout. If the player fails to rotate the disc so that it is identical to the little example disc with 50 moves, it is game over.": "",
  "R-Type is a side scrolling shoot 'em up best known for its extremely tough and strategic gameplay. You control the R-9 spaceship as it launches a last-ditch effort to repel the evil Bydo empire. The R-9 comes equipped as standard with a small gun which can only take down the smallest of enemies without firing several shots. By holding down the fire button, it can be loaded up so as to release a large burst of energy, eliminating all but the strongest enemies in its path. From time to time, pods will come flying in your direction. Upon being shot, they release an upgrade. The first one will invariably be the one called \"The Force\", which is a weapons pod that clings either to the front or the back of your ship, absorbing any enemy bullets or acting as a bumper with which you can fly head-on into them. You can also use it as an offensive weapon by firing it and pulling it back in. Mastering the Force is vital to surviving in R-Type, since it must be used both as protection against bullet clusters, as a remote controlled cannon, and in order to clear the screen from obstacles. Other upgrades give you target-seeking missiles or a bigger main gun. Different gun types, differentiated by their colour, serve different purposes. The blue one sends laser beams bouncing across the screen (good for tunnels), the red one fires straight ahead, and the yellow one follows any walls it may encounter (good for artillery emplacements). The stages of R-Type are made in an organic style, certainly inspired by H. R. Giger's artwork for the Alien movies. When it came out, it was considered trend-setting since it broke off from the stereotypical sci-fi mould of other shoot'em'ups. In part, the levels themselves are your enemy, which is exemplified by the fourth, where spider-like creatures weave webs that cover the screen and block your path, or levels with intricate tunnel systems. Still, the levels are best handled with a combination of strategy and reflexes, without the memorisation that is required of R-Type's contemporary rival, Gradius.": "",
  "Salamander (également connu sous le nom de Life Force) est un shoot'em up dérivé de la série Gradius. Il introduit un système de powerups simplifié, un mode 2 joueurs en coopératif et des niveaux alternant scrolling horizontal et scrolling vertical.": "",
  "In Same Game, the player must clear the entire playfield by selecting at least two adjacent colored cells. Depending on the difficulty setting, the playfield and the number of colors differ (from 5x5 with 3 colors to 20x15 with 4 colors). Once a set is selected, it is removed and the remaining cells are \"consolidated\" (cells above fall down, cells moving to the left if there is a horizontal space). This also means that possible set get destroyed when the cells are moving. As soon as the player removes all cells, the game completes. If even only one cell remains, the game is lost.": "",
  "Scorpius is a horizontally scrolling shoot-em-up in which the player can choose to control one of the three available spaceships on their way through exotic planets populated by hostile alien races. The ships vary in shape and use modified versions of basic weapon types. Each ship starts with a low-damage gun and can upgrade and change the weapon to spreading fire, slow but powerful lightning attack, and others. The ships are also equipped with a claw-like tail, which is activated with a separate button. The tail can attack enemies in a circular motions and retracts back to the ship. Most stages require alternating between firearms and the tail for successful completion.": "",
  "SCRAP! is a game for the iPhone, following the general tradition of building-block type games where you complete lines in exchange for points. The twist that makes SCRAP! interesting is that the orientation you must complete lines in, switches at random and is highlighted along one side of the game board. In lieu of gravity, you have a given amount of time (dependent on your current level/difficulty) to place the piece before it is moved to the SCRAP! pile. Pieces can be retrieved from the SCRAP! pile (limit one per turn) and placed on the game board. Don't let the pile build up too much, or your game will come to an end.": "",
  "The evil lord of the castle is throwing heavy blocks at you. If you stand on the opposite end of the see-saw when a block falls on it, you will be hoisted up in the air. Watch out for green monsters defending the castle's wall that grab either you or the block flying up. If five blocks are on the see-saw at once, it will become immobilized. Lives are lost when you are grabbed by a green monster or when a block crushes you. The object of the game is to fly to the top of the castle and defeat the evil lord.": "",
  "Shanghai is one of the first video game adaptations of the tile-based game played with the Chinese mahjong stones - essentially a puzzle game that has little to do with real mahjong rules. The gameplay involves 144 tiles, each depicting different images, which have to be removed by matching them into pairs. The tiles are arranged in a gridded pattern, which is higher near the centre. A tile can only be removed if it has no tile next to it on at least one side. This computer implementation can generate a random board layout to take on and features five preset challenges, some of which have time limits of five or ten minutes, as well as a multiplayer mode.": "",
  "Shanghai II is a variant of the puzzle game also known as solitaire mahjong. 144 mahjong tiles are arranged in rows and stacked upon each other in various patterns; the player's goal is to remove pairs of matching tiles that do not have adjacent tiles from both sides until the whole board is clear. This variant features six patterns named after animals: tiger, scorpion, monkey, snake, panther, and dragon. The player can choose to display hints or reverse any amount of moves. A mode with a time limit is available as well.": "",
  "Tooru has always been a rather ordinary young man living in modern-day Japan. One day he was taking a stroll with his girlfriend and the two followed a strange cat to a mysterious castle. There, they met an old man who said he was Fermata, the court magician of the Kingdom of Nyuckel located in a parallel dimension where magic dominates over technology. A great war is taking place there. Erion, prince of Nyuckel, was cursed, and his soul transmigrated into Tooru's body. Taking the role of the prince, Tooru must command ten female officers and their armies and repel the invaders. Shangrlia (sic) is a turn-based tactical game. The ten female commanders reside in the castle and can be approached in any order. Each of them transfers the player to a different location (alternating between urban, dungeon-like, and rural areas) where a tactical battle takes place. Every commander is responsible for a unit type in the army. These types include Lancers, Fighters, Swordsmen, Cannoneers, Horsemen, Archers, Mages, Ninjas, Dragon Riders, and Birds. Enemy forces possess the same unit types. Each type has advantages and disadvantages in terms of power, mobility, range, etc. The goal is to select and position units on the battle field, taking the conditions of the terrain, number of enemies, distance, etc. into consideration. Defending own castle and capturing that of the enemy is the top priority. The battles then proceed in a turn-based fashion. Some unit types can attack from a distance, while others are restricted to fighting on adjacent squares. Battles are displayed as animated sequences on a separate screen, their outcome calculated according to the unit's properties and parameters. After each round of victory, the female general removes an item of her clothing. The final result for each general is an erotic picture with partial nudity and implicit sexual scene, but no explicit images.": "",
  "For a while peace was reigning in the magical Kingdom of Hyunckel. However, dark forces have emerged again. Commanding hellish creatures, they managed to capture the top female generals of the Hyunckel army, sealing them in special devices resembling eggs. Only three generals remained free, and they must liberate their companions and re-capture the land. Shangrlia 2 is a turn-based tactical game and a sequel to Shangrlia. The goal of the game is to capture castles occupied by the enemy, freeing commanders on the way. Unlike in the first game, the player is no longer allowed to choose any battle right from the beginning and is at first restricted to only three battles. Same applies to characters and unit types: in the beginning the player can only control three types of fighters, and other characters are unlocked gradually. There are fifteen unit types altogether (as opposed to ten in the previous game). New units include different types of horsemen, chariots, winged horses, golem commanders, etc. In addition, each unit comes in three variations, e.g. catapults and cannons are considered the same type, variants of which can be unlocked by completing battles and freeing them. Each unit gradually advances in strength, and must reach a \"master\" level to be actively selected by the player and positioned on the battle. This time, enemy units are mostly completely different and mainly consist of various monster types such as skeletons, minotaurs, dragons, undead mages, assorted hell creatures etc. Winning battles gradually unlocks erotic pictures of the female generals. The sexual content is noticeably heavier than in the first game and includes non-traditional types of sex as well.": "",
  "Slime Master is a very simple doujin (independent freeware) role-playing game. The player character is sent by a seductive princess to bring back an amulet that was stolen from her. The protagonist then enters a first-person dungeon, which is absolutely linear, consisting of a single corridor navigated by selecting \"advance\" or \"retreat\" from a text menu. Enemies looking like cute little girls dressed in warrior and monster costumes would pop out, resulting in simple turn-based battles where the player can choose to attack or use a scroll. Scrolls pop out at certain spots in the dungeon as well or are won by defeating enemies, and include offensive magic and a cure spell. Experience points are awarded for vanquishing enemies, and the player character levels up. After retrieving the amulet the protagonist returns to the princess, who then takes off her underwear in front of him as a token of gratitude. However, the amulet is immediately stolen once again, and the player has to repeat the same process two more times, fighting identically-looking enemies who nevertheless become stronger, and receiving similar erotic awards for these endeavors.": "",
  "Soft de Hard na Monogatari is the third entry in System Sacom's Novel Ware series. The story has humorous overtones and deals with production of computer games. The protagonist is the son of a software company manager and has to fill in as a temporary leader when his father falls sick and is hospitalized. Himself an avid gamer, the young boss has to use his employee's strengths and his own imagination to produce a successful game such as the \"Nobara Series\" DAME (an obvious parody of DOME). Gameplay-wise, the game abandons the adventure format with its set verb-object commands and interaction with the environment, and plays more like a visual novel with light simulation elements. The player has to make choices for the protagonist, which will advance in-game time and ultimately influence the outcome of the story. It is possible to talk to the employees, check out planned software releases, and make other decisions crucial for the company and the hero's success.": "",
  "Sol-Feace (Sol-Deace in the Genesis) is a typical 2D shooter with weapon powerups. The game features six levels: Sirius, Enemy Arsenal, ArtifiStar, Pluto Base, Almathea, and Final Battle. Along the way various weapons can be picked up including plasma bullets, double plasma bullets, lasers, and missiles. The most unique feature of the game is that you can realign your upgraded guns to fire front-back, up-down, tight spread, wide spread or whatever the current situation required.": "",
  "Sorcerian is the fifth game in the Dragon Slayer series. It is set in the fantasy land known as Pentawa, whose inhabitants are in constant need of protection from ferocious creatures roaming the wilderness. The king of Pentawa hires a party of adventurers, and their first assignment is to retrieve a precious sceptre from a dungeon, where it is guarded by the evil demonic lord Ouks. The game is an RPG with an unusual side-scrolling perspective and action-based combat, somewhat of a cross between Wizardry and platform games. Despite being a Japanese game, Sorcerian resembles Western RPGs of its time, focusing more on character development than story. In the beginning, the player creates a party of four characters, choosing between fighter, wizard, elf, and dwarf (races and classes are not distinguished). Beside the usual inns and shops, there are many things that can be done in the towns of the game, including complex development of magical spells (up to 120 spells of different disciplines), training to raise personal skills (strength, intelligence, etc.), enchanting weapons with elemental magic, as well as looking for part-time jobs. The view switches to side-scrolling when the party ventures into a hostile area. Combat is performed in real time, with the player controlling the entire party at once. The lead character can be changed at any time, and battle actions will be carried out by whoever is in front. Melee attacks and magic spells are unleashed by pressing corresponding buttons. The characters can also jump and interact with objects by bumping into them. Dungeons are usually maze-like, and some contain simple puzzles such as finding and activating hidden switches to open doors.": "",
  "Run? fly? dodge those obstacles, but return fire on wave after wave of attacking aliens. Armed with a really big gun, you have to defend yourself against the alien hordes using your wits to navigate around the screen. But watch out for those end of level bosses! Originating in the arcades, Space Harrier is a third-person rail shooter with pseudo-3D graphics, set in the same world as Fantasy Zone. The lone titular hero fights aliens with a fireball-launching cannon, which can also be used to transform the hero into a flying rocket. The protagonist is constantly in motion, but the speed of his movement can be regulated by the player.": "",
  "In 1978, Earth successfully repulsed an invasion from outer space thanks to \"the Tank.\" The Tank was based on alien technology found when a scout ship had crashed years earlier. Now, over 20 years later, a new Tank has been created based on the technology recovered during the 1978 invasion. And none too soon, because the Invaders are back! Space Invaders is yet another classic arcade game remake by Activision (see Battlezone and Asteroids). But this time, Activision licensed a game from Taito instead of Atari. The game stays close to its roots while adding many power-ups and enemies. You can play either one or two players against the Invaders, who march down the screen in orderly rows and columns, at one of three skill levels. You'll start at Pluto and work your way through the Solar System to Mars, then Venus, and finally Earth. There are four common aliens (red, green, blue, and yellow), plus seven more less common ones. You receive special one shot power-ups by shooting four of the same type of Invaders in a row. As in the original game, there are also Mother Ships that fly above the action, but in this version if you hit them you can pick up other useful power-ups like shields or double shots. Plus, after fighting off several waves on each planet, you'll face a unique boss. If you manage to finish the game, you'll be able to play a reproduction of the original coin-op.": "",
  "The Princess Blue was a trading vessel. While cruising through space, it happened upon a derelict ship floating in space. Only one crew member was allowed to investigate the abandoned ship. Suddenly, Manchi raiders appeared on the viewscreen. The Manchi managed to ambush and destroy the Princess Blue. The only surviving crew member from the Princess Blue swears revenge and is determined to do everything in his power to defeat the Manchi. Space Rogue is a hybrid game that combines space flight and combat simulation with trading and RPG elements such as interaction with characters and a quest-based structure with a main plot line. Space flight takes place in two different modes: Cruise Flight, which is ideal for travelling quickly, and Newtonian Flight, which works best for combat and precision flying. There are also three different camera views for the 3D exploration and combat. Each planetary system has a variety of destinations and obstacles to travel through via a top-down navigational map. Traveling to an outpost, a space station, or any other location with the star system can be done simply by selecting it and charting a course, or in real-time 3D flight mode. Interstellar travel between systems, is done by finding a Malir Gate and using it to reach hyperspace. While in hyperspace, the game becomes a simple 'tunnel' game where the player must manually control the ship not to hit any of the walls. Also hyperspace travel eats away at the ship, so the faster the player can get through them, the more armor the ship retains. While traveling in space the ship may get attacked, or the player may opt to assault any other ships first. It is also possible to buy and sell various goods, earning money and spending it on outfitting the ship with weapons and various upgrades, such as for example a device that allows it to move more stealthily through space and avoid detection by hostiles. The player character has a reputation rating with various factions such as the Imperium, the pirates, and others. This rating is affected by the player's actions towards them and can be raised or lowered by helping specific factions fight others. When docked at outposts or stations, the view shifts to top-down, and the player navigates the protagonist through the location in an adventure or RPG-like fashion, examining objects and talking to characters. Conversations may have multiple choices, and a few instances require the player to type in keywords, though for the most parts responses are selected from a menu. The game has a main plot line that requires finding, talking, and performing tasks for characters, as well as sub-quests that may result in various rewards such as money or ship upgrades.": "",
  "Star Cruiser is one of the earliest Space Invaders/Galaxian variant to appear on the Apple II. Large Space Egg-like shapes make the flying ship targets easier to hit.": "",
  "Star Fighter is a rather generic side-scrolling shoot'em'up with certain Scramble influences. Your plane travels across an undulating landscape where aliens sit at the ground. You can strafe down and shoot them on the ground, or wait until they lift off and fly into your line of sight. Your beam is short and thin, so precision is required in order to hit them before they fly into you. The game starts off in four-colour mode, then switches to black and white high resolution mode, possibly to simulate night flight. Three game speeds are available, and the screen scrolls fast, even at the slowest setting. Unlike the vast majority of games, it scrolls from left to right, instead of the opposite. Due to the use of analogue joysticks, and the speed of your ship, there is a lot of inertia in your control, which feels more realistic than the straight course in which you travel in other similar games.": "",
  "You are a spaceship pilot shooting enemy spacecraft and ground targets. Pick up the special letter symbols for bonuses and additional power-ups. Levels or areas are named after the Greek letter alphabet and the end boss at the end of each area must be defeated before you can continue to the next area.": "",
  "In Star Luster, the player controls Dan Heinick, a pilot of the starfighter Gaia. He is tasked with having to fight the evil being Battura and its minions, who are bent on controlling the entire universe. The game is played from an inside the cockpit view. Players select a location on their interplanetary map and warp to it. Locations that can be flown to include spots that contain enemy clusters and bases. Players have to be aware of the enemy locations, as the enemies can attack and destroy planets and bases if they come close enough to them. When players reach an enemy cluster they have to seek out the enemy ships to engage in battle with, and then blast them away with either laser fire or photon torpedoes. Once all the enemies in a sector are defeated, the player can move on to another location. Firing shots and moving costs the spaceship energy. If the ship is running low on energy, the player has the option to visit a base to refill their energy. Bases can also repair the ships' radar, computer, and engine if they have become to damaged from enemy attacks. The ship also contains a rechargeable shield. Getting hit will temporarily drain the shield, while avoiding enemy fire for a while will refill it. The game features three modes of play. Training mode and Command mode are easier versions of the Adventure mode. They mainly try to get the player prepared for the Adventure mode. The Adventure mode features the most groups of enemies that have to be dealt with and requires the most planning to defend the planets successfully. The Adventure mode also features an optional objective which involves collecting keys from seven different planets in order to access a hidden final planet.": "",
  "Star Mobile is a real-time puzzle game. A large scale is displayed on the screen, and stars continuously fall on it from above. The goal is to move the stars horizontally as they are falling in such a way that the weight on the scale is balance. Each stage contains a set amount of stars required for the player to handle. Stars come in different colors that represent their weight. Both right and left side of the scale contain several spots where the stars can land. If there are too many stars on the same spot, they will fall down, greatly decreasing the weight on the side they were in.": "",
  "As a merchant in the distant future, you captain a starship from system to system, visiting starports to buy and sell cargo until you amass one thousand credits and retire to the quiet life. Fuel, upkeep, and even computer access contribute to overhead expenses. Pirates will get in your way and do costly damage to your ship or even end your career if your aim is slow. When money runs short, however, you can always scoop fuel from a red giant star or swipe some cargo from the ship a few bays down. If you make your deliveries on time, your reputation will bring you better fees. The emphasis of the game is economic; ship-to-ship combat is purely a gallery shoot with moving targets and a possibility of escape. All play is real-time, so even in the starport, your fuel is being used and delivery dates are getting closer. Care must be taken in selecting cargo, as some runs will lose you money for the amount of fuel they consume. Run out of fuel in mid-jump and you're space salvage. Everything happens on one, tripartite game screen showing the view outside your ship, your status (cash, fuel, repair, date, etc.), and the graphical menu below.": "",
  "Star Trek is an unofficial game based on the television series of the same name. In the game the player must defeat all Klingons in the quadrant. At any moment the player can perform the following five actions from within the Enterprise: Fire proton torpedo Shields Computer Map Move Long range scanner In the default view the player can see the objects in the immediate surrounding of the ship: stars or Klingons. When encountering Klingons the player can fire torpedoes in order to defeat them. The player cannot move in the default view and must enter an angle at which to fire a torpedo (which flies in a straight line). If enemy torpedoes are about to hit the player must raise the shields. Moving sends the player to a different screen, this is done by inputting an angle and desired distance. Using the computer map and long range scanner the player can try to find screens that contain objects, which can be either Klingons or harmless stars.": "",
  "Le jeu est concu en graphismes vectoriels relativement simplifiés, et reste finalement très proche du jeu d'arcade d'autrefois, Star Wars The Arcade Game.": "",
  "Star Wars: Attack on the Death Star recreates the final battle from the \"Star Wars\" movie, putting the player at the controls of an X-Wing starfighter. The gameplay is similar to the popular 1983 arcade game: the first stage is a dogfight with TIE Fighters as you approach the station, second one makes you skim Death Star's surface while dodging turbolaser towers, the last one is the torpedo run down the trench. The game features digitized voices (straight from the film) and 3D wireframe vector graphics - this makes the Death Star analysis sequence during the intro look nearly identical to original animation (created with analog computers) used in the movie (shown in the Rebel base briefing room).": "",
  "This is an Adult game! If you start the game from disk1, there are four levels, and you will walk around what looks like a hangar bay with space ships. There are various adult objects lying around that you can collect. At the end of a level there is a female \"boss\", and you get to use the adult objects on her. The gameplay is pretty laggy, and you can only shoot one bullet and need to wait until it has left the screen. The more enemies are on the screen the worse the lag becomes. Enemies don't notice you unless your in their direct line of view (straight in front), but they do see you through walls and will try to shoot you even though they cannot. Generally it is easiest to avoid them rather then shooting at them, with the exception of the female boss at the end of the level which you need to shoot to begin the \"boss\" game. If you start the game directly from disk2, you will go straight to the \"Special Stage Michelle\", here you have a similar adult game as the \"boss\" game at the end of each level of disk1, without having to play the level. The main difference is that the \"boss\" game on disk1 is Japanese Anime style, the one on disk2 is based on photos, and the quality of the photos will depend on the MSX machines capability. For best quality a MSX2+ or TurboR should be used.": "",
  "This version of Street Fighter II is similar in most aspects to the original, save that all 12 characters are selectable from the get-go (the boss characters were originally locked), and the game engine has been revamped.": "",
  "En 2048, un Strider nommé Hiryu parcourt le monde à la recherche du mystérieux Meio, qui règne sur la Terre depuis sa base lunaire.Le joueur contrôle Hiryu, armé de son sabre Falchion, à travers cinq niveaux allant de l'Union Soviétique à la forêt vierge. Hiryu a la particularité de pouvoir s'accrocher aux parois grâce à un crochet métallique, et peut également se faire aider de deux animaux robotiques (un faucon et un tigre) appelés Options.": "",
  "Strip Fighter II is similar to Street Fighter II, but has a distinguishing feature: in this fighting game all the participants are attractive women. Players can choose one of six female characters. The player-controlled character must use her fighting and combat strengths to defeat the other five girls and a palette-swap of herself. The game has some fairly explicit content: during some moves the fighters would take their clothes off; after each fight the player is presented with a picture of female stripper.": "",
  "Super D.P.S. is the fifth entry in the D.P.S./Dream Program System series. Like the other D.P.S. games, it is a collection of three short scenarios, which are unrelated to each other story-wise and can be played separately. Those scenarios are presented as cartridges played on a fictional console named Dream Program System. Each scenario allows the player to choose between two different protagonists, or two different personalities for the protagonist. All of the scenarios feature nudity and/or sexual situations. The scenarios in this game include: A rather disturbing tale entitled Maria and Kanpan, which focuses on a young female robot specialist who falls asleep and is sexually \"explored\" by one of the robots. The player can view the events from either the girl's or the robot's point of view. An adventurous scenario, which depicts the dangers encountered by a young couple in a tropical forest populated by local tribes. The two are imprisoned and have to find a way to escape. The player can choose to control either the heroine or the hero. A scenario with sci-fi elements, involving a famous female space pirate named Camelia, who raids a space ship together with her pretty lieutenant. The story varies according to the player's choice to control Camelia herself, or a male soldier on the ship who captures Camelia's lieutenant. The gameplay is the same as in other D.P.S. games. At almost every screen, the player is given a number of choices, which correspond to answers or actions, according to the situation. Some choices are required to trigger the next event and advance in the game, others are \"neutral\", having no effect on the progress, while a few are considered \"bad\" by the game, leading to Game Over. Scenes, dialogue choices, and story events may vary slightly or significantly, depending on the choice of character in the beginning of a scenario.": "",
  "In Super Hang-On you race a motorcycle around the world, completing each section of track within a time limit. There are other bikes on the road, but beating this is not important, so they can be thought of as moving obstacles. Each continent is a different difficulty level: Africa is beginner, Asia is junior, the Americas are senior, and Europe is expert. This is a very simple and straightforward game, viewed from behind the bike in 2D (so the screen does not tilt with the bike). The right/left controls are steering, and up/down are gear changes. Your cycle is always moving, and your speed strictly depends on the gear you are in, although contact or running off the road slows the bike down. The Sega Genesis version features \"Original mode\" in which the player participates in racing tournaments, hires mechanics, upgrades his bike. This mode uses passwords allowing players to continue a previously played game.": "",
  "The Princess has been kidnapped by the evil Bowser, and it is up to Mario and brother Luigi to save the day. The first ever platform adventure for the Mario Brothers has the player exploring level after level, with Bowser to contend with as the end of level boss. Power-ups include the Super Mushroom, which increases Mario's size and power, the fire flower, allowing him to shoot fireballs at enemies, and the ever important starman for a short burst of invincibility. Each level includes a bonus section filled with coins plus a shortcut through the level, plenty of bad buys and obstacles to get past, and an end of level flag, in which the higher the player grabs it, the more points are awarded to them. Certain levels also include warp points, which takes the player to higher levels.": "",
  "The player takes the role of Seisa, a bald-headed photographer. He likes sneaking into a high school and taking pictures of pretty girls. But one day he was caught and beaten by a girl who didn't want to be photographed. So Seisa plotted an elaborate revenge scheme: he managed to learn a spell that allowed him to look like different girls. Naturally, being one of the girls, it becomes much easier for our heroes to earn their trust - and to seduce them! Sweet Angel differs from the majority of Japanese adventures by allowing the player to physically move in the game world (from top-down perspective). Most important conversations and seduction scenes are still viewed from the traditional first-person perspective, with menu choices for different actions.": "",
  "Sword Master establishes the tale of an evil wizard in league with a monstrous demon who have dared to kidnap a damsel. The Sword Master is a knight who seeks to rescue the fair lady and destroy the evil people and creatures in the castle in which they dwell. It is a parallax side-scrolling action game in which the player must use sword and shield to battle through 7 game levels, from the forest, to a cursed town, to multiple levels of the villain's castle lair. The player will encounter giant bats, wolves, skeleton warriors, evil knights, wizards, lizard men, gargoyles, and other fierce enemies on his quest. The Sword Master can swing his sword, defend with his shield, and gather power-ups which enable him to change his form; for example, the Sword Master can transform into a magic user himself and cast offensive magic spells.": "",
  "Syvalion is a shoot 'em up game in which you take control of a spaceship shaped as a dragon and divided in several segments. The spaceships/dragon can move freely across the screen in all directions and has to fight off robots, spaceships and bosses with his fire attack. When using the fire attack the fuel meter at the bottom off the screen depletes but moving around recharges the meter. Along the way are also indestructible obstacles that have to be evaded. The segments serve as hit points and when taking damage a segment changes color. The game features the following modes: Basic Series: A mode in witch you receive instruction and tips on how to play the game; Real Combat Series: A story mode; Time Attack: A mode where you need to gather as many points as possible before the time reaches zero. The game was later also released as part of a compilation called Taito Legends 2 for the PlayStation 2.": "",
  "You'll start with a bit of bare land and a small bank loan, then establish transportation systems, buy and sell land and businesses, and even invest in the stock market. If all goes well, you'll be rich and powerful. Then you can hop a train and take a first-person 3-D joy ride through your empire. If all doesn't go well... well. you'll have to find out for yourself. Trains, power and money - what more could you want?": "",
  "In Tank Battalion, you control a tank in a maze. One after another, enemy tanks enter the maze, and you must shoot them all before they reach and destroy your base. The maze walls can be shot and destroyed. After all white tanks are destroyed, you proceed to the next level. Each level layout calls for different tactics, depending on the formations of the walls. Some spots on certain levels make for perfect ambush tactics, on other levels you must rally back and forth to eradicate the enemy tanks. Occasionally a red tank appears, shoot it for bonus points.": "",
  "After the dissolution of the Soviet Union in former Warsaw Pact countries many different gangs wanted to take control of as much territory as possible. However those who came later were not strong enough, soon mysterious bombing presents and leaden diseases appeared. Those who survived did not have money or did not want to involve them self into that so they decided to use mercenaries... Player is one of those mercenaries. By choosing one of available classes (commando, saboteur or sniper) you enter Polish cities, woods, factories and work for local mafia.": "",
  "P.T.O. (Pacific Theater of Operations), released as \"Teitoku no Ketsudan\", is a console strategy video game released by Koei. Players must choose one of nine scenarios when starting a game. The first scenario (Negotiations Breakdown) is a long-term campaign, where the player must win the war from mid-1941 before the war is declared. Victory can only be obtained by controlling all ports or eliminating all enemy ships. The other scenarios begin in the midst of a certain major Pacific conflict, where the goal is to capture or defend a certain port or sink or protect a number of enemy ships. If a scenario's goal is achieved, the player can continue with the full campaign.": "",
  "Angels and demons have a disagreement concerning the human race. Some vote for its extermination; other suggest milder solutions. In the end, it is decided to test the humans' abilities. The Earth is invaded by hostile angels and demons of different kind. A boy named Takami is chosen to be the subject of the \"examination\". At the same time, a young woman named Yuima, discovering her celestial heritage and magical powers, decides to put an end to the invasion... The player can choose to begin the game as either Takami or Yuima. Takami is a fighter type with strong physical attacks; Yuima is a magic user. Their stories, however, converge early in the game, after which they fight together in a party. Tenshin Ranma is a traditional first-person 3D dungeon crawler. Enemies appear randomly and must be dealt with in turn-based fashion. Auto-map appears near the main exploration screen, highlighting already explored areas. Leveling up is automatic, like in most Japanese RPGs. Some dungeons have shops, where the heroes can buy weapons and items. There are scenes with nudity and eroticism, but no \"hardcore\" pornographic sex scenes.": "",
  "The original commercially-licensed version of Alexey Pajitnov's classic Tetris puzzle game. Geometric shapes fall from the top of a playfield to rest on the bottom; fit the pieces together, and the line they form disappears. If the pieces don't form lines and eventually stack up to the top of the playfield, the game is over. Difficulty increases by dropping the pieces faster and faster over time.": "",
  "Thanatos is a side-scrolling dragon action game with a dragon protagonist named Thanatos the Destroyer. The large on-screen dragon was animated with a lot of detail on the head, wings and legs, and the background had a semi-3D parallax scrolling system, akin to the semi-3D systems seen in other Durell games such as Fat Worm, Combat Lynx and Turbo Esprit. The game's title music, composed by Julian Breeze, is multi-channeled on the Spectrum's single 'beep' channel, using the same multi-channel engine as some other Durell titles. On Spectrum 128, the title music has actual multiple channels. In the game the player must guide the dragon through the land flying towards the right, and fight its way through a multitude of enemies, both humans and fantasy creatures: sea snakes, giant spiders, a hostile two-headed dragon. They can be burned with the dragon's fiery breath, or they can be grabbed with the dragon's claws and dropped onto other enemies. Boulders can also be picked up and dropped on enemies. To win the game, the dragon's mission is to pick up an enchantress for a ride, then safely deliver her to find a book of spells, and finally take her to a magic cauldron so she may cast her spell. The enchantress brings extra challenge to the task, as she must be kept safe from harm. If Thanatos turns around too fast while flying, she may fall off and must be picked up again. If the sorceress is slain or Thanatos dies, the game will end. The dragon makes its way through a few strongholds, whose gates must be burned through (apparently the castle walls are too tall to fly over). If the dragon runs out of fire breath, it must backtrack to find a virgin strapped to a pole, land nearby, and walk closer to eat the virgin. This will restore the dragon's breath. However, be wary as a knight is waiting in ambush and attacks the dragon while it's landed and vulnerable. The dragon's health is indicated by a beating heart in the bottom of the screen. As the dragon takes hits from enemies the heart starts beating faster and faster, and near death it starts flashing blue. The dragon must withdraw to safety to rest and recover.": "",
  "The 4th Unit 2 is a direct sequel to The 4th Unit. The young and pretty bionic soldier Blon-Win has exposed the dark schemes of the trade organization WWWF. However, a new conspiracy is rising. WWWF has employed another bionic soldier, a young woman named Dalzy, who manages to seal Blon-Win's psychic powers. Blon-Win is arrested by WWWF and must find a way to contact her friends, escape, and defeat the treacherous organization. The sequel follows the same gameplay format, being a predominantly puzzle-less Japanese-style adventure with an interface that combines menu-based verb selection and interaction with objects and characters highlighted on-screen. Compared to the previous games, the gameplay is more streamlined and the menu contains less commands. Rarely used options such as answering \"Yes\" or \"No\" during dialogues or the command \"Rescue\" have been eliminated.": "",
  "Thrice is a puzzle game similar to Columns. You drop blocks consisting of fruit symbols (such as pear, watermelon, plum, etc.) and must match three or more either horizontally, vertically, or diagonally. Unlike in Columns though, here you can't rotate the blocks normally; you must find where you would want a block to fall and once it touches a block, you can press right or left to make the column fall over.": "",
  "Thunder Force II is both a side scrolling and top down shooter. In the game you control a ship. In some stages the action is side scrolling and in others it is top down (overhead). The weapons systems is fairly basic. You can switch from shooting a more powerful weapon straight ahead or two less powerful guns shooting forward and backward simultaneously. There are various power-ups that improve your fire power. In the top down levels you can only travel in cardinal directions and cannot maneuver around obstacles easily or slow down. The control in the side scrolling levels is reminiscent of R-Type or Gradius, but with more basic weapons systems. In future incarnations of the series the top down aspect would be abandoned.": "",
  "Time Pilot is an arcade style shooter. Piloting your trusty spaceship, you need to destroy the squadrons of enemy craft that are attacking! On each level you have a quota of enemies that need to be destroyed. After fulfilling your quota, a final boss of the level will appear; when destroyed, you will move on to the next level. The game begins in the year 1910, and each time a level is completed you advance in time. In 1910 you only have to face relatively unarmed biplanes, but as the levels advance so does the technology. Each new level brings with it tougher, more heavily armed aircraft including jets, helicopters, and even flying saucers! From time to time, you will encounter a parachute; if you run into this, you will earn bonus points.": "",
  "Two dolls, Pino and Acha, have gone into a castle to save their friends who have been kidnapped by the witch Majyo. Toy Pop is a top-down multi-directional shooter that can be played both single-player or with two players simultaneously. The players venture through 44 floors, collecting four gold hearts contained in jars on each floor in order to open a doorway to the next floor. Once you open the exit, you need to hurry as the room will begin to close in around you if you wait. Along the way, the players must open gift-wrapped boxes, concealing weapons, and score-increasing bonus items; these various weapons are used to defeat several different varieties of enemies, including toy soldiers, wind-up cars, balloons, and so on, with many typically vulnerable to only one type of weapon. Some of the boxes also contain punch traps that can stun you or time bombs that will blow you up if you do not get away. If hit by an enemy, you lose your outer clothes and are reduced to underclothes. If you get hit again, you lose a life, but you can look around for a new set of clothes.": "",
  "Two twin brothers, Na Daero and Na Gaeseong, get caught by the police for committing minor crimes. Once released from the prison, the twins begin to plan a more serious theft, hoping for an easy way to wealth and prosperity. However, they are overheard by a mysterious Mr. X, who foils their schemes and departs with their trophies. As the twins try to catch Mr. X, the police is hunting them down, and no one knows how the chase will end. Twins is a Korean-made game that is primarily composed of puzzle adventure segments similar to those of Gobliiins. The player must alternate between the two brothers and use their unique abilities to bypass obstacles and solve puzzles in an enclosed area typically consisting of a few screens. Daero can move heavy objects and use various tools, while Gaeseong is able to jump and is a skillful pickpocket. The game also contains some fighting sequences in which the brothers attempt to take on Mr. X in simple one-screen brawls, and driving sequences where they must escape a police pursuit.": "",
  "U.S. Championship V'Ball, anche conosciuto semplicemente come V'Ball, è un videogioco arcade (coin-op) di sport (beach volley) uscito sotto il marchio Technos nel 1988. La versione arcade è stata distribuita in Nord America da Taito. Una versione per la console domestica Nintendo Entertainment System è stata pubblicata da Nintendo in Nord America e nelle regioni PAL, con il titolo di Super Spike V'Ball. Una conversione del gioco arcade, sviluppata da SPS, è stata rilasciata per il computer Sharp X68000 in Giappone.": "",
  "The Avatar, the embodiment of the Eight Virtues and the hero of Britannia, is called back to deal with a grave threat. Lord British, the country's benevolent monarch, has disappeared, and a man named Blackthorn has usurped his throne. The tyrant rules the land by enforcing the virtues upon the will of the people, corrupting their meaning in the process. His fundamentalist visions led him to create a police state, where failure to adhere to the virtues is punishable by death. Behind Blackthorn are the three Shadowlords, anti-thesis to the three principles of Truth, Love, and Courage. The Avatar must understand their meaning and origins, find a way to defeat them, rescue Lord British, and restore the former ethical principles of Britannia.": "",
  "Several years after having restored Lord British to his rightful position as the monarch of Britannia, the Avatar is captured by demon-like creatures and placed on a sacrificial altar. His friends Iolo, Shamino and Dupre appear just in time to save him. In the Britannia castle, the Avatar learns that his abductors were gargoyles, a race of enigmatic creatures who have recently invaded Britannia and occupied the shrines of Virtue. As the Avatar embarks on a quest to liberate Britannia, he begins to gain insight into the gargoyles' true motives, and realizes that it is his duty to achieve peace and understanding between the two races. Ultima VI is notable for having a fully continuous world. There is no \"world map\" in the game; all the locations are seamlessly connected to each other, turning the game world into an open environment. Compared to the previous installments in the series, the game focuses more on quests and exploration rather than on combat. The latter no longer involves separate screens; battles occur during exploration, without any transitions. The turn-based system from the previous games has been preserved. The interface has been re-designed, the original key-bound commands co-existing with selectable command icons and mouse-based interaction. The game world is more detailed than in the previous games, with a large number of various objects that can be manipulated or added to the inventory. Conversations are more extended, with a wider selection of topics, including many personal ones unique to specific characters. The player is also able to conduct extensive conversations with the Avatar's companions, as well as split the party and control the characters separately. Some important topics may be highlighted during text display, to facilitate further dialogue, which requires the player to type the desired conversation topics. Like in the predecessors, the player is free to explore the game world from the beginning of the game, and visit locations in any order. Following the main quest and obtaining specific items and information is necessary to complete the story; however, the player can also opt to bypass a large part of it by using previous knowledge of the game or outside help. The FM Towns version has full voice acting for all the conversations, in English and in Japanese.": "",
  "Undeadline: Genjuuki is a top-down arcade shooter with scrolling screens, like Commando and other games. The player controls a character that shoots projectiles at enemy monsters. The six levels available are presented in a menu and can be selected and played in any order. There is a boss battle at the end of each one. Chests with power-ups are scattered throughout the levels. They open when shot, and in the Genesis version it is possible to cycle through the available power-ups by keeping firing at them. The power-ups include armor and speed boosts, and several types of projectiles.": "",
  "The classic card game goes portable with this Game Boy Color Version of Uno! Play against a friend with the link cable, and play 2 different versions of the game with up to 4 players. Play to a specific point total and have special cards in the game.": "",
  "In 2080, Tokyo, the capital of Japan, became a center for daring scientific experiments, newest research in space ship technology, and organized crime. A new deadly drug was developed, that enhanced sexual experiences of human beings, eventually subduing their will and turning them into slaves of whoever possessed the drug. A special unit of the police force was assigned to investigate the crimes committed under the influence of the drug, and to find the criminals that distributed it. The player controls the young female investigator Amano Murakumo. Will she be able to survive in this hostile and terrifying world?.. Virgin Angel is a visual novel, i.e. its gameplay consists of decisions that influence the course of the story, instead of true interaction with the game world. There are no command verbs of any kind, but comparatively many points during which the player has to decide what to do next. Some of these decisions may lead to premature end of the game. The game contains sexual scenes, mostly of lesbian kind.": "",
  "The year is 2044 and after the events in Vision, the Rockfellow Tower, a self-contained generation ship for the exploration of deep space, starts off into the unknown universe. But as they enter the tail of a comet and bring the ship up to light speed, the crew realizes that there is something or someone else on the ship who doesn't want the crew to succeed on their mission. The basic game is an adventure in which you see the world through the eyes of the protagonist. You move from screen to screen to find items, talk to the crew in a multiple choice dialogue and solve puzzles to find and eliminate the evil. Always with you is the computer MAX that controls the whole ship. As you move through the Tower he maps all the different levels and also helps you with the riddles and keeps you on the right track. To spice things up a bit, the game also features some action-based mini-games.": "",
  "Although made by Square, the well-known Japanese RPG developer, Wild Card is a game that is very different from classic Asian RPGs. Most importantly, it is not story-driven. The game is based entirely on quests which are not connected by a story arc. You play a nameless character with no background and there is no plot information or development beside your own progress with the quests. The gameplay consists entirely of playing cards. In the beginning of the game, an enigmatic woman named Maria asks you a series of questions, to determine the cards you get. After that, your character begins an adventure in a town. Locations, other characters, inventory, your movement - everything appears in form of cards. To get quests, you must choose your correspondent cards when encountering different people. You can buy weapons and equipment, and also fight enemies in turn-based combat by choosing the cards from your deck. You gain levels and become stronger in a traditional RPG fashion.": "",
  "You are an allied fighter pilot in WW1, duking it out with the \"Huns\" up in the sky in over 200 missions. The missions usually come in three flavors: Top-down view bombing missions where you have to take out strategically important targets, isometric strafing runs where you get to blast anything that you fancy blasting with an unlimited supply of ammo, and of course the main part: Dogfights in the sky. Rendered in 3D, seems from behind your head. The game is set in the years 1916 through 1918, and to loosen things up a little, we get to read a page of our character's new entry for the diary-like journal in his company between every mission.": "",
  "Winning Post lets the player take control of a stable of horse, breeding and training them for the ultimate goal, to win the French Grand Prix. The player can hire breeders, trainers and jockeys and race in over 240 different races to earn more money to buy even better personnel and breed faster and stronger horses as well as keeping their horses healthy. Players can also bet on races as well. The gameplay consists of choosing options before races, such as choosing which horses to train and what regiment they undertake, view stats, hire personnel and place bets. However the player has no controls over races and cannot participate and only view as a spectator.": "",
  "God had created the world with Light and Shadow completing each other, maintaining the balance of events. The Tribe of Light are humans, living on the surface; the Tribe of Shadow has many different creatures, who dwell underground. To sustain peace and harmony between the tribes, a huge stone tablet called Words Worth was erected. But one day, someone has shattered the tablet. Both Tribes blamed each other and began a bloody war that has been raging for hundred years. Finally, the king of the Shadow Tribe sends his son, the brave Astral, to find out what really happened to the tablets, and to restore peace in the world. Words Worth is primarily a first-person dungeon crawler. Even though there are a few \"friendly\" areas, such as a town where the hero can rest and buy supplies, most of the game is spent in dungeon-like, maze-like areas (with an auto-map feature). There is no party in the game: Astral has to face the enemies alone. The enemies appear randomly, and the combat is turn-based. The game has scenes with nudity and sexual situations.": "",
  "Wrecking Crew is a platform action game for one or two players. Players control Mario and Luigi, who need to demolish various buildings. After each wall in the building has been destroyed, players move on to the next (and more difficult) building. Many of the buildings have a puzzle element to them; players may need to find the path to reach all of the walls without the heroes getting trapped at a dead end. Wandering throughout the buildings are dangerous creatures and the construction foreman, all of whom will stop Mario and Luigi from completing their task. The game features 100 levels. A construction set is included, allowing players to create and play their own buildings.": "",
  "Wrestle Angels 3 is, like its predecessors in the series, a turn-based wrestling-themed game. The player takes the role of the manager of a new company that represents and trains young wrestlers, guiding them to participate in an all-female league. Wrestlers can be selected and hired either directly by following the league's records, or by scouting the city and recruiting suitable candidates. Afterwards the wrestlers can be trained by choosing and investing points into particular moves. It is also possible to send them on vacations. Most actions in that preparation mode cost action points (AP); running out of them ends the turn. The manager can then send the wrestlers to participate in tournaments. The actual wrestling matches can be set in auto, with their outcome determined by the wrestlers' parameters. However, it is also possible to control them manually, choosing each move from a deck of randomly dealt cards. Moves include attacks, special attacks of various kinds, charging, healing, etc. There is also an exhibition mode where the player can select any of the 48 available wrestlers and take them to single or tag-team matches.": "",
  "Hace doscientos cincuenta años, el dios \"Duel\" derrotó al demonio malvado llamado \"Badu\", encerrándolo en una montaña de hielo. Ahora Badu ha logrado escapar de su prisión. Los demonios han invadido la tierra, y el rey de Wavis ha enviado un mensajero al guerrero conocido como Dork Kart, pidiéndole que defienda el país. Sin embargo, Dork está ausente, y su hijo Latok, de dieciséis años, decide seguir las órdenes del rey, hasta enfrentarse al mismísimo \"Badu\". Xak: The Art of Visual Stage es un juego de rol de acción, en el que Latok viaja por el mundo de Xak, explorando sus entornos al aire libre y mazmorras, eliminando a muchos enemigos que encuentra en su camino. Los enemigos derrotados otorgan puntos de experiencia al jugador, lo que le permite a Latok subir de nivel y volverse más fuerte. El protagonista a menudo necesita cumplir con requisitos de nivel para empuñar ciertas armas y/o equiparse con una mejor armadura.": "",
  "Xenon 2: Megablast is a vertically scrolling space shooter, in which you have to pass several levels, filled with waves of enemies, that all end with a level boss creature. Each group of enemies you destroy grants you a cash reward and every once in a while you enter Colin's Bargain Basement, where you can use this cash to purchase upgrades for your ship like better weapons, speed & health upgrades etc. Some upgrades can also be picked up during the levels. The first part of the game has an organic feel to it, while the second part of the game features mechanical enemies. As there are some maze-like sections with dead-ends in the game, your spaceship scrolls backwards when you keep pressing the down key.": "",
  "A hundred thousand years ago, an ancient civilization prospered on our Earth, their product being GAMP (General Artificial Matrix Producer). In order to survive the Ice Age, most of the Earth's inhabitants have decided to leave it, finally settling on a planet called Xevious. A group of humans remained, becoming our own ancestors. Many years have passed, and the Xevians are now planning a massive comeback to their long-lost homeland. The pilot Mu, his android companion Eve, and Mio, a Xevian who opposes the GAMP regime, are back from a space travel just in time to warn the Earth of the upcoming invasion. The prototype fighter craft Solvalou is going to be used as the main weapon against the Xevian attack. Xevious is a vertically-scrolling shooter which is notable for being the first game of that type to feature an aircraft flying over the Earth (as opposed to the outer space in other games), displaying views of South American nature. It also introduced, for the first time, two types of enemies to fight: aerial and ground-based (the menacing SOL towers invoked by GAMP to aid their planes). The player-controlled ship, Solvalou, is equipped with two weapons, each assigned to a button: the Zapper for air enemies, and the Blaster, which drops bombs on ground targets with the aid of a lock-on. The aerial enemies are divided into sub-categories distinguished by their attack and behavior patterns. Certain enemy types are immune to Solvalou's weapons, and must be avoided.": "",
  "Tetsu is a young warrior who has left his home country in order to serve human rulers in their battle against the dark elves. But one day the valiant knight was heavily wounded in battle. Unconscious, he was found by a female fighter named Mei, who brought him to her house and cured him. Grateful, Tetsu promises Mei to help her venture into the huge tower standing nearby, which was built by the princess of the country and is now overrun by monsters... X?na is a dungeon crawler very similar to early Dragon Knight games, but without erotic content. Most of the activity in the game takes place in the gigantic maze-like tower. The player has to explore it, finding the correct way to upper floors (without auto-map feature). In town, it is possible to buy weapons and rest. The player controls only Tetsu and Mei during the entire game, as they fight random enemies in turn-based combat, gaining levels. The combat system is very simple, relying on preparation and level-building. Mei can cast healing magic, which depletes magic points (MP).": "",
  "Miyu Izawa is a designer working for the prosperous Studio Yo in central Tokyo. She is nicknamed \"famous detective\" because of her unusually sharp perception: since her childhood, she has possessed an inexplicable \"sixth sense\" that warns her of danger by coloring her vision red. When her former classmate and successful model Marie is brutally murdered, Miyu decides to use her special senses and investigate the mysterious circumstances of her death. The sixth installment in System Sacom's Novel Ware series, Yami no Ketsuzoku is a Japanese-style adventure game. The player interacts with the environment by selecting objects to look at, conversation topics, and locations to travel to from a menu. There are no puzzles or inventory items to use. The game features extended text descriptions, cutscenes, and dialogues which sometimes prompt the player to make choices for the heroine.": "",
  "In the far future, human beings learned to travel to faraway solar systems; as a result, human civilization has spread across the entire galaxy. However, as they tried to explore the outer space beyond it, they encountered a huge black hole. It was said that a strange light emanated from it. A brave scientist and pilot named Sonya traveled to the black hole, and discovered a medieval-like world, whose inhabitants consider her a divine savior... Despite the side-scrolling perspective for navigation, Yesterday is an RPG without any action elements, similar to its \"sister games\" Caroll and Emerald Densetsu. The player navigates the heroine through vast side-scrolling environment, fighting randomly appearing enemies. During the turn-based battles, the game switches to first-person view. Items and equipment can be bought in friendly areas. Leveling up is automatic; magic spells are learned depending on the protagonist's level.": "",
  "Après qu'une brillante lueur soit apparue au dessus de la Tour de Dahm, Adol Christin est retrouvé inconscient par une jeune fille nommée Lilia. Celle-ci lui dit qu'il se trouve dans le monde d'Ys...": "",
  "Described by its developers as a \"New Type Role-Playing Game\", Zavas differs from the Japanese-made RPGs by resembling a Western-style RPG, in particular the Ultima games of its time. Retaining the characteristically Japanese manga/anime aesthetics in graphics, Zavas has little resemblance to Japanese RPGs in other aspects. It is not story- and character-driven; the player controls a knight named Mardy in the medieval fantasy land of Fargana (with slight Middle Eastern influences), and is free to go anywhere, exploring the world without following a set storyline. The top-down world consists of vast wilderness areas and towns. Similarity to Western RPGs is evident in detailed management of player-controlled party (NPCs with names and portraits, but little personality can be found and recruited). beside the usual weapon, armor, and item management, the player must also buy food to keep his characters alive. Some of the interaction with NPCs offers choices (for example, paying money or attacking a guard who demands toll to enter a city). The enemies appear randomly. The turn-based combat is very similar to that of Ultima games, with characters freely moving around a fixed battle screen.": "",
  "Zugya is a multidirectional scrolling shoot'em up, in which you will have to destroy modules with increasingly complex structures throughout the game's 50 levels.": ""
}