{
  "Armored Unit (Armored Unit)": "",
  "Bakusou Dekotora Densetsu (Bakusou Dekotora Densetsu)": "",
  "Beatmania (Beatmania)": "",
  "Buffers Evolution (Buffers Evolution)": "",
  "Cardcaptor Sakura - Sakura to Fushigi na Clow Card (Cardcaptor Sakura - Sakura to Fushigi na Clow Ca...": "",
  "Ch Aniki: Otoko no Tamafuda (Ch Aniki: Otoko no Tamafuda)": "",
  "Chaos Gear - Michibikareshi Mono (Chaos Gear - Michibikareshi Mono)": "",
  "Chocobo no Fushigi na Dungeon for WonderSwan (Chocobo no Fushigi na Dungeon for WonderSwan)": "",
  "Chou Denki Card Game - Youfu Makai - Kikuchi Shuuk (Chou Denki Card Game - Youfu Makai - Kikuchi Shu...": "",
  "Clock Tower (Clock Tower)": "",
  "Crazy Climber (Crazy Climber)": "",
  "Densha de Go! (Densha de Go!)": "",
  "Densha de Go! 2 (Densha de Go! 2)": "",
  "Digimon - Ver. WonderSwan (Digimon - Ver. WonderSwan)": "",
  "Digimon - Ver. Wonderswan (Digimon - Ver. Wonderswan)": "",
  "Digimon Adventure 02: Tag Tamers (Digimon Adventure 02: Tag Tamers)": "",
  "Digimon Adventure: Anode Tamer (Digimon Adventure: Anode Tamer)": "",
  "Digimon Adventure: Cathode Tamer (Digimon Adventure: Cathode Tamer)": "",
  "Digital Partner (Digital Partner)": "",
  "Dokodemo Hamster (Dokodemo Hamster)": "",
  "D's Garage 21: Koubo Game - Tane wo Maku Tori (D's Garage 21: Koubo Game - Tane wo Maku Tori)": "",
  "Engacho! for Wonderswan (Engacho! for Wonderswan)": "",
  "Fever: Sankyo Koushiki Pachinko Simulation (Fever: Sankyo Koushiki Pachinko Simulation)": "",
  "Final Lap 2000 (Final Lap 2000)": "",
  "Fire Pro Wrestling for WonderSwan (Fire Pro Wrestling for WonderSwan)": "",
  "Fishing Freaks: BassRise for WonderSwan (Fishing Freaks: BassRise for WonderSwan)": "",
  "From TV Animation One Piece - Mezase Kaizoku Ou! (From TV Animation One Piece - Mezase Kaizoku Ou!)": "",
  "Ganso Jajamaru-kun (Ganso Jajamaru-kun)": "",
  "Glocal Hexcite (Glocal Hexcite)": "",
  "Gomoku Narabe & Reversi Touryuumon (Gomoku Narabe & Reversi Touryuumon)": "",
  "Goraku Ou Tango! (Goraku Ou Tango!)": "",
  "GunPey (GunPey)": "",
  "Hanafuda Shiyouyo (Hanafuda Shiyouyo)": "",
  "Harobots (Harobots)": "",
  "Hunter X Hunter - Ishi wo Tsugu Mono (Hunter X Hunter - Ishi wo Tsugu Mono)": "",
  "Kakutou Ryouri Densetsu Bistro Recipe - Wonder Bat (Kakutou Ryouri Densetsu Bistro Recipe - Wonder B...": "",
  "Kaze no Klonoa: Moonlight Museum (Kaze no Klonoa: Moonlight Museum)": "",
  "Keiba Yosou Shien Soft - Yosou Shinkaron (Keiba Yosou Shien Soft - Yosou Shinkaron)": "",
  "Kiss Yori... - Seaside Serenade (Kiss Yori... - Seaside Serenade)": "",
  "Kosodate Quiz Dokodemo - My Angel (Kosodate Quiz Dokodemo - My Angel)": "",
  "Kyousouba Ikusei Simulation: KEIBA (Kyousouba Ikusei Simulation: KEIBA)": "",
  "Langrisser Millennium WS - The Last Century (Langrisser Millennium WS - The Last Century)": "",
  "Last Stand (Last Stand)": "",
  "Lode Runner for WonderSwan (Lode Runner for WonderSwan)": "",
  "Macross - True Love Song (Macross - True Love Song)": "",
  "Magical Drop for WonderSwan (Magical Drop for WonderSwan)": "",
  "Mahjong Touryuumon (Mahjong Touryuumon)": "",
  "Makaimura for WonderSwan (Makaimura for WonderSwan)": "",
  "Medarot Perfect Edition - Kabuto Version (Medarot Perfect Edition - Kabuto Version)": "",
  "Medarot Perfect Edition - Kuwagata Version (Medarot Perfect Edition - Kuwagata Version)": "",
  "Meitantei Conan: Majutsushi no Chsenj! (Meitantei Conan: Majutsushi no Chsenj!)": "",
  "Meitantei Conan: Nishi no Meitantei Saidai no Kiki (Meitantei Conan: Nishi no Meitantei Saidai no Ki...": "",
  "Metakomi Theraphy - Nee Kiite! (Metakomi Theraphy - Nee Kiite!)": "",
  "Mingle Magnet (Mingle Magnet)": "",
  "Mobile Suit Gundam MSVS (Mobile Suit Gundam MSVS)": "",
  "MobileWonderGate (MobileWonderGate)": "",
  "Moero!! Pro Yakyuu Rookies (Moero!! Pro Yakyuu Rookies)": "",
  "Morita Shougi (Morita Shougi)": "",
  "Nazo Ou Pocket (Nazo Ou Pocket)": "",
  "Nice On (Nice On)": "",
  "Nippon Pro Mahjong Renmei Kounin Tetsuman (Nippon Pro Mahjong Renmei Kounin Tetsuman)": "",
  "Nobunaga no Yabou (Nobunaga no Yabou)": "",
  "Ou-chan no Oekaki Logic (Ou-chan no Oekaki Logic)": "",
  "Pocket Fighter (Pocket Fighter)": "",
  "Pro Mahjong Kiwame (Pro Mahjong Kiwame)": "",
  "Puyo Puyo 2 (Puyo Puyo 2)": "",
  "Puzzle Bobble (Puzzle Bobble)": "",
  "Rainbow Islands: Putty's Party (Rainbow Islands: Putty's Party)": "",
  "Ring Infinity (Ring Infinity)": "",
  "Robot Works (Robot Works)": "",
  "Rockman & Forte - Mirai Kara no Chousensha (Rockman & Forte - Mirai Kara no Chousensha)": "",
  "San Goku Shi for WonderSwan (San Goku Shi for WonderSwan)": "",
  "Sangokushi II for WonderSwan (Sangokushi II for WonderSwan)": "",
  "SD Gundam - Emotional Jam (SD Gundam - Emotional Jam)": "",
  "SD Gundam Gashapon Senki - Episode 1 (SD Gundam Gashapon Senki - Episode 1)": "",
  "SD Gundam G-Generation - Gather Beat (SD Gundam G-Generation - Gather Beat)": "",
  "Senkaiden - TV Animation Senkaiden Houshin Engi Yo (Senkaiden - TV Animation Senkaiden Houshin Engi ...": "",
  "Sennou Millennium (Sennou Millennium)": "",
  "Shanghai Pocket (Shanghai Pocket)": "",
  "Shin Nippon Pro Wrestling Toukon Retsuden (Shin Nippon Pro Wrestling Toukon Retsuden)": "",
  "Shin Seiki Evangelion : Shito Ikusei (Shin Seiki Evangelion : Shito Ikusei)": "",
  "Shougi Touryuumon (Shougi Touryuumon)": "",
  "Side Pocket (Side Pocket)": "",
  "Slither Link (Slither Link)": "",
  "Soccer Yarou! - Challenge the World (Soccer Yarou! - Challenge the World)": "",
  "Sotsugyou for WonderSwan (Sotsugyou for WonderSwan)": "",
  "Space Invaders (Space Invaders)": "",
  "Super Robot Taisen Compact (Super Robot Taisen Compact)": "",
  "Super Robot Taisen Compact 2 - Dai-1-bu - Chijou G (Super Robot Taisen Compact 2 - Dai-1-bu - Chijou...": "",
  "Super Robot Taisen Compact 2 - Dai-2-Bu - Uchuu Ge (Super Robot Taisen Compact 2 - Dai-2-Bu - Uchuu ...": "",
  "Super Robot Taisen Compact 2 - Dai-3-bu - Ginga Ke (Super Robot Taisen Compact 2 - Dai-3-bu - Ginga ...": "",
  "Taikyoku Igo - Heisei Kiin (Taikyoku Igo - Heisei Kiin)": "",
  "Tanjou Debut for WonderSwan (Tanjou Debut for WonderSwan)": "",
  "Tare Panda no GunPey (Tare Panda no GunPey)": "",
  "Tekken Card Challenge (Tekken Card Challenge)": "",
  "Terrors (Terrors)": "",
  "Tetsujin 28 Gou (Tetsujin 28 Gou)": "",
  "Time Bokan Series - Bokan Densetsu - Butamo Odater (Time Bokan Series - Bokan Densetsu - Butamo Odat...": "",
  "Tokyo Majin Gakuen - Fuju Houroku (Tokyo Majin Gakuen - Fuju Houroku)": "",
  "Trump Collection - Bottom-Up Teki Trump Seikatsu (Trump Collection - Bottom-Up Teki Trump Seikatsu)": "",
  "Trump Collection 2 - Bottom-Up Teki Sekaiisshuu no (Trump Collection 2 - Bottom-Up Teki Sekaiisshuu ...": "",
  "Turntablist - DJ Battle (Turntablist - DJ Battle)": "",
  "Umizuri ni Ikou! (Umizuri ni Ikou!)": "",
  "Uzumaki: Denshi Kaikihen (Uzumaki: Denshi Kaikihen)": "",
  "Uzumaki: Noroi Simulation (Uzumaki: Noroi Simulation)": "",
  "Vaitz Blade (Vaitz Blade)": "",
  "Wonder Stadium (Wonder Stadium)": "",
  "Wonder Stadium '99 (Wonder Stadium '99)": "",
  "Wonderswan Handy Sonar (Wonderswan Handy Sonar)": "",
  "wuzb? Produce: Street Dancer (wuzb? Produce: Street Dancer)": "",
  "Anchor Field 2 (Anchor Field 2)": ""
}