{
  "Banana (VTech, Time & Fun)": {
    "key": "Banana (VTech, Time & Fun)",
    "original_name": "Banana (VTech, Time & Fun)",
    "name": "香蕉",
    "name_source": "api",
    "original_desc": "Move a busy thrash man around the street to clean banana peels. When a pedestrian falls on a banana peel, one miss is scored. Five misses and game ends. \n1 point is scored for each safe pedestrian.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:45:50",
    "desc_translated_at": "",
    "original_name_hash": "1efe1a82",
    "original_desc_hash": "8b6e451d"
  },
  "Baseball (VTech, Explorer Time & Fun)": {
    "key": "Baseball (VTech, Explorer Time & Fun)",
    "original_name": "Baseball (VTech, Explorer Time & Fun)",
    "name": "棒球",
    "name_source": "api",
    "original_desc": "Train baseball by playing with your coach. Move the player left and right to get all balls. When a ball falls to the ground, a chance is missed. Three misses and game ends. 10 points are scored each time a ball is hit. A quick rest is awarded at every 1000 points. Maximum displayed score is 9990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:45:51",
    "desc_translated_at": "",
    "original_name_hash": "2a7398cb",
    "original_desc_hash": "9b548011"
  },
  "Bomb Fight (VTech, Mini Time & Fun)": {
    "key": "Bomb Fight (VTech, Mini Time & Fun)",
    "original_name": "Bomb Fight (VTech, Mini Time & Fun)",
    "name": "炸彈戰",
    "name_source": "api",
    "original_desc": "An angry lion is throwing bombs to a peaceful elephant. Playing the elephant, you have to spit water to bombs to defuse them before they explode. Misses: one miss per exploded bomb. Three misses and game ends. 10 points are awarded when the elephant successfully defuses a bomb. All bombs are cleared at every 1000 points. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:45:51",
    "desc_translated_at": "",
    "original_name_hash": "a5ec9e12",
    "original_desc_hash": "1dc36477"
  },
  "Casio-HF": {
    "key": "Casio-HF",
    "original_name": "Caccia Al Ladro",
    "name": "抓小偷",
    "name_source": "api",
    "original_desc": "Help Heathcliff the cat to prevent Sonja's fish to be stolen by a thief, or she'll shout at him in anger. Spike the dog disturbs Heathcliff's action. Misses: one miss per cleared dish of fish. Three misses and game ends. 10 points are awarded when Heathcliff successfully attacks a thief. All fish are restored at every 1000 points. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:15",
    "desc_translated_at": "",
    "original_name_hash": "fe85d4cf",
    "original_desc_hash": "6a6b38d6"
  },
  "Casio-SF": {
    "key": "Casio-SF",
    "original_name": "Cessate Il Fuoco",
    "name": "停火",
    "name_source": "api",
    "original_desc": "Help Heathcliff the cat to prevent Sonja's flowers from being burned by flaming sticks thrown by an enemy cat. Spike the dog watches from behind the fence. Misses: one miss per burnt flower. Three misses and game ends. 10 points are awarded when Heathcliff successfully extinguishes a flame. All flames are cleared at every 1000 points. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:16",
    "desc_translated_at": "",
    "original_name_hash": "4af72627",
    "original_desc_hash": "658654a9"
  },
  "Chicky Woggy (VTech, Arcade Time & Fun)": {
    "key": "Chicky Woggy (VTech, Arcade Time & Fun)",
    "original_name": "Chicky Woggy (time And Fun) (VTech, Arcade Time & Fun)",
    "name": "小雞沃吉",
    "name_source": "api",
    "original_desc": "Help Chicky Woggy fill the labyrinth with eggs, while wolves chase her. Chicky Woggy can move across bridges, subways and tunnels to escape wolves. As soon as Chicky Woggy eats magic worms, she can chase and defeat wolves for a short period of time. When the labyrinth is full of eggs, Chicky Woggy moves to a new empty labyrinth. Three misses and game ends. 10 points are scored each time an egg is laid. 50 points are scored each time a worm is eaten. 200 to 400 points are scored each time a wolf is defeated. Bonus life is awarded at 2000 points. Maximum displayed score is 99990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:17",
    "desc_translated_at": "",
    "original_name_hash": "b71e12c1",
    "original_desc_hash": "62649818"
  },
  "Condor (VTech, Time & Fun)": {
    "key": "Condor (VTech, Time & Fun)",
    "original_name": "Condor (VTech, Time & Fun)",
    "name": "禿鷹",
    "name_source": "api",
    "original_desc": "Move a caveman to prevent condors from stealing his food, then entrap them. When a condor gets a piece of food, one miss is scored. Five misses and game ends. 1 point is scored each time you entrap a condor. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:40",
    "desc_translated_at": "",
    "original_name_hash": "f2eda956",
    "original_desc_hash": "361a3999"
  },
  "Defendo (VTech, Explorer Time & Fun)": {
    "key": "Defendo (VTech, Explorer Time & Fun)",
    "original_name": "Defendo (VTech, Explorer Time & Fun)",
    "name": "防禦",
    "name_source": "api",
    "original_desc": "Enemy soldiers continuously move towards your camp from three paths, trying to steal your Army's gold. Move the brave soldier to prevent soldiers from reaching the camp. When an enemy successfully reaches the camp, a chance is missed. Five misses and game ends. 1 point is scored each time an enemy soldier is hit. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:41",
    "desc_translated_at": "",
    "original_name_hash": "c0c778d7",
    "original_desc_hash": "5d04d981"
  },
  "Donkey Kong (Coleco)": {
    "key": "Donkey Kong (Coleco)",
    "original_name": "Donkey Kong (Coleco)",
    "name": "大金剛",
    "name_source": "api",
    "original_desc": "Move Mario to make him rescue his girlfriend, kidnapped by Donkey Kong. In odd levels, Donkey Kong throws barrels at Mario. Operate Mario and take him to the top of the building, making him avoid barrels. In even levels, operate Mario in order to remove all rivets from the girders by walking above them. Fireballs hang around: be sure Mario won't touch them! Additional info: don't let Mario move too left or right of the girders or he'll fall down; the left ladder on the second girder is a \"safe position\" from barrels; Mario can walk, not jump through the electric fence below Donkey Kong.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:46:42",
    "desc_translated_at": "",
    "original_name_hash": "1b15b1f3",
    "original_desc_hash": "b609984d"
  },
  "Donkey Kong (Nintendo, Multi Screen)": {
    "key": "Donkey Kong (Nintendo, Multi Screen)",
    "original_name": "Donkey Kong (multi Screen) (Nintendo, Multi Screen)",
    "name": "大金剛",
    "name_source": "api",
    "original_desc": "Mario must reach the top of the structure, activate a lever which will put a crane in his reach. Then he must jump for the crane and demolish little by little the structure on which Donkey Kong is standing in order to rescue Pauline.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:04",
    "desc_translated_at": "",
    "original_name_hash": "4f7551e9",
    "original_desc_hash": "07e4cf05"
  },
  "Donkey Kong Circus (Nintendo, Panorama Screen)": {
    "key": "Donkey Kong Circus (Nintendo, Panorama Screen)",
    "original_name": "Donkey Kong Circus (Nintendo, Panorama Screen)",
    "name": "大金剛馬戲團",
    "name_source": "api",
    "original_desc": "Donkey Kong juggles pineapples while balancing on a barrel. Catch the pineapples, but beware of fireballs. Donkey Kong will automatically toss the pineapples he catches. Mario watches his juggling performance. Lives are lost either if a pineapple falls on the floor or if Donkey Kong touches a fireball. Mario laughs at Donkey Kong as he misses. Three misses and game ends. 1 point for each pineapple Donkey Kong catches and tosses. Maximum displayed score is 999. At 300 points fanfare sounds and all misses are canceled. If there are no misses when 300 points are reached, game goes into \"Chance-Time\": all points are awarded at double value (2 points per pineapple caught) until a miss is made.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:06",
    "desc_translated_at": "",
    "original_name_hash": "f0f13ede",
    "original_desc_hash": "695d15d3"
  },
  "Donkey Kong II (Nintendo, Multi Screen)": {
    "key": "Donkey Kong II (Nintendo, Multi Screen)",
    "original_name": "Donkey Kong II (Nintendo, Multi Screen)",
    "name": "大金剛2",
    "name_source": "api",
    "original_desc": "A continuation of the famous Donkey Kong Story. Now Mario has chained Donkey Kong. Donkey Kong Junior braves snapjaws, sparks and birds, throwing the key which will open Donkey Kong's locks, up to where his papa is held prisoner. Avoid sparks overhead and make Junior jump and throw key to upper screen. When a snapjaw attacks, make Junior jump without hitting overhead spark. When Junior reaches the upper screen, he has to jump to get the key he threw again. The key jumps to one of the four locks. \n- Press top of \"PLUS\" button when on top of chain. A lock opens.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:07",
    "desc_translated_at": "",
    "original_name_hash": "085149e0",
    "original_desc_hash": "fb0c4a59"
  },
  "Donkey Kong Jr": {
    "key": "Donkey Kong Jr",
    "original_name": "Donkey Kong Jr. (table Top) (Nintendo, Table Top)",
    "name": "小金剛",
    "name_source": "api",
    "original_desc": "Donkey Kong has been captured and chained by Mario. Donkey Kong Jr. goes to papa's rescue with key he needs to open the locks on the chains. Junior is attacked by fierce birds. He uses umbrellas to leap from heights, and balloons to get up there, opening the locks on the way. When he opens all 4 locks, papa is free. Each time he opens one lock, he must go back to START to retrieve the key, then sets out again is lost. With three misses game ends. 1 point when Junior jumps to umbrella or balloon. 2 to 10 points when Junior hits fierce bird with coconut. 10 points when Junior opens one lock. 10 points (extra bonus) when Junior opens all four locks. When score reaches 300 points and there are one or two misses, all the misses are cleared with fanfare. If there are no misses when a 300 score is reached, game goes into \"CHANCE TIME\". Score flashes and all the points are awarded at double value until a miss is scored. Maximum displayed score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:29",
    "desc_translated_at": "",
    "original_name_hash": "794dc9eb",
    "original_desc_hash": "e9deddc6"
  },
  "Dungeons & Dragons Computer Fantasy Game (Mattel Electronics, Arcade Action Series)": {
    "key": "Dungeons & Dragons Computer Fantasy Game (Mattel Electronics, Arcade Action Series)",
    "original_name": "Dungeons & Dragons Computer Fantasy Game (Mattel Electronics, Arcade Action Series)",
    "name": "龍與地下城電腦奇幻遊戲",
    "name_source": "api",
    "original_desc": "Press ATTACK button to get out of demo mode; screen shows L1, for skill level 1. Press MOVE button 1 or 2 times, to select skill level 2 or 3. Press it again and you go back to level 1. Level 1: warrior possesses magic rope at start of game. Level 2: magic rope is hidden randomly and must be found to be used. Level 3: there is no magic rope. You see score ONLY when you slay the dragon. You score 1 point per each 5 seconds of spent time. Maximum number of points possible is 99 (then game is over). The lowest score is the best score! Click on the Attack button after game ends to start a new game, or hold it for 5 seconds to put the game in demo mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:30",
    "desc_translated_at": "",
    "original_name_hash": "f7a122b5",
    "original_desc_hash": "0a43f822"
  },
  "Egg (Nintendo, Wide Screen)": {
    "key": "Egg (Nintendo, Wide Screen)",
    "original_name": "Egg (Nintendo, Wide Screen)",
    "name": "蛋",
    "name_source": "api",
    "original_desc": "Chickens lay eggs. Control the wolf so that he catches them in his cap. When the wolf drops an egg, one miss is scored. The cock appears/disappears at every five seconds. When the cock appears while egg falls, half miss is scored (miss mark blinks). Three full misses and game is over. 1 point per caught egg. At 200 and 500 points, if there are one or more misses, fanfare sounds and all misses are canceled.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:32",
    "desc_translated_at": "",
    "original_name_hash": "e5c17245",
    "original_desc_hash": "2bf078f4"
  },
  "Engine Room (VTech, Explorer Time & Fun)": {
    "key": "Engine Room (VTech, Explorer Time & Fun)",
    "original_name": "Engine Room (VTech, Explorer Time & Fun)",
    "name": "機房",
    "name_source": "api",
    "original_desc": "The love boat engine needs coal, or it'll stop cruising across the ocean. Move a busy worker in order to throw coal continuously into the furnace. When a lot of coal is not supplied, a chance is missed. A mate appears occasionally, bringing some tea to our character (game B only). Three misses and game ends. 10 points are scored each time a lot of coal is thrown into the furnace. 50 points are scored each time the worker drinks some tea. A quick rest is awarded at every 1000 points. Maximum displayed score is 9990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:54",
    "desc_translated_at": "",
    "original_name_hash": "72032ceb",
    "original_desc_hash": "75b97ec1"
  },
  "Escape (VTech, Time & Fun)": {
    "key": "Escape (VTech, Time & Fun)",
    "original_name": "Escape (VTech, Time & Fun)",
    "name": "逃脫",
    "name_source": "api",
    "original_desc": "Manipulate the motion of the prisoner so as to avoid being caught by the guards appearing in the upper and lower rows, and to escape through the gate as soon as it's open. When the prisoner is spotted by a guard, he will be caught, meaning a miss. Five misses and game ends. 1 point is awarded when a prisoner successfully leaves the jail. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:55",
    "desc_translated_at": "",
    "original_name_hash": "77463995",
    "original_desc_hash": "17add4c0"
  },
  "Explorers of Space (Elektronika)": {
    "key": "Explorers of Space (Elektronika)",
    "original_name": "Explorers Of Space (Elektronika)",
    "name": "太空探索者",
    "name_source": "api",
    "original_desc": "Press Game A button to play game A (easy). Press Game B button to play game B (hard). Press Game A + Game B buttons to play game A+B (different). \n* Instructions (games A and B): \nYour ship has landed on a hostile planet. Enemy ships attack your ship by shooting homing missiles against it. Move your ship's energy shield to destroy enemy missiles. Misses: one miss is scored per each enemy missile that hits your ship. If your mothership (the large one on top of screen) is on screen while missile hits your ship, half a miss is scored; miss marks blinks. If your mothership is not on screen while missile hits your ship, a full miss is scored; miss marks appears. 1 point per destroyed enemy missile. \n* Instructions (game A + B): \nShoot missiles from the screen corners to the ship in the center of the screen. Computer controls the ship's energy shield. You have 300 missiles available. 1 point per missile hitting the ship. \nAt 200 and 500 points, if there are one or more misses, fanfare sounds play and all misses are canceled (games A and B only). Maximum displayed score is 999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:57",
    "desc_translated_at": "",
    "original_name_hash": "7d935819",
    "original_desc_hash": "d8639c42"
  },
  "Fowling (Elektronika)": {
    "key": "Fowling (Elektronika)",
    "original_name": "Fowling (Elektronika)",
    "name": "福林",
    "name_source": "api",
    "original_desc": "Hunt as many birds as possible by placing the gun in the correct direction as birds fly away. Misses: one miss is scored per each missed bird. If dragon is on screen while bird flies away, half a miss is scored; miss mark blinks. If dragon is not on screen bird flies away, a full miss is scored; miss mark appears. 1 point per killed bird. At 200 and 500 points, if there are one or more misses, fanfare sounds play and all misses are canceled. Maximum displayed score is 999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:19",
    "desc_translated_at": "",
    "original_name_hash": "de754a50",
    "original_desc_hash": "4b4dffd9"
  },
  "Galaxy II (Epoch)": {
    "key": "Galaxy II (Epoch)",
    "original_name": "Galaxy II (Epoch)",
    "name": "星海爭霸II：自由之翼",
    "name_source": "wiki",
    "original_desc": "Game is divided into four phases. In Phase 1, you must destroy a squadron of fighters that attack in two different patterns: a zigzag and a backward-forward motion. In Phase 2, another squadron attacks, this time in a circular formation. In Phase 3, the enemy command ships are vulnerable but watch out for their barrage of missiles! In Phase 4, you are challenged to complete a difficult docking maneuver. Your earth ship launches a space shuttle and the countdown begins. Five misses and game ends (in phases 1 to 3). In Phase 1, enemy warships on top rows are worth 10 or 20 points each. In Phase 1, enemy warships moving down are worth 40 or 50 points each. In Phase 2, enemy warships are worth 70 points each. In Phase 3, enemy command ships are worth 100 points each. In Phase 4, you score bonus points. The amount of points depend on how much time you spend to complete the docking maneuver. Maximum displayed score is 10000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:47:56",
    "desc_translated_at": "",
    "original_name_hash": "c1fe36a1",
    "original_desc_hash": "a27503f9"
  },
  "Grab Man (unknown manufacturer, Game & Time)": {
    "key": "Grab Man (unknown manufacturer, Game & Time)",
    "original_name": "Grab Man (unknown manufacturer, Game & Time)",
    "name": "搶人",
    "name_source": "api",
    "original_desc": "Same as Pac Man - do you really need instructions? Notice: Grab Man can eat pills when walking from right to left only! Pill: 5 points. Power pill: 100 points. Ghosts: 200 to 800 points. Apple: 200 to 2000 points (depending on game stage). Apples appear whenever Grab Man eats 8 pills (maximum 2 cherries per stage). Bonus points (1000) are given at level 6 and at every 5 levels. A bonus life is awarded at 5000 and at every 20000 points (just in case you have less than 3 lives left).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:21",
    "desc_translated_at": "",
    "original_name_hash": "58471b82",
    "original_desc_hash": "8b172c12"
  },
  "Hippo Teeth (VTech, Mini Time & Fun)": {
    "key": "Hippo Teeth (VTech, Mini Time & Fun)",
    "original_name": "Hippo Teeth (mini Time And Fun) (VTech, Mini Time & Fun)",
    "name": "河馬牙齒",
    "name_source": "api",
    "original_desc": "Help the busy dentist to prevent hippo's teeth from being eaten by the tooth-invaders. When a tooth is eaten, a miss is scored. Three misses and game ends. 10 points per killed tooth-invader. All teeth are restored at every 1000 points scored. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:22",
    "desc_translated_at": "",
    "original_name_hash": "a4bc7d4e",
    "original_desc_hash": "6c733714"
  },
  "Hot Line (VTech, Mini Time & Fun)": {
    "key": "Hot Line (VTech, Mini Time & Fun)",
    "original_name": "Hot Line (mini Time And Fun) (VTech, Mini Time & Fun)",
    "name": "熱線電話",
    "name_source": "api",
    "original_desc": "A clerk has the task to answer phone calls very quickly. Move the clerk left and right to answer phone calls. When a phone call is not answered, a chance is missed. The secretary appears occasionally, waiting for the clerk to sign a few documents (game B only). Three misses and game ends. 10 points are scored each time a phone call is answered. 50 points are scored each time a document is signed. A quick rest is awarded at every 1000 points. Maximum displayed score is 9990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:44",
    "desc_translated_at": "",
    "original_name_hash": "db973528",
    "original_desc_hash": "ad14b66b"
  },
  "Las Vegas (Bandai, LCD Game Digital)": {
    "key": "Las Vegas (Bandai, LCD Game Digital)",
    "original_name": "Las Vegas (Bandai, LCD Game Digital)",
    "name": "拉斯維加斯",
    "name_source": "api",
    "original_desc": "Your hero is very poor because he lost all his money playing the slot-machines. There are a few luckier gamblers than he, whose coins fall from the slot-machines. Your hero tries to get all of the coins falling from their slot-machines. When he collects 100 coins, he plays the slot-machine and attempts to win some more money. Gambling game starts whenever he scores 1000 points. 10 points are scored when your hero grabs a falling coin. 100 points are scored when your hero scores 111 at the slot machine. 200 points are scored when your hero scores 333 at the slot machine. 500 points are scored when your hero scores 777 at the slot machine. A money bag is awarded when your hero scores 777 at the slot machine. A money bag is lost when your hero scores a miss at the gambling game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:46",
    "desc_translated_at": "",
    "original_name_hash": "dfdfa2e4",
    "original_desc_hash": "ae837770"
  },
  "Lifeboat (Nintendo, Multi Screen)": {
    "key": "Lifeboat (Nintendo, Multi Screen)",
    "original_name": "Lifeboat (Nintendo, Multi Screen)",
    "name": "救生艇",
    "name_source": "api",
    "original_desc": "A fire breaks out on a luxury liner; passengers jump from the ship. Put lifeboat in position for catching passengers. Each lifeboat holds up to four passengers. There is a shore on the left and right of the screen. When a lifeboat reaches shore, passengers will unload automatically. 1 point per person caught. 1 point per person unloaded to shore. Maximum displayed score is 999. At 300 points fanfare sounds and all misses are canceled; if there are no misses when 300 points are reached game goes into \"Chance-Time\": score flashes and all points are awarded at double value (2 points per passenger caught or unloaded to shore) until a miss is made.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:47",
    "desc_translated_at": "",
    "original_name_hash": "e9c1c5e4",
    "original_desc_hash": "a7db1ef9"
  },
  "Mario Bros": {
    "key": "Mario Bros",
    "original_name": "Mario Bros. (Nintendo, Multi Screen)",
    "name": "超級瑪利歐兄弟35",
    "name_source": "wiki",
    "original_desc": "Mario is back in action with his brother Luigi, working in a bottling plant, loading cases on a belt conveyor. The conveyor carries the cases up for loading onto trucks. Operate Mario and Luigi up and down ladders in order to get cases. When a case is dropped, the foreman get angry and a miss is scored. Three misses and game is over 1 point per case loaded on a conveyor. 10 points per truck loaded with 8 cases. At 300 points fanfare sounds and all misses are canceled; if there are no misses when 300 points are reached, game goes into \"CHANCE TIME\". Score flashes and all points are awarded at double value until a miss is made. Maximum displayed score is 999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:48:45",
    "desc_translated_at": "",
    "original_name_hash": "a1f00564",
    "original_desc_hash": "20963d16"
  },
  "Crazy Chewy (VTech, Electronic Tini-Arcade)": {
    "key": "Crazy Chewy (VTech, Electronic Tini-Arcade)",
    "original_name": "Crazy Chewy (VTech, Electronic Tini-Arcade)",
    "name": "瘋狂耐嚼",
    "name_source": "api",
    "original_desc": "You are in a deep-sea maze. Your task is to outwit the deadly sea monsters. Every step you take you absorb a power atom giving you the energy to continue and score points. Your aim is to clear the maze completely. The monsters will try to protect the territory and chase you. If you are captured you loose a life. You have three lives. If you manage to absorb a \"marine energizer\" you can chase and destroy the monsters scoring bonus points. There are many power atoms, marine energizers and two bonus stars - which flash on and off. If you manage to clear the maze, a new full maze will appear, allowing you to continue your greedy rampage. There are two secret tunnels in the maze. Both Chewy and the monsters can enter them. The tunnels are indicated by arrows on the screen. 10 points are scored each time a power atom is absorbed. 200 points are scored each time a sea monster is defeated. 2000 points are scored each time a bonus star is absorbed. Bonus life is awarded at 20000 points. Maximum displayed score is 99990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:10",
    "desc_translated_at": "",
    "original_name_hash": "82244829",
    "original_desc_hash": "780d4dee"
  },
  "Frog Boaster (Elektronika)": {
    "key": "Frog Boaster (Elektronika)",
    "original_name": "Frog Boaster (Elektronika)",
    "name": "青蛙誇耀者",
    "name_source": "api",
    "original_desc": "Move a frog to catch butterflies. When a butterfly escapes, a miss is scored. The chicken appears/disappears at every five seconds. When the cock appears while butterfly escapes, half miss is scored (miss mark blinks). Three full misses and game is over. 1 point is scored for each butterfly caught by frog. At 200 and 500 points, if there are one or more misses, fanfare sounds play and all misses are canceled. Maximum displayed score is 999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:11",
    "desc_translated_at": "",
    "original_name_hash": "f51a71af",
    "original_desc_hash": "8f03ed11"
  },
  "Mario's Bombs Away (Nintendo, Panorama Screen)": {
    "key": "Mario's Bombs Away (Nintendo, Panorama Screen)",
    "original_name": "Mario's Bombs Away (Nintendo, Panorama Screen)",
    "name": "馬里奧的炸彈消失了",
    "name_source": "api",
    "original_desc": "Mario is in the jungle, fighting against an enemy army. His aim is to take five bombs on the right side of the jungle. Mario's companion on the right side places bombs close to enemies. When all five bombs are in place, they detonate and enemy army is beaten. Enemies try to light Mario's bomb; lift/lower Mario's bomb to keep it safe. If enemies torches reach Mario's bomb, all progress (bombs already placed) is lost. Three misses and game ends. 1 point when Mario steps forward. 5 points when Mario places a bomb. 10 points when Mario places the 5th bomb. At 300 points a music is played and all misses are canceled; if there are no misses when 300 points are reached game goes into \"Chance-Time\": score flashes and all points are awarded at double value until miss is made. Maximum displayed score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:12",
    "desc_translated_at": "",
    "original_name_hash": "6633ab66",
    "original_desc_hash": "6ac67896"
  },
  "Mickey Mouse (Nintendo, Panorama Screen)": {
    "key": "Mickey Mouse (Nintendo, Panorama Screen)",
    "original_name": "Mickey Mouse (panorama Screen) (Nintendo, Panorama Screen)",
    "name": "米老鼠",
    "name_source": "api",
    "original_desc": "Mickey Mouse performs baton acrobatics while balancing on a ball in a circus. Donald Duck watches his acrobatic feats. Move Mickey Mouse left and right to catch the batons, but beware of the flaming torches. One miss is scored when Mickey Mouse fails to catch a baton, or when he catches a flaming torch. Three misses and game ends. 1 point for each baton Mickey Mouse catches and tosses. Maximum displayed score is 999. At 300 points fanfare sounds and all misses are canceled. If there are no misses when 300 points are reached, game goes into \"Chance-Time\": all points are awarded at double value (2 points per baton caught) until a miss is made.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:35",
    "desc_translated_at": "",
    "original_name_hash": "1209cacc",
    "original_desc_hash": "efb51028"
  },
  "Monkey (VTech, Time & Fun)": {
    "key": "Monkey (VTech, Time & Fun)",
    "original_name": "Monkey (VTech, Time & Fun)",
    "name": "猴",
    "name_source": "api",
    "original_desc": "Monkeys continuously climb the trees to steal coconuts. You should try your best to avoid the coconuts being stolen. When a monkey successfully reaches a coconut, a missed is scored. Five misses and game ends. 1 point is scored each time a monkey is hit. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:36",
    "desc_translated_at": "",
    "original_name_hash": "53b9c776",
    "original_desc_hash": "762bc2f6"
  },
  "Monkey Jump (VTech, Arcade Time & Fun)": {
    "key": "Monkey Jump (VTech, Arcade Time & Fun)",
    "original_name": "Monkey Jump (VTech, Arcade Time & Fun)",
    "name": "猴子跳",
    "name_source": "api",
    "original_desc": "A Kong kidnapped a very nice girl and took her to the mysterious jungle. She's waiting for you to save her. Now it's up to you to make your way to her. You can escape the Kong by jumping the tires he's throwing at you. You may want to rest for a while on short benches placed here and there. There's four items on the left side of the tree. The purse and the shoe on floors 1 and 3 award you with bonus points. The magic cakes on floors 2 and 4 make you invincible for a short time. You can smash tires by simply hitting them, and they're worth bonus points. When you save the girl, she awards you with a kiss. But beware of the Kong, he will kidnap her again! At every 4 completed stages, Kong falls down from tree tree, then game starts again at increased difficulty. If time runs out, or you get hurt by a tire, a life is lost. When all lives are lost, game ends. 10 points are scored when jumping a tire 100 points are scored when getting a bonus item 100 points are scored when smashing a tire 300 to 500 points awarded when completing level (depending on remaining time). Bonus life is awarded when completing level 2 and at every 4 levels. Maximum displayed score is 99990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:49:37",
    "desc_translated_at": "",
    "original_name_hash": "f7a3ce38",
    "original_desc_hash": "15e23f46"
  },
  "Motor Cross (Queentex)": {
    "key": "Motor Cross (Queentex)",
    "original_name": "Motor Cross (Queentex)",
    "name": "機動十字",
    "name_source": "api",
    "original_desc": "Your aim is to overtake as many bikers as possible before running out of fuel and crashing your bike. As soon as you score a fixed amount of points on the current track, a new track will be made available for you to race. At the beginning of the track, you'll have a new bike with full fuel tank. Sometimes a fuel pump or a spanner will appear on the left or right sides of the road. You can fill your fuel tank or restore your bike by moving close to them and then pressing Start to collect them. When game is over you can continue the game by pressing Start before the \"CON\" writing fades (10 seconds). You'll run the same track and your score will be reset zero. 100 points per every overtaken bike, (slow speed). 200 points per every overtaken bike, (medium speed). 300 points per every overtaken bike, (fast speed). Maximum displayed score is 199900 points, then score resets to 0.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:00",
    "desc_translated_at": "",
    "original_name_hash": "7ec547b2",
    "original_desc_hash": "eef1df37"
  },
  "Pac Man (Tomytronic)": {
    "key": "Pac Man (Tomytronic)",
    "original_name": "Pac Man (Tomytronic)",
    "name": "吃豆人",
    "name_source": "api",
    "original_desc": "Do you really need instructions about the Pac Man videogame ? :-) Notice: Pac Man can eat pills when walking from right to left only! Amateur game becomes automatically Professional game at level 4 (this means that there will be three ghosts in the maze instead of two). Bait: 2 points. Power star: 50 points. Ghost: 100 to 400 points. Cherry: 100 to 400 points (depending on game stage). Cherries appear whenever Pac Man eats 8 pills (maximum 2 cherries per stage). A bonus life is awarded at 2000 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:01",
    "desc_translated_at": "",
    "original_name_hash": "3f1290a6",
    "original_desc_hash": "9356bdf1"
  },
  "Pancake (VTech, Time & Fun)": {
    "key": "Pancake (VTech, Time & Fun)",
    "original_name": "Pancake (VTech, Time & Fun)",
    "name": "餅子",
    "name_source": "api",
    "original_desc": "Move a busy waiter around the restaurant to bring pancakes from cook to a hungry customer. When a pancake falls to ground, one miss is scored. Five misses and game ends. 1 point is scored for each pancake successfully delivered. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:02",
    "desc_translated_at": "",
    "original_name_hash": "629ef15a",
    "original_desc_hash": "4c0b0890"
  },
  "Parachute (Nintendo, Wide Screen)": {
    "key": "Parachute (Nintendo, Wide Screen)",
    "original_name": "Parachute (Nintendo, Wide Screen)",
    "name": "降落傘",
    "name_source": "api",
    "original_desc": "Skydivers come parachuting down over shark-infested waters. Lifeboat tries to catch them. Try to catch skydivers. Move boat left or right by pressing corresponding control buttons. When a skydiver falls into the ocean he is attacked by sharks. Three misses and game ends. 1 point is scored for each skydiver caught by lifeboat. Maximum displayed score is 999. When the score reaches a bonus score (200 or 500 points), any miss marks indicated at the time are erased with a fanfare and game continues.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:25",
    "desc_translated_at": "",
    "original_name_hash": "822fb55c",
    "original_desc_hash": "e50ab702"
  },
  "Pirate (VTech, Time & Fun)": {
    "key": "Pirate (VTech, Time & Fun)",
    "original_name": "Pirate (VTech, Time & Fun)",
    "name": "海盜",
    "name_source": "api",
    "original_desc": "Pirates continuously climb up to embark your ship from three paths, to steal your gold. Move the captain to prevent pirates from reaching the deck. When a pirate successfully reaches the deck, a chance is missed. Five misses and game ends. 1 point is scored each time a pirate is hit. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:26",
    "desc_translated_at": "",
    "original_name_hash": "7a2e2554",
    "original_desc_hash": "9cb888f6"
  },
  "Roller Coaster (VTech, Explorer Time & Fun)": {
    "key": "Roller Coaster (VTech, Explorer Time & Fun)",
    "original_name": "Roller Coaster (VTech, Explorer Time & Fun)",
    "name": "雲霄飛車",
    "name_source": "api",
    "original_desc": "Roller Coaster needs maintenance: there are three holes on the railway. Move a busy worker around the rails to fill holes and prevent cars from falling. When a car falls into a hole, one miss is scored. Five misses and game ends. 1 point is scored for each safe car. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:27",
    "desc_translated_at": "",
    "original_name_hash": "cfab6a4b",
    "original_desc_hash": "40dfca55"
  },
  "Safari (VTech, Time & Fun)": {
    "key": "Safari (VTech, Time & Fun)",
    "original_name": "Safari (VTech, Time & Fun)",
    "name": "狩獵之旅",
    "name_source": "api",
    "original_desc": "The barbarians continuously wander around. Control the position of the hunter so as to keep out of sight from the barbarians and to reach the rescue helicopter. If the hunter is spotted by the barbarian, he will be caught, meaning a miss. A hunter will appear in the upper right corner of the screen at each miss. Five misses and game ends. 1 point is awarded when the hunter successfully reaches the ladder of the helicopter. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:50",
    "desc_translated_at": "",
    "original_name_hash": "40059380",
    "original_desc_hash": "1349487f"
  },
  "Sleep Walker (VTech, Time & Fun)": {
    "key": "Sleep Walker (VTech, Time & Fun)",
    "original_name": "Sleep Walker (VTech, Time & Fun)",
    "name": "夢遊者",
    "name_source": "api",
    "original_desc": "Move a busy man in pyjamas around the house to save sleepwalkers. When a sleepwalker gets awaken, one miss is scored. Five misses and game ends. 1 point is scored for each safe sleepwalker. Maximum displayed score is 9999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:51",
    "desc_translated_at": "",
    "original_name_hash": "9916bc0a",
    "original_desc_hash": "9dc509e4"
  },
  "Snoopy (Nintendo, Panorama Screen)": {
    "key": "Snoopy (Nintendo, Panorama Screen)",
    "original_name": "Snoopy (panorama Screen) (Nintendo, Panorama Screen)",
    "name": "史努比",
    "name_source": "api",
    "original_desc": "Shroeder is playing his piano. The notes fly through the air to where Woodstock is sleeping. Operate Snoopy left and right to strike down the notes with his hammer so that Woodstock may sleep in peace. If a note gets to any nest, a miss occurs; three misses and game ends. Game A: 3 lines of notes. Game B: 4 lines of notes. 1 point for each note knocked down. At 300 points a music is played and all misses are canceled; if there are no misses when 300 points are reached game goes into \"Chance-Time\": score flashes and all points are awarded at double value until miss is made. Maximum display score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:50:52",
    "desc_translated_at": "",
    "original_name_hash": "83778ef0",
    "original_desc_hash": "61bdc233"
  },
  "Snoopy Tennis (Nintendo, Wide Screen)": {
    "key": "Snoopy Tennis (Nintendo, Wide Screen)",
    "original_name": "Snoopy Tennis (Nintendo, Wide Screen)",
    "name": "史努比網球",
    "name_source": "api",
    "original_desc": "Charlie Brown and Snoopy are playing tennis. Snoopy has to climb the tree to receive Charlie Brown's serve. Lucy keeps butting in, intercepts the ball from snoopy and returns it. Pressing when ball is just in front of Snoopy's face is good timing.  When Snoopy swings and misses, he can not move until his racket returns to original position. When Snoopy misses, ball continues on, followed by sound of broken bottles. CRASH mark appears. Snoopy pretends innocence, fakes sleep. Charlie Brown throws racket down in despair. 2 points when returning Charlie Brown's ball. 3 points when returning Lucy's ball. Bonus scores are those with 200 or 500 points (200, 500, 1200, 1500, ... to 9500). When each bonus score is reached, fanfare sounds and all misses are canceled. When a bonus score is reached and there are no misses registered, game goes into \"Chance time\" for 50 to 70 seconds. Score flashes on and off, returning Charlie Brown's ball score 5 points, Lucy's ball score 6 points. Maximum display score is 9999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:15",
    "desc_translated_at": "",
    "original_name_hash": "fbebc900",
    "original_desc_hash": "2f2ccf1b"
  },
  "SnoopyPS": {
    "key": "SnoopyPS",
    "original_name": "Snoopy (table Top)",
    "name": "史努比",
    "name_source": "api",
    "original_desc": "Shroeder is playing his piano. The notes fly through the air to where Woodstock is sleeping. Operate Snoopy left and right to strike down the notes with his hammer so that Woodstock may sleep in peace. If a note gets to any nest, a miss occurs; three misses and game ends. Game A: 3 lines of notes. Game B: 4 lines of notes. 1 point for each note knocked down. At 300 points a music is played and all misses are canceled; if there are no misses when 300 points are reached game goes into \"Chance-Time\": score flashes and all points are awarded at double value until miss is made. Maximum display score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:16",
    "desc_translated_at": "",
    "original_name_hash": "34271117",
    "original_desc_hash": "61bdc233"
  },
  "Sub Chase (Mattel Electronics)": {
    "key": "Sub Chase (Mattel Electronics)",
    "original_name": "Sub Chase (Mattel Electronics)",
    "name": "子追逐",
    "name_source": "api",
    "original_desc": "Computer controls submarine attack. Turn power on: single (bright red) dot appears: that's your ship. Use cursor keys to steer ship within range of invisible submarine. \"Sonar\" single beep means submarine is nearby. \"Sonar\" frequent beeps mean submarine is very near or under your ship. Fire depth charge by using control key. You have 30 on board to sink as many submarines as you can. Sink one and computer programs another submarine. Watch out for torpedoes (moving line of dots). If submarine sinks your ship, game is over. Game is also over when you have no more depth charges on board. 1 to 5 points per submarine sunk (score depends on how many charges you shot). Scores over 100 will be displayed by code, I.E.: 100-109 hits by \"A0-A9\", 110-119 by \"B0-B9\", 120-129 by \"C0-C9\", 130-139 by \"D0-D9\", 140-149 by \"E0-E9\".",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:17",
    "desc_translated_at": "",
    "original_name_hash": "bbdaa8fb",
    "original_desc_hash": "53c629a0"
  },
  "Tennis Menace (VTech, Sporty Time & Fun)": {
    "key": "Tennis Menace (VTech, Sporty Time & Fun)",
    "original_name": "Tennis Menace (VTech, Sporty Time & Fun)",
    "name": "網球威脅",
    "name_source": "api",
    "original_desc": "Train tennis by playing with your coach. Move the player left and right to get all balls. When a ball falls on the ground, a chance is missed. Three misses and game ends. 10 points are scored each time a ball is hit. a quick rest is awarded at every 1000 points. Maximum displayed score is 9990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:40",
    "desc_translated_at": "",
    "original_name_hash": "d95c5036",
    "original_desc_hash": "a2356449"
  },
  "Terrahawks The Battlehawk": {
    "key": "Terrahawks The Battlehawk",
    "original_name": "Towering Rescue",
    "name": "高聳救援",
    "name_source": "api",
    "original_desc": "A large scale earthquake occurred! Rescue refugees on the top of the buildings by helicopter. If the helicopter collides against red building or tower on either side, the game is over. Also if you fail to rescue 2 refugees the game is over. In game A, helicopter can carry one only refugee at one time. In game B, helicopter can carry up to two refugees at the same time. 10 points per each refugee taken to the safety building (on the right side of the screen). Maximum display score is 9990 points. At 9990 points the game is over automatically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:41",
    "desc_translated_at": "",
    "original_name_hash": "f3e15352",
    "original_desc_hash": "1969fa21"
  },
  "Towering Rescue (Gakken, LCD Card Game)": {
    "key": "Towering Rescue (Gakken, LCD Card Game)",
    "original_name": "Towering Rescue (Gakken, LCD Card Game)",
    "name": "高聳救援",
    "name_source": "api",
    "original_desc": "A large scale earthquake occurred! Rescue refugees on the top of the buildings by helicopter. If the helicopter collides against red building or tower on either side, the game is over. Also if you fail to rescue 2 refugees the game is over. In game A, helicopter can carry one only refugee at one time. In game B, helicopter can carry up to two refugees at the same time. 10 points per each refugee taken to the safety building (on the right side of the screen). Maximum display score is 9990 points. At 9990 points the game is over automatically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:51:42",
    "desc_translated_at": "",
    "original_name_hash": "2d8fed45",
    "original_desc_hash": "1969fa21"
  },
  "Tron (Tomytronic)": {
    "key": "Tron (Tomytronic)",
    "original_name": "Tron (Tomytronic)",
    "name": "創",
    "name_source": "api",
    "original_desc": "You must destroy your enemy: Sark and the MCP (Master Control Program) by making the Enemy Light Cycle crash and by destroying Sark's Rings and finally by penetrating the MCP barrier and destroying the MCP. *Level 1: The Light Cycle Game. Two Light Cycles appear: Tron's (the blue one) Sark's (the red one). As both Cycles travel across the screen they create a wall behind them. You must try to destroy the enemy's Cycle by causing it to crash into a wall while avoiding crashing into a wall or the enemy Cycle. Press the \"Speed/Shoot\" button to accelerate. 5 points for moving ahead and creating five Tron wall bars. 100 points for destroying each enemy Light Cycle. * Level 2: The Ring Game. Tron is on the left and Sark is on the right. The green bars beneath each figure represent the four Rings each player begins with. Move Tron up and down to catch the Disc as Sark throws it; then position Tron and press the \"Speed/Shoot\" button to throw the Disc where Sark can't catch it. If either one misses it they lose one Ring below them. 5 points for catching a Disc. 20 points for destroying the enemy's Ring. 200 points for destroying all Rings. * Level 3: the MCP Game. Tron is on the left on a stationary position. Below him are bars that act as timers: the number of bars equals the number of Tron's remaining Rings from the Ring Game. Press the \"Speed/Shoot\" button to throw one Disc at the MCP Barrier; the Barrier will begin to move up and down. Try to pick the correct timing to press the \"Speed/Shoot\" button again and release a Disc to penetrate the Barrier and destroy the MCP; then game starts again with the Light Cycle Game - at higher speed! If the Disc fails to penetrate the Barrier you must release another Disc and aim for the correct timing again. If all bars below Tron disappear, a miss is scored. 200 points for destroying the MCP. Bonus 50 points x the number or remaining timing bars. The highest score that can be recorded is 1,995 points; anything over 2,000 points appear as a green bar on the top of the screen when your total score is shown. The highest possible score is 15,995 points, shown as seven bars plus 1,995. Bonus life is given at every 2,000 points scored (maximum five lives at one time).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:52:05",
    "desc_translated_at": "",
    "original_name_hash": "c9132ceb",
    "original_desc_hash": "0e73a816"
  },
  "Turtle Bridge (Nintendo, Wide Screen)": {
    "key": "Turtle Bridge (Nintendo, Wide Screen)",
    "original_name": "Turtle Bridge (Nintendo, Wide Screen)",
    "name": "龜橋",
    "name_source": "api",
    "original_desc": "Tourists attempt to cross a lake from left bank to right bank with their luggage by stepping on the backs of turtles. When tourist reaches other side he hands his baggage to other tourist then crosses back again. When turtle sees a fish rising to the surface, it dives down into the water. When the tourist is on a turtle that dives, score one miss; miss mark appears on screen; three misses and game ends. Once tourist leaves the left bank, he can not climb back without his baggage to other tourist. Fishes do not rise from the center of screen in Game A. If tourist remains in center area for more than 2 minutes, fish begins rising from center also. 3 points each time tourist hand over a piece of baggage. Extra points are scored each time tourist returns to left bank. The faster the tourist makes the round trip, the higher the score (Max. points: 12. Min. points: 2). When player reaches a bonus score (successive units of 200 or 500), any miss marks indicated at the time are erased with a fanfare and game continues. If a bonus score is reached with no misses, game goes into Chance time for 20 to 40 seconds. Turtles do not move and fishes do not appear. Maximum display score is 9999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:52:06",
    "desc_translated_at": "",
    "original_name_hash": "5881446c",
    "original_desc_hash": "7e408070"
  },
  "Wild Man Jump (VTech, Electronic Tini-Arcade)": {
    "key": "Wild Man Jump (VTech, Electronic Tini-Arcade)",
    "original_name": "Wild Man Jump (VTech, Electronic Tini-Arcade)",
    "name": "野人跳躍",
    "name_source": "api",
    "original_desc": "A Kong kidnapped a very nice girl and took her to the mysterious jungle. She's waiting for you to save her. Now it's up to you to make your way to her. You can escape the Kong by jumping the tires he's throwing at you. You may want to rest for a while on short benches placed here and there. There's four items on the left side of the tree. The purse and the shoe on floors 1 and 3 award you with bonus points. The magic cakes on floors 2 and 4 make you invincible for a short time. You can smash tires by simply hitting them, and they're worth bonus points. When you save the girl, she awards you with a kiss. But beware of the Kong, he will kidnap her again! At every 4 completed stages, Kong falls down from tree tree, then game starts again at increased difficulty. If time runs out, or you get hurt by a tire, a life is lost. When all lives are lost, game ends. 10 points are scored when jumping a tire 100 points are scored when getting a bonus item 100 points are scored when smashing a tire 300 to 500 points awarded when completing level (depending on remaining time). Bonus life is awarded when completing level 2 and at every 4 levels. Maximum displayed score is 99990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:52:07",
    "desc_translated_at": "",
    "original_name_hash": "3851536e",
    "original_desc_hash": "15e23f46"
  },
  "Armor Battle (Mattel Electronics)": {
    "key": "Armor Battle (Mattel Electronics)",
    "original_name": "Armor Battle (Mattel Electronics)",
    "name": "裝甲戰",
    "name_source": "api",
    "original_desc": "You are on a dangerous tank mission. To reach and destroy your assigned target, you must maneuver through a field filled with enemy mines. Although these are hidden, the mine detection equipment in your tank warns you of their presence by producing a buzzing sound. This is your signal to change course on route to your target. If you should stumble into a mine, your tank will be \"destroyed\" and returned to its original starting position. If you get through the minefield and successfully engage the target, the built-in computer will automatically set up another challenge with a new starting position, target location, and minefield.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:52:30",
    "desc_translated_at": "",
    "original_name_hash": "01f033f3",
    "original_desc_hash": "0ba951dc"
  },
  "Donkey Kong Jr. (Coleco)": {
    "key": "Donkey Kong Jr. (Coleco)",
    "original_name": "Donkey Kong Jr. (Coleco)",
    "name": "",
    "name_source": "",
    "original_desc": "Donkey Kong has been captured and chained by Mario. Donkey Kong Jr. goes to papa's rescue with key he needs to open the locks on the chains. Junior is attacked by fierce birds. He uses umbrellas to leap from heights, and balloons to get up there, opening the locks on the way. When he opens all 4 locks, papa is free. Each time he opens one lock, he must go back to START to retrieve the key, then sets out again is lost. With three misses game ends. 1 point when Junior jumps to umbrella or balloon. 2 to 10 points when Junior hits fierce bird with coconut. 10 points when Junior opens one lock. 10 points (extra bonus) when Junior opens all four locks. When score reaches 300 points and there are one or two misses, all the misses are cleared with fanfare. If there are no misses when a 300 score is reached, game goes into \"CHANCE TIME\". Score flashes and all the points are awarded at double value until a miss is scored. Maximum displayed score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Donkey Kong Jr. (Nintendo, Panorama Screen)": {
    "key": "Donkey Kong Jr. (Nintendo, Panorama Screen)",
    "original_name": "Donkey Kong Jr. (panorama Screen) (Nintendo, Panorama Screen)",
    "name": "",
    "name_source": "",
    "original_desc": "Donkey Kong has been captured and chained by Mario. Donkey Kong Jr. goes to papa's rescue with key he needs to open the locks on the chains. Junior is attacked by fierce birds. He uses umbrellas to leap from heights, and balloons to get up there, opening the locks on the way. When he opens all 4 locks, papa is free. Each time he opens one lock, he must go back to START to retrieve the key, then sets out again is lost. With three misses game ends. 1 point when Junior jumps to umbrella or balloon. 2 to 10 points when Junior hits fierce bird with coconut. 10 points when Junior opens one lock. 10 points (extra bonus) when Junior opens all four locks. When score reaches 300 points and there are one or two misses, all the misses are cleared with fanfare. If there are no misses when a 300 score is reached, game goes into \"CHANCE TIME\". Score flashes and all the points are awarded at double value until a miss is scored. Maximum displayed score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Donkey Kong Jr. (Nintendo, Table Top)": {
    "key": "Donkey Kong Jr. (Nintendo, Table Top)",
    "original_name": "Donkey Kong Jr. (table Top) (Nintendo, Table Top)",
    "name": "",
    "name_source": "",
    "original_desc": "Donkey Kong has been captured and chained by Mario. Donkey Kong Jr. goes to papa's rescue with key he needs to open the locks on the chains. Junior is attacked by fierce birds. He uses umbrellas to leap from heights, and balloons to get up there, opening the locks on the way. When he opens all 4 locks, papa is free. Each time he opens one lock, he must go back to START to retrieve the key, then sets out again is lost. With three misses game ends. 1 point when Junior jumps to umbrella or balloon. 2 to 10 points when Junior hits fierce bird with coconut. 10 points when Junior opens one lock. 10 points (extra bonus) when Junior opens all four locks. When score reaches 300 points and there are one or two misses, all the misses are cleared with fanfare. If there are no misses when a 300 score is reached, game goes into \"CHANCE TIME\". Score flashes and all the points are awarded at double value until a miss is scored. Maximum displayed score is 999 points. At 999 points score resets and game starts again (at higher speed).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mario Bros. (Nintendo, Multi Screen)": {
    "key": "Mario Bros. (Nintendo, Multi Screen)",
    "original_name": "Mario Bros. (Nintendo, Multi Screen)",
    "name": "",
    "name_source": "",
    "original_desc": "Mario is back in action with his brother Luigi, working in a bottling plant, loading cases on a belt conveyor. The conveyor carries the cases up for loading onto trucks. Operate Mario and Luigi up and down ladders in order to get cases. When a case is dropped, the foreman get angry and a miss is scored. Three misses and game is over 1 point per case loaded on a conveyor. 10 points per truck loaded with 8 cases. At 300 points fanfare sounds and all misses are canceled; if there are no misses when 300 points are reached, game goes into \"CHANCE TIME\". Score flashes and all points are awarded at double value until a miss is made. Maximum displayed score is 999 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  }
}