{
  "Air Cars": {
    "key": "Air Cars",
    "original_name": "Air Cars",
    "name": "空氣汽車",
    "name_source": "api",
    "original_desc": "AirCars takes place in the future after a nuclear holocaust. \nThe large organization E.B.N.E.R.S. is plotting to take over the world and has developed advanced forcefield and teleportation systems, and nuclear powered AirCars. To stop the plot, your group steals plans, builds its own AirCar, and sets out to destroy all of the bases, 28 known and countless unknown ones, stationed around the globe.\n\nYou can choose to play a single player game, the 2-player game using a JagLink, or up to 8 players using ICD's CatBoxes. On screen and on radar, each player's AirCar is displayed in a different color to help identify the good guys from the bad guys. There are 3 difficulty settings. You will be using the cockpit's instrument panel to fly the AirCar, select weapons and view radar, as well as combating the enemy in the air and shooting ground targets.\n\nFeatures include true 3D sound, a computer voice (which can be turned off if desired), and music during the introduction and level intermissions.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:39",
    "desc_translated_at": "",
    "original_name_hash": "b10397a0",
    "original_desc_hash": "7230e43f"
  },
  "Alien vs Predator": {
    "key": "Alien vs Predator",
    "original_name": "Alien Vs Predator",
    "name": "外星人大戰鐵血戰士",
    "name_source": "api",
    "original_desc": "Aliens versus Predator is a first-person shooter on Jaguar. It offers to play as a Marine, an Alien or a Predator, each race having its own strengths and weaknesses. The three campaigns take place on a space colony of marines beset by aliens, and on which a Predator ship has discreetly landed to try to kill the alien queen!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:42",
    "desc_translated_at": "",
    "original_name_hash": "c66c1472",
    "original_desc_hash": "17ce030f"
  },
  "Atari Karts": {
    "key": "Atari Karts",
    "original_name": "Atari Karts",
    "name": "雅達利卡丁車",
    "name_source": "api",
    "original_desc": "Atari Karts is a character-based go-kart racing game. It plays very similarly to Super Mario Kart. The emphasis in this game, like most kart games, is on making use of pick-up items found around the track to knock out your opponents.\n\nThere is only one game mode, a points based cup series.  There are four difficulty levels, each with 3 cups to race for. After completing all the cups for a difficulty level, you get to challenge a \"boss\" kart in a single race match.  If you beat the boss, he becomes a playable character.  The various cup races can be played in either single player or two player split screen modes.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:42",
    "desc_translated_at": "",
    "original_name_hash": "726dd55f",
    "original_desc_hash": "71f48e75"
  },
  "Attack of the Mutant Penguins": {
    "key": "Attack of the Mutant Penguins",
    "original_name": "Attack of the Mutant Penguins",
    "name": "變異企鵝的襲擊",
    "name_source": "api",
    "original_desc": "In the distant galaxy of Bleurggh, an evil (but reasonably stupid) band of aliens picked up some of Earth's television signals. Unfortunately for them, they could only tune in a wildlife program. They figured the Earth would be a pushover to invade, so they disguised themselves as its inhabitants -- penguins! Word of the invasion has reached those champions of intergalactic do-goodery, Bernard and Rodney. Now, with their help, you must prevent the alien mutant penguins from triggering the Doomscale and destroying the Earth. Are you up to the challenge?",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:42",
    "desc_translated_at": "",
    "original_name_hash": "a8e5dd9d",
    "original_desc_hash": "a42d76d9"
  },
  "Battle Sphere Gold": {
    "key": "Battle Sphere Gold",
    "original_name": "Battle Sphere Gold",
    "name": "戰球金",
    "name_source": "api",
    "original_desc": "A 3D space combat simulator, BattleSphere's story was based upon an episode in the original Star Trek television series and it plays similarly to Star Raiders.\n\nSeven alien races vie against each other - the victor will control the galaxy. They meet in an arena in Sector 51, a spherical sector of space formerly used by the Earth government to secretly test new weapons and starships. Gameplay consists of 5 different play modes with different scenarios and goals. Choose from various starships (each with unique weapons systems) and battle the aliens, who have also chosen their best fighters and have many space ships of their own.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:43",
    "desc_translated_at": "",
    "original_name_hash": "4a914ad6",
    "original_desc_hash": "6d3bdf22"
  },
  "Brutal Sports Football": {
    "key": "Brutal Sports Football",
    "original_name": "Brutal Sports Football",
    "name": "殘酷運動足球",
    "name_source": "api",
    "original_desc": "Similar to Speedball 2 in many ways, this is an ultra-violent sports game. Matches last 7 minutes, and the aim is to get the ball into a goal at each end, guarded by a net-minder. The ball can be thrown or kicked, and is an oval, resulting in frequent up-and-under type kicks. \n\nThe gameplay is fast and flowing, and has one rule - if you can't get the ball, get the man, and decapitate him if possible. Bonus and non-bonus items appear on the pitch, such as bombs to throw at opponents, rabbits to speed up the current player, or tortoises to slow him down. \n\nTeams consist of humans and aliens, many of which have their own unique skills. There's a lot of blood and flailing limbs, giving things a gruesomely humorous edge. There are four leagues to progress through, plus a knockout cup and single matches.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:50",
    "desc_translated_at": "",
    "original_name_hash": "eb2e970e",
    "original_desc_hash": "990bbc4e"
  },
  "Bubsy in Fractured Furry Tales": {
    "key": "Bubsy in Fractured Furry Tales",
    "original_name": "Bubsy in : Fractured Furry Tales",
    "name": "巴布西（《破碎的毛茸茸的故事》）",
    "name_source": "api",
    "original_desc": "Only Bubsy can protect the world's kids from these silly stories and tangled-up tales as he leaps and bounds his way through 15 frantic chapters of fabulous furry fun. In Fairytaleland, Bubsy attends a twisted tea party, climbs a giant beanstalk, voyages under the sea (without getting his paws wet), head to Ali Baba's desert and even meets Hansel and Gretel, who should be up on kidnapping charges.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:49",
    "desc_translated_at": "",
    "original_name_hash": "4f8870f4",
    "original_desc_hash": "eb365b5e"
  },
  "Cannon Fodder": {
    "key": "Cannon Fodder",
    "original_name": "Cannon Fodder",
    "name": "炮灰",
    "name_source": "api",
    "original_desc": "Guide a team of up to four soldiers through 72 levels of combat in this innovative top-down action/strategy hybrid, best thought of as Lemmings crossed with Commando crossed with Dune 2. The characters are controlled indirectly using the mouse, as you activate each soldier or group of them by highlighting them, click the left button to move them to a particular spot, and the right button for them to fire guns at an enemy. You can also pick up grenades, which can be used to destroy groups of enemies or buildings (by pressing both buttons at once). \n\nEach mission has a specific objective, and some feature vehicles such as tanks to make things easier. Your troops can cross water but can't shoot within it, so finding and controlling bridges is often crucial. You can use the arrangement of trees to find hiding places to shoot from, and should watch out for CPU soldiers also doing so.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:49",
    "desc_translated_at": "",
    "original_name_hash": "03b5c312",
    "original_desc_hash": "d6b5eb43"
  },
  "Club Drive": {
    "key": "Club Drive",
    "original_name": "Club Drive",
    "name": "俱樂部大道",
    "name_source": "api",
    "original_desc": "It is the future, and the most popular theme park around is Club Drive.  Scientists have managed to invent indestructible cars. Patrons to Club Drive can drive these cars around imaginative environments and play outrageous driving games.\n\nClub Drive as a Jaguar game is a simple driving simulator.  You are put in the drivers seat, and can race through some large environments.  The racing areas available are: an old west ghost town, San Francisco, a giant house, and a simple hot-wheels style track.  In addition to the racing modes, there are object collection and 2-player tag modes.  These modes are played out in smaller versions of the areas described above.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:50",
    "desc_translated_at": "",
    "original_name_hash": "6ec9733f",
    "original_desc_hash": "13908e2e"
  },
  "Cybermorph": {
    "key": "Cybermorph",
    "original_name": "Cybermorph",
    "name": "賽博變形",
    "name_source": "api",
    "original_desc": "Cybermorph was the first game released for Atari's Jaguar console. It's a 3d sci-fi shoot-'em-up.  The story goes like this:  The evil Pernitia Empire is swallowing up the galaxy's planets left and right.  What's worse, the resistance forces have had their secret weapons stolen from them and put into pods spread out on many different planets.  You must pilot the T-Griffon morphing attack craft to each planet and recover the pods to stop the Pernitians.\n\nSo, in each planet, or level, you must collect a certain number of pods and make it to the exit before the enemies shoot you down. Fortunately, there are power-ups that can strategically enhance the T-Griffon's offensive capabilities.  After clearing 8 planets, you take on a boss creature/ship before moving on to the next sector.  There are 4 levels like this to clear, each with progressively increasing difficulty.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:51",
    "desc_translated_at": "",
    "original_name_hash": "813d2565",
    "original_desc_hash": "964b4fa2"
  },
  "Defender 2000": {
    "key": "Defender 2000",
    "original_name": "Defender 2000",
    "name": "後衛2000",
    "name_source": "api",
    "original_desc": "Defender 2000 is an update of the classic arcade game by Eugene Jarvis.  This Jaguar game features a port of the original game, and two updated versions: Defender Plus and Defender 2000.\n\nDefender combines a side scrolling shooter with a search and rescue game. You control a ship that travels left and right above the planets surface. Alien lander craft warp into the play area, and begin to descend to the surface. Along the surface, there are humanoids ripe for the picking.  The alien landers grab the humanoids and begin to carry them up the screen. You have to shoot the landers before they reach the top of the screen, and catch the humanoids before they fall to the surface.\n\nThe Defender Plus update features gameplay that is very similar to the original, and graphics that have a crazy, psychedelic look. The Defender 2000 update adds playfields that scroll in both directions, weapon power-ups, bonus rounds, improved graphics, and extremely high speed gameplay.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:52",
    "desc_translated_at": "",
    "original_name_hash": "7ce14b48",
    "original_desc_hash": "55e02007"
  },
  "Doom": {
    "key": "Doom",
    "original_name": "Doom",
    "name": "毀滅戰士：永恆",
    "name_source": "wiki",
    "original_desc": "The Union Aerospace Corporation has been experimenting with teleportation technology on Mars' moons Phobos and Deimos. After early successes, something goes wrong. It seems the scientists have opened a gateway straight to Hell. Phobos base is overrun with demonic creatures, and the whole of Deimos simply vanishes. A squad of marines is sent to Phobos, but all except one are quickly slaughtered. It falls to the surviving marine to grab some guns and strike back at the demons.\n\nid Software's follow-up to their genre-defining Wolfenstein 3D, DOOM is another first person shooter: full-on action seen from the space marine's perspective. Like Wolfenstein, the game consists of distinct episodes, playable in any order. The first episode, Knee-Deep in the Dead, takes place in the Phobos base and is freely available as shareware. The full game continues on Deimos in The Shores of Hell and culminates in Inferno, the final episode which takes place in Hell itself. Each episode consists of nine levels, one of which is a hidden level.\n\nThe basic objective in each level is simply to reach the exit. Since dozens of enemies stand in the way, the only way to get there is through killing them. Switches and buttons must be \npressed to advance at certain points and often color-coded locked doors will block the way - matching keycards or skull keys must be found to pass.\n\nDOOM's engine technology is more advanced than Wolfenstein's, and thus the levels are more varied and complex. The engine simulates different heights (stairs and lifts appear frequently) and different lighting conditions (some rooms are pitch black, others only barely illuminated). There are outdoor areas, pools of radioactive waste that hurt the player, ceilings that come down and crush him, and unlike Wolfenstein's orthogonally aligned corridors, the walls in DOOM can be in any angle to each other. An automap helps in navigating the levels.\n\nStylistically, the levels begin with a futuristic theme in the military base on Phobos and gradually change to a hellish environment, complete with satanic symbols (pentagrams, upside-down-crosses and portraits of horned demons), hung-up mutilated corpses and the distorted faces of the damned.\n\nDOOM features a large weapon arsenal, with most weapons having both advantages and drawbacks. The starting weapons are the fists and a simple pistol. Also available are a shotgun (high damage, slow reload, not good at distances), a chaingun (high firing rate, but slightly inaccurate in longer bursts) and a plasma rifle (combining a high firing rate and large damage). The rocket launcher also deals out lots of damage, but the explosion causes blast damage and must be used with care in confined areas or it might prove deadly to the player as well as the enemies. Two further (in)famous weapons in DOOM are the chainsaw for close-quarter carnage, and the BFG9000 energy gun, that, while taking some practice to fire correctly, can destroy most enemies in a single burst. The different weapons use four different ammunition types (bullets, shells, rockets and energy cells), so collecting the right type for a certain gun is important.\n\nDOOM drops some of Wolfenstein's arcade-inspired aspects, so there are no extra lives or treasures to be collected for points, but many other powerups are still available. Medpacks heal damage while armor protects from receiving it in the first place. Backpacks allow more ammunition to be carried, a computer map reveals the whole layout of the level on the automap (including any secret areas), light amplification visors illuminate dark areas and radiation suits allow travel over waste without taking damage. Also available are berserk packs (which radically increase the damage inflicted by the fists) as well as short-time invisibility and invulnerability powerups.\n\nThe enemies to be destroyed include former humans corrupted during the invasion, plus demons in all shapes and sizes: fireball-throwing imps, floating skulls, pink-skinned demons with powerful bite attacks and large one-eyed flying monstrosities called Cacodemons. Each episode ends with a boss battle against one or two especially powerful creatures.\n\nDOOM popularized multiplayer in the genre with two different modes: Cooperative allows up to four players to move through the single-player game together, while Deathmatch is a competitive game type where players blast at each other to collect 'frag' points for a kill and re-spawn in \na random location after being killed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:51",
    "desc_translated_at": "",
    "original_name_hash": "63af23ac",
    "original_desc_hash": "87e6a968"
  },
  "Double Dragon V - The Shadow Falls": {
    "key": "Double Dragon V - The Shadow Falls",
    "original_name": "Double Dragon V : The Shadow Falls",
    "name": "雙截龍V : 暗影降臨",
    "name_source": "api",
    "original_desc": "Double Dragon V: The Shadow Falls is a sequel to Double Dragon series. Unlike the previous games, which were side-scrolling fighting action games or beat-em-ups, Shadow Falls is a head-to-head fighting game based on the animated Double Dragon TV series in the style of Capcom's 1991 arcade-hit Street Fighter II.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:54",
    "desc_translated_at": "",
    "original_name_hash": "67e76a1c",
    "original_desc_hash": "57e96e4d"
  },
  "Dragon - The Bruce Lee Story": {
    "key": "Dragon - The Bruce Lee Story",
    "original_name": "Dragon : The Bruce Lee Story",
    "name": "龍:李小龍的故事",
    "name_source": "api",
    "original_desc": "Dragon: The Bruce Lee Story is a fighting video game based on the film Dragon: The Bruce Lee Story, which is a semi-fictionalized account of the life of Bruce Lee. You control Lee, and must defeat enemies to progress through the game, recalling major action scenes from the film. You can use a variety of martial arts moves to defeat their enemies and build up a chi meter, which can help unleash special moves on their opponents. The game supports up to three players simultaneously, playing through the game co-operatively, or against each other in a battle mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:54",
    "desc_translated_at": "",
    "original_name_hash": "c6829f93",
    "original_desc_hash": "6c1dae09"
  },
  "Evolution - Dino Dudes": {
    "key": "Evolution - Dino Dudes",
    "original_name": "Evolution : Dino Dudes",
    "name": "進化：恐龍兄弟",
    "name_source": "api",
    "original_desc": "The gameplay of The Humans has similarities to Lode Runner and Lemmings. Your job in this action puzzler is to help prehistoric man to evolve by helping them discover tools, the wheel, weapons, or even fire. Each level in the game will have a given task to help in this, and you are allotted a number of characters who must accomplish the task. The player can switch from person to person while moving the characters around each scrolling puzzle, and teamwork is essential to success.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:54",
    "desc_translated_at": "",
    "original_name_hash": "c5928975",
    "original_desc_hash": "75b3bda5"
  },
  "Fever Pitch Soccer": {
    "key": "Fever Pitch Soccer",
    "original_name": "Fever Pitch Soccer",
    "name": "狂熱足球",
    "name_source": "api",
    "original_desc": "In this isometric football game, 50 national teams are represented to play in two game modes: Exhibition and Tournament (a series of seven games on four continents, with a final against the World All-Stars), with the ability to set time, difficulty level, see cutscenes after goals and if players are free to kick each other around without (many) fouls.\n\nWhile the game seems short-featured for 1995 standards, the tournament mode includes a twist: depending on how well the player defeats his opponents, he can trade his \"standard players\", who won't do anything spectacular (but at least fill up the ranks) for star players, who not only look different, are able to cross and backheel the ball but also have a unique ability at the disposal of the player.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:55",
    "desc_translated_at": "",
    "original_name_hash": "dc5425ab",
    "original_desc_hash": "935aa103"
  },
  "Flashback - The Quest for Identity)": {
    "key": "Flashback - The Quest for Identity)",
    "original_name": "Flashback : The Quest for Identity",
    "name": "閃回:尋找身份",
    "name_source": "api",
    "original_desc": "You're Conrad B. Hart, Galaxis Bureau of Investigation Agent and right now you're stranded on a far-away planet after discovering an alien plot to overtake Earth. You must travel and find your way through four planets back to Earth and foil the aliens' sinister and deadly plans.\n\nThe award winning sci-fi action adventure comes to Jaguar. And it's gonna rip you right out of your comfortable little century and hurl you smack into a time and place that'll have you begging for a nap!\n\n-Film-style, fluid 24 frames-per-second animation and gives life-like movements to this wild action game.\n\n-You star as super-agent Conrad Hart, stranded on a far-away planet after you discover an alien plot to overtake Earth.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:58",
    "desc_translated_at": "",
    "original_name_hash": "b256becc",
    "original_desc_hash": "417ce2f2"
  },
  "Flip Out!": {
    "key": "Flip Out!",
    "original_name": "Flip Out!",
    "name": "翻出來！",
    "name_source": "api",
    "original_desc": "FlipOut! is a puzzle game starring aliens from the planet Phrohmaj. Your  objective in each puzzle is simple: you must place all the colored tiles into the correct spaces on the board. The tricky part is that there is always one more tile than there are spaces. That means you are always juggling at least one tile in the air. The game becomes more difficult as you have to juggle more tiles, and the Phrohmajians try to interfere.\n\nThis game features nine bizarre areas, each with multiple puzzles.  The graphics feature a lot of crazy animation of the Phrohmaj onlookers and lots of bright and colorful tiles.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:55",
    "desc_translated_at": "",
    "original_name_hash": "7cdd2f56",
    "original_desc_hash": "2991d9e5"
  },
  "Hover Strike": {
    "key": "Hover Strike",
    "original_name": "Hover Strike",
    "name": "懸停打擊",
    "name_source": "api",
    "original_desc": "Terrakian Pirates have taken over a colonized planet under Federation control.  They've set up an atmospheric cannon, making invasion impossible.  Your job, as a hovercraft pilot, is to launch a pre-emptive strike on the planet's surface.\n\nHover Strike for the Jaguar is a mission-based tank game.  In each mission, you will drop to the surface of the planet, destroy some targets, and then return to your ship in orbit.  The hovercraft you pilot is heavily armored and includes various weapons systems to take out enemies and targets.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:58",
    "desc_translated_at": "",
    "original_name_hash": "f5cf2ace",
    "original_desc_hash": "67e677f7"
  },
  "Hyper Force": {
    "key": "Hyper Force",
    "original_name": "Hyper Force",
    "name": "超級力量",
    "name_source": "api",
    "original_desc": "It's Just You, Your Gun, and a Corporate Army Bent On Your Destruction.\n\nTrans Con is decimating world after world in search of enough resources and wealth to launch an attack against the Terran High Command. The politicians don't want a direct confrontation that might hurt their corporate sponsors. So, Interstellar Special Forces has been called in to send a lone warrior to eliminate the Trans Con threat. Wanna guess who that warrior is?\n\nFeatures:\n-More than 20 levels of intense action!\n-ISF Supply Shop allows you to upgrade 5 different weapons\n-Secret areas and hidden switches\n-Parallax scrolling\n-Incredible in-game music!\n-Saved game support with three game slots",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:58",
    "desc_translated_at": "",
    "original_name_hash": "9addb66d",
    "original_desc_hash": "507d062c"
  },
  "I-War": {
    "key": "I-War",
    "original_name": "I-War",
    "name": "一戰",
    "name_source": "api",
    "original_desc": "The giant supercomputer that controls the world's information has been infected with viruses. You must enter the virtual world known as the I-Way, and clear them out with your anti-virus tank.\nI-War is a 3D virtual reality tank game. In each of the 21 levels, you must find all the data pods and make your way to the exit. Enemy tanks, turrets, and bombers stand in your way, as well as occasional traps or locked doors controlled by hidden switches. Levels are divided into simple, enclosed rooms, linearly connected by one-way teleporters.\nYou can select a fast, medium, or heavy tank at the beginning of the game, with its abilities reflected in the strength of its guns or the amount of punishment it can absorb. Throughout the game, you will also find weapon power-ups and tank upgrades (such as shields, radar, and auto-targeting) to help you stay effective against the increasing numbers of enemy defenders. You can save your progress to the cart at the end of each level.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:01",
    "desc_translated_at": "",
    "original_name_hash": "9805b8ba",
    "original_desc_hash": "3d8cb8da"
  },
  "Iron Soldier 2": {
    "key": "Iron Soldier 2",
    "original_name": "Iron Soldier 2",
    "name": "鋼鐵戰士2",
    "name_source": "api",
    "original_desc": "Iron Soldier 2 puts you back in the pilot's seat of a 42 foot tall humanoid war machine.  The old Iron Fist corporation is gone, and a new democratic republic has been set up. The peace is short lived, though. Iron Fist's rival, PENTA corporation, is now threatening the United Republic's stability.  You are a pilot for the United Republic, and must stop PENTA's advances.\n\nIron Soldier 2 plays similarly to the first game.  You have new weapons, new enemies, and 20 super-challenging missions to contend with.\n\nOriginally released on CD, Telegames later released a cartridge version, featuring the same gameplay as the CD version, but lacking music as well as having had the FMV sequences replaced with still images due to space constraints.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:01",
    "desc_translated_at": "",
    "original_name_hash": "cbe70b0f",
    "original_desc_hash": "c4a60dda"
  },
  "Iron Soldier": {
    "key": "Iron Soldier",
    "original_name": "Iron Soldier",
    "name": "鋼鐵戰士",
    "name_source": "api",
    "original_desc": "It is the future, and the earth has been covered with wastelands and cities.  The powerful, faceless Iron First Corporation has replaced the last forms of free government.  Now, they are developing a new, 42-foot, armed robot known as the Iron Soldier.  With the Iron Soldier, no one will be able to stop the Iron First Corporation.  The only hope is the Resistance, a group that has managed to capture one of the Iron Soldier prototypes.  You are a pilot for the Resistance.  It's up to you to pilot the robot and bring down the Iron Fist.\n\nIron Soldier is mech sim played from an in-cockpit view.  There are 16 single player missions.  Objectives involve taking out certain targets, defending convoys, collecting items, and so on.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:01",
    "desc_translated_at": "",
    "original_name_hash": "d47f31a8",
    "original_desc_hash": "3e4931ef"
  },
  "Kasumi Ninja": {
    "key": "Kasumi Ninja",
    "original_name": "Kasumi Ninja",
    "name": "霞忍者",
    "name_source": "api",
    "original_desc": "On the tiny island of Kasumi, there exists a portal between this world and the Netherworld.  For many centuries, this portal has been kept closed by the balance between good and evil forces.  Now, the dark ninja lord Gyaku has defeated the forces of good, and opened the portal to the netherworld.  It is up to you, a Kasumi ninja, to stop Gyaku and restore balance to the world.\n\nKasumi Ninja is a one-on-one fighting game featuring digitized character graphics.  There are 8 fighters for you to choose from, each with their own fighting environments.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:03",
    "desc_translated_at": "",
    "original_name_hash": "2f33da7b",
    "original_desc_hash": "40f51e09"
  },
  "NBA Jam - Tournament Edition": {
    "key": "NBA Jam - Tournament Edition",
    "original_name": "NBA Jam : Tournament Edition",
    "name": "NBA Jam ：錦標賽版",
    "name_source": "api",
    "original_desc": "NBA Jam, which featured 2-on-2 basketball, is one of the first real playable basketball games, and is also one of the first sports games to feature NBA-licensed teams and players, and their real digitized likenesses. NBA Jam: T.E. included updated rosters, new features and easter eggs combined with the same gameplay of the original. Teams now consisted of three players (though only two could be on court at any time), with the exception of the new \"Rookies\" team, which consists of five players, all picked in the 1994 NBA draft, and players could be substituted into the game between quarters.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:03",
    "desc_translated_at": "",
    "original_name_hash": "638c8ac5",
    "original_desc_hash": "653e5de0"
  },
  "Pinball Fantasies": {
    "key": "Pinball Fantasies",
    "original_name": "Pinball Fantasies",
    "name": "彈球幻想",
    "name_source": "api",
    "original_desc": "After the success of Pinball Dreams on several systems, a sequel featuring four new tables was created. The gameplay is much the same as the first game, with realistic physics, multi-player options and a high score table to aim for. The tables are Partyland, Speed Devils, Billion Dollar Gameshow and Stones 'n' Bones, taking in a funfair, racing cars, a tacky game-show, and a graveyard. Each one has a range of ramps, combos, light sequences and targets to shoot, as well as general themes which are less influenced by real tables than those in Pinball Dreams.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:03",
    "desc_translated_at": "",
    "original_name_hash": "1a265f9c",
    "original_desc_hash": "444e667a"
  },
  "Pitfall - The Mayan Adventure": {
    "key": "Pitfall - The Mayan Adventure",
    "original_name": "Pitfall : The Mayan Adventure",
    "name": "陷阱:瑪雅歷險記",
    "name_source": "api",
    "original_desc": "Pitfall: The Mayan Adventure is a sequel to Activision's 1982 Pitfall! for the Atari 2600, the player controls Pitfall Harry, Jr., son of the protagonist of the original game, as he attempts to rescue his father from a Mayan jungle setting.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:04",
    "desc_translated_at": "",
    "original_name_hash": "d2717149",
    "original_desc_hash": "897eef43"
  },
  "Power Drive Rally": {
    "key": "Power Drive Rally",
    "original_name": "Power Drive Rally",
    "name": "動力驅動拉力賽",
    "name_source": "api",
    "original_desc": "Power Drive Rally is a view into the exciting world of rally racing.  This game is an overhead-view racer featuring real cars and tracks based on locations around the world.\n\nThe main game mode portrays a season of championship racing.  There are several types of races that you will encounter.  First, there is the special stage, which is a timed qualifying round.  Second, there is the rally cross stage, in which you race against one other computer-controlled racer.  Finally, there is the skill stage, where you have to perform a series of tricky driving maneuvers.  After each round, you earn money for qualifying or winning.  You can then use this money to repair your car, or save the money to purchase a new, faster car.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:07",
    "desc_translated_at": "",
    "original_name_hash": "dda9252d",
    "original_desc_hash": "2e440660"
  },
  "Protector - Special Edition": {
    "key": "Protector - Special Edition",
    "original_name": "Protector : Special Edition",
    "name": "保護者：特別版",
    "name_source": "api",
    "original_desc": "Haven-7 is a planetoid near Earth whose inhabitants are in grave danger. Aliens will arrive soon and plan to terraform Haven-7 which will annihilate every living thing. You, with the last remaining spaceship, are the only one left to protect Haven-7 from the aliens.\n\nProtector features 3 difficulty levels and fast-paced shooting action as you blast swarms of aliens all at once in fierce battle. Purchase ship upgrades and find powerups to help you blast the alien starships.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:07",
    "desc_translated_at": "",
    "original_name_hash": "bbbb3217",
    "original_desc_hash": "c5039534"
  },
  "Raiden": {
    "key": "Raiden",
    "original_name": "Raiden",
    "name": "雷電",
    "name_source": "api",
    "original_desc": "In the year 2090, Earth is invaded by extra-terrestrials. The World Alliance of Nations has developed a supersonic attack fighter, Raiden, to defend the Earth. A pilot must take control of the experimental fighter to destroy the alien warships that just happen to look like odd variations of typical military tanks and planes with gadgets attached to them. \n\nRaiden (called Raiden Trad on the Genesis and SNES) is an over-head vertical-scrolling shooter, based on an arcade game of the same title. It features two forms of weapon upgrades and two types of missiles (normal or homing). You start the game with several bombs which you can use to destroy most enemies on the screen to get yourself out of a jam. Each level ends with a large boss or bosses.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:07",
    "desc_translated_at": "",
    "original_name_hash": "a370664d",
    "original_desc_hash": "d1380ef4"
  },
  "Rayman": {
    "key": "Rayman",
    "original_name": "Rayman",
    "name": "雷曼",
    "name_source": "api",
    "original_desc": "When a villain known only as Mr. Dark appears, trouble brews in Rayman's world.  Mr. Dark captures the Toons - source of light and Rayman's friends.  With no more light, evil creatures begin to roam, making the world unsafe for everyone.  Its up to you, as Rayman, to free your friends and put an end to Mr. Dark's dastardly schemes!\n\nRayman is side-scrolling platformer starring the titular Rayman, a big-nosed chap with no arms or legs.  Rayman can jump and use his hair to hover for a short period of time.  He can also attack by throwing his fists, or winding up his fists for a more powerful punch.  He can occasionally find special power ups that grant him unlimited flying power, giving him the ability to navigate through tricky mazes.\n\nAside from the platforming action, the other notable feature of Rayman is its large, detailed and vibrant graphics, which have helped it to stand out from most other similar games in the genre.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:07",
    "desc_translated_at": "",
    "original_name_hash": "f8d17f28",
    "original_desc_hash": "f52b26b9"
  },
  "Ruiner Pinball": {
    "key": "Ruiner Pinball",
    "original_name": "Ruiner Pinball",
    "name": "毀滅者彈球",
    "name_source": "api",
    "original_desc": "Ruiner Pinball is a collection of two fantasy pinball tables: Ruiner and Tower.\n\nRuiner is a two screen wide table that features flashy scaling and rotation effects. There are lots of ramps and animated moving targets to score on.  Ruiner has a cold war nuclear holocaust theme.\n\nTower is an extra-tall table that features a medieval horror motif. Like Ruiner, it contains animated targets and scaling effects.  Both tables contain missions, or series of targets to increase the scoring opportunities available.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:10",
    "desc_translated_at": "",
    "original_name_hash": "ff5a5064",
    "original_desc_hash": "21b08475"
  },
  "Sensible Soccer - International Edition": {
    "key": "Sensible Soccer - International Edition",
    "original_name": "International Sensible Soccer : World Champions",
    "name": "國際明智足球:世界冠軍",
    "name_source": "api",
    "original_desc": "Released alongside the 1994 World Cup, this was the first version of Sensible Soccer to feature teams from outside Europe. The World Cup tournament is featured in full, and you can adjust which 24 teams this features, a particularly crucial feature for English and French fans, as their nations failed to qualify. For the first time in the series an on-screen referee is featured. The club team data has been updated to take into account transfers and kit changes since the previous version. Gameplay is much the same as previous editions, being viewed from above with small sprites and loose ball control.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:10",
    "desc_translated_at": "",
    "original_name_hash": "3f24dcdd",
    "original_desc_hash": "6f0d8689"
  },
  "Skyhammer": {
    "key": "Skyhammer",
    "original_name": "Skyhammer",
    "name": "天錘",
    "name_source": "api",
    "original_desc": "In a futuristic city, you are a mercenary pilot flying a helicopter-like craft in cyberspace. Hired by the large corporation Cytox, you are to defend its corporate holdings from those who seek to destroy all it has accomplished.\n\nThe numerous missions involve flying to several large cities and hunting down the renegades who threaten them. You have a cockpit view of the city as you hunt down your enemies and dock at the Cyber Mart for repairs. As you destroy your enemies and complete missions, you can earn credits for buying more supplies, weapons and ship upgrades at the Cyber Mart.\n\nPlay in Mission Mode or Battle Mode. To win the game, you must complete each mission successfully. The enemies become more tough as you progress through the \"levels\" of gameplay.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:08",
    "desc_translated_at": "",
    "original_name_hash": "376d51b0",
    "original_desc_hash": "e81dba5a"
  },
  "Soccer Kid": {
    "key": "Soccer Kid",
    "original_name": "Soccer Kid",
    "name": "足球小子",
    "name_source": "api",
    "original_desc": "Aliens attempting to steal the World Cup have crashed as they tried to flee, and the Cup has been broken, its pieces scattered around the globe. As Soccer Kid, you must retrieve it. During your journey you will visit Britain, Italy, Russia, Japan, and finally the States.\n\nSoccer Kid is a platform game with some unique elements.  As the name implies, you have to kill your enemies with your ball. Football-style tricks of keeping the ball in the air and under control are especially useful - headers and overhead kicks can be played with practice. You gain access to the pieces by collecting 11 Player Cards across each world.\n\nThere is a saving feature that gives you the ability to save between each country (but not between individual levels).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:10",
    "desc_translated_at": "",
    "original_name_hash": "ec1ef404",
    "original_desc_hash": "4be6cbbb"
  },
  "Space War 2000": {
    "key": "Space War 2000",
    "original_name": "Space War 2000",
    "name": "太空戰爭2000",
    "name_source": "api",
    "original_desc": "As a space knight, you will vie for glory, honor, fame and fortune in this one- or two-player first-person perspective 3D jousting adventure. Procure multiple weapons anhd cool defensive items in your quest to rank with other valiant knights on the High Score Table.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:12",
    "desc_translated_at": "",
    "original_name_hash": "cde8fc63",
    "original_desc_hash": "fd714c1c"
  },
  "Super Burnout": {
    "key": "Super Burnout",
    "original_name": "Super Burnout",
    "name": "超級倦怠",
    "name_source": "api",
    "original_desc": "Super Burnout is an arcade-style superbike racing game inspired by Super Hang-On. Players control an ultra-fast motorcycle through races that take place on famous tracks throughout the world. There are six bikes to choose from with races on a total of eight different tracks. The usual racing game modes are present. There is a single race mode, a practice mode, and a championship mode. Players can also compete against a friend in a single-race versus mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:14",
    "desc_translated_at": "",
    "original_name_hash": "3a910806",
    "original_desc_hash": "a00c43b0"
  },
  "SuperCross 3D": {
    "key": "SuperCross 3D",
    "original_name": "SuperCross 3D",
    "name": "超級越野3D",
    "name_source": "api",
    "original_desc": "Supercross 3D brings the excitement of arena supercross racing to the Jaguar.  Not only do you get to race ahead of your competitors, you can catch big air on the huge jumps and perform a few tricks.\n\nThere are three game modes: Practice, Single Race, and Tournament. In practice mode, you can race around any track for as long as you like.  In single race mode, you compete in one race against the computer.  Finally, in tournament mode, you compete in a series of races to accumulate points and become the Supercross champion.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:14",
    "desc_translated_at": "",
    "original_name_hash": "4aa52e76",
    "original_desc_hash": "dc790ec4"
  },
  "Syndicate": {
    "key": "Syndicate",
    "original_name": "Syndicate",
    "name": "辛迪加",
    "name_source": "api",
    "original_desc": "In the future, the world is controlled by a handful of global corporations (syndicates).  You are the Marketing director (hit man) for one of these companies.  It is your job to take control away from the competitors.  The job is not one of diplomacy, but one of brute force and physical control.  Advance your way to the top of the corporation by successfully completing your missions and managing the money you make from your territories.\n\nThe gameplay is visually reminiscent of X-Com, with an angled top-down perspective, but it is real time rather than turn based. You have missions ranging from infiltrate and capture, to seek and destroy. In each of these you direct a team of four agents as they move through the world shooting at anything that gets in their way.\n\nYou can upgrade and modify your agents, as well as equip them with tools you have researched or liberated from opposing syndicates.  As you complete missions, you gain more funds to use for purchasing agents or researching upgrades and equipment.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:14",
    "desc_translated_at": "",
    "original_name_hash": "f51edf59",
    "original_desc_hash": "7b79c1b1"
  },
  "Tempest 2000": {
    "key": "Tempest 2000",
    "original_name": "Tempest 2000",
    "name": "暴風雨2000",
    "name_source": "api",
    "original_desc": "Tempest 2000 is a remake/upgrade of the popular Atari vector graphics-based shooter.\n\nBlast your way through over 100+ levels, shooting the creatures that come out from the other side of the web to drag you in. Collect power-ups (jump, AI robots and more) to trippy graphics and colorful explosions as a thumping techno-house soundtrack blasts in the background.\n\nCollect enough bonuses, and be subjected to two different types of bonus rounds as you navigate through rings, or try to ride a spiral tube.\n\nAlso included in the gameplay is an intense two-player mode to team up with or go head to head against another player, or even play a version of the original arcade game. There are four modes of gameplay in all: Traditional Tempest, Tempest Duel, Tempest Plus and Tempest 2000.\n\nFace the web....",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:18",
    "desc_translated_at": "",
    "original_name_hash": "9fd698cc",
    "original_desc_hash": "83455b2c"
  },
  "Theme Park": {
    "key": "Theme Park",
    "original_name": "Theme Park",
    "name": "主題公園",
    "name_source": "api",
    "original_desc": "Dominating the exciting world of Theme Park ownership is your goal in this strategy game from Bullfrog. The first task is to set up your rides within the available land, structuring convenient paths and queues and ideally leaving some space for bigger rides once they become available, and include some lakes and trees to increase the park's allure. Rides range from Teacups and Haunted Houses to the biggest most elaborate roller-coaster you can design, and water rides that loop around other rides.\n\nShops must also be included, so that the visitors can buy food, drinks and souvenirs - the cunning player will combine salt, sugar and caffeine settings to maximize consumer interest. Staff must be hired to keep everything running smoothly, and they will only work for what they consider a fair rate of pay.\n\nYou are competing against other Theme Parks, so don't let them get an advantage over you - monitor your success in attracting customers and financial viability closely using the supplied statistics pages. More important, ensure that research is adequately funded to produce new rides.\n\nIt can be played in three modes - Sandbox level lets you concentrate on the park design elements, while Sim and Full add more strategic features.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:18",
    "desc_translated_at": "",
    "original_name_hash": "69d0a3f3",
    "original_desc_hash": "7dabd16d"
  },
  "Total Carnage": {
    "key": "Total Carnage",
    "original_name": "Total Carnage",
    "name": "全面屠殺",
    "name_source": "api",
    "original_desc": "The war of 1999 left the country of Kookistan in shambles. Naturally, a dictator named General Akhboob took control of the beleagured nation and began creating an army of radioactive mutants. With a virtually impenetrable stronghold, a bunch of hostages, and a legion of mutants under his command, the evil despot will stop at nothing but world domination. Only two men have the courage and idealistic naivete to take on Akhboob and his forces: Captain Carnage and Major Mayhem, also known as the Doomsday Squad.\n\nAs Captain Carnage or Major Mayhem, it is up to you or you and a friend (in simultaneous action) to rescue the hostages while shooting hundreds of mutants bent on your destruction. As you walk and run forward, backward, left, right, and diagonally through 20 battlezones of nonstop action, you'll always have your machine gun by your side. Additional weapons which you can find along the way include grenade launchers, rocket launchers, plasma machine guns, flame throwers, spray-fire rifles, defensive blades, and an assortment of bombs.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:18",
    "desc_translated_at": "",
    "original_name_hash": "bbf438bc",
    "original_desc_hash": "b886b4e1"
  },
  "Checkered Flag": {
    "key": "Checkered Flag",
    "original_name": "Checkered Flag",
    "name": "方格旗",
    "name_source": "api",
    "original_desc": "Checkered Flag for the Jaguar is a 3D F1-style racing game. The racing game staples are here: single race, practice, and tournament. You can choose to set up a variety of options for each race, also.  You can choose various weather conditions.  Or, you can set up your car to change it's handling characteristics.  There are 10 different tracks on which to race, each with a different theme.  Some take place on sunny beaches, others take place in the arctic.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:19",
    "desc_translated_at": "",
    "original_name_hash": "8a8dd4bb",
    "original_desc_hash": "4f52201f"
  },
  "Fight for Life": {
    "key": "Fight for Life",
    "original_name": "Fight for Life",
    "name": "為生命而戰",
    "name_source": "api",
    "original_desc": "Fight for Life is a 3D fighting game that takes place in hell.  The player controls one of eight deceased fighters competing to earn a chance to escape and return to the world of the living. After they defeat an opponent they not only move on to the next round, but also learn two of the opponent's moves.\n\nThis is the only 3D fighting game released for the Jaguar.  It features brightly-colored texture mapped fighters and arenas. Gameplay is very similar to Virtua Fighter, in that the moves more-or-less look like real martial arts.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:21",
    "desc_translated_at": "",
    "original_name_hash": "69b3fd19",
    "original_desc_hash": "41709460"
  },
  "Missile Command 3D": {
    "key": "Missile Command 3D",
    "original_name": "Missile Command 3D",
    "name": "導彈指揮3D",
    "name_source": "api",
    "original_desc": "Missile Command 3D is an update to the classic Atari arcade game. The goal in Missile Command is to defend your cities against an onslaught of missiles coming from the sky. Your arsenal consists of three anti-missile flak cannons. You have to position the anti-missile clouds in the path of the incoming missiles to stop them from impacting.\n\nThis Jaguar game has 3 modes. First, there is a port of the original arcade game. There are neat extras for this mode like graphic backdrops and the ability to resize or scale the screen. The second mode is Missile Command 3D. This mode retains the gameplay of the original, but adds 3D graphics to the mix. The final mode, Virtual Missile Command, changes things up quite a lot. Instead of anti-missile flak, your cannons shoot lasers. This means you don't need to lead your targets anymore. You play the game from a first-person perspective, and must switch between the three cannons via buttons on the keypad. There are nine levels in this mode, each with a boss at the end.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:21",
    "desc_translated_at": "",
    "original_name_hash": "8c4b390c",
    "original_desc_hash": "7db801b4"
  },
  "Towers II": {
    "key": "Towers II",
    "original_name": "Towers II : Plight of the Stargazer",
    "name": "塔樓 II : 觀星者的困境",
    "name_source": "api",
    "original_desc": "Become one of four different characters as you are immersed within the strange happenings in the mystical land of Lamini. You must uncover the secrets as you explore Daggan's tower. Many before you have tried, but none have returned. First person perspective, full screen smooth scrolling, talk to others, refer to maps, collect 100's of items, encounter 100's of creatures, experience challenges in combat and spell casting. Hours and hours of entertainment with appropriate save features.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:21",
    "desc_translated_at": "",
    "original_name_hash": "65c01bbf",
    "original_desc_hash": "c913b32b"
  },
  "Trevor McFur in the Crescent Galaxy": {
    "key": "Trevor McFur in the Crescent Galaxy",
    "original_name": "Trevor McFur in the Crescent Galaxy",
    "name": "特雷弗·麥克弗在新月星系",
    "name_source": "api",
    "original_desc": "The Crescent Galaxy has been attacked by an entity known as Odd-it. This creatures goal is to make everything odd, like it. You play Trevor McFur, a corporal in the Crescent Galaxy's chapter of the Interplanetary Defense squad and are sent in along with your feline partner Cutter to defeat Odd-it. The game is a side scrolling shooter featuring a wide variety of worlds and enemies to conquer. Throughout the game you can power your ship with newer and better weapons by shooting certain enemies and collecting the bonuses left behind.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:22",
    "desc_translated_at": "",
    "original_name_hash": "f1a26f0f",
    "original_desc_hash": "3e17ce92"
  },
  "Troy Aikman NFL Football": {
    "key": "Troy Aikman NFL Football",
    "original_name": "Troy Aikman NFL Football",
    "name": "特洛伊·艾克曼 NFL 橄欖球",
    "name_source": "api",
    "original_desc": "You and a friend can become star NFL players or choose to coach a team in this realistic rendition of the game of American football, endorsed by former Dallas Cowboys quarterback and Super Bowl champ, Troy Aikman. Choose to play alone against the system, or play against each other.\n\nPick from 3 play modes: Pre-season, Season, or Custom Generated (editable) season. There are also three skill levels: Rookie, Pro and Veteran.  You can design your own plays, customize your team, and save your team's stats. True-to-life playing surfaces have an effect on how your team performs and include grass, mud, dirt, snow, rain and turf. Listen to the roar of the crowd and other authentic stadium sounds as your plays are followed through.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:24",
    "desc_translated_at": "",
    "original_name_hash": "fbcb00af",
    "original_desc_hash": "dbd190ca"
  },
  "Ultra Vortek": {
    "key": "Ultra Vortek",
    "original_name": "Ultra Vortek",
    "name": "超渦流",
    "name_source": "api",
    "original_desc": "Civilization has fallen into a deep decline.  Gangs and warlords are gaining power and influence all over the world.  Then out of nowhere, a powerful being known as the Gaurdian appears with a challenge.  Unless a warrior meets his challenge, he will destroy the Earth.  So, 7 warriors from around the world fight to re-open the Ultra Vortek and restore the Earth.\n\nUltra Vortek is a one-on-one fighting game similar to Mortal Kombat.  Some of the fighters are digitzed actors, other are stop motion or computer animated.  You have at your control an array of punches and kicks, and a large number of special moves.  The game also features several \"finishing moves\" for each of the 7 warriors.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:24",
    "desc_translated_at": "",
    "original_name_hash": "d875f670",
    "original_desc_hash": "c97beafb"
  },
  "Val d'Isere Skiing and Snowboarding": {
    "key": "Val d'Isere Skiing and Snowboarding",
    "original_name": "Val d'Isère Skiing and Snowboarding",
    "name": "伊澤爾谷滑雪和單板滑雪",
    "name_source": "api",
    "original_desc": "Cut the slopes on some of the steepest mountainsides in SKIING AND SNOWBOARDING, a wild winter challenge where speed in guaranteed! Train and compete on the breathtaking slopes of France's world-famous Vald-Isère Ski Resort. Race against time and friends in slalom, giant slalom and downhill events.\nWatch out for trees, snowmobiles and sno-cats as you barrel down windswept mountainsides, black ice, and moguls.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:24",
    "desc_translated_at": "",
    "original_name_hash": "7ad67846",
    "original_desc_hash": "8fa689ed"
  },
  "White Men Can't Jump": {
    "key": "White Men Can't Jump",
    "original_name": "White Men Can't Jump",
    "name": "白人不會跳",
    "name_source": "api",
    "original_desc": "This is the game of basketball the way many people learn to play it - in the city streets - with loose rules and in various suburban locales. Inspired by the 1992 film about high stakes street basketball gambling, in this game you can wager how much you want on each game.\n\nThe action is seen from the half court line, with a screen view that pans and zooms to follow the action. Aside from a goal tending penalty and the need to clear the ball, anything goes. For instance, steals are effected by shoving an opponent and making a grab for the ball.\n\nYour goal is to get enough money to enter, and win, the tournament. If you make $5000, you instantly get entered into the tournament. You have the ability to save your game in this mode so that you can come back later if you run short on time and don't want to lose all your money.\n\nOpt for a single game or the Slam City tournament, while game options determine time limits, scoring system, and control schemes. There are fifteen teams to choose from, and up to four players can get in on the action (with the Jaguar Team Tap adapter included with the game).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:26",
    "desc_translated_at": "",
    "original_name_hash": "a6dcbd88",
    "original_desc_hash": "f0cb01a0"
  },
  "Wolfenstein 3D": {
    "key": "Wolfenstein 3D",
    "original_name": "Wolfenstein 3D",
    "name": "德軍總部3D",
    "name_source": "wiki",
    "original_desc": "id software's adaptation of their classic first-person shooter Wolfenstein 3D to consoles is not a straight port, but a remix with substantial changes as well as new additions.\n\nWhile the basic gameplay of exploring levels, shooting enemies, collecting treasures, keys and power-ups remain the same, only half of the original game's 60 levels have been retained. Each of those 30 levels (grouped into six missions, with two levels being secret ones) is a simplified version of an original level. The end bosses for the missions are taken from both Wolf3D as well as its sequel, Spear of Destiny.\n\nOther changes from the original include new power-ups: an ammo box (taken from Spear of Destiny) and backpack that increases the maximum amount of ammo that can be carried.\n\nThe original's weapons (knife, pistol, machine gun, chaingun) all return, but there are also two completely new tools of destruction: a flame thrower and a rocket launcher.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:25",
    "desc_translated_at": "",
    "original_name_hash": "a27017d6",
    "original_desc_hash": "208fb77c"
  },
  "Worms": {
    "key": "Worms",
    "original_name": "Worms",
    "name": "蠕蟲",
    "name_source": "api",
    "original_desc": "Worms is a turn-based strategy game. It features up to 4 teams of 4 worms, aiming to destroy the others on a generated terrain. Each worm has 100 hit points, and dies when his hit points fall to 0. Upon death, a worm explodes, causing damage to everyone around.\n\nGameplay is turn-based. Each turn, the player can control one specific worm from his team. The worm can crawl left and right or jump. However, there is a time limit to make a move; also, if the worm falls from a great height, it loses health and the turn ends immediately; and if a worm falls into water or offscreen, it dies. Each turn, a worm can also make a single attack: the player can aim up and down, choose a weapon and then fire it. After attacking, the turn ends. \n\nThere's a lot of weapons available - the standard ones as bazookas (which is affected by the (random) wind settings and gravity) and grenades. The others include a Fire Punch, dynamite, air strikes, and utilities such as ropes and girders.\n\nThere are 10 styles of terrain, ranging from forests and deserts to Candy land and the moon (complete with affected gravity). Shots leave craters in the ground, and complex tunnels can be formed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:27",
    "desc_translated_at": "",
    "original_name_hash": "8ba2899e",
    "original_desc_hash": "ffd9079a"
  },
  "Zero 5": {
    "key": "Zero 5",
    "original_name": "Zero 5",
    "name": "零5",
    "name_source": "api",
    "original_desc": "ZERO 5 is a futuristic space shooter set in a 3-D, 360 degree playfield. The year is 2044 and the battle for Earth has begun. On the far reaches of the galaxy, a massive invasion force is assembling. Scanners at DEFCON have alerted you to the alien threat. The Earth's best pilots are dispatched in their BAMBAM cruisers to engage the enemy. Multiple weapons, driving soundtrack, non-stop combat, multiple power-ups, and 15 extended missions contribute to a shooters game with real depth.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:29",
    "desc_translated_at": "",
    "original_name_hash": "88d586c8",
    "original_desc_hash": "f8a8d2ff"
  },
  "Zool 2": {
    "key": "Zool 2",
    "original_name": "Zool 2",
    "name": "動物園2",
    "name_source": "api",
    "original_desc": "The sequel to Zool sees him take on the bad guys Mental Block and Krool across 15 levels.\n\nZool 2 is a platform game where you control the titular \"Ninja of the Nth Dimension\" (or his girlfriend, Zooz, who can complete each level in a slightly different way) as he rampages through a variety of levels, collecting countless tasty treats, shooting any enemies that he encounters and finding bonuses (there's a variety of special power-ups Zool can find - for example, a bomb that follows him and can be blown up at any time to remove on-screen enemies, or a temporary invulnerability). New to the sequel is Zool's ability to scale walls and his new spinning attacks. \n\nOn each level you have to collect a certain amount of the featured fruit within an allocated time limit, and then find the exit across the multi-directionally-scrolling levels. There are lots of hidden areas to see, including a bonus Breakout game starring Zool's pet 2-headed dog.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:29",
    "desc_translated_at": "",
    "original_name_hash": "7763227b",
    "original_desc_hash": "c7979ce1"
  },
  "Zoop!": {
    "key": "Zoop!",
    "original_name": "Zoop!",
    "name": "動物園！",
    "name_source": "api",
    "original_desc": "Fast-paced action-puzzle game where the player eliminates colored shapes that are approaching his alter ego, another colored shape, before they reach the top, ala Tetris.\n\nIn order to eliminate the other shapes, you must point your piece at it and 'fire'. If the shape is the same color as your piece, the shape is eliminated, as well as all of the shapes of the same color behind it, until your piece hits a piece of a different color. If the shape is of a different color, or it is hit when collecting a line of similar shapes, your piece exchanges colors with the shape.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:56:29",
    "desc_translated_at": "",
    "original_name_hash": "2afc8239",
    "original_desc_hash": "07e7a253"
  }
}