{
  "Cyber Shinobi, The (Europe, Brazil)": {
    "key": "Cyber Shinobi, The (Europe, Brazil)",
    "original_name": "The Cyber Shinobi",
    "name": "網絡忍者",
    "name_source": "api",
    "original_desc": "In the previous game, an evil army of villains, known simply as \"Zeed\" , but some of them escaped, however. \n\nTime has passed and it is the year 2XXX where atomic power plants in countries around the world are attacked, and plutonium, which was the equivalent of 100,000 megatons of explosive power, was stolen from these plants. The words \"Cyber Zeed\" was always written at the scene of the crime. Later, the world realized what Cyber Zeed had planned to do: use their nuclear capabilities to terrorize the world. Every nation sent their best forces to stop this threat, but all of them failed. \n\nJoe Musashi came forward to this great evil, and he is required to fight those who rose from the ashes and put an end to this threat.\n\nCyber Shinobi is a one-player game that consists of six rounds. You need to fight ninjas that get in your way using your fists and legs. You can also defeat them using special attacks and ninjitsu. Power-ups can be collected along the way, which will give you more shots, ninjitsu, power, and life. A boss needs to be defeated at the end of the round.",
    "desc": "在前一款遊戲中，有一支由惡棍組成的邪惡軍隊，簡稱為“Zeed”，但其中一些人逃脫了。\n\n時間一晃，到了2XXX年，世界各國原子能發電廠遭到襲擊，相當於10萬兆噸爆炸力的钚被從這些工廠中盜走。犯罪現場總是寫著“Cyber Zeed”字樣。後來，世界意識到了 Cyber Zeed 的計劃：利用他們的核能力來恐嚇世界。每個國家都派出了最好的力量來阻止這一威脅，但都失敗了。\n\n武藏喬挺身而出，面對這個巨大的邪惡，他需要與那些從灰燼中復活的人戰鬥，結束這個威脅。\n\nCyber Shinobi 是一款單人遊戲，共六輪。你需要用你的拳頭和腿來對抗那些阻礙你的忍者。您還可以使用特殊攻擊和忍術擊敗他們。一路上可以收集能量道具，這將為你提供更多的射擊、忍術、力量和生命。Boss 需要在回合結束時被擊敗。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:33",
    "desc_translated_at": "2026-01-02T12:45:33",
    "original_name_hash": "ed2bd2f0",
    "original_desc_hash": "75bb484a"
  },
  "Dragon Crystal (Europe, Brazil) (En)": {
    "key": "Dragon Crystal (Europe, Brazil) (En)",
    "original_name": "Dragon Crystal",
    "name": "暴鯉龍",
    "name_source": "wiki",
    "original_desc": "Dragon Crystal is a dungeon crawler with RPG elements, along the lines of classics such as Rogue or Nethack. Without relying on a story, the game throws you into a randomly generated world which you should explore carefully - and most importantly, where you must survive! The complex, maze-like levels reveal their structure only after you cover the corresponding map areas. Your goal in each level is to reach a teleporter which will take you to the next one. There are also a lot of random items scattered around - weapons, armor, money, and food. Money allows you to continue the game if you die, food prevents you from starving. The enemies are visible on screen, and you fight them in a fast-paced turn-based combat, moving around and pressing direction arrows to strike with the equipped weapon. You are always accompanied by an egg which will eventually grow up to be a dragon if you have leveled up enough.",
    "desc": "《Dragon Crystal》是一款帶有 RPG 元素的地下城探索遊戲，與《Rogue》或《Nethack》等經典遊戲類似。遊戲不依賴故事，而是將你帶入一個隨機生成的世界，你應該仔細探索這個世界 - 最重要的是，你必須在那裡生存！只有在您覆蓋相應的地圖區域後，複雜的迷宮般的關卡才會顯示其結構。您在每個級別的目標是到達一個傳送器，它將帶您進入下一個級別。周圍還散落著許多隨機物品——武器、盔甲、金錢和食物。如果你死了，金錢可以讓你繼續遊戲，食物可以防止你挨餓。敵人在屏幕上可見，你可以在快節奏的回合製戰鬥中與他們戰鬥，四處移動並按下方向箭頭以使用裝備的武器進行攻擊。你總是伴隨著一顆蛋，如果你的等級足夠高，它最終會成長為一條龍。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:35",
    "desc_translated_at": "2026-01-02T12:45:35",
    "original_name_hash": "f4a5f708",
    "original_desc_hash": "e296495d"
  },
  "Master of Darkness (Europe, Brazil)": {
    "key": "Master of Darkness (Europe, Brazil)",
    "original_name": "Master of Darkness",
    "name": "黑暗大師",
    "name_source": "api",
    "original_desc": "Master of Darkness is a Platformer very similar to Castlevania.\n\nYou play as a psychologist trying to defeat Dracula. This requires you to fight your way through several spooky locations such as cemeteries, laboratories, castles or a house of wax dolls. To defeat your enemies, you can use several primary and secondary weapons. Primary weapons are close combat weapons ranging from knifes to rapiers and axes, that differ in range and efficiency. Secondary weapons are long-range weapons (pistols, bombs etc.) with limited ammunition. The game features 5 Rounds divided into 3 stages. At the end of each stage, a boss must be defeated.",
    "desc": "《Master of Darkness》是一款與《惡魔城》非常相似的平台遊戲。\n\n你扮演一名心理學家，試圖擊敗德古拉。這需要你在幾個詭異的地點殺出一條血路，比如墓地、實驗室、城堡或蠟娃娃屋。為了擊敗你的敵人，你可以使用多種主要和次要武器。主要武器是近戰武器，從刀到劍和斧頭，其射程和效率各不相同。次要武器是彈藥有限的遠程武器（手槍、炸彈等）。遊戲共有 5 輪，分為 3 個階段。在每個階段結束時，都必須擊敗 Boss。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:37",
    "desc_translated_at": "2026-01-02T12:45:37",
    "original_name_hash": "2084aab3",
    "original_desc_hash": "dc4bb032"
  },
  "Shinobi (USA, Europe, Brazil) (Rev 1)": {
    "key": "Shinobi (USA, Europe, Brazil) (Rev 1)",
    "original_name": "Shinobi",
    "name": "忍",
    "name_source": "api",
    "original_desc": "You control a ninja, Shinobi, who must battle his way through each level in search of hostages which must be rescued. You have shurikens, kicks and punches to defend yourself with. As well as the powerful ninja magic which can clear the screen of enemies in one go.\n\nEach level is broken down into smaller scenes and hostages are guarded by big blokes who throw swords. Watch out for gun-toting enemy henchmen and ninjas.\n\nReaching the end of each level will find you battling it out with a boss. These range from 8ft giants to helicopter gunships.",
    "desc": "你控制一個忍者忍者，他必須在每個關卡中奮戰，尋找必須獲救的人質。你可以用手裡劍、拳腳來保護自己。以及強大的忍者魔法，可以一口氣清除敵人的屏幕。\n\n每個關卡都分為更小的場景，人質由投擲劍的大個子看守。提防持槍的敵方追隨者和忍者。\n\n到達每個關卡的末尾時，你都會與老闆進行戰鬥。這些範圍從 8 英尺巨型飛機到武裝直升機。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:39",
    "desc_translated_at": "2026-01-02T12:45:39",
    "original_name_hash": "da43bbcc",
    "original_desc_hash": "fee677e8"
  },
  "Asterix (Europe, Brazil) (En,Fr) (Rev 1)": {
    "key": "Asterix (Europe, Brazil) (En,Fr) (Rev 1)",
    "original_name": "Astérix",
    "name": "阿斯特里克斯",
    "name_source": "api",
    "original_desc": "Getafix, the Druid whose potion has kept his village from falling in Caesar's hands, has been kidnapped! Join Asterix and Obelix as they try to rescue the druid and save the village!",
    "desc": "德魯伊赫塔菲克斯被綁架了，他的魔藥使他的村莊免於落入凱撒手中！加入阿斯特里克斯和奧貝利克斯，嘗試營救德魯伊並拯救村莊！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:41",
    "desc_translated_at": "2026-01-02T12:45:41",
    "original_name_hash": "6b669ec4",
    "original_desc_hash": "6938626f"
  },
  "Wonder Boy in Monster Land (USA, Europe)": {
    "key": "Wonder Boy in Monster Land (USA, Europe)",
    "original_name": "Wonder Boy in Monster Land",
    "name": "怪物樂園裡的神奇男孩",
    "name_source": "api",
    "original_desc": "Eleven years have gone by since Tom-Tom rescued his girlfriend Tanya from the clutches of the evil King. Word of Tom-Tom's dangerous adventure soon spread throughout Wonder Land. The people were very proud of him and gave Tom-Tom the highest honor of all - the legendary name of Wonder Boy. With the evil King defeated, Wonder Land returned to its peaceful state, and for over one decade, the kingdom was a paradise, and everything and everyone lived happily together.\nEventually, the peace was broken when a ferocious fire-breathing dragon appeared out of nowhere and took over Wonder Land with an army of evil, monsterous henchmen, causing Wonder Land was immediately thrown into utter chaos. The people were quickly taken over and the tranquil and serene kingdom was transformed into a land of demons and devils. Wonder Land was now a Monster Land. Tom-Tom was summoned to set out on a journey, destroy this dragon, and restore peace once again. Tom-Tom is Wonder Land's last hope.",
    "desc": "自從湯姆湯姆從邪惡國王的魔掌中救出女友坦尼婭以來，已經過去十一年了。湯姆湯姆的危險冒險的消息很快就傳遍了仙境。人們為他感到非常自豪，並授予湯姆湯姆最高的榮譽——神奇男孩的傳奇名字。邪惡之王被擊敗後，仙境又恢復了平靜，十幾年來，王國變成了世外桃源，萬物皆可幸福地生活在一起。\n最終，和平被打破，一條兇猛的噴火巨龍憑空出現，帶著邪惡怪物大軍佔領了仙境，仙境頓時陷入一片混亂。人們很快就被佔領了，平靜安寧的王國變成了惡魔之地。仙境現在變成了怪物之地。湯姆湯姆被召喚踏上旅程，消滅這條巨龍，再次恢復和平。湯姆湯姆是仙境的最後希望。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:43",
    "desc_translated_at": "2026-01-02T12:45:43",
    "original_name_hash": "6c38afd1",
    "original_desc_hash": "b140634d"
  },
  "Sonic The Hedgehog (USA, Europe, Brazil)": {
    "key": "Sonic The Hedgehog (USA, Europe, Brazil)",
    "original_name": "Sonic the Hedgehog",
    "name": "",
    "name_source": "",
    "original_desc": "SEGA's mascot Sonic the Hedgehog made his debut in a famous Genesis title, but Sega's 8-bit systems got their own version of the platformer featuring the same story and gameplay style but different levels. To stop the evil Dr. Robotnik, Sonic must traverse six zones consisting of three levels each. Most of the zones are based on the original game, but some are new. Enemies and power-ups are mostly the same as well. Sonic can pick up golden rings for protection (when hit, he simply loses all of his rings instead of a life) and bonuses: 100 rings gain Sonic an extra life, and 50 remaining rings at the end of a level allow access to pinball-themed special stages full of bumpers and springs. The final level of a zone is always a boss fight against Robotnik. Sonic should also collect the six Chaos Emeralds to keep them from falling into Robotnik's hands. In a departure from the original game, these are not hidden in the special stages but somewhere in the regular levels.",
    "desc": "SEGA 的吉祥物刺猬索尼克在著名的 Genesis 遊戲中首次亮相，但 Sega 的 8 位系統擁有自己的平台遊戲版本，具有相同的故事和遊戲風格，但級別不同。為了阻止邪惡的機器人博士，索尼克必須穿越六個區域，每個區域由三層組成。大多數區域都是基於原版遊戲，但也有一些是新的。敵人和能力提升也大多相同。索尼克可以拾取金戒指進行保護（被擊中時，他只是失去所有戒指而不是生命）和獎勵：100 個戒指讓索尼克獲得額外的生命，關卡結束時剩下的 50 個戒指允許進入充滿緩衝器和彈簧的彈球主題特殊階段。區域的最終關卡始終是與 Robotnik 的 Boss 戰。索尼克還應該收集六顆混沌翡翠，以防止它們落入機器人手中。與原版遊戲不同的是，這些並不是隱藏在特殊關卡中，而是隱藏在常規關卡中的某個地方。",
    "desc_source": "api",
    "needs_retranslate": true,
    "name_translated_at": "2026-01-02T12:45:45",
    "desc_translated_at": "2026-01-02T12:45:45",
    "original_name_hash": "9d0b36ec",
    "original_desc_hash": "3bb7c6f2"
  },
  "Wonder Boy in Monster World (Europe)": {
    "key": "Wonder Boy in Monster World (Europe)",
    "original_name": "Wonder Boy in Monster World",
    "name": "怪物世界中的神奇男孩",
    "name_source": "api",
    "original_desc": "\"Monster World was once a peaceful region. Then, the peace was shattered by an invading army of monsters. A young man named Shion vowed to defeat them and make his land peaceful again.\"\n\nWonder Boy In Monster World puts you in control of Shion in his quest to save Monster World from the evil hands of BioMeka.  It controls like your standard platform game - run, jump, and kill enemies.  The game is filled with RPG elements such as talking to townsfolk, collecting money to buy items, upgrading your life, and equipping a variety of armor and weapons - staying very close to the \"Zelda format\".  You can save your game to continue your quest at a later time.\n\nWonder Boy In Monster World is the third game in the Monster World spin-off series.  In Japan the game is called Wonder Boy 5: Monster World 3.",
    "desc": "“怪物世界曾經是一個和平的地區。後來，和平被入侵的怪物大軍打破了。一個名叫紫苑的年輕人發誓要打敗他們，讓他的土地恢復和平。”\n\n《怪物世界裡的神奇男孩》讓你控制 Shion，從 BioMeka 的邪惡手中拯救怪物世界。它的控制方式就像標準平台遊戲一樣——奔跑、跳躍和殺死敵人。遊戲充滿了 RPG 元素，例如與城鎮居民交談、收集金錢購買物品、升級你的生活以及裝備各種盔甲和武器 - 非常接近“塞爾達格式”。您可以保存遊戲以便稍後繼續您的任務。\n\n怪物世界中的神奇男孩是怪物世界衍生系列的第三款遊戲。在日本，該遊戲稱為 Wonder Boy 5：怪物世界 3。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:48",
    "desc_translated_at": "2026-01-02T12:45:48",
    "original_name_hash": "bbf08510",
    "original_desc_hash": "9cad882a"
  },
  "Fantasy Zone II (USA, Europe, Brazil)": {
    "key": "Fantasy Zone II (USA, Europe, Brazil)",
    "original_name": "Fantasy Zone II",
    "name": "",
    "name_source": "",
    "original_desc": "Fantasy Zone II on the Master System is a shooting game in which you control a spaceship. Equipped with various weapons such as bombs or missiles, you must dodge or destroy enemies to stay alive and finish the level.",
    "desc": "Master System上的Fantasy Zone II是一款控制宇宙飛船的射擊遊戲。配備炸彈或導彈等各種武器，你必須躲避或消滅敵人才能生存並完成關卡。",
    "desc_source": "api",
    "needs_retranslate": true,
    "name_translated_at": "2026-01-02T12:45:49",
    "desc_translated_at": "2026-01-02T12:45:49",
    "original_name_hash": "2076cd47",
    "original_desc_hash": "3cd2689b"
  },
  "Battle Out Run (Europe, Brazil)": {
    "key": "Battle Out Run (Europe, Brazil)",
    "original_name": "Battle Out Run",
    "name": "戰鬥出逃",
    "name_source": "api",
    "original_desc": "Battle Out Run is Sega's answer to Taito's Chase H.Q. You drive a red sports car and must apprehend eight target vehicles in selected cities across the USA, including Los Angeles, Chicago, Miami, and New York. You have to do this while avoiding yellow cars and other obstacles. Halfway through the eight stages, you enter a shop that allows you to upgrade your car and get some nitros, as long as you have money, and you will be rewarded if you apprehend the vehicles. This can be done by bumping into them to disable them.",
    "desc": "Battle Out Run 是世嘉對 Taito 的 Chase H.Q. 的回應。你駕駛一輛紅色跑車，必須在美國選定的城市（包括洛杉磯、芝加哥、邁阿密和紐約）逮捕八輛目標車輛。你必須在避開黃色汽車和其他障礙物的同時做到這一點。八個關卡過半時，你會進入一家商店，可以升級你的汽車並獲得一些硝基，只要你有錢，抓獲車輛就會獲得獎勵。這可以通過碰撞它們來禁用它們來完成。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:51",
    "desc_translated_at": "2026-01-02T12:45:51",
    "original_name_hash": "40a19100",
    "original_desc_hash": "967ae720"
  },
  "OutRun (World)": {
    "key": "OutRun (World)",
    "original_name": "Out Run",
    "name": "外跑",
    "name_source": "api",
    "original_desc": "Race across varied terrain in this conversion of one of the most famous arcade racing games. Your Ferrari is at the ready, complete with female passenger, over a series of short tracks.\n\nGameplay is viewed form just above and behind the car, so you can see it. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose you time. On each section of track there is a fork in the road, allowing you to choose which direction you go in. You have to complete 5 track sections in total, out of the 15 in the game.",
    "desc": "在這款最著名的街機賽車遊戲之一的改版中，穿越不同的地形。您的法拉利已準備就緒，並載有女性乘客，在一系列短跑道上行駛。\n\n遊戲玩法是從汽車的上方和後面觀看的，所以你可以看到它。道路上充滿了急彎和危險，接觸它們可能會導致汽車滾動並浪費您的時間。每段賽道上都有一個岔路口，您可以選擇前進的方向。遊戲共有 15 個賽道段，總共需要完成 5 個賽道段。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:53",
    "desc_translated_at": "2026-01-02T12:45:53",
    "original_name_hash": "c09e0530",
    "original_desc_hash": "711a3c0f"
  },
  "Sonic Chaos (Europe, Brazil)": {
    "key": "Sonic Chaos (Europe, Brazil)",
    "original_name": "Sonic Chaos",
    "name": "索尼克 未知邊境",
    "name_source": "wiki",
    "original_desc": "The inhabitants of South Island are in danger! Dr. Robotnik has stolen all the Chaos Emeralds which kept the power balance. Robotnik has thrown the Emeralds in a parallel universe and is keeping the red one. Sonic and Tail must retreive all the Chaos Emeralds before the destruction of South Island.\nThis is the first Game Gear game where you can play either Sonic or Tail.",
    "desc": "南島的居民處於危險之中！機器人博士偷走了所有保持權力平衡的混沌翡翠。機器人尼克將祖母綠扔進了平行宇宙，並保留了紅色祖母綠。索尼克和泰爾必須在南島毀滅之前取回所有混沌翡翠。\n這是第一款可以玩 Sonic 或 Tail 的 Game Gear 遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:55",
    "desc_translated_at": "2026-01-02T12:45:55",
    "original_name_hash": "5e0ef1a8",
    "original_desc_hash": "d966c632"
  },
  "Lord of the Sword (USA, Europe, Brazil)": {
    "key": "Lord of the Sword (USA, Europe, Brazil)",
    "original_name": "Lord of the Sword",
    "name": "劍之主",
    "name_source": "api",
    "original_desc": "The player is in the role of Landau, a man who must pass three tests in order to gain the crown of the land Baljinya, which for years has been rife with lawlessness and fear, and restore peace to the land. To pass the three tests, Landau must find the Tree of Marill, subdue the Goblin of Balala Valley, and destroy the Statue Of Evil.\n\nLandau is controlled in a 3rd-person side-scrolling view. He can explore the world map (which can be seen by pressing the pause button) freely in a non linear way, but some portions of the map will be available only after defeating certain enemies or getting certain items. The Kingdom of Baljinya has towns and villages where Landau can stop to rest (restoring his health) and gather information from the people. There are also castles which can only be entered after completing certain tasks. Between those villages, towns and castles lie different kinds of terrains, like flatlands, dark forests, mountains and swamps. Those terrains are plagued by different kinds of monsters, some specific of each terrain.\n\nThere are two weapons which can be used by Landau: a sword and a bow. The sword can be used by pressing the button 2 while standing, kneeling or jumping. The bow can be used by pressing the button 1 only when standing or kneeling. Landau cannot walk and attack at the same time. Along his way he'll find new and stronger swords and bows.\n\nLandau has only one life, but the game offers a continue feature which can be used up to 10 times.",
    "desc": "玩家扮演蘭多（Landau），他必須通過三項考驗，才能獲得多年來一直充斥著無法無天和恐懼的巴爾金亞（Baljinya）土地的王冠，並恢復這片土地的和平。為了通過三項考驗，蘭道必須找到馬里爾之樹，制服巴拉拉山谷的妖精，並摧毀邪惡雕像。\n\n蘭道是在第三人稱橫向滾動視圖中控制的。他可以以非線性的方式自由探索世界地圖（可以通過按暫停按鈕看到），但地圖的某些部分只有在擊敗某些敵人或獲得某些物品後才能使用。巴爾金亞王國有城鎮和村莊，蘭多可以停下來休息（恢復健康）並從人民那裡收集信息。還有一些城堡需要完成一定的任務才能進入。在這些村莊、城鎮和城堡之間有不同的地形，如平原、黑暗的森林、山脈和沼澤。這些地形受到不同種類怪物的困擾，其中一些怪物是每個地形所特有的。\n\n蘭道可以使用兩種武器：劍和弓。站立、跪下或跳躍時按下按鈕2即可使用劍。只有在站立或跪著時按下按鈕1才能使用弓。蘭道不能同時行走和攻擊。一路上他會發現新的、更強大的劍和弓。\n\nLandau 的生命只有一次，但遊戲提供了連續功能，最多可以使用 10 次。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:57",
    "desc_translated_at": "2026-01-02T12:45:57",
    "original_name_hash": "22329196",
    "original_desc_hash": "d1c67496"
  },
  "Ninja, The (USA, Europe, Brazil) (En)": {
    "key": "Ninja, The (USA, Europe, Brazil) (En)",
    "original_name": "The Ninja",
    "name": "Ninja (網絡紅人)",
    "name_source": "wiki",
    "original_desc": "Early in Japan's edo era, circa 1630, peace had continued in the western province of Ohkami until the feudal lord passed away. Gyokuro, an evil emperor, gained power and his oppressive rule caused great hardship to the people, and the princess who opposed him was confined to a dungeon somewhere in the Ohkami castle. Gyokuro has the Ohkami ninja under control at his command. Utilizing various ninjitsu techniques, in addition to the one that transforms them into a wolf, they protect him from the people who are his enemies.\n\nYou play Kazamuru, a great warrior who challenges the clan to a fight in order to rescue the princess. However, he can't rescue the princess unless he finds the five scrolls in the thirteen areas of Ohkami. On his quest, he must defeat various ninjas such as Kuno-ichi and Ninniku, as well as fire-blowing ninjas, slashing ninjas, and footloose ninjas. You'll explore grassy fields, shrines, river banks,  towns, and the castle itself. Some of the steps have varied gameplay. For example, you must avoid boulders in Step 2, must use logs in order to cross a river in Step 5, avoid being trampled on by horses in Step 7, and scale a cliff in Step 9.",
    "desc": "日本江戶時代初期，即 1630 年左右，西部大神省一直保持著和平，直到封建領主去世為止。邪惡的皇帝玉郎掌握了權力，他的壓迫統治給人民帶來了巨大的苦難，而反對他的公主則被關在大神城的某個地牢裡。玉郎在他的指揮下控制了大神忍者。他們利用各種忍術，除了將他們變成狼的忍術之外，還保護他免受敵人的傷害。\n\n你扮演 Kazamuru，一位偉大的戰士，為了拯救公主，他向部落髮起戰鬥。然而，除非他在大神十三區找到五捲捲軸，否則他無法營救公主。在他的任務中，他必須擊敗各種忍者，如女忍者和忍者，以及噴火忍者、砍殺忍者和自由忍者。您將探索草地、神社、河岸、城鎮和城堡本身。有些步驟有不同的遊戲玩法。例如，在步驟2中必須避開巨石，在步驟5中必須使用圓木過河，在步驟7中避免被馬踐踏，在步驟9中攀爬懸崖。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:45:59",
    "desc_translated_at": "2026-01-02T12:45:59",
    "original_name_hash": "da49631f",
    "original_desc_hash": "296edb41"
  },
  "Enduro Racer (USA, Europe, Brazil) (En)": {
    "key": "Enduro Racer (USA, Europe, Brazil) (En)",
    "original_name": "Enduro Racer",
    "name": "耐力賽車手",
    "name_source": "api",
    "original_desc": "In this game you play the role of an endurance bike racer. The gameplay involves you racing against the clock to get to the finish line and jumping over ramps. At the end of each race you get points for how many cars or bikes you have overtaken with which you can upgrade your bike.\nThere are various different terrain for you to race on including desert beach and dirt tracks plus a number of things to slow you down or even knock you off of your bike all together. The main idea is to find the best route through each level to shave off valuable seconds in order to over take more cars and bikes.\n\nThe Japanese version of the game has more Tracks than the European and US versions have. Among  them is a snow track which is one of the hardest tracks in the game, because there is a lot of stones on the thin road.",
    "desc": "在這款遊戲中，您扮演耐力自行車賽車手的角色。遊戲玩法要求你與時間賽跑，到達終點線並跳過坡道。在每場比賽結束時，您將獲得超過多少輛汽車或自行車的積分，您可以用這些積分來升級您的自行車。\n有各種不同的地形供您比賽，包括沙漠海灘和土路，還有許多會讓您減速甚至讓您從自行車上摔下來的東西。主要思想是找到通過每個級別的最佳路線，以節省寶貴的時間，以便超越更多的汽車和自行車。\n\n日本版的遊戲比歐洲版和美國版的曲目更多。其中雪道是比賽中最難的賽道之一，因為細路上有很多石頭。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:01",
    "desc_translated_at": "2026-01-02T12:46:01",
    "original_name_hash": "6c9ac0ce",
    "original_desc_hash": "049927d0"
  },
  "Buggy Run (Europe, Brazil) (En)": {
    "key": "Buggy Run (Europe, Brazil) (En)",
    "original_name": "Buggy Run",
    "name": "越野跑",
    "name_source": "api",
    "original_desc": "Buggy Run is a game that lets players race dune buggies in a championship over 15 possible tracks (plus 4 in 2 player mode) each winning money that can be used for dune buggy upgrades.  There are 4 different modes that can be played in single player mode that includes Race, Vs Com, Freerun, and Battle.\n\nIn the main mode Race the player is given $20,000 starting cash that can be used to upgrade the buggy. The upgradable features of the buggy are Tyres (grip), Engine (speed), Suspension (limits bounce), Steering (cornering), Transmission (performance). All the upgrades cost $10,000 for level 2, $30,000 for level 3, and $50,000 for level 4 however the player doesn’t need to get them in order. There are also special upgrades to buy that includes $5000 for a mine (drops behind and if another car hits then it is blown up until reset), $5000 for Nitoro (gives the players car a short speed boost), and $10,000 for extra capacity of special items (starts with 2 slots to a max of 6). Special Items must be used in the order they're placed in the slots.\n\nWithin the race the player will be racing 4 other cars to a race to the chequered flag on an isometric scrolling track. Some hazards on the track are lumps and jumps, bumps, rough road and mud. Appearing on the track are special power-ups that are red or white boost and extra money also a random that selects between the two. The prize money for winning is $30,000, 2nd gets $20,000, 3rd gets $10,000, and last gets $5000 to spend on the upgrades and power-ups between races. There are 3 stages of racing that is beginner, intermediate, and expert that have 5 races each. The player must qualify for the next stage or else it will be game over.\n\nIn Vs Com the player plays the computer one on one on any track of the player's choice. All the upgrades for the buggy for the player and the computer are done though allocating a set number of points to varies upgrades. All the item slots can by used for either the nitoro or mine. \n\nFreerun is a time trial where the player races alone without upgrades on any track against the clock. \n\nBattle mode is where the player picks 3 computer players to battle on a round arena with the objective to knock the opponents off with the last player on the arena winning.\n\nThere is also a two players mode that include Race, 1P vs 2P, and Battle.\n\nIn 2P Race there is $30,000 for both players to upgrade there cars before placing them on a track with a fixed overhead view where they play 2 computer opponents. There are 4 different themes to pick from.\n\n1P vs 2P is just the two players battling it out on one of 4 tracks each with 4 different themes. Buggy upgrades are done though allocating a set number of points.\n\nBattle is the same as single player battle only with 2 players and 2 computers.",
    "desc": "Buggy Run 是一款讓玩家在 15 條可能的賽道（加上 4 條 2 人模式）的錦標賽中駕駛沙丘越野車比賽的遊戲，每條賽道都可以贏得可用於沙丘越野車升級的金錢。單人遊戲模式有 4 種不同的模式，包括競賽、對抗、自由奔跑和戰鬥。\n\n在主要模式“競賽”中，玩家將獲得 20,000 美元的起始現金，可用於升級越野車。越野車的可升級功能包括輪胎（抓地力）、發動機（速度）、懸架（限制彈跳）、轉向（轉彎）、變速箱（性能）。所有升級的 2 級費用為 10,000 美元，3 級費用為 30,000 美元，4 級費用為 50,000 美元，但玩家不需要按順序進行升級。還有一些特殊的升級可供購買，其中包括價值 5000 美元的地雷（落在後面，如果另一輛車撞上，它就會被炸毀直到重置），價值 5000 美元的 Nitoro（給玩家的汽車短暫的速度提升），以及價值 10,000 美元的特殊物品額外容量（從 2 個插槽開始，最多 6 個）。特殊物品必須按照放置在插槽中的順序使用。\n\n在比賽中，玩家將與另外 4 輛賽車在等距滾動賽道上爭奪方格旗。賽道上的一些危險包括顛簸、跳躍、顛簸、崎嶇不平的道路和泥濘。出現在賽道上的是特殊的能量提升，它們是紅色或白色的增強，額外的金錢也是在兩者之間隨機選擇的。獲勝獎金為 30,000 美元，第二名獲得 20,000 美元，第三名獲得 10,000 美元，最後一名獲得 5000 美元，用於在比賽之間進行升級和加電。比賽分為初級、中級、專家3個階段，每個階段有5場比賽。玩家必須有資格進入下一階段，否則遊戲就會結束。\n\n在 Vs Com 中，玩家可以在玩家選擇的任何曲目上與計算機進行一對一的遊戲。玩家和計算機的越野車的所有升級都是通過為不同的升級分配一定數量的點數來完成的。所有物品槽均可用於 nitoro 或我的。\n\nFreerun 是一項計時賽，玩家無需升級即可在任何賽道上與時間賽跑。\n\n對戰模式是玩家選擇 3 名電腦玩家在圓形競技場上進行戰鬥，目標是擊倒對手，最後一名進入競技場的玩家獲勝。\n\n還有兩人模式，包括競賽、1P vs 2P 和戰鬥。\n\n在 2P Race 中，兩名玩家需要花費 30,000 美元來升級賽車，然後將它們放置在具有固定俯視圖的賽道上，與 2 個電腦對手進行比賽。有 4 個不同的主題可供選擇。\n\n1P vs 2P 是兩名玩家在 4 條賽道之一上展開對決，每條賽道都有 4 個不同的主題。有缺陷的升級是通過分配一定數量的點數來完成的。\n\n戰鬥與單人戰鬥相同，只有 2 名玩家和 2 台電腦。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:03",
    "desc_translated_at": "2026-01-02T12:46:03",
    "original_name_hash": "e459bdb5",
    "original_desc_hash": "d8af1e73"
  },
  "Psycho Fox (USA, Europe, Brazil)": {
    "key": "Psycho Fox (USA, Europe, Brazil)",
    "original_name": "Psycho Fox",
    "name": "心理狐狸",
    "name_source": "api",
    "original_desc": "Psycho Fox is a platform game where you play a fox and you must get through seven worlds, consisting of three areas each. At the end of each world, there are one of seven bosses waiting to destroy you, but some of the later bosses are exactly the same as the earlier ones. The title is a bit misleading because you can also play as three other characters including Hippo, Leopard, and Monkey Boy. Each character has their own disadvantages. For example, Hippo is much slower than the other three. However, all the characters share one thing in common: they can use their fists and punch enemies as they approach them. They can also jump on them and keep knocking them in the ground until they disappear off the face of the earth. If they don't make them disappear, they will pop back out again and set out for revenge. Obstacles are scattered through each area, including spikes, cannonballs, esculators, fireballs, and steam.\n\nYou start the game with three lives. Once you touch an enemy, you lose a life. Lose any of your lives, and the game is over. If the game is over, you can continue where you left off. There are several items to find, and these can help you on your quest, and one of these items are eggs. If you break any of these eggs, either the \"switch\" item or the invincibility item is revealed. If you're lucky enough, a white bag is also revealed, but more often than not, one of your enemies can pop out from inside the egg. One egg will reveal a bird which you can carry for the rest of the game. This bird may be nothing but a pest, as it hinders your progress, but you can throw it at enemies to knock them out. It can also be used as a backup, meaning that you can have enemies touching you, but it is the bird that is killed, not you.\n\nThere is little chance that you'll find a white bag inside an egg, unless you go up into a secret area, which can often be found if you jump on springs that are scattered throughout the level. These white bags are useless, until you get to the bonus areas, which are at the end of each area. In these bonus stages, you can place a number of foxes on a path depending on how much white bags you've collected throughout each area.\n\nWhen you complete Psycho Fox, you are treated to a funny ending.",
    "desc": "Psycho Fox 是一款平台遊戲，您扮演一隻狐狸，必須穿過七個世界，每個世界由三個區域組成。在每個世界的盡頭，都有七個 Boss 之一等著消滅你，但後來的一些 Boss 與早期的完全一樣。這個標題有點誤導，因為你還可以扮演其他三個角色，包括河馬、豹子和猴子男孩。每個角色都有自己的缺點。例如，河馬比其他三者慢得多。然而，所有角色都有一個共同點：當敵人接近時，他們可以用拳頭猛擊敵人。他們還可以跳到它們身上，不斷地將它們撞到地上，直到它們從地球表面消失。如果他們不讓他們消失，他們就會再次跳出來並開始復仇。每個區域都散佈著障礙物，包括尖刺、砲彈、自動扶梯、火球和蒸汽。\n\n你以三個生命開始遊戲。一旦觸碰敵人，你就會失去生命。失去任何一條生命，遊戲就結束了。如果遊戲結束，您可以從上次中斷的地方繼續。有幾種物品可以找到，這些物品可以幫助你完成任務，其中之一就是雞蛋。如果你打破這些雞蛋中的任何一個，“開關”物品或無敵物品都會被揭示。如果你足夠幸運，還會露出一個白色的袋子，但通常情況下，你的敵人之一可能會從蛋內彈出。一個雞蛋會露出一隻鳥，你可以帶著它玩剩下的遊戲。這隻鳥可能只是一種害蟲，因為它會阻礙你的前進，但你可以將它扔向敵人，將他們擊倒。它也可以用作備份，這意味著你可以讓敵人接觸你，但被殺死的是鳥，而不是你。\n\n除非你進入一個秘密區域，否則你不太可能在雞蛋內找到一個白色的袋子，如果你跳上散佈在整個關卡中的彈簧，通常可以找到這個區域。這些白色袋子毫無用處，直到您到達位於每個區域末尾的獎勵區域。在這些獎勵階段中，您可以在一條路徑上放置一定數量的狐狸，具體取決於您在每個區域收集的白色袋子的數量。\n\n當你完成《Psycho Fox》時，你會看到一個有趣的結局。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:05",
    "desc_translated_at": "2026-01-02T12:46:05",
    "original_name_hash": "ba749be1",
    "original_desc_hash": "7234f808"
  },
  "SpellCaster (USA, Europe, Brazil) (En)": {
    "key": "SpellCaster (USA, Europe, Brazil) (En)",
    "original_name": "SpellCaster",
    "name": "施法者",
    "name_source": "api",
    "original_desc": "Kujakuo is based on the comic by the same name, published in Young Jump in the late eighties and drawn by Makoto Ogino. It is a tale of the occult, centred around the buddhist monk Kujaku.\n\nIn this game, Kujaku is sent out by his master, Ajari, to find out what has happened at the nearby temple of Hieizan. Upon arriving, after having fought his way through magical creatures and deadly warriors, he find his comrades slain. One of them, Kubira, is still holding on to his life, and before drawing his last breath, he utters the word \"Izumo\". Ajuri then sends Kujaku to the town of Izumo, where he encounters a deadly enemy of unknown origin.\n\nKujakuo is part adventure game à la Déjà vu (or, since this is a Sega game, Hoshi o sagashite), part platform action. To get between the adventure parts, you must pass an action level, as well as a boss fight or two, just as in Cosmic Spacehead.\n\nThe adventure part has you looking at a scenery, with a text box for descriptions and lines, and a set of verbs on the right. Use a cursor to point out specific objects for your verbs.\n\nIn the platform levels, Kujaku can jump and shoot magic bolts. While the usual bolt is small, he can load up before releasing them, R-Type style. Pressing the pause button opens up the spell menu, for accessing more powerful magical spells. New spells can be learned throughout the game. Most spells are offensive, but some grant additional powers such as levitation. Each time a spell is activated, you use up your limited spirit energy. Enemies will, when killed, sometimes drop spheres that will raise your spirit energy, though.\n\nThis game was remade into Spellcaster upon its release in the West.",
    "desc": "《Kujakuo》改編自八十年代末在《Young Jump》上發表的同名漫畫，由荻野誠繪製。這是一個以佛教僧人九覺為中心的神秘故事。\n\n在這款遊戲中，Kujaku 被他的主人 Ajari 派去查明附近比叡山寺廟發生的事情。在與魔法生物和致命的戰士戰鬥後，他到達目的地後，發現他的戰友都被殺了。其中一個名叫久比拉（Kubira）的人仍然死死地抱著自己的生命，在嚥下最後一口氣之前，他說出了“出雲”這個詞。阿朱里隨後將九雀送往出雲鎮，在那裡他遇到了來歷不明的致命敵人。\n\n《Kujakuo》一半是冒險遊戲 à la Déjà vu（或者，因為這是一款世嘉遊戲，所以是 Hoshi o sagashite），一半是平台動作遊戲。為了進入冒險部分，你必須通過一個動作關卡，以及一兩場 Boss 戰，就像在 Cosmic Spacehead 中一樣。\n\n冒險部分讓你看風景，有一個用於描述和台詞的文本框，右側有一組動詞。使用光標指出動詞的特定賓語。\n\n在平台關卡中，Kujaku 可以跳躍並發射魔法箭。雖然通常的螺栓很小，但他可以在釋放螺栓之前加載，R-Type 風格。按下暫停按鈕會打開法術菜單，以訪問更強大的魔法法術。在整個遊戲過程中可以學習新的咒語。大多數法術都是攻擊性的，但有些法術會賦予額外的力量，例如懸浮。每次激活法術時，你都會消耗有限的精神能量。不過，敵人在被殺死後有時會掉落可以提升你精神能量的球體。\n\n該遊戲在西方發行後被重新製作成《Spellcaster》。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:07",
    "desc_translated_at": "2026-01-02T12:46:07",
    "original_name_hash": "89fa4332",
    "original_desc_hash": "60128063"
  },
  "California Games II (Europe)": {
    "key": "California Games II (Europe)",
    "original_name": "California Games II",
    "name": "最终幻想II",
    "name_source": "wiki",
    "original_desc": "California Games II is the sequel to the smash hit 1988 game.\n\nThis time you compete in: hang-gliding, jetski, skateboarding, body boarding and snow boarding.",
    "desc": "California Games II 是 1988 年熱門遊戲的續作。\n\n這次你參加的比賽項目有：懸掛式滑翔、水上摩托艇、滑板、趴板和滑雪板。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:09",
    "desc_translated_at": "2026-01-02T12:46:09",
    "original_name_hash": "9b519467",
    "original_desc_hash": "02c105b4"
  },
  "Bomber Raid (World)": {
    "key": "Bomber Raid (World)",
    "original_name": "Bomber Raid",
    "name": "轟炸機突襲",
    "name_source": "api",
    "original_desc": "Fly your plane through five levels, shooting enemy planes, submarines, helicopters, and other enemies along the way, and use your equipped cluster bombs if necessary. You need to destroy a target that is outlined in your mission briefing. You have three lives and limited cluster bombs. To help you along the way, you can shoot a power pod \nto score points, increase your firepower, and gain some help from fellow squadrons.",
    "desc": "駕駛你的飛機穿過五個關卡，射擊沿途的敵機、潛艇、直升機和其他敵人，並在必要時使用你裝備的集束炸彈。您需要摧毀任務簡報中概述的目標。你有 3 條生命和有限的集束炸彈。為了一路幫助你，你可以拍攝一個電源吊艙\n得分、增強火力並獲得其他中隊的幫助。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:12",
    "desc_translated_at": "2026-01-02T12:46:12",
    "original_name_hash": "dd0c7024",
    "original_desc_hash": "d2a7bcb9"
  },
  "Wonder Boy (USA, Europe, Brazil) (Rev 1)": {
    "key": "Wonder Boy (USA, Europe, Brazil) (Rev 1)",
    "original_name": "Wonder Boy",
    "name": "神奇男孩",
    "name_source": "api",
    "original_desc": "Just when things were going great with Tom-Tom and his girlfriend Tanya, some thug of a woodland king had to kidnap her and hide her away, and Tom-Tom doesn't have a clue where. That's why he has to explore deep dark forests, cross endless oceans, climb treacherous slopes, survive endless volcanoes, and even walk through clouds. But Tom-Tom will never be totally alone. You see, when he goes through the exotic locations, he has to come face to face with its inhabitants, like bees, spiders, snakes, coal-kids, frogs, bats, snails, coyotes, and octopuses, to name a few. The hatchet is Tom-Tom's only line of defense against these menaces.\n\nThere are ten areas, each containing four rounds each, but the tenth area can't be accessed unless Tom-Tom collects all the dolls during his rescue mission. During his journey, he can break open different eggs that will reveal hatchets, skateboards, mushrooms, milk, and even guardian angels. You can ride the skateboard through each round, as long as you don't collide with an inhabitant. When you complete each round while still riding the skateboard, you'll start the next round still riding it. As you progress through each round, your vitality will start to get low, but it can be increased by getting milk, mushrooms, potato chips,or fruit that appear everywhere you go. As well as the normal eggs, there are also speckled eggs that must be avoided, otherwise the God of Death will be released, and once he follows you, you'll lose vitality much quickly. At the end of every fourth round, there is a king waiting to destroy you with his fireballs or lightning bolts.\n\nThere are also warp-gates, but you don't find them, they find you. You see, warp-gates appear in rounds 1-4 of each area. If you happen to get one fruit, a special item will appear. These special items include handbags, wrist watches, a pair of shoes, a teddy bear, and a bottle of perfume. Another girl will appear and take you up to the clouds where the object is to collect as many hearts as you can without falling down or getting the item again. Once you have collected all the hearts, you can get the item to return to the surface, and more often than not, you'll get further in the round.",
    "desc": "就在湯姆湯姆和他的女朋友坦尼婭相處得很好時，森林之王的某個暴徒不得不綁架她並將她藏起來，而湯姆湯姆不知道她藏在哪裡。這就是為什麼他必須探索幽深的黑暗森林，穿越無盡的海洋，攀登危險的斜坡，在無盡的火山中生存，甚至穿越雲層。但湯姆湯姆永遠不會完全孤獨。你看，當他穿越異國他鄉時，他必須與那裡的居民面對面，比如蜜蜂、蜘蛛、蛇、煤小孩、青蛙、蝙蝠、蝸牛、郊狼和章魚等等。斧頭是湯姆湯姆抵禦這些威脅的唯一防線。\n\n有十個區域，每個區域包含四輪，但除非湯姆湯姆在救援任務中收集到所有娃娃，否則無法進入第十個區域。在旅途中，他可以打開不同的雞蛋，裡面會出現斧頭、滑板、蘑菇、牛奶，甚至守護天使。只要不與居民相撞，你就可以騎著滑板完成每一輪。當您在滑著滑板的同時完成每一輪時，您將繼續騎著滑板開始下一輪。隨著每一輪的進展，你的活力會開始降低，但可以通過獲得隨處可見的牛奶、蘑菇、薯片或水果來增加活力。除了普通的蛋之外，還有斑點蛋一定要避開，否則死神會被釋放出來，一旦他跟著你，你就會很快失去活力。每第四輪結束時，就會有一位國王等待著用他的火球或閃電摧毀你。\n\n還有傳送門，但不是你找到它們，而是它們找到你。你看，曲速門出現在每個區域的第 1-4 輪中。如果你碰巧得到一個水果，就會出現一個特殊的物品。這些特殊物品包括手袋、手錶、一雙鞋子、一隻泰迪熊和一瓶香水。另一個女孩會出現並帶你到雲端，目標是收集盡可能多的心，而不會掉下來或再次獲得物品。一旦你收集了所有的心，你就可以讓物品返回地面，而且通常情況下，你會在回合中走得更遠。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:14",
    "desc_translated_at": "2026-01-02T12:46:14",
    "original_name_hash": "d761ee96",
    "original_desc_hash": "ff3e9492"
  },
  "Penguin Land (USA, Europe)": {
    "key": "Penguin Land (USA, Europe)",
    "original_name": "Penguin Land",
    "name": "企鵝樂園",
    "name_source": "api",
    "original_desc": "Welcome to Penguin Land, where you're going underground to plan more than your next move. Because now with the help of a super advanced battery, you can actually design each game maze as you play and save your maze for more fun later.\n\nHere's the setting. You're aboard a cosmic expedition that's full of action and adventure. And guess who's in command?\n\nThat's right, you're Overbite, commander of a special Penguin Task Force.Your mission: bring fragile eggs back safely to home from a foreign land.Your journey will take you deep into mysterious caverns where dangerous animals await to attack and destroy your eggs.\n\nBut remember, your space ship and crew need you too. So be careful not to \"crack-up\" because you, can't be a hero with \"egg on your face.\"",
    "desc": "歡迎來到企鵝樂園，在這裡您將進入地下，計劃的不僅僅是您的下一步行動。因為現在在超級先進電池的幫助下，您實際上可以在玩遊戲時設計每個遊戲迷宮並保存迷宮以供以後享受更多樂趣。\n\n這是設置。您正在踏上一次充滿行動和冒險的宇宙探險之旅。猜猜誰是指揮？\n\n沒錯，你就是 Overbite，企鵝特別特遣隊的指揮官。你的任務：將脆弱的蛋從異國安全地帶回家鄉。你的旅程將帶你深入神秘的洞穴，那裡有危險的動物等待著攻擊並摧毀你的蛋。\n\n但請記住，您的太空飛船和船員也需要您。所以要小心，不要“崩潰”，因為你，不可能成為“臉上掛著雞蛋”的英雄。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:16",
    "desc_translated_at": "2026-01-02T12:46:16",
    "original_name_hash": "ed087f0f",
    "original_desc_hash": "29d43408"
  },
  "Ys - The Vanished Omens (USA, Europe, Brazil) (En)": {
    "key": "Ys - The Vanished Omens (USA, Europe, Brazil) (En)",
    "original_name": "Ys : The Vanished Omens",
    "name": "伊蘇：消失的預兆",
    "name_source": "api",
    "original_desc": "Once long ago, the Kingdom of Y's fell under a reign of evil. But the Goddesses of Y's saved the Kingdom from ruin. Their feats were written in six magical books and hidden until the time the Goddesses would be needed again. A thousand years later, that time has come. You are Aron, a wanderer. An evil sorcerer named Dark Dekt is planning diabolical magic. And the Seer Sara is desperately looking for a swordsman to help her find the vanished six books of Y's. Now arm yourself and prepare for an adventure into the unknown. Where caverns and towers are filled with creatures and hoards of treasure. Where the strangest people have clues to tell you. Where your skill in combat depends on your reflexes. If you succeed, you'll have the power to call down the Goddesses. Fail, and Dark Dekt will rule the Kingdom under a reign of terror forever!",
    "desc": "很久以前，Y王國陷入了邪惡的統治。但 Y 的女神將王國從廢墟中拯救出來。她們的功績被寫在六本魔法書中，並被隱藏起來，直到再次需要女神時為止。一千年後，那個時刻已經到來。你是阿倫，一個流浪者。一個名叫達克·德克特的邪惡巫師正在策劃邪惡的魔法。而先知莎拉正在拼命尋找劍客來幫助她找到Y失踪的六本書。現在武裝自己，準備踏上未知的冒險之旅。那裡的洞穴和塔樓裡充滿了生物和寶藏。最奇怪的人有線索告訴你。你的戰鬥技巧取決於你的反應能力。如果你成功了，你將擁有召喚女神的力量。如果失敗，黑暗德克特將永遠在恐怖統治下統治王國！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:18",
    "desc_translated_at": "2026-01-02T12:46:18",
    "original_name_hash": "732add06",
    "original_desc_hash": "03eb146b"
  },
  "Golden Axe (USA, Europe, Brazil)": {
    "key": "Golden Axe (USA, Europe, Brazil)",
    "original_name": "Golden Axe",
    "name": "金斧战士",
    "name_source": "wiki",
    "original_desc": "In the past, a terrible war raged between the Gods, the creators of the world, and the Titans. The Titans were defeated thanks to a super-powerful weapon forged by the Gods, called the Golden Axe. Thanks to this weapon, the Titans were banished, and the Gods bequeathed the Earth to humans. However, one Titan had survived: Death Adder. He seized the Golden Axe and used it to lay waste to the world. He kidnapped the king of Yuria and his daughter and threatened to execute them if the inhabitants did not submit unconditionally. Three heroes, determined to take revenge on Death Adder, set out to find him.\nEach character has a special magical ability that can be charged by kicking small creatures that drop a potion.",
    "desc": "過去，世界的創造者諸神與泰坦之間爆發了一場可怕的戰爭。泰坦們被眾神鑄造的超強大武器金斧頭打敗了。多虧了這件武器，泰坦被驅逐，眾神將地球遺贈給了人類。然而，有一位泰坦倖存下來：死亡蝰蛇。他奪取了金斧頭，並用它來毀滅世界。他綁架了尤里亞國王和他的女兒，並威脅如果居民不無條件屈服就處決他們。三位英雄決心向死亡蝰蛇報仇，出發尋找他。\n每個角色都有一種特殊的魔法能力，可以通過踢掉掉落藥水的小生物來充電。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:20",
    "desc_translated_at": "2026-01-02T12:46:20",
    "original_name_hash": "c184e3be",
    "original_desc_hash": "1b762eee"
  },
  "Aladdin (Europe, Brazil) (En)": {
    "key": "Aladdin (Europe, Brazil) (En)",
    "original_name": "Aladdin",
    "name": "阿拉丁",
    "name_source": "api",
    "original_desc": "Sega's 8-bit systems received a unique adaptation of Disney's 1992 animated film Aladdin.\n\nLike other versions, it is a side-scrolling action game. The player controls Aladdin, making his way through a variety of locations, including the streets of Agrabah, the Cave of Wonders, the Sultan's palace and more. Gameplay takes several different forms: some levels are chases, where Aladdin runs automatically, but must be made to jump over chasms or rolling rocks and barrels, evade falling objects and avoid getting caught by a guard. Other levels are platforming affairs: Aladdin must run, jump and climb, find keys or switches to open doors while searching for the exit. Rocks can be collected and be thrown to dispatch enemies or hit buttons otherwise out of reach. Finally, there are also several magic carpet rides in the game, in which the level scrolls automatically and the player must make sure to avoid any obstacles in the way.",
    "desc": "世嘉的 8 位系統對迪士尼 1992 年的動畫電影《阿拉丁》進行了獨特的改編。\n\n與其他版本一樣，它是一款橫向捲軸動作遊戲。玩家控制阿拉丁，穿越各個地點，包括阿格拉巴的街道、奇蹟洞穴、蘇丹的宮殿等等。遊戲玩法有幾種不同的形式：有些關卡是追逐，阿拉丁會自動奔跑，但必須跳過裂縫或滾動的岩石和桶，躲避掉落的物體並避免被守衛抓住。其他關卡則是平台遊戲：阿拉丁必須奔跑、跳躍和攀爬，在尋找出口的同時找到鑰匙或開關來打開門。可以收集並投擲岩石來消滅敵人，或者點擊其他無法觸及的按鈕。最後，遊戲中還有幾個魔毯遊樂設施，其中關卡會自動滾動，玩家必須確保避開路上的任何障礙物。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:22",
    "desc_translated_at": "2026-01-02T12:46:22",
    "original_name_hash": "d84c46d5",
    "original_desc_hash": "a649ceec"
  },
  "Ninja Gaiden (Europe, Brazil)": {
    "key": "Ninja Gaiden (Europe, Brazil)",
    "original_name": "Ninja Gaiden",
    "name": "忍者龍劍傳",
    "name_source": "api",
    "original_desc": "The Master System version of Ninja Gaiden is not a port of the well-known NES game, but an entirely new game (this includes both a different story and different levels) developed by SIMS under license from Tecmo.\n\nThe story is also about the original protagonist, the Dragon ninja Ryu Hayabusa, who returns to his clan's village only to find it utterly destroyed and the inhabitants murdered. A single survivor tells Ryu in his last seconds that the Sacred Scroll of Bushido was stolen. With the power of the scroll its owner is mighty enough the gain control of the whole world. Thus Ryu swears to recapture the scroll and the avenge the annihilation of his clan.\n\nThe game is sidescrolling platformer/ beat'em up title and incorporates most of the mechanics from the NES games: Ryu can jump and attack with his Dragon Sword. Furthermore, he can collect different kinds of Ninja Magic (which again vary form the powers in the NES games), from shuriken to fire wheels, which can only be used finitely many times, as the use up energy which again must be collected. However, instead of clinging to walls and climbing them, Ryu can push himself off the wall in this game, which must be applied for instance by jumping and forth between two close walls to get higher and higher.\n\nThe goal of each level is simply to reach the end of the level before the time runs out. Each level is divided into several sections, and at the end of each level is a boss fight. After beating a boss, a cut scene is shown which continues the story about Ryu's quest for the Bushido scroll and his revenge.",
    "desc": "Master System版本的《忍者龍劍傳》並不是著名的NES遊戲的移植版，而是由SIMS在Tecmo許可下開發的全新遊戲（包括不同的故事和不同的關卡）。\n\n這個故事也是關於最初的主角，龍忍者隼龍，他回到他氏族的村莊，卻發現村莊被徹底摧毀，居民被謀殺。一名倖存者在生命的最後幾秒告訴龍，武士道神聖捲軸被盜了。憑藉捲軸的力量，它的主人足以控制整個世界。因此，Ryu發誓要奪回捲軸，並為他的氏族被滅亡報仇。\n\n該遊戲是橫向捲軸平台遊戲/清版遊戲，融合了 NES 遊戲的大部分機制：Ryu 可以跳躍並用龍劍攻擊。此外，他可以收集不同種類的忍者魔法（與紅白機遊戲中的力量不同），從手裡劍到火輪，這些魔法只能使用有限次，因為消耗的能量必須再次收集。然而，在這款遊戲中，Ryu 不是緊貼牆壁並攀爬它們，而是可以將自己推離牆壁，這必須通過在兩堵靠近的牆壁之間來回跳躍來越來越高來實現。\n\n每個級別的目標只是在時間用完之前到達級別的末尾。每個關卡都分為幾個部分，每個關卡的最後都是boss戰。擊敗頭目後，會出現一個過場動畫，繼續講述 Ryu 尋找武士道捲軸和復仇的故事。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:24",
    "desc_translated_at": "2026-01-02T12:46:24",
    "original_name_hash": "3f0cc2c3",
    "original_desc_hash": "bd0100bd"
  },
  "Golvellius - Valley of Doom (USA, Europe, Brazil)": {
    "key": "Golvellius - Valley of Doom (USA, Europe, Brazil)",
    "original_name": "Golvellius : Valley of Doom",
    "name": "戈維留斯:末日谷",
    "name_source": "api",
    "original_desc": "In this game, you play Kelesis, a warrior who is sent to seek out Golvellius and rescue the beautiful Princess Rena. But in order to find him, you must defeat seven of his fiercest demons that were sent to stop you. These demons are found in caves throughout the valley floor, but in order to access these caves, you need to defeat some of the wild beasts that are scattered throughout the valley. When you kill these beasts, you will receive some gold, but when you are hit by these beasts, your energy will be lost. Some caves will appear when certain objects are struck with your sword. In some caves,you will find fairies, sorceresses, and wise women who will help you in many ways be increasing gold, giving you life potions, and restoring your energy.\n\nThere is a password save feature in this game. At the beginning of each area, you can enter a cave where a woman tells you what the password is, but if you die in the course of your quest, the password will already be revealed. By entering this password, you will be able to begin the game from the opening of the valley (if you get that far) with all your possessions intact.",
    "desc": "在這款遊戲中，你扮演凱勒西斯，一名被派去尋找戈維留斯並營救美麗公主蕾娜的戰士。但為了找到他，你必須擊敗他派來阻止你的七個最兇猛的惡魔。這些惡魔遍布整個山谷的洞穴中，但為了進入這些洞穴，你需要擊敗一些散佈在山谷中的野獸。當你殺死這些野獸時，你會得到一些金幣，但是當你被這些野獸擊中時，你的能量就會損失。當你的劍擊中某些物體時，一些洞穴就會出現。在一些洞穴中，你會發現仙女、女術士和智者，她們會以多種方式幫助你增加黃金、給你生命藥水並恢復你的能量。\n\n該遊戲有密碼保存功能。在每個區域的開始，你可以進入一個洞穴，那裡有一個女人告訴你密碼是什麼，但如果你在任務過程中死亡，密碼就會被洩露。通過輸入此密碼，您將能夠從山谷的開口處（如果您到達那麼遠）開始遊戲，並且您的所有財產都完好無損。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:26",
    "desc_translated_at": "2026-01-02T12:46:26",
    "original_name_hash": "3075d9da",
    "original_desc_hash": "e24a7f8b"
  },
  "R-Type (World)": {
    "key": "R-Type (World)",
    "original_name": "R-Type",
    "name": "R-Type",
    "name_source": "keep",
    "original_desc": "R-TYPE, uno de los shooters arcade más famosos, ofrece una adaptación fiel donde mejoras tu nave R-9 destruyendo cápsulas POW. El módulo Force, que puedes acoplar y desacoplar, es clave para usar armas como láseres y misiles. También puedes cargar el cañón Beam para lanzar un poderoso disparo. El juego destaca por sus enormes jefes y por el célebre tercer nivel, donde enfrentas tú solo a un gigantesco acorazado.",
    "desc": "R-TYPE 是最著名的街機射擊遊戲之一，它提供了忠實的改編版本，您可以通過摧毀戰俘膠囊來升級您的 R-9 飛船。可以對接和分離的原力模塊是使用激光和導彈等武器的關鍵。您還可以給光束加農炮充電，以發出強大的射擊。該遊戲因其巨大的頭目和著名的第三關而脫穎而出，在第三關中，你將獨自面對一艘巨大的戰艦。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:27",
    "desc_translated_at": "2026-01-02T12:46:27",
    "original_name_hash": "ec2e6b8b",
    "original_desc_hash": "50115004"
  },
  "Phantasy Star (World) (Sega Ages)": {
    "key": "Phantasy Star (World) (Sega Ages)",
    "original_name": "Phantasy Star",
    "name": "梦幻之星II 不归的终点",
    "name_source": "wiki",
    "original_desc": "Alis is a young girl whose brother Nero was brutally killed by a mysterious man known as Lassic. Nero's last words were: \"Sister, find a warrior named Odin, he can help you to defeat Lassic!\" Now Alis' dangerous adventure begins. Her first task is to find Odin. Then, with help and support from her friends, Alis will have to stop the evil Lassic and save the world...\n\nThis game is the very first installment in the long-lived Phantasy Star series. It is a futuristic RPG that uses a turn-based combat system (viewed from first-person perspective). An unusual feature of this game is that some locations are also viewed from first-person perspective. You can explore those locations by moving forward or backward, and the environments are in pseudo-3D.",
    "desc": "艾麗絲是一個年輕女孩，她的弟弟尼祿被一個名叫拉西克的神秘人殘忍殺害。尼祿的遺言是：“姐姐，找到一個名叫奧丁的戰士，他可以幫助你打敗萊西克！”現在，艾麗絲的危險冒險開始了。她的首要任務是找到奧丁。然後，在朋友們的幫助和支持下，艾莉絲必須阻止邪惡的拉西克並拯救世界……\n\n該遊戲是長久以來的《夢幻之星》系列的第一部分。這是一款未來派角色扮演遊戲，採用回合製戰鬥系統（從第一人稱視角觀看）。這款遊戲的一個不尋常的特點是，某些地點也是從第一人稱視角觀看的。您可以通過向前或向後移動來探索這些位置，並且環境是偽 3D 的。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:29",
    "desc_translated_at": "2026-01-02T12:46:29",
    "original_name_hash": "dd432dc9",
    "original_desc_hash": "7fd54cad"
  },
  "Alex Kidd in Shinobi World (USA, Europe, Brazil)": {
    "key": "Alex Kidd in Shinobi World (USA, Europe, Brazil)",
    "original_name": "Alex Kidd in Shinobi World",
    "name": "亞歷克斯·基德在忍者世界",
    "name_source": "api",
    "original_desc": "Alex Kidd continues his adventures in Alex Kidd in Shinobi World, featuring remixes of the music you heard from Shinobi, and featuring the common enemy: Ninjas.\n\nThe Dark Ninja, whom was banished 10,000 years ago, has returned to rule Miracle World. He also takes young Alex's girlfriend and use her as a sacrifice. To help Alex defeat the Dark Ninja and rescue his girlfriend, a god enters Alex's body, causing Alex to become a ninja master.\n\nThere are four rounds, with three levels each, and has Alex travel through locations like office blocks, construction sites, shipyards, and jungles. He must go through each level defeating ninjas and other wildlife. In the last levels, he must defeat bosses including Kabuto, Heli, Robster, and Hanzo. To survive some levels, you must learn the secret jumping technique, described on page eight of the game's instruction manual. You start the game with three lives and are presented with an energy bar with three units, but you'll lose one if an enemy touches you. Furthermore, If you lose all three energy units, you lose a life, and if you lose all three lives, the game is over.\n\nAdditional energy units can be obtained by collecting hearts that can be found by breaking treasure chests. The maximum units you can get is six. From there, the heart is replaced by a mini-Alex. Collect this and you've earned yourself an extra life. You'll get hearts if you have less than six units. \n\nYou can also get weapons like spears and power swords by breaking these treasure cheats. However, if you're lucky, you can obtain a Tornado icon, letting you transform into a tornado while mini-Tornados whirl around the screen, seeking enemies. This allows you to either go left or right so your enemies get sucked in and are knocked out.",
    "desc": "亞歷克斯·基德 (Alex Kidd) 在《忍者世界》的亞歷克斯·基德 (Alex Kidd) 中繼續他的冒險，其中包括你從忍者那裡聽到的音樂的混音，以及共同的敵人：忍者。\n\n一萬年前被放逐的黑暗忍者重新統治奇蹟世界。他還帶走了年輕亞歷克斯的女朋友，並將她用作犧牲品。為了幫助亞歷克斯打敗黑暗忍者並救出他的女朋友，一位神進入了亞歷克斯的身體，使亞歷克斯成為了忍者大師。\n\n有四輪，每輪三個級別，亞歷克斯穿越辦公大樓、建築工地、造船廠和叢林等地點。他必須通過每個關卡，擊敗忍者和其他野生動物。在最後的關卡中，他必須擊敗包括 Kabuto、Heli、Robster 和 Hanzo 在內的 Boss。為了在某些關卡中生存，您必須學習遊戲說明手冊第八頁中描述的秘密跳躍技術。遊戲開始時，你有 3 條生命，並會看到一個包含 3 個單位的能量條，但如果敵人碰到你，你就會失去一個。此外，如果你失去了所有三個能量單位，你就會失去一條生命，如果你失去了所有三個生命，遊戲就結束了。\n\n通過收集可以通過打破寶箱找到的心來獲得額外的能量單位。您可以獲得的最大單位是六個。從那裡開始，心臟被迷你亞歷克斯取代。收集這個，你就為自己贏得了額外的生命。如果您的單位少於六個，您將獲得紅心。\n\n您還可以通過打破這些寶藏秘籍來獲得長矛和動力劍等武器。然而，如果你幸運的話，你可以獲得一個龍捲風圖標，讓你變成龍捲風，同時迷你龍捲風在屏幕上旋轉，尋找敵人。這允許你向左或向右走，這樣你的敵人就會被吸進去並被擊倒。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:31",
    "desc_translated_at": "2026-01-02T12:46:31",
    "original_name_hash": "ba1bba9e",
    "original_desc_hash": "ae8865ff"
  },
  "Kenseiden (USA, Europe, Brazil)": {
    "key": "Kenseiden (USA, Europe, Brazil)",
    "original_name": "Kenseiden",
    "name": "暨靜電",
    "name_source": "api",
    "original_desc": "In Kenseiden, you play Hayato, a fearless samurai warrior. You must get back the stolen swords and scrolls, and defeat the evil waiting in the Black Castle!\n\nKenseiden is a one-player game that comprises of sixteen levels. Each of the levels are side-scrolling, with bamboo houses or dank, haunted caves as their backdrop. These levels see Hayato beseigned by ghosts, skeletons, and other spirits of the supernatural. On his side is his curved sword, which he can swish at will against the monsters. If Hayato comes in contact with a monster, he will lose some life.\n\nAt the end of each level, you will have to fight a warlock or one of their henchmen. More often than not, there is a hut with a sealed door, but the door is not unlocked unless a warlock or henceman is defeated. You gain a new special power whenever you recover a scroll from them. These special powers range from high jumping to the ability to whirl your sword around like a windmill.",
    "desc": "在《Kenseiden》中，你扮演隼人，一位無所畏懼的武士。你必須奪回被盜的劍和捲軸，並擊敗等待在黑色城堡中的邪惡勢力！\n\nKenseiden 是一款單人遊戲，共有 16 個關卡。每個關卡都是橫向捲軸的，以竹屋或潮濕、鬧鬼的洞穴為背景。在這些關卡中，隼人被鬼魂、骷髏和其他超自然的靈魂所困擾。他的身邊是他的彎劍，他可以隨意揮動它來對抗怪物。如果隼人接觸到怪物，他就會失去一些生命。\n\n在每個關卡結束時，你都必須與術士或其追隨者戰鬥。通常情況下，小屋的門是密封的，但門不會解鎖，除非擊敗術士或侍從。每當你從他們那裡收回捲軸時，你就會獲得新的特殊力量。這些特殊能力的範圍從跳高到像風車一樣旋轉你的劍的能力。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:33",
    "desc_translated_at": "2026-01-02T12:46:33",
    "original_name_hash": "cadc5416",
    "original_desc_hash": "fca47700"
  },
  "Golden Axe Warrior (USA, Europe, Brazil)": {
    "key": "Golden Axe Warrior (USA, Europe, Brazil)",
    "original_name": "Golden Axe Warrior",
    "name": "金斧战士",
    "name_source": "wiki",
    "original_desc": "Golden Axe Warrior is a spin-off of the Golden Axe games, a series of side-scrolling Beat'Em Ups from Sega.\n \nIn ancient times a horde of giants rebelled against the elders and a brutal war ensued. Things looked grave until finally a hero, carrying the Golden Axe, appeared and drove back the giants. Since then, the kingdom of Firewood has been ruled by a family that had mastered the power of the nine crystals to ward off all evil from Firewood. Everyone lived in peace until one of Firewood's ministers betrayed his king and sold the nine crystals to Death Adder, one of the evil giants. Death Adder has hidden the nine crystals in nine dungeons, has unleashed hordes of monsters and is threatening to take over the world. Will there be another hero who can find the Golden Axe and defeat Death Adder?\n\nGameplay in Golden Axe Warrior is very similar to The Legend Of Zelda, meaning you will spend most of your time exploring the large overworld fighting against lots of enemies and looking for the dungeons in which the crystals are hidden. Inside the dungeons you have to fight more enemies, find treasures and keys, solve simple puzzles and defeat the dungeon's boss to get one of the crystals. In order to survive against the large number of enemies, you will be able to find many different weapons and three different spells.",
    "desc": "《Golden Axe Warrior》是《Golden Axe》遊戲的衍生作品，是世嘉推出的一系列橫向捲軸 Beat'Em Up 遊戲。\n\n在遠古時代，一群巨人反抗長老，隨後爆發了一場殘酷的戰爭。事情看起來很嚴重，直到最後一位手持金斧頭的英雄出現並擊退了巨人。從此，柴王國就被一個掌握了九顆水晶力量的家族所統治，可以抵禦柴的一切邪惡。每個人都過著平靜的生活，直到柴火的一位大臣背叛了他的國王，並將九塊水晶賣給了邪惡巨人之一的死亡蝰蛇。死亡蝰蛇將九塊水晶藏在九個地牢中，釋放了成群的怪物，並威脅要統治世界。還會有另一位英雄能夠找到金斧頭並擊敗死亡毒蛇嗎？\n\n《金斧戰士》的遊戲玩法與《塞爾達傳說》非常相似，這意味著你將花費大部分時間探索廣闊的世界，與大量敵人作戰，並尋找隱藏水晶的地下城。在地牢內，你必須與更多的敵人戰鬥，找到寶藏和鑰匙，解決簡單的謎題並擊敗地牢的老闆以獲得一顆水晶。為了在大量的敵人中生存，你將能夠找到許多不同的武器和三種不同的咒語。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:35",
    "desc_translated_at": "2026-01-02T12:46:35",
    "original_name_hash": "302b9e2a",
    "original_desc_hash": "576eddd2"
  },
  "Zillion II - The Tri Formation (World)": {
    "key": "Zillion II - The Tri Formation (World)",
    "original_name": "Zillion II : The Tri Formation",
    "name": "Zillion II : 三陣",
    "name_source": "api",
    "original_desc": "They're at it again. The dreaded Norsa Empire is back... and stronger than ever before. This time they won't make any mistakes. Others have tried to stop them and all have failed. The evil Baron Ricks knows you are coming. And it's a trap! But you're the galaxy's last hope. Can you do what's never been done before?",
    "desc": "他們又來了。可怕的諾薩帝國回來了……並且比以往任何時候都更強大。這一次，他們不會再犯任何錯誤了。其他人試圖阻止他們，但都失敗了。邪惡的瑞克斯男爵知道你要來。這是一個陷阱！但你是銀河系最後的希望。你能做以前從未做過的事嗎？",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:37",
    "desc_translated_at": "2026-01-02T12:46:37",
    "original_name_hash": "4201cebf",
    "original_desc_hash": "56709321"
  },
  "Sonic Spinball (Europe, Brazil)": {
    "key": "Sonic Spinball (Europe, Brazil)",
    "original_name": "Sonic Spinball",
    "name": "",
    "name_source": "",
    "original_desc": "The evil doctor Robotnik has a new plan to take over the world. He has built a new weapon, the Veg-O-Fortress on Mount Mobius and with it, he is transforming all creatures into robots. Sonic sneaks into the fortress and tries to stop Robotnik.\n\nUse Sonic as a pinball in 4 dangerous levels. Score points, get rings, collect Chaos Emeralds and destroy the boss at the end of each level.",
    "desc": "邪惡的機器人博士有一個接管世界的新計劃。他在莫比烏斯山上建造了一種新武器“Veg-O-Fortress”，並用它將所有生物變成了機器人。索尼克潛入堡壘並試圖阻止機器人尼克。\n\n在 4 個危險關卡中使用索尼克作為彈球。得分、獲得戒指、收集混沌翡翠並在每個關卡結束時摧毀 Boss。",
    "desc_source": "api",
    "needs_retranslate": true,
    "name_translated_at": "2026-01-02T12:46:39",
    "desc_translated_at": "2026-01-02T12:46:39",
    "original_name_hash": "03f6d536",
    "original_desc_hash": "b3ed731a"
  },
  "Wonder Boy III - The Dragon's Trap (USA, Europe)": {
    "key": "Wonder Boy III - The Dragon's Trap (USA, Europe)",
    "original_name": "Wonder Boy III : The Dragon's Trap",
    "name": "神奇小子3：龍之陷阱",
    "name_source": "api",
    "original_desc": "Wonder Boy III: The Dragon's Trap is a direct sequel to Wonder Boy in Monster Land. When Tom-Tom defeats the MEKA dragon, the wounded beast casts a spell on him, turning him into a Lizard-Man. To regain your original human form, you have to find the Salamander Cross, hidden by the Vampire Dragon in Monster Land.\n\nIn this side-scrolling platform game, you can still buy equipment and items, but unlike its predecessor, it is not divided in sequences of levels. You are allowed to go anywhere, as long as you have the right shape or equipment. During his quest, Tom-Tom has to defeat various dragon bosses. Each win will give you a new shape with new abilities such as flying, swimming, walking on ceilings or clinging to walls, which also give you to access new parts of the world. The possible shapes are Lizard-Man, Mouse-Man, Piranha-Man, Lion-Man and Hawk-Man and the main abilities are defined by attacking power, defense points and charm points (needed for equipment by collecting charm stones). Also, certain blocks can only be destroyed by specific weapons or are only accessible to certain shapes.\n\nThe basic actions consist of attacking and jumping, and in the status screen you can equip swords, shields and armour. Special attacks include fire balls, tornadoes, arrows, boomerangs and thunder strikes. Along the way, you collect keys (only one at all times) and gold left behind by defeated creatures, and you often have to revisit places to access new areas. A password is given at the beginning of each town to continue from there.",
    "desc": "神奇小子 III：龍之陷阱是神奇小子 in Monster Land 的直接續集。當湯姆湯姆擊敗 MEKA 龍時，受傷的野獸對他施了咒語，將他變成了蜥蜴人。為了恢復原來的人類形態，你必須找到被吸血鬼龍隱藏在怪物之地的火蜥蜴十字架。\n\n在這款橫向捲軸平台遊戲中，您仍然可以購買裝備和物品，但與前身不同的是，它不按級別順序劃分。只要您有合適的形狀或設備，您就可以去任何地方。在他的探索過程中，湯姆湯姆必須擊敗各種龍首領。每次勝利都會給你帶來新的形狀和新的能力，例如飛行、遊泳、在天花板上行走或緊貼牆壁，這也讓你能夠進入世界的新地方。可能的形狀有蜥蜴人、老鼠人、食人魚人、獅子人和鷹人，主要能力由攻擊力、防禦點和魅力點（通過收集魅力石獲得裝備所需）來定義。此外，某些方塊只能用特定武器摧毀，或者只能由某些形狀訪問。\n\n基本動作包括攻擊和跳躍，在狀態屏幕中你可以裝備劍、盾牌和盔甲。特殊攻擊包括火球、龍捲風、箭、迴旋鏢和雷擊。一路上，你會收集被擊敗的生物留下的鑰匙（始終只有一把）和黃金，並且你經常必須重新訪問地點才能進入新區域。每個城鎮的開頭都會給出一個密碼，以便從那裡繼續。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:41",
    "desc_translated_at": "2026-01-02T12:46:41",
    "original_name_hash": "559515e4",
    "original_desc_hash": "723a4e82"
  },
  "Fantasy Zone (World) (Rev 1)": {
    "key": "Fantasy Zone (World) (Rev 1)",
    "original_name": "Fantasy Zone",
    "name": "最終幻想XV",
    "name_source": "wiki",
    "original_desc": "The Fantasy Zone is a solar system consisting of eight brightly colored, fantastic planets. The evil Menons are trying to take over all of the planets in the Fantasy Zone by using misappropriated foreign currency to build their forces. It is the player's job to recover all of the coins and save the solar system! \n\nFantasy Zone is an arcade style shooter for one or two players. The goal is to destroy all of the creatures on each planet and collect as many of the lost coins as possible. At the end of each level is a large enemy that will have to be defeated before moving on to the next world.  At various points in the game, the player will be able to find a parts shop, which allows purchasing improvements for his spaceship, including better weapons and faster engines.",
    "desc": "幻想區是一個由八顆色彩鮮豔的奇幻行星組成的太陽系。邪惡的梅農人試圖通過挪用的外幣來建立他們的勢力，從而佔領幻想地帶的所有行星。玩家的任務就是收回所有金幣並拯救太陽系！\n\nFantasy Zone 是一款適合一兩個玩家的街機風格射擊遊戲。目標是消滅每個星球上的所有生物並收集盡可能多的丟失的硬幣。每個關卡的最後都有一個巨大的敵人，在進入下一個世界之前必須將其擊敗。在遊戲的各個階段，玩家將能夠找到一家零件店，可以為他的宇宙飛船購買改進，包括更好的武器和更快的引擎。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:43",
    "desc_translated_at": "2026-01-02T12:46:43",
    "original_name_hash": "2382dfc8",
    "original_desc_hash": "25970e07"
  },
  "Lucky Dime Caper Starring Donald Duck, The (Europe, Brazil)": {
    "key": "Lucky Dime Caper Starring Donald Duck, The (Europe, Brazil)",
    "original_name": "The Lucky Dime Caper Starring Donald Duck",
    "name": "唐老鴨主演的幸運一角硬幣",
    "name_source": "api",
    "original_desc": "The Lucky Dime Caper is a 2D platform game featuring Donald Duck in search of Uncle Scrooge's lucky dime, stolen by Magica De Spell.\n\nThe game is the 8-bit counterpart for Quack Shot (released only for Sega Genesis), which also features Donald Duck, but the story and gameplay are totally different.",
    "desc": "《Lucky Dime Caper》是一款 2D 平台遊戲，主角唐老鴨尋找被 Magica De Spell 偷走的史克魯奇叔叔的幸運硬幣。\n\n該遊戲是 Quack Shot（僅適用於 Sega Genesis）的 8 位版本，同樣以唐老鴨為主角，但故事和遊戲玩法完全不同。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:45",
    "desc_translated_at": "2026-01-02T12:46:45",
    "original_name_hash": "82ab1191",
    "original_desc_hash": "b0595ca8"
  },
  "Power Strike II (Europe, Brazil) (En)": {
    "key": "Power Strike II (Europe, Brazil) (En)",
    "original_name": "Power Strike II",
    "name": "強力打擊 II",
    "name_source": "api",
    "original_desc": "In the early 1930s, people have lived in poverty since the great depression in 1929. Being laid off from their job, a great amount of pilots became the sky pirates in order to survive. The sea and the sky near Italy have been plundered by them. You earn a living by shooting down these pirates.\n\nPower Strike II is a top-down shooter where you must select which weapon you want to use during the game, and then fight your way through various stages, destroying both air- and ground-based enemies along the way. You can upgrade your weapons by collecting power-ups that can only be found by shooting specific ships. You will need to defeat the end-of-level boss (by destroying parts of it) in order to proceed to the next level.",
    "desc": "1930年代初期，自1929年大蕭條以來，人們生活貧困，下崗後，大批飛行員為了生存而成為空賊。意大利附近的大海和天空都被他們掠奪了。你通過擊落這些海盜來謀生。\n\nPower Strike II 是一款自上而下的射擊遊戲，您必須在遊戲中選擇要使用的武器，然後在各個階段中一路戰鬥，一路消滅空中和地面的敵人。你可以通過收集只能通過射擊特定船隻才能找到的能量來升級你的武器。你需要擊敗關卡末頭目（通過摧毀它的一部分）才能進入下一個關卡。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:47",
    "desc_translated_at": "2026-01-02T12:46:47",
    "original_name_hash": "e9165205",
    "original_desc_hash": "bf06e039"
  },
  "Castle of Illusion Starring Mickey Mouse (USA, Europe, Brazil) (Rev 1)": {
    "key": "Castle of Illusion Starring Mickey Mouse (USA, Europe, Brazil) (Rev 1)",
    "original_name": "Castle of Illusion Starring Mickey Mouse",
    "name": "米奇老鼠主演的幻象城堡",
    "name_source": "api",
    "original_desc": "Sega's 8-bit systems received their own version of the Genesis' popular Disney platformer. Story and themes remain the same, but the game has unique levels and slightly different gameplay mechanics.\n\nTo save his girlfriend Minnie from the evil witch Mizrabel, Mickey Mouse must venture into the Castle of Illusion. Crossing six levels (including a magical forest, a toy land and a candy world), he must collect the gems of the rainbow in order to confront and defeat the witch.\n\nEach level features unique obstacles, enemies and a final boss. The enemies can be defeated by jumping on top of them. An alternative way is to pick up objects lying around (like rocks in the forest or blue balls in the toy level) and throwing them at the enemies. Mickey's ability to pick up things and carry them around also leads to puzzle-oriented gameplay. By placing objects in the right spot and jumping off of them, he can get to areas otherwise out of reach. In some levels, he also has to collect keys to open doors. A unique type of object is the treasure chest - by jumping on top of one or throwing it, Mickey gets access to its contents, which might include extra lives, a health power-up or coins to collect for points.",
    "desc": "世嘉的 8 位系統收到了他們自己版本的 Genesis 流行的迪士尼平台遊戲。故事和主題保持不變，但遊戲具有獨特的關卡和略有不同的遊戲機制。\n\n為了從邪惡女巫米茲拉貝爾手中拯救女友米妮，米老鼠必須冒險進入幻象城堡。穿越六個關卡（包括魔法森林、玩具世界和糖果世界），他必須收集彩虹寶石才能對抗並擊敗女巫。\n\n每個關卡都有獨特的障礙、敵人和最終首領。可以通過跳到敵人身上來擊敗他們。另一種方法是撿起周圍的物體（例如森林中的岩石或玩具關卡中的藍色球）並將其扔向敵人。米奇撿起東西並隨身攜帶的能力也帶來了以解謎為導向的遊戲玩法。通過將物體放置在正確的位置並從上面跳下來，他可以到達其他方式無法到達的區域。在某些關卡中，他還必須收集鑰匙才能開門。寶箱是一種獨特的物體 - 通過跳到寶箱頂部或扔掉它，米奇可以訪問其中的內容，其中可能包括額外的生命、生命值提升或收集積分的硬幣。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:49",
    "desc_translated_at": "2026-01-02T12:46:49",
    "original_name_hash": "24f48175",
    "original_desc_hash": "2ec56f00"
  },
  "Double Dragon (World)": {
    "key": "Double Dragon (World)",
    "original_name": "Double Dragon",
    "name": "雙龍",
    "name_source": "api",
    "original_desc": "Set in a post-apocalyptic New York, Double Dragon is the story of Billy and Jimmy Lee, twin brothers trained in the fighting style of Sou-Setsu-Ken. Together, they manage a small martial arts training school, teaching their students in self-defense. One day, Billy's girlfriend, Marian, is kidnapped off the street by the \"Black Warriors\", a savage street gang led by a man named Willy. The Black Warriors demand the Lee brothers disclose their martial arts secrets in exchange for Marian's freedom. The Lee brothers set out on a rescue mission to crush the Black Warriors and save Marian.\n\nUsing whatever techniques they have at their disposal, from the basic punches and kicks to the invulnerable elbow strike, as well any weapon that comes into their hands, the Lee brothers must pursue the gang through the city slum, industrial area and the forest before reaching their hideout to confront the big boss, Willy.",
    "desc": "《雙截龍》以後世界末日的紐約為背景，講述了比利·李和吉米·李這對雙胞胎兄弟接受雙節劍格鬥風格訓練的故事。他們共同管理著一家小型武術培訓學校，教授學生自衛術。有一天，比利的女朋友瑪麗安在街上被“黑武士”綁架，“黑武士”是一個名叫威利的男子領導的野蠻街頭幫派。黑武士要求李氏兄弟公開他們的武術秘密，以換取瑪麗安的自由。李兄弟出發執行救援任務，粉碎黑武士並拯救瑪麗安。\n\n李氏兄弟必須使用他們所掌握的一切技術，從基本的拳打腳踢到刀槍不入的肘擊，以及他們手中的任何武器，必須追擊該團伙，穿過城市貧民窟、工業區和森林，然後到達他們的藏身處，與大佬威利對峙。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:51",
    "desc_translated_at": "2026-01-02T12:46:51",
    "original_name_hash": "fc087002",
    "original_desc_hash": "da795299"
  },
  "Alex Kidd in Miracle World (World) (Sega Ages)": {
    "key": "Alex Kidd in Miracle World (World) (Sega Ages)",
    "original_name": "Alex Kidd in Miracle World",
    "name": "亞歷克斯·基德《奇蹟世界》",
    "name_source": "api",
    "original_desc": "Many centuries ago, on the planet Aries, there lived a boy called Alex Kidd. For seven years, he lived on Mt. Eternal studying Shellcore, an ancient art that makes one strong enough to break rocks into pieces. As he was leaving the mountain one day to travel to his spiritual homeland, a dying man told him that the peaceful city of Radactian was in grave danger. Before taking his last breath, the man gave Alex a piece of a map and a medallion made of Sun Stone.\n\nThere are eleven locations in which Alex must explore, each of them has its own unique dangers. In each location, Alex can collect bags of coins, which can be used to buy items at the shop and are used to help Alex get through each location (eg: motorcycle, peticopter, power bracelet, etc.) There are also traps that Alex must avoid like the ghost that chases him. He can also collect the Telepathy Ball that will help him read people's minds.\n\nLater, Alex learns that in order to save Radactian from destruction, he must first defeat Janken the Great, Emperor of the planet Janbarik (he got his name from his expertise at the game of Janken -- or what people call \"scissors, paper, stone\" in the Western World. Janken has sent his henceman all over Radactian to prepare the game for Alex as he passes by them. In order to get past them, Alex must win three times at Janken. If he loses, he is turned to stone and vanished from Radactian forever. Later on in the game, Alex must play with the same henceman, but only this time, when Alex wins, they decide to play dirty.\n\nAlex uses his fists to wipe out some of Janken's enemies such as birds, sea horses, bats, monkeys, frogs, and a few others. If his quest to save Radactian from the evil hands of Janken becomes difficult, he can instead use the power bracelet to perform the \"Shocking Waves of Destruction\", an ancient trick in the art of Shellcore.\n\nBefore Alex comes face-to-face with Janken, he should rescue his brother, Egle, from imprisonment, and get the letter and two medallions.",
    "desc": "許多世紀前，在白羊座星球上，住著一個名叫亞歷克斯·基德的男孩。他在永恆山生活了七年，研究貝殼核心（Shellcore），這是一種古老的藝術，可以使人變得足夠強大，可以將岩石打碎。有一天，當他離開大山前往他的精神家園時，一位垂死的人告訴他，寧靜的拉達克西安市正處於嚴重危險之中。在他嚥下最後一口氣之前，這個人給了亞歷克斯一張地圖和一個由太陽石製成的獎章。\n\n亞歷克斯必須探索十一個地點，每個地點都有其獨特的危險。在每個地點，Alex都可以收集一袋袋的金幣，這些金幣可以用來在商店購買物品，並用來幫助Alex通過每個地點（例如：摩托車、小型直升機、動力手環等）。還有Alex必須避免的陷阱，比如追趕他的幽靈。他還可以收集心靈感應球，這將幫助他讀懂人們的想法。\n\n後來，亞歷克斯得知，為了拯救拉達克安免於毀滅，他必須首先擊敗詹巴里剋星球的皇帝詹肯大帝（他的名字來源於他在揚肯遊戲中的專業知識，或者在西方世界人們所說的“剪刀、布、石頭”。詹肯派他的侍從遍布拉達克安各地，在亞歷克斯經過他們時為他準備遊戲。為了通過他們，亞歷克斯必須在詹肯贏三場。如果他輸了，他就會被轉向石頭並從拉達蒂安永遠消失了。在遊戲的後期，亞歷克斯必須與同一個酋長一起玩，但只有這一次，當亞歷克斯獲勝時，他們決定玩骯髒的遊戲。\n\n亞歷克斯用拳頭消滅了詹肯的一些敵人，如鳥類、海馬、蝙蝠、猴子、青蛙等。如果他從詹肯邪惡手中拯救拉達克西安的任務變得困難，他可以使用能量手鐲來表演“毀滅衝擊波”，這是貝殼核藝術中的一種古老技巧。\n\n在亞歷克斯與詹肯面對面之前，他應該將他的兄弟埃格爾從監獄中救出來，並拿到這封信和兩個獎章。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:53",
    "desc_translated_at": "2026-01-02T12:46:53",
    "original_name_hash": "b4f5d916",
    "original_desc_hash": "920123b8"
  },
  "California Games (USA, Europe, Brazil)": {
    "key": "California Games (USA, Europe, Brazil)",
    "original_name": "California Games",
    "name": "加州運動會",
    "name_source": "api",
    "original_desc": "California Games was the original \"Extreme Games\" – what today's generation might call \"X-Games in the sun\".  Players can select sponsors (absent in some versions) and compete in events such as skateboarding, footbag, surfing, roller skating, flying disc (frisbee) and BMX.  The surfing event is ranked by judges, which give a score to help the players improve their routine.\n\nThe Atari versions (2600 and Lynx) of the game omit the flying disc and roller skating events, while the Genesis version omits only the flying disc event.",
    "desc": "加州運動會是最初的“極限運動會”——今天的一代人可能會稱之為“陽光下的極限運動會”。玩家可以選擇贊助商（某些版本中沒有）並參加滑板、足球、衝浪、輪滑、飛盤（飛盤）和小輪車等賽事。衝浪項目由評委進行排名，評委給出分數以幫助選手提高日常水平。\n\n遊戲的 Atari 版本（2600 和 Lynx）省略了飛盤和輪滑項目，而 Genesis 版本僅省略了飛盤項目。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:55",
    "desc_translated_at": "2026-01-02T12:46:55",
    "original_name_hash": "29795172",
    "original_desc_hash": "670babcd"
  },
  "Miracle Warriors - Seal of The Dark Lord (USA, Europe, Brazil) (En)": {
    "key": "Miracle Warriors - Seal of The Dark Lord (USA, Europe, Brazil) (En)",
    "original_name": "Miracle Warriors : Seal of the Dark Lord",
    "name": "奇蹟戰士：黑魔王的封印",
    "name_source": "api",
    "original_desc": "In Miracle Warriors: Seal of the Dark Lord, you have been asked to recover the Golden Seal which is being guarded by the Dark Lord Terarin.  You start your quest by yourself, but you must find three other companions who will join you to defeat Terarin. You also must venture through five lands. You will find villages, towns and castles in your travels in these lands. In each, you will find or be able to buy weapons and armor (both for you and your companions), medicine and...clues. You will also find caves, dungeons, and monuments that are scattered. Some you may enter unhindered. Others will be locked...until you find the right person or learn the right spell. \n\nAlso within each land, you will encounter monsters such as evil merchants, Weasly wimps, Unmutaks, Great Lions, Gelfises, Zirods, and many more. Some of these monsters do less damage than others, and  take more damage themselves. You can either attack them yourself using your weapons or spells, or make your companions attack the monsters themselves. When defeated, most monsters will either leave behind some coins, which you can spend to buy stuff at the towns, or some items, which you can also use to defeat monsters.\n\nHowever, not all inhabitants are monsters. You will also meet merchants and travelers who might tell you where to go and what to do.",
    "desc": "在《奇蹟勇士：黑魔王印記》中，您被要求取回由黑魔王泰拉林守護的黃金印記。你自己開始你的任務，但你必須找到其他三個同伴，他們會和你一起打敗泰拉林。你還必須冒險穿越五塊土地。在這些土地上旅行時，您會發現村莊、城鎮和城堡。在每一個中，你都會找到或能夠購買武器和盔甲（為你和你的同伴）、藥品和……線索。你還會發現分散的洞穴、地牢和紀念碑。有些你可以不受阻礙地進入。其他人將被鎖定......直到你找到合適的人或學習正確的咒語。\n\n此外，在每片土地上，您還會遇到邪惡商人、弱小懦夫、Unmutaks、Great Lions、Gelfises、Zirods 等怪物。其中一些怪物造成的傷害比其他怪物少，但自身受到的傷害卻更高。你可以使用你的武器或法術自己攻擊它們，也可以讓你的同伴自己攻擊怪物。被擊敗後，大多數怪物都會留下一些硬幣，你可以用這些硬幣在城鎮裡購買東西，或者留下一些物品，你也可以用它們來擊敗怪物。\n\n然而，並非所有居民都是怪物。您還會遇到商人和旅行者，他們可能會告訴您該去哪里以及該做什麼。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:57",
    "desc_translated_at": "2026-01-02T12:46:57",
    "original_name_hash": "4378e1d7",
    "original_desc_hash": "3bb0f70d"
  },
  "Zillion (USA, Europe) (Rev 1)": {
    "key": "Zillion (USA, Europe) (Rev 1)",
    "original_name": "Zillion",
    "name": "不計其數",
    "name_source": "api",
    "original_desc": "Are you ready for the ultimate danger? You're alone, outnumbered and there's no guarantee you'll make it alive. You're J.J. Your objective: secretly infiltrate the underground labyrinth of The Norsa Empire and steal their plans for domination. Armed with the ultra speed and power of the Zillion Laser, your mission is complex. And sheer strength will not win this one alone. You'll need more brains than brawn in this sophisticated operation. So, how will you think your way to victory? With cunning strategy and memory to guide you successfully through the maze which awaits. Where once inside, you'll find the information needed to destroy the Norsas and restore peace forever.",
    "desc": "你準備好迎接終極危險了嗎？你孤身一人，寡不敵眾，無法保證你能活下來。你是 J.J.你的目標：秘密潛入諾薩帝國的地下迷宮並竊取他們的統治計劃。憑藉 Zillion Laser 的超高速和強大功率，您的任務將變得十分複雜。光靠實力是無法贏得這場胜利的。在這個複雜的操作中，你需要更多的大腦而不是體力。那麼，你將如何思考通往勝利的道路呢？憑藉狡猾的策略和記憶力，引導您成功穿過等待著的迷宮。進入內部後，您將找到摧毀諾薩斯並永遠恢復和平所需的信息。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:46:59",
    "desc_translated_at": "2026-01-02T12:46:59",
    "original_name_hash": "60504739",
    "original_desc_hash": "707d2a76"
  },
  "Danan - The Jungle Fighter (Europe, Brazil) (En)": {
    "key": "Danan - The Jungle Fighter (Europe, Brazil) (En)",
    "original_name": "Danan : The Jungle Fighter",
    "name": "達南：叢林鬥士",
    "name_source": "api",
    "original_desc": "Long ago, in the distant land of Moralos, in a time when vast jungles still covered the Earth, an evil presence emerged from its tomb beneath the ground. His name was Gilbas, and he was about to destroy the inhabitants of the land. Aganan, a great warrior, was summoned to save the troubled land and put an end to Gilbas by sealing him in the tome from where it came.\n\nUnfortunately, Gilba was successfully resurrected and another warrior, Danan, was called. His quest is to locate the three sacred objects that Aganan used to defeat Gilbas: \"The Orb of Light\", \"The Amulet of Light\", and \"The Knife of Light\". \n\nThere are about four rounds to complete, and has Danan going through exotic locations defeating enemies such as valkyries, ogres, bees, spiders, and several others. At the end of each round, you come face to face with a boss, which takes quite a number of hits to kill with your sword. Once they are defeated, they are likely to give you one of the objects that you need to defeat Gilbas. More to the story is then revealed.\n\nAssisting you with your journey are three animals: an eagle, a monkey, and some other animal that I am unfamiliar with. To get these animals to help you, however, you will need to collect three of their tokens that are found in yellow chests. These animals are quite useful in dangerous situations. The eagle, for example, can get a hold of you and fly you to safety if more than one type of enemy surrounds you. Anyway, you can get these animals to help you at any place, at any time, as long as you have three of its tokens. Yellow chests can also reveal extra strength, extra time, or extra health.\n\nThe game ends when you run out of time, or when you lose your health, and there are no second chances, unless you manage to find some elixirs, which are rare.",
    "desc": "很久以前，在遙遠的莫拉洛斯大陸，當廣闊的叢林仍然覆蓋著地球時，一個邪惡的存在從地下的墳墓中出現了。他的名字叫吉爾巴斯，他即將消滅這片土地上的居民。阿迦南是一位偉大的戰士，他被召喚來拯救這片動亂的土地，並通過將吉爾巴斯封印在這本書中來終結吉爾巴斯。\n\n不幸的是，吉爾巴成功復活，並召喚了另一位戰士達南。他的任務是找到阿加南用來擊敗吉爾巴斯的三件聖物：“光之球”、“光之護身符”和“光之刀”。\n\n大約有四輪需要完成，達南將穿越異國他鄉，擊敗敵人，如瓦爾基里、食人魔、蜜蜂、蜘蛛和其他幾種。在每一輪結束時，你都會遇到一個 Boss，需要用劍擊中相當多的攻擊才能殺死它。一旦他們被擊敗，他們很可能會給你擊敗吉爾巴斯所需的物品之一。故事的更多內容隨後揭曉。\n\n在旅途中幫助你的是三種動物：一隻鷹、一隻猴子和一些我不熟悉的其他動物。然而，為了讓這些動物來幫助你，你需要收集黃色箱子中的三個它們的代幣。這些動物在危險情況下非常有用。例如，如果您周圍有不止一種類型的敵人，老鷹可以抓住您並將您飛到安全的地方。不管怎樣，只要你擁有三個它的代幣，你就可以隨時隨地讓這些動物來幫助你。黃色寶箱還可以顯示額外的力量、額外的時間或額外的生命值。\n\n當你用完時間或失去生命值時，遊戲就會結束，並且沒有第二次機會，除非你設法找到一些罕見的長生不老藥。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:47:01",
    "desc_translated_at": "2026-01-02T12:47:01",
    "original_name_hash": "a0a29212",
    "original_desc_hash": "2fa34b95"
  },
  "Power Strike (USA, Europe, Brazil) (En)": {
    "key": "Power Strike (USA, Europe, Brazil) (En)",
    "original_name": "Power Strike",
    "name": "強力打擊",
    "name_source": "api",
    "original_desc": "The Earth is threatened by mutant plant life and their brainwashed human followers. Only one force can stop the evil vegetables from taking root: Power Strike, the most versatile jet fighter in the world.  Blast the enemy in the air and and on the ground and save the planet from the creeping green menace. \n\nThere are six rounds to complete (three in the mobile version). In each round, numbers (from 1 to 8) can be found on the ground either enclosed by a ring, or in the air carried by a ship. Getting these numbers will upgrade your firepower. Get more of the same number for a maximum upgrade. Unfortunately, whatever the type of firepower you get, you will have a limited supply of ammo, so you need to stock up on the same type of firepower if you get too low. \n\nAt the end of each round, there is an end-of-round boss which involves shooting parts of its base in order to destroy it. Intermediate bosses can be found in the last three rounds (console version only).",
    "desc": "地球受到突變植物生命及其被洗腦的人類追隨者的威脅。只有一種力量可以阻止邪惡蔬菜紮根：Power Strike，世界上功能最多的噴氣式戰鬥機。轟炸空中和地面上的敵人，拯救地球免受蔓延的綠色威脅。\n\n有六輪需要完成（移動版本為三輪）。在每一輪中，數字（從 1 到 8）可以在地面上被圓環包圍的地方，或者在由船隻攜帶的空中找到。獲得這些數字將提升你的火力。獲得更多相同數量的物品即可獲得最大升級。不幸的是，無論你獲得哪種類型的火力，你的彈藥供應都是有限的，所以如果你的火力太低，你需要儲備相同類型的火力。\n\n在每輪結束時，都會有一個回合結束的 Boss，需要射擊其基地的一部分以摧毀它。中級 Boss 可以在最後三輪中找到（僅限主機版）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:47:03",
    "desc_translated_at": "2026-01-02T12:47:03",
    "original_name_hash": "f13e2641",
    "original_desc_hash": "5bbcfd15"
  },
  "Land of Illusion Starring Mickey Mouse (Europe, Brazil)": {
    "key": "Land of Illusion Starring Mickey Mouse (Europe, Brazil)",
    "original_name": "Land of Illusion Estrelando Mickey Mouse",
    "name": "幻象之地埃斯特雷蘭多米奇老鼠",
    "name_source": "api",
    "original_desc": "Mickey Mouse is reading an interesting book and suddenly find himself in a strange, dreamy village. he is told that a curse has been placed on the village, turning its good magic into bad one. The evil Phantom, who lives in the castle in the clouds, is responsible for that! Mickey decides to help the villagers and to defeat the evil Phantom.\n\nThis is a platform jump-and-run game. There is a time limit to each level. Mickey can jump, duck, climb, and defeat enemies by jumping on them and pressing the down arrow at the same time.",
    "desc": "米老鼠正在讀一本有趣的書，突然發現自己身處一個陌生的夢幻村莊。他被告知村莊受到了詛咒，將其好的魔法變成了壞的魔法。住在雲中城堡裡的邪惡幻影負有責任！米奇決定幫助村民並擊敗邪惡的幽靈。\n\n這是一款平台跳躍和奔跑遊戲。每個級別都有時間限制。米奇可以跳躍、躲避、攀爬，還可以通過跳到敵人身上並同時按下向下箭頭來擊敗敵人。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:47:05",
    "desc_translated_at": "2026-01-02T12:47:05",
    "original_name_hash": "16da9468",
    "original_desc_hash": "e71fa789"
  },
  "Action Fighter (USA, Europe, Brazil) (Rev 1)": {
    "key": "Action Fighter (USA, Europe, Brazil) (Rev 1)",
    "original_name": "Action Fighter",
    "name": "動作格鬥家",
    "name_source": "api",
    "original_desc": "This is a top down vertically scrolling shooter, in which you start off as a motorbike. You are quite vulnerable to attack at first, but power ups come in the form of a Sega van which you have to dock with. The first time you dock you get double fire, the second time gives you a rocket, the third gives a rear force field and the fourth invulnerablility.\n\nBy destroying cars and bikes that appear on your way, you can collect A-F letters. Collecting A through to D allows you change into a sportscar which is less vulnerable to attack, but not as nimble. Collect all the letters in order to be able to transform into a high tech plane. This is the final stage of one of the five missions. Only the high tech plane can guide you to your destination in which your main target is hiding.\n\nThere is also time limit in which you have to complete the mission. It is advisable to transform into the high tech plane as fast as it is possible.\n\nPicking up flags gives you bonus points with 10,000 points gaining you an extra life.",
    "desc": "這是一款自上而下的垂直捲軸射擊遊戲，您從摩托車開始。一開始你很容易受到攻擊，但能量提升以世嘉貨車的形式出現，你必須與之對接。第一次對接時你會得到雙火力，第二次會給你火箭，第三次給你一個後力場，第四次給你刀槍不入。\n\n通過摧毀路上出現的汽車和自行車，您可以收集 A-F 字母。收集A到D可以讓你變成一輛不易受到攻擊的跑車，但不那麼靈活。收集所有字母以便能夠轉變成一架高科技飛機。這是五個任務之一的最後階段。只有高科技飛機才能引導您到達主要目標隱藏的目的地。\n\n您必須完成任務也有時間限制。建議盡快變身高科技位面。\n\n拿起旗幟會給你獎勵積分，其中 10,000 點可以讓你獲得額外的生命。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:47:07",
    "desc_translated_at": "2026-01-02T12:47:07",
    "original_name_hash": "c5536f4f",
    "original_desc_hash": "82ca575b"
  },
  "Aztec Adventure (World)": {
    "key": "Aztec Adventure (World)",
    "original_name": "Aztec Adventure : The Golden Road to Paradise",
    "name": "阿茲特克冒險：通往天堂的黃金之路",
    "name_source": "api",
    "original_desc": "Aztec Adventure is a traditional action/labyrinth game in which the player assumes the role of Nino, an explorer whose aim is to find the Aztec Paradise.\n\nThe labyrinth is full of Aztec mythology creatures and other ancient Mexican references.\n\nAlthough it is a maze game, the controls are very simple and easy to manage.",
    "desc": "阿茲特克冒險是一款傳統的動作/迷宮遊戲，玩家扮演尼諾的角色，一位探險家，其目標是找到阿茲特克天堂。\n\n迷宮裡充滿了阿茲特克神話中的生物和其他古代墨西哥的參考文獻。\n\n雖然這是一款迷宮遊戲，但操作非常簡單，易於管理。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T12:47:09",
    "desc_translated_at": "2026-01-02T12:47:09",
    "original_name_hash": "d5e0512e",
    "original_desc_hash": "cb36864b"
  },
  "Sonic The Hedgehog 2 (Europe, Brazil) (Rev 1)": {
    "key": "Sonic The Hedgehog 2 (Europe, Brazil) (Rev 1)",
    "original_name": "Sonic The Hedgehog 2",
    "name": "",
    "name_source": "",
    "original_desc": "Coming back from the vacation Sonic took after foiling the plans of Dr Robotnik, he finds that Tails and all his other animal friends are missing. Sonic finds a letter waiting for him, that reads:\n\n\"Dear Sonic,\n\nRobotnik is back, and he's captured all the animals on the island! He is holding me in a place called the Crystal Egg. In order to free me, you have to find and bring the six Chaos Emeralds.\n\nRobotnik made me write this. He says he's waiting for you, and he's created six really nasty robots in order to 'get rid of you once and for all.' I don't know what he has planned, but Sonic, please be careful!\n\nSincerely, Tails.\"\n\nThat being more that enough motivation for him, Sonic races out to defeat Robotnik again.\n\nThe master system version is totally different than the Sonic 2 for Genesis. Tails obviously doesn't accompany you, like he can in the Genesis release. Sonic can also not do his infamous buzzsaw roll by simply ducking and pressing jump.",
    "desc": "索尼克挫敗了機器人博士的計劃後休假回來，發現塔爾斯和他所有的其他動物朋友都失踪了。索尼克發現一封信在等著他，上面寫著：\n\n“親愛的索尼克，\n\n機器人尼克回來了，他捕獲了島上所有的動物！他把我關在一個叫水晶蛋的地方。為了釋放我，你必須找到並帶來六顆混沌翡翠。\n\n機器人尼克讓我寫了這個。他說他正在等你，並且他創造了六個非常令人討厭的機器人，以便“一勞永逸地擺脫你”。我不知道他有什麼打算，但是索尼克，請小心！\n\n誠摯的，塔爾斯。”\n\n這對他來說已經足夠動力了，索尼克再次奮力擊敗機器人尼克。\n\n主系統版本與 Genesis 的 Sonic 2 完全不同。尾巴顯然不會像《創世紀》中那樣陪伴你。索尼克也不能通過簡單地躲避和按下跳躍來完成他臭名昭著的圓鋸滾。",
    "desc_source": "api",
    "needs_retranslate": true,
    "name_translated_at": "2026-01-02T12:47:11",
    "desc_translated_at": "2026-01-02T12:47:11",
    "original_name_hash": "8f694169",
    "original_desc_hash": "5fa35ccd"
  }
}