{
  "Inemuriryuu Asada Tetsuya no A-kyuu Mahjong (Japan)": {
    "key": "Inemuriryuu Asada Tetsuya no A-kyuu Mahjong (Japan)",
    "original_name": "Inemuri Ryuu Adada Tetsuya no A-Kyuu Mahjong (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A Mahjong game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Inindou - Datou Nobunaga (Japan)": {
    "key": "Inindou - Datou Nobunaga (Japan)",
    "original_name": "Inindo: Datou Nobunaga (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "1581, Japan. Fearing a rebellion and striving to conquer the entire country, the warlock Nobunaga orders to attack the Iga ninja clan. The ninjas bravely defend their village, but, being vastly outnumbered, are mercilessly slain by Nobunaga's men. Only one survived: you, the hero of the game. Shortly before the assault you were sent to a nearby village to warn the elder of Nobunaga's attack. However, the other village is also destroyed by Nobunaga's army. You swear to avenge his crime. But for now, you are just an inexperienced young men, and are \"wanted\" by Nobunaga's men and ruthless bounty hunters. Will you be able to unite Japan in the ultimate struggle against Nobunaga? \n \nInindo: Way of the Ninja is a Japanese-style RPG with a touch of strategy. You navigate your hero on the world map, visit towns, and descend into dungeons. The battles are turn-based and are viewed from a third-person perspective, like in Final Fantasy games. You can move on the battle field and use melee or long-ranged attacks. You'll be able to recruit characters of various classes to your party, who will join you for profit or for other reasons. After you gain enough experience, you'll also be able to talk to daimyos (feudal rulers) of various castles and to convince them to work together against Nobunaga. You can also perform various tasks for the daimyos, such as spying.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ishin no Arashi (Japan)": {
    "key": "Ishin no Arashi (Japan)",
    "original_name": "Ishin no Arashi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Ishin no Arashi is set during Bakumatsu period (around 1850 until the Meiji Restoration of 1867), the final stretch of the Japanese Edo period, which was a turbulent time, a time of great struggle between the supporters of the feudal shoguns, the rulers of the country, and the adherents of the Emperor, which eventually won and carried through the Meiji Restoration, turning Japan into a modern, powerful state. In Ishin no Arashi the player can choose one of the three major battles of Bakumastu period, and decide which leader will eventually propel Japan towards the Meiji era. \n \nThis strategy game is somewhat similar to the better-known  Romance of the Three Kingdoms series and other  historical simulation games by  the same company, but also differs from them by having much less complex diplomacy options and focusing the gameplay on navigation and individual encounters. Before beginning, the player chooses a general and customizes his parameters (stamina, attack power, charisma, knowledge). The player then controls the general with soldiers of his choice, navigating him on grids representing towns and countryside of Japan in turn-based fashion. The grids can be occupied by shops, schools (to train the general), friendly and hostile characters and groups. Battles, as well as negotiations and diplomatic procedures, are carried out automatically, and their outcome depends on the characters' statistics.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Jansei (Japan) (Alt 1)": {
    "key": "Jansei (Japan) (Alt 1)",
    "original_name": "Jansei. Mahjong King (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Jansei is a Board game, developed and published by Sony, which was released in Japan in 1986.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Jansei (Japan)": {
    "key": "Jansei (Japan)",
    "original_name": "Jansei. Mahjong King (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Jansei is a Board game, developed and published by Sony, which was released in Japan in 1986.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Janyuu (Japan)": {
    "key": "Janyuu (Japan)",
    "original_name": "Janyu Mahjong (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Japanese MSX-Write II (Japan) (Program)": {
    "key": "Japanese MSX-Write II (Japan) (Program)",
    "original_name": "ZZZ(notgame):Japanese MSX-Write II (Japan) (Program)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kempelen Chess (Japan)": {
    "key": "Kempelen Chess (Japan)",
    "original_name": "Kempelen Chess (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kenpelen Chess is a computer chess game with a top-down view but with a 3D-feel. It includes various boards and play options. You can choose to play at one of the seven different difficulty levels. Chess can be played against the computer or a friend. \nAll pieces are animated when moved.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Arkanoid II - Revenge of Doh (Japan)": {
    "key": "Arkanoid II - Revenge of Doh (Japan)",
    "original_name": "Arkanoid II - Revenge of Doh (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Revenge of Doh is a direct sequel to the original arcade smash Arkanoid. Along with improved graphic engine, better sound and music, better hardware support and more levels, Revenge of Doh also features a built-in editor and allows you to create your own level sets! \nA long time period passed and the dimension controlling force Doh has again come back to life. Occupying the huge starship Xorg, it has entered our universe from a different dimension. Mixtec, Arkanoid type spaceship, has lauched the craft Vaus II to make a preemptive attack on Xorg.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "AshGuine - Densetsu no Seisenshi (Japan)": {
    "key": "AshGuine - Densetsu no Seisenshi (Japan)",
    "original_name": "AshGuine (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The evil Banutracus had destroyed the great civilization of the planet Nepenthus and brought it down to a primitive state. War broke out between the planet's humble Eletrian people and Banutracus's barbarous Cooligan invaders. After a long struggle, the Eletrians got united under the powerful leadership of one they called the father and managed to obtain a momentary peace. Howerver, when Banutracus returned to his planet he killed the father and re-established his hold. One Cooligan Gea saw the evil nature of Banutracus and escaped with the father's only daughter Neshah to one of the great ruined Eletrian cities. There, they had a son. When the boy grew to be a strong young man, one of the Cooligan soldiers discovered their hideout and killed his escaped parents. From that day, the boy swore vengeance on Banutracus and to eventually restore peace to the planet.?",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "AshGuine Story II - Kokuu no Gajou (Japan)": {
    "key": "AshGuine Story II - Kokuu no Gajou (Japan)",
    "original_name": "AshGuine 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The time had come to put an end to the long and unproductive battle. This was brought about by the Azumural, the third race that came from the heavens.  While both countries were fighting, the Azumural steadily developed their scientific capabilities and in the end even acquired aviation technology. They got to know about the world beyond the Ring. Because of their brutal nature they made a temporary alliance with the Ghouls and invaded Eletria. The balance of fight largely deteriorated and the Eletrians barricaded themselves in the last remaining fortress Nesha Castle",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "AshGuine Story III - Fukushuu no Honoo (Japan)": {
    "key": "AshGuine Story III - Fukushuu no Honoo (Japan)",
    "original_name": "AshGuine 3 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The time had come to put an end to the long and unproductive battle. This was brought about by the Azumural, the third race that came from the heavens.  While both countries were fighting, the Azumural steadily developed their scientific capabilities and in the end even acquired aviation technology. They got to know about the world beyond the Ring. Because of their brutal nature they made a temporary alliance with the Ghouls and invaded Eletria. The balance of fight largely deteriorated and the Eletrians barricaded themselves in the last remaining fortress Nesha Castle",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Bubble Bobble (Japan) (Alt 1)": {
    "key": "Bubble Bobble (Japan) (Alt 1)",
    "original_name": "Bubble Bobble (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Bubble Bobble is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave... \n \nBubble Bobble is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Bubble Bobble (Japan)": {
    "key": "Bubble Bobble (Japan)",
    "original_name": "Bubble Bobble (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Bubble Bobble is the story of two humans, Bub and Bob who wander into the mysterious cave of monsters and magically turn into dinosaurs. The only way to transform back is to reach the end of the cave... \n \nBubble Bobble is a platform game, with each level being a single screen. The enemies must be cleared from a level to go to the next one. With one player controlling Bub and the other controlling Bob, the player can jump and collect items for points (such as fruit). The real power Bub and Bob have however is the ability to blow bubbles. These bubbles can be as platforms to leap on, or to trap enemies. Enemies trapped in a bubble must be popped by jumping into them, wherein they'll turn to fruit. Additionally, power-ups sometimes float by in bubbles. They include lightning, which flies out horizontally at enemies, and water, which drags the player and enemies straight down flowing over platforms. Taking too long to complete any level will summon Baron Von Blubba, who will float around the screen trying to destroy the player.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Cheese 2 (Japan) (Program)": {
    "key": "Cheese 2 (Japan) (Program)",
    "original_name": "ZZZ(notgame):Cheese 2 (Japan) (Program)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Cockpit, The (Japan)": {
    "key": "Cockpit, The (Japan)",
    "original_name": "The Cockpit (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Cockpit is a Simulation game, developed and published by Nidecom, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Contra (Japan)": {
    "key": "Contra (Japan)",
    "original_name": "Kontora (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In the year 2631, a small meteorite has fallen into the Galuga archipelago, located 20km northeast off the coast of New Zealand. Two years later, a terrorist group known as Red Falcon has seized the island in preparation for an alien invasion. The earth's marines sent two members of their elite Contra unit, Bill Rizer and Lance Bean, to neutralize the terrorists. \n \nAs either Bill (player 1) or Lance (player 2), the player must get to the end of each stage, shooting everything in sight, while avoiding enemy fire themselves. The player can upgrade their standard-issue rifle into one of four different weapons, including the powerful spread shot.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Crimson (Japan)": {
    "key": "Crimson (Japan)",
    "original_name": "Crimson (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Crimson is a medieval-themed role-playing game similar to Dragon Quest. The player controls a lone character, a young man whose father sent him on a mission to defeat the evil monster Crimson before passing away. Exploration is done in an overhead fashion, and is divided into world map and hostile areas, which are usually maze-like and contain one or more dungeons each. In towns the hero can buy weapons, armor, and items, as well as rest in inns. \n \nEnemies appear randomly, and the battles are turn-based. The player character can either attack, defend, or use an item. Combat is viewed from a first-person perspective. Unlike Dragon Quest, there are no random encounters on the world map. Exploration is non-linear, i.e. the player has access to many areas of the map from the beginning of the game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Daikoukai Jidai (Japan)": {
    "key": "Daikoukai Jidai (Japan)",
    "original_name": "Daikoukai Jidai. Uncharted Waters (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Franco family used to be one of the influential houses of Portugal. That is until the head of the family sailed out of a disastrous voyage to find the kingdom of Prester John. The disarray that followed brought about an end to the nobility of the Franco name. 100 years have passed and Portugal has prospered through it's sailing and trading empires. Young Leon Fanco wishes to restore his family's good name and make a name for himself as a sailor. At the heart of his ambition is the fair lady, Christiana, who is desired by the likely heir to the kingdom. Towards that end, Leon has been working hard to secure finances for his first ship. With the first step of his dream complete, Franco sails out with his father's good friend as first mate, you're off to find fame, adventure and fortunes out on the sea and in uncharted waters.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Daisenryaku MSX2 (Japan)": {
    "key": "Daisenryaku MSX2 (Japan)",
    "original_name": "Daisenryaku (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Daisenryaku is a Strategy game, developed by SystemSoft and published by Micro Cabin, which was released in Japan in 1986.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Darwin 4078 (Japan) (Alt 1)": {
    "key": "Darwin 4078 (Japan) (Alt 1)",
    "original_name": "Darwin 4078 (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "The game takes place within a gigantic spaceship which has virtually infinite capacity because of its ability to manipulate time and space. The player must deal with enigmatic creatures called EVOL, which consist only of pure energy and need to keep themselves in capsules in order to maintain their existence in the world. \nAll of the characters in the game are designed to resemble microscopic organisms, both in their appearance and their quick, tricky movements. The player's ship undergoes over 10 types of transformations throughout the game, each with offensive and defensive maneuvers specific to their design. The sound effects used are minimal, but different types of sounds are used according to the type of shots or their speed. A sound resembling a long scream results when the player's ship is hit and returns to its weakest evolutionary state. The game's designer, graphic designer, and music composer, Tomo Furukawa, would go on to become the vocalist of the band Guniw Tools.The game controls like a regular shoot-'em-up: A and C shoot bullets, B drops bombs; there is rapidfire. However, unlike regular shoot-'em-ups where weapons are upgraded through powerups, your ship \"evolves\" to survive situations and get past obstacles. Evolution occurs with the Evol (small faces with an E on them) and B-Evol (darker Evols). Each pickup adds a new evolution state to the list. After a particular amount of time, one evolution wears off and the next evolution is chosen. The DNA powerup does provide a more permanent weapon upgrade, but will merely just make the existing weapons stronger. You can hold up to nine DNA powerups.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Darwin 4078 (Japan) (Alt 2)": {
    "key": "Darwin 4078 (Japan) (Alt 2)",
    "original_name": "Darwin 4078 (Japan) (Alt 2)",
    "name": "",
    "name_source": "",
    "original_desc": "The game takes place within a gigantic spaceship which has virtually infinite capacity because of its ability to manipulate time and space. The player must deal with enigmatic creatures called EVOL, which consist only of pure energy and need to keep themselves in capsules in order to maintain their existence in the world. \nAll of the characters in the game are designed to resemble microscopic organisms, both in their appearance and their quick, tricky movements. The player's ship undergoes over 10 types of transformations throughout the game, each with offensive and defensive maneuvers specific to their design. The sound effects used are minimal, but different types of sounds are used according to the type of shots or their speed. A sound resembling a long scream results when the player's ship is hit and returns to its weakest evolutionary state. The game's designer, graphic designer, and music composer, Tomo Furukawa, would go on to become the vocalist of the band Guniw Tools.The game controls like a regular shoot-'em-up: A and C shoot bullets, B drops bombs; there is rapidfire. However, unlike regular shoot-'em-ups where weapons are upgraded through powerups, your ship \"evolves\" to survive situations and get past obstacles. Evolution occurs with the Evol (small faces with an E on them) and B-Evol (darker Evols). Each pickup adds a new evolution state to the list. After a particular amount of time, one evolution wears off and the next evolution is chosen. The DNA powerup does provide a more permanent weapon upgrade, but will merely just make the existing weapons stronger. You can hold up to nine DNA powerups.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Darwin 4078 (Japan)": {
    "key": "Darwin 4078 (Japan)",
    "original_name": "Darwin 4078 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game takes place within a gigantic spaceship which has virtually infinite capacity because of its ability to manipulate time and space. The player must deal with enigmatic creatures called EVOL, which consist only of pure energy and need to keep themselves in capsules in order to maintain their existence in the world. \nAll of the characters in the game are designed to resemble microscopic organisms, both in their appearance and their quick, tricky movements. The player's ship undergoes over 10 types of transformations throughout the game, each with offensive and defensive maneuvers specific to their design. The sound effects used are minimal, but different types of sounds are used according to the type of shots or their speed. A sound resembling a long scream results when the player's ship is hit and returns to its weakest evolutionary state. The game's designer, graphic designer, and music composer, Tomo Furukawa, would go on to become the vocalist of the band Guniw Tools.The game controls like a regular shoot-'em-up: A and C shoot bullets, B drops bombs; there is rapidfire. However, unlike regular shoot-'em-ups where weapons are upgraded through powerups, your ship \"evolves\" to survive situations and get past obstacles. Evolution occurs with the Evol (small faces with an E on them) and B-Evol (darker Evols). Each pickup adds a new evolution state to the list. After a particular amount of time, one evolution wears off and the next evolution is chosen. The DNA powerup does provide a more permanent weapon upgrade, but will merely just make the existing weapons stronger. You can hold up to nine DNA powerups.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Deep Forest (Japan) (Alt 1)": {
    "key": "Deep Forest (Japan) (Alt 1)",
    "original_name": "Deep Forest (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Deep Forest is a Role-Playing game, developed and published by XAIN, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Deep Forest (Japan)": {
    "key": "Deep Forest (Japan)",
    "original_name": "Deep Forest (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Deep Forest is a Role-Playing game, developed and published by XAIN, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dires - Giger Loop (Japan)": {
    "key": "Dires - Giger Loop (Japan)",
    "original_name": "Dires - Giger Loop (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Dires: Giger Loop is an Action game, developed and published by Bothtec, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Double Vision (Japan)": {
    "key": "Double Vision (Japan)",
    "original_name": "ZZZ(notgame):Double Vision - Beauty Girl Photo Studio (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Buster (Japan)": {
    "key": "Dragon Buster (Japan)",
    "original_name": "Dragon Buster (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Originating in the arcades, Dragon Buster is an action platform game composed out of several large levels, each one containing various stages: a cave, a tower, a castle, etc. The player's goal in every level is to reach the final stage where the protagonist faces the level boss. There are often several ways to reach the final stages, and not all stages are necessary to visit. Equipped with a sword, the player character moves through platform stages, clearing them of diverse monsters, collecting power-ups and trying to stay in good health until the level boss, since it is impossible to heal between the stages. The hero's life meter (called \"vitality\" in the game) is the first introduction of such a feature to action games.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Quest (Japan)": {
    "key": "Dragon Quest (Japan)",
    "original_name": "Dragon Quest (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "All is darkness. The Dragon-lord has captured the Princess and stolen Erdrick's powerful ball of light. You are Erdrick's heir. To you has fallen the most dangerous task - to rescue the King's daughter and recover the mystic ball of light. Search out the Dragon-lord's lair and face your destiny. In this role-playing adventure you are the Dragon Warrior!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Quest II (Japan) (Alt 1)": {
    "key": "Dragon Quest II (Japan) (Alt 1)",
    "original_name": "Dragon Quest II (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Long ago, a descendant of Erdrick the Great defeated the Dragonlord and recovered the mystical ball of light in Alefgard. Under the rule of his children and their descendants there was prosperity throughout the land for generations. One day, however, this peace was shattered by the wicked Sorcerer Hargon. Now it is time for you to claim your birthright as the Prince of Midenhall, for Erdrick's blood also flows through your veins. With the Prince of Cannock and the Princess of Moonbrooke by your side, you are about to embark on a most adventurous journey. Use your strength and cunning for you are about to enter the world of Dragon Quest II.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Slayer IV - Drasle Family (Japan) (Alt 1)": {
    "key": "Dragon Slayer IV - Drasle Family (Japan) (Alt 1)",
    "original_name": "Dragon Slayer 4 - Drasle Family (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Long ago, an evil dragon named Keela was imprisoned inside a magical dungeon. However time has passed and the magic that sealed the dragon away is weakening. The Drasle family decides that it's time to destroy the dragon once and for all. However only one weapon is capable of doing this, the Dragon Slayer, which is itself sealed away by four magical crowns. The Drasle family decides to take on this quest, and will use every member of the family in order to accomplish it. \nThe player chooses a character from among five different members of the Drasle family. The choices are: Xemm the father and woodcutter, Mayna the magic-using mother, Roas the brave warrior son, Lyll the athletic daughter and Pochi the domesticated monster-pet. Each character has unique abilities (including attack and jumping abilities) and can only use certain items from those collected. Players can travel back to the Drasle household at any point to change characters. \n \nThe object of the game is to enter the large dungeon, itself divided into 5 areas, collecting a variety of items (which as mentioned, can only be used by particular characters) and use them to progress through the dungeon, defeating monsters. Power-ups dropped by monsters include gold, keys, health-restoring bread, magic-restoring potions and health-damaging poison. Gold can be spent on items and other power-ups that are available at various shops hidden inside the dungeon. The player must eventually defeat the four bosses guarding the crowns that seal the Dragon Slayer and then use that weapon to defeat the Kress.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Slayer IV - Drasle Family (Japan)": {
    "key": "Dragon Slayer IV - Drasle Family (Japan)",
    "original_name": "Dragon Slayer 4 - Drasle Family (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Long ago, an evil dragon named Keela was imprisoned inside a magical dungeon. However time has passed and the magic that sealed the dragon away is weakening. The Drasle family decides that it's time to destroy the dragon once and for all. However only one weapon is capable of doing this, the Dragon Slayer, which is itself sealed away by four magical crowns. The Drasle family decides to take on this quest, and will use every member of the family in order to accomplish it. \nThe player chooses a character from among five different members of the Drasle family. The choices are: Xemm the father and woodcutter, Mayna the magic-using mother, Roas the brave warrior son, Lyll the athletic daughter and Pochi the domesticated monster-pet. Each character has unique abilities (including attack and jumping abilities) and can only use certain items from those collected. Players can travel back to the Drasle household at any point to change characters. \n \nThe object of the game is to enter the large dungeon, itself divided into 5 areas, collecting a variety of items (which as mentioned, can only be used by particular characters) and use them to progress through the dungeon, defeating monsters. Power-ups dropped by monsters include gold, keys, health-restoring bread, magic-restoring potions and health-damaging poison. Gold can be spent on items and other power-ups that are available at various shops hidden inside the dungeon. The player must eventually defeat the four bosses guarding the crowns that seal the Dragon Slayer and then use that weapon to defeat the Kress.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Slayer Jr": {
    "key": "Dragon Slayer Jr",
    "original_name": "Dragon Slayer III - Romancia (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This game exists in two editions, one for the MSX1 and one for the MSX2 with better graphics. \n \nIn Romancia: Dragon Slayer Jr., you are a young warrior whom the king sends on a mission to rescue a lost princess. You must leave the town and enter the dreadful monster-infested catacombs in order to complete your quest. \n \nThe game is a departure from Dragon Slayer RPG-oriented gameplay style. It tends more towards medieval-themed platformer action. The hero has hit points, can buy items and weapons, use magic, and stay in inns to recover health. However, instead of receiving experience points and becoming stronger, you simply must attack quicker (by bumping into your opponent on platform levels) and jump higher.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Druid (Japan) (Alt 1)": {
    "key": "Druid (Japan) (Alt 1)",
    "original_name": "Druid (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Druid is an action game inspired by the arcade hit Gauntlet. As the eponymous hero, your job is to destroy four magic skulls hidden over eight levels.  \n \nThe game is presented in a top-down view. The druid walks around the terrain seeking out the staircase that leads to the next level. On the way, he is harassed by hordes of monsters that come out of every direction and attack him, decreasing his health. To defend himself, the druid can use the spells of water, fire or electricity to toss projectiles. However, these magical weapons have limited ammo.  \n \nThe druid also has three other magical spells at his disposal - an invisibility spell which prevents the monsters from automatically approaching him, a golem spell which summons a helpful golem (which can be controlled by a second player), and a skull spell which destroys all on-screen enemies. The druid also carries around keys which open locked doors. But all these have very limited supplies.  \n \nOn his way, the druid finds many shops. Each such shop contains some keys or charges for the druid's spells, but the druid can only pick one item from each shop.  \n \nThe druid can also come across a pentagram on the ground which will restore his lost health.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Druid (Japan)": {
    "key": "Druid (Japan)",
    "original_name": "Druid (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Druid is an action game inspired by the arcade hit Gauntlet. As the eponymous hero, your job is to destroy four magic skulls hidden over eight levels.  \n \nThe game is presented in a top-down view. The druid walks around the terrain seeking out the staircase that leads to the next level. On the way, he is harassed by hordes of monsters that come out of every direction and attack him, decreasing his health. To defend himself, the druid can use the spells of water, fire or electricity to toss projectiles. However, these magical weapons have limited ammo.  \n \nThe druid also has three other magical spells at his disposal - an invisibility spell which prevents the monsters from automatically approaching him, a golem spell which summons a helpful golem (which can be controlled by a second player), and a skull spell which destroys all on-screen enemies. The druid also carries around keys which open locked doors. But all these have very limited supplies.  \n \nOn his way, the druid finds many shops. Each such shop contains some keys or charges for the druid's spells, but the druid can only pick one item from each shop.  \n \nThe druid can also come across a pentagram on the ground which will restore his lost health.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dynamite Bowl (Japan) (Alt 1)": {
    "key": "Dynamite Bowl (Japan) (Alt 1)",
    "original_name": "Dynamite Bowl (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Dynamite Bowl is a bowling game simulation based on the real bowling sport and can be played up to five players at one of the thirty lanes. \nThe game has two difficulty levels. \nGame variables that can be controlled are: your position at the lane, set the strength of the throw and control the loft and curve of the bowling ball.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dynamite Bowl (Japan)": {
    "key": "Dynamite Bowl (Japan)",
    "original_name": "Dynamite Bowl (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Dynamite Bowl is a bowling game simulation based on the real bowling sport and can be played up to five players at one of the thirty lanes. \nThe game has two difficulty levels. \nGame variables that can be controlled are: your position at the lane, set the strength of the throw and control the loft and curve of the bowling ball.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Arctic - Active Rail Playing (Japan)": {
    "key": "Arctic - Active Rail Playing (Japan)",
    "original_name": "Arctic (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Arctic is an action puzzle game that describes itself as \"active rail playing\". Each of more than two-dozen stages consists of a set of rails in various arrangements, often looping around each other and splitting in various directions. Each stage contains a number of colored balls which begin in corresponding slots, and after launching them the goal is to return the balls to the matching-colored slots. The only interaction the player has with the board is switching two sets of splits; there are yellow and blue splits, which will redirect any balls moving through them, and the player can only turn all of one color as a group. Many stages also contain bumpers and gates which will affect the speed and direction of the balls. Completing a puzzle often requires strategic use of the stage's features to bounce balls onto the correct paths.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Quest II (Japan)": {
    "key": "Dragon Quest II (Japan)",
    "original_name": "Dragon Quest II (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Long ago, a descendant of Erdrick the Great defeated the Dragonlord and recovered the mystical ball of light in Alefgard. Under the rule of his children and their descendants there was prosperity throughout the land for generations. One day, however, this peace was shattered by the wicked Sorcerer Hargon. Now it is time for you to claim your birthright as the Prince of Midenhall, for Erdrick's blood also flows through your veins. With the Prince of Cannock and the Princess of Moonbrooke by your side, you are about to embark on a most adventurous journey. Use your strength and cunning for you are about to enter the world of Dragon Quest II.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Eidolon, The (Europe)": {
    "key": "Eidolon, The (Europe)",
    "original_name": "The Eidolon (Europe)",
    "name": "",
    "name_source": "",
    "original_desc": "You control a mysterious 19th-century machine named \"The Eidolon\" through mysterious caves. Collect and create fireballs and encounter strange creatures like 'Greps', 'Biter Birds', 'Bottlenecks', 'Rotoflies', 'Puffer Birds' , and 'Guardian Dragons'. Each type of fireball you collect has different effects. For instance Blue fireballs freeze time, and green fireballs transform one monster into another type. A guardian dragon must be defeated at the end of each level. \n \n \n \nEidolon is one of the progenitors of the first-person shooter genre, with full pseudo-3D panoramic graphics. This was achieved with the use of Lucasfilm Games 3D fractal technology, also used in Rescue on Fractalus! and Koronis Rift.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fantasy Zone II - The Tears of Opa-Opa (Japan) (Alt 1)": {
    "key": "Fantasy Zone II - The Tears of Opa-Opa (Japan) (Alt 1)",
    "original_name": "Fantasy Zone II - The Tears of Opa-Opa (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "In the past, the courageous hero Opa-Opa saved the Fantasy Zone from the invading Nenon forces, but his victory came at a price as he was forced to fight his own father who led the invasion. It is now Space Year 1432, 10 years after that battle, and the Nenon forces are once again spreading chaos through the Fantasy Zone. Opa-Opa must once again fly into the Fantasy Zone to rout the invasion. Similar to Defender, the player occupies a side-scrolling level that repeats indefinitely, and in which the player can freely travel left or right. Each zone contains several \"bases\" that serve as primary targets. New to the sequel are \"warps\" hidden behind certain bases that allow the player to travel between different zones. Each level has at least three zones, and when all of the bases have been cleared in all of the zones of a level, the player can travel through the warp to the boss. Boss fights do not allow for free travel as the main stages do, and force the player to face the boss or face a particular direction. Bosses are generally very large and change color to reflect damage taken. The final stage is a \"boss rush\" in which the player must fight a succession of previous bosses before fighting the final boss. There are two action buttons that correspond to two types of attacks, \"fire\" and \"bomb\". The fire attacks shoot horizontally, as in a typical shooter, and different variants can be purchased at shops. The bomb attacks are more powerful, and the basic bomb drops downward. Other variants have other behaviors and are limited in quantity. Shops, uncovered at key points, allow the player to purchase upgraded weapons, bombs, and speed, as well as extra lives.[8] Upgrades to Opa-Opa's speed (such as larger wings, or jet engines) are permanent as long as the player does not lose a life, but weapon upgrades are time-limited, and bombs limited in quantity. Items become increasingly expensive with subsequent purchases, encouraging the player to vary their purchases.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ganbare Goemon! - Karakuri Douchuu (Japan)": {
    "key": "Ganbare Goemon! - Karakuri Douchuu (Japan)",
    "original_name": "Ganbare Goemon! Karakuri Douchuu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The second game in the Ganbare Goemon series (known in English as Mystical Ninja) and the first released on a video game console and home computer. It was initially released for the Family Computer July 30, 1986[1] and later released for the MSX one year later. \nThe game revolves around the main character, Goemon, and his exploits. As the name suggests, his character was based on Ishikawa Goemon, the noble thief of Japanese Folklore. Unlike its sequels, this game still doesn't feature the comic situation and strange characters that define the series, and Goemon is portrayed as a noble thief rather than a plain hero.[2] \n \nThe game plays a top view action/adventure game (similar to The Legend of Zelda) though it is separated by stages. In each level Goemon must find three passes in order to advance. Some of these passes are found in boxes, secret passages or can be bought. After finishing all the stages, the game will present you with a new Japanese province (eight total), but all the levels will remain the same. The ending, however, will be different. \n \nLike the rest of the series, Goemon can be powered up if certain items are found and/or bought, which can be lost after a few hits. \n \nThe MSX version has the option to be played in turns by two players, with the second player playing as a ninja named Nezumi KozÅ , which is the basis of Goemon's sidekick Ebisumaru. In addition, unlike the Family Computer version, the game has six more provinces with completely new levels after finishing the game once.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race 2 (Japan) (English Menu)": {
    "key": "Gekitotsu Pennant Race 2 (Japan) (English Menu)",
    "original_name": "Gekitotsu Pennant Race 2 (Japan) (English Menu)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lupin Sansei - Babylon no Ougon Densetsu (Japan)": {
    "key": "Lupin Sansei - Babylon no Ougon Densetsu (Japan)",
    "original_name": "Arsene Lupin 3rd 2 - Babiron no Ougon Densetsu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A video game adaption of Hayao Miyazaki's Lupin III anime film of the same name.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Malaya no Hibou (Japan)": {
    "key": "Malaya no Hibou (Japan)",
    "original_name": "Malaya no Hihou (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Malaya no Hihou is an Action/Adventure game, developed and published by Pony Canyon, which was released in Japan in 1989.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Monmon Kaibutsu (Japan)": {
    "key": "Monmon Kaibutsu (Japan)",
    "original_name": "The Mon Mon Monster (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In most games you have to attack monsters as a hero. In this case you are the reincarnation of the creature of Dr. Frankenstein. The opponents, however, remain monstrous. Mon Mon Monster is an arcade platform game with some touches of adventure. With your monster, you have to make your way through a maze of screens. Your path is blocked at all times by boulders and annoying creatures. The action takes place over the entire screen with the exception of some information at the bottom. In the fields you can find lots of useful objects such as \"rocks\", the normal method of defeating an opponent is simply done with the fire button. With this you reach the effect of a punch stroke or when you are standing at a distance, you shoot a projectile. You throw the boulders using a combination of the stick and 2nd fire button. Not really easy but practice makes perfect. You can also find extra life or supplement the remaining energy. Even secret passages are not lacking in this game nor are difficult passages such as water fountains. With a press of the STOP key you pause the game and a card is also placed on the screen. On that card you can read your current posfty as well as the screens you have already viewed and also the position of the Boss is indicated. However, this card does not help you much, since you still have to reach your goal through secret passages. I have not yet finished the first internship. Have you lost all your lives you can continue to play through a continuous option. However, you will still start at the beginning of the internship, but items that have been retained will be retained. Mon Mon Monster looks graphically well-cared for The music is welcome, thanks to the fact that the musical possibilities of the FM-Pac are used. The movements are smooth and \"Frankie1\" lets you steer well The idea is not very interesting, but still fascinating.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ogre (Japan)": {
    "key": "Ogre (Japan)",
    "original_name": "Ogre (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Ogre is a 2D turn-based strategy game, and a direct computer conversion of Steve Jackson's board game of supertanks going against conventional infantry with howitzers. It plays exactly like the board game - on a hex-based board one player controls ordinary military units (soldiers, tanks etc.), and defends against the second player, who controls a supertank named \"Ogre\" - Ogre is very powerful, and can easily destroy normal weaponry and ground forces.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Royal Blood (Japan)": {
    "key": "Royal Blood (Japan)",
    "original_name": "Royal Blood. Gemfire (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Koei made an incursion into the fantasy worlds of magic with this game. \n \nSix magicians, each trapped inside a magical gem, are liberated from the crown by Princess Robyn, daughter of the tyrannical ruler of Ishmeria, King Eselred. Fleeing across the length and breadth of the island nation, they each choose a leader from the greatest noble houses as their champion to topple Eselred and bring peace to Ishmeria.  \n \nPlayers select one of these noblemen and seek to unite all the provinces under their banner through a combination of warfare and diplomacy.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Space Manbow (Japan)": {
    "key": "Space Manbow (Japan)",
    "original_name": "Space Manbow (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Space Manbow is a side scrolling shoot 'em up. Shooting certain enemies will leave a power up pod behind which can be collected to add more power to your ship. Each level features a wide variety of enemies trying to stop you, with a large boss at the end. The levels are maze-like. Gameplay is for one player or two players alternating.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Topple Zip (Japan)": {
    "key": "Topple Zip (Japan)",
    "original_name": "Topple Zip (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Topple Zip is a vertically scrolling shooter that is marketed as a racing game. The basic premise is that you control an aircraft and fly in competition against several other, computer controlled crafts. In addition to shooting at your opponents, you may ram into them, and they into you. Doing so may dislodge a pill shaped power-up from them which you can then shoot and collect.  \n \nPower-ups exist in various types, including defensive and offensive such as giving you better weapons. There are eight different levels, each of which contain a number of warps which link to other levels. How the levels connect is random each time you play the game.  \n \nThe goal of the game is to locate a key which is necessary to access the warp which leads to the eight and final level. Collect it from whichever level it is hidden inside of, and access the eighth level before any of your competitors.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Vampire Killer (Japan, Europe) (Alt 2)": {
    "key": "Vampire Killer (Japan, Europe) (Alt 2)",
    "original_name": "Akumajyo Drakyula (Japan, Europe) (Alt 2)",
    "name": "",
    "name_source": "",
    "original_desc": "You are Simon, who has just entered Dracula's Satanic Castle. \nThe world of Dransylvania is in trouble, and you are the one to set it right. You have to fight your way through 18 stages of demons to where Dracula is hiding. Once you have destroyed Dracula, the evil force behind all the trouble will show up, attempting to destroy you! Destroy this menace, and Dransylvania will return to it's happy days after a wait of hundreds of years. \n \nVampire Killer follows the same plot as Castlevania, but with a different gameplay. At each stage, Simon has to find a white key to open the exit door which leads to the next stage. The keys are usually hidden in the castle's walls, in which he will also find useful items. Items can also be found by whipping candles and other sources of light inside the castle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Xevious - Fardraut Saga (Japan)": {
    "key": "Xevious - Fardraut Saga (Japan)",
    "original_name": "Xevious - Fardraut Saga (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Xevious: Fardraut Saga is a vertically-scrolling shooter that contains two modes: Recon and Scramble. The Recon mode is a port of the arcade game Xevious; the Scramble mode can be considered its sequel, adding sixteen new stages, enemies, and boss battles, as the brave fighter pilots continue to defend the Earth against its former inhabitants, who migrated to the planet Xevious thousands of years ago and are now determined to re-capture their ancestral homeland. \n \nThe game's Scramble mode allows the player to control three other aircrafts in addition to the seris' trademark Solvalou, each possessing unique weapons. These aircrafts include Solgrado (armed with spread shot), Zeodalley (twin back fire), and Gampmission, a large ship that is also a combination of the previous three, with massive firepower and enhanced lock-on abilities. A specific aircraft can be assigned to each of the player's \"lives\". The amount of points needed to gather an extra life increases if the player selects more powerful ships. Also, enemies become progressively harder as the controlled aircraft collects power-ups.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Elthlead (Japan)": {
    "key": "Elthlead (Japan)",
    "original_name": "Elthlead (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Elthlead is also notable for being the first fantasy SLG game ever developed. While most SLG fans look back to Master of Monsters or Fire Emblem as the origin of the genre, these games were released in 1988 and 1990 respectively. \nThe world of Elthlead also introduced the universe that would provide the framework for NCS' later Langrisser series.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Empereur, L' (Japan)": {
    "key": "Empereur, L' (Japan)",
    "original_name": "L'Empereur (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "L'Empereur is a military strategy game. The game takes place during the violent aftermath of the French Revolution and follows the rise and fall of Napoleon Bonaparte who became one of the most popular and charismatic leaders of France. \n \nGameplay \n \nYou start as an officer in charge of the military and local city affairs and later in your career you become the French First Consul and finally the Emperor and take up the responsibilities that come with it. You can only rise in rank if you have gained the support of the people.  \n \nYou have to build and organize a loyal military army and lead them into war. Defeat the belligerent neighboring countries and collect taxes and pay stipends on time. But be aware of military uprising, strikes, rebellions and deal with weather conditions a harsh winters and other natural disasters that might occur. You fail if your captured by the enemy or die. \n \nScenarios \n \nThe game scenarios that can be selected are based on Napoleon's military life: \n \n1. Napoleon's Beginning. \n \n2. The desire for Power. \n \n3. The End of the Revolution. \n \n4. The Glorious Empire.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Europe Sensen (Japan)": {
    "key": "Europe Sensen (Japan)",
    "original_name": "Europa Sensen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is an historical simulation of the European and North African theaters of World War II. The game allows player to role-play as Army commanders for either the Axis or Allied forces. This game emphasizes the military aspects of the war and leaves diplomacy to the politicians.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "F-15 Strike Eagle (Japan)": {
    "key": "F-15 Strike Eagle (Japan)",
    "original_name": "F-15 Strike Eagle (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The seven missions featured in this simulation of F-15 flight are all real-life missions the plane was originally used in. They take in the Middle East and Asia in the 1970s and early 1980s, and have air and ground targets to destroy. You have machine guns, guided missiles and bombs at your disposal. There is an arcade mode and 3 further difficulty levels. The game features 3 enemy aircraft and 3 types of enemy SAMs.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Famicle Parodic (Japan)": {
    "key": "Famicle Parodic (Japan)",
    "original_name": "Famicle Parodic (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Shoot and bomb your way around in this Xevious-style shooter for the MSX2.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Family Billiards (Japan)": {
    "key": "Family Billiards (Japan)",
    "original_name": "Family Billiards (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Family Billiards is a Miscellaneous game, developed by Dual and published by Pack-In-Video, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Family Boxing - MSX Title Match (Japan)": {
    "key": "Family Boxing - MSX Title Match (Japan)",
    "original_name": "Family Boxing (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Ring King is a boxing game in which the action in the ring is viewed in a 3D top-down view and a full range of moves is provided, with the standard jabs complimented by body punches and the ability to dodge, duck or raise your guard. \n \nEach punch weakens your opponent's strength which can slightly recover during a round break. A rain of well placed blows can produce a quick knockout, but normally you must hit your opponent many times before he goes down. \n \nThe game has three play modes. There is training mode to train your player before you enter a tournament. A ranking mode where you can select one of the three championships, Rookie, Japan and World. Each championship can be played at five difficulty levels. The third mode is the tournament mode. To reach the number one spot in the ranking or tournament mode you must train your boxer well. \n \nBefore you start you must create your character and set his initial abilities, strength, speed and stamina. Each won bout increases these abilities slightly. The abilities of your opponent and you are visible in the status bar at the top of the screen during the game. Strength is represented with a boxing glove, speed with a shoe and stamina with a dumb bell. \n \nThis game can be played by one player against the computer or by two players against each other. A password is given after each won bout and it enables you to continue with the next match in a tournament at a later time.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "A Ressha de Ikou MSX (Japan)": {
    "key": "A Ressha de Ikou MSX (Japan)",
    "original_name": "A Ressha de Iko (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A Ressha de Ikou is the first in the long-running transport network simulation series mostly known as A-Train. \n \nThe player controls a railroad company CEO in the end of the nineteenth century, who was entrusted by the president of an unnamed country to build a railroad that reaches its Western coast. The game is played in real time, with a day/night cycle and a game world that changes regardless of the player's actions. Compared to its more widely known sequels, A Ressha de Ikou has a rather simple gameplay that is confined to building tracks for just one train line, the titular A-train. A report is generated that shows how well the player is doing in his/her competition against other networks.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "AcroJet (Japan)": {
    "key": "AcroJet (Japan)",
    "original_name": "AcroJet (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Acrojet contains ten acrobatic events which can be played by up to four players and at four different levels of difficulty. \nIn all ten events you fly a BD5J Acrojet over a series of obstacles: \nIn the Pylon Race you have to fly around pylons and land safely.  \nIn the Slalom Race you have to fly a 'figure 8'. \nIn the next event, the Ribbon Cut you have to break two ribbons. \nIn the Inverted Ribbon Cut you perform the same stunt but flying the plane upside down.  \nIn the Ribbon Roll there are two ribbons in a row and you have to fly under one \nand complete a full roll followed by flying under the second ribbon. \nIn the Under Ribbon Race you perform a slalom by flying in sequence under three ribbons.  \nIn the Under Ribbon Loop you fly under a ribbon followed by a loop and passing over the same ribbon upside down. \nIn the Spot Landing event you have to fly up to 2,000 feet and land on the runway as close as possible to a marked spot. \nIn the Flame-Out Landing event you perform the same stunt  \nbut then without the engines running. \nThe tenth and last event, the Cuban Eight, you have to make a half-loop over a ribbon, followed by a half-role, a half loop and flying under the first ribbon again.  \nSome game parameters can be set. You can decide how the weather conditions are going to be. \nAn instrument panel at the bottom of the screen contains several read-outs, like a altitude meter, a compass, an artificial horizon and a vertical velocity meter.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Aleste (Japan)": {
    "key": "Aleste (Japan)",
    "original_name": "Aleste (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The sequel to Aleste 2.It was released as a free game in Compile's now defunct WOOMB magazine. It is also known as Aleste Special, because it was released in the Disc Station 4 Aku Gau disc in Autumn. \n \nUnlike Aleste 1, you are not controlling a spaceship, but instead you're controlling a robot. However, like Aleste, you can shoot enemies, enemies can shoot you, collect power ups, and defeat bosses at the end of a level. However, new to this game is the ability to jump over holes in the ground. This adds a new challenge to the game. In some levels, there are even obstacles like cars that you have to avoid. Power ups range from one that clones yourself and can fire lasers with you, one that replaces your default laser with shurikens. One replaces your default weapon and instead shoots red targets that go in a zig-zag. This laser has a possiblity of shooting enemies. The kinds of power-ups are marked by the color of their box-containers and the Japanese letter on them.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Alges no Yoku (Japan)": {
    "key": "Alges no Yoku (Japan)",
    "original_name": "Arugisu no Yoku. Wings of Arugisu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Arugisu no Tsubasa (Wings of Arugisu) is a Role-Playing game, developed and published by Kogado, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "American Soccer (Japan)": {
    "key": "American Soccer (Japan)",
    "original_name": "American Soccer (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "American Soccer is a Sports game, developed by Universal and published by Nidecom, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Aoki Ookami to Shiroki Mejika - Genchou Hishi (Japan)": {
    "key": "Aoki Ookami to Shiroki Mejika - Genchou Hishi (Japan)",
    "original_name": "Aoki Okami to Shiroki Mejika - Gencho Hishi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Aoki Ookami to Shiroki Mejika: Genchou Hishi is a Strategy game, developed and published by Koei, which was released in Japan in 1992.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Aoki Ookami to Shiroki Mejika - Genghis Khan (Japan)": {
    "key": "Aoki Ookami to Shiroki Mejika - Genghis Khan (Japan)",
    "original_name": "Aoki Ōkami to Shiroki Mejika : Genghis Khan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Become Genghis Khan and lead the most fearsome army in the known world. Use your Land of Mongols to build an empire on the bodies of your enemies and the rubble of their conquered cities. With skill, cunning, diplomacy and luck, all of Europe and Asia could be yours. Failure means shame in the eyes of your princess, or even death! Victory on the battlefield requires bold strategy and clever planning. Outmaneuver your opponent with cavalry, lay siege to his castle with archers or even challenge him to a duel. But success also requires brilliant political tactics and a sharp eye for business during times of peace. Genghis Khan is based on actual history and offers a blend of strategy and role playing elements. Make history as you play the great Khan himself or his rivals, Richard the Lionhearted, Emperor Alexious III, or Shogun Minamoto of Japan.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Arctic - Active Rail Playing (Japan) (Alt 1)": {
    "key": "Arctic - Active Rail Playing (Japan) (Alt 1)",
    "original_name": "Arctic (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Arctic is an action puzzle game that describes itself as \"active rail playing\". Each of more than two-dozen stages consists of a set of rails in various arrangements, often looping around each other and splitting in various directions. Each stage contains a number of colored balls which begin in corresponding slots, and after launching them the goal is to return the balls to the matching-colored slots. The only interaction the player has with the board is switching two sets of splits; there are yellow and blue splits, which will redirect any balls moving through them, and the player can only turn all of one color as a group. Many stages also contain bumpers and gates which will affect the speed and direction of the balls. Completing a puzzle often requires strategic use of the stage's features to bounce balls onto the correct paths.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fantasy Zone II - The Tears of Opa-Opa (Japan)": {
    "key": "Fantasy Zone II - The Tears of Opa-Opa (Japan)",
    "original_name": "Fantasy Zone II - The Tears of Opa-Opa (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In the past, the courageous hero Opa-Opa saved the Fantasy Zone from the invading Nenon forces, but his victory came at a price as he was forced to fight his own father who led the invasion. It is now Space Year 1432, 10 years after that battle, and the Nenon forces are once again spreading chaos through the Fantasy Zone. Opa-Opa must once again fly into the Fantasy Zone to rout the invasion. Similar to Defender, the player occupies a side-scrolling level that repeats indefinitely, and in which the player can freely travel left or right. Each zone contains several \"bases\" that serve as primary targets. New to the sequel are \"warps\" hidden behind certain bases that allow the player to travel between different zones. Each level has at least three zones, and when all of the bases have been cleared in all of the zones of a level, the player can travel through the warp to the boss. Boss fights do not allow for free travel as the main stages do, and force the player to face the boss or face a particular direction. Bosses are generally very large and change color to reflect damage taken. The final stage is a \"boss rush\" in which the player must fight a succession of previous bosses before fighting the final boss. There are two action buttons that correspond to two types of attacks, \"fire\" and \"bomb\". The fire attacks shoot horizontally, as in a typical shooter, and different variants can be purchased at shops. The bomb attacks are more powerful, and the basic bomb drops downward. Other variants have other behaviors and are limited in quantity. Shops, uncovered at key points, allow the player to purchase upgraded weapons, bombs, and speed, as well as extra lives.[8] Upgrades to Opa-Opa's speed (such as larger wings, or jet engines) are permanent as long as the player does not lose a life, but weapon upgrades are time-limited, and bombs limited in quantity. Items become increasingly expensive with subsequent purchases, encouraging the player to vary their purchases.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Final Mystery Murder Club - Satsujin Club (Japan)": {
    "key": "Final Mystery Murder Club - Satsujin Club (Japan)",
    "original_name": "J.B. Harold's case file #1 - Murder Club (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Final Mystery: Murder Club is an adventure game with simulation elements. The player controls the private detective J.B. Harold, who must investigate the murder of a wealthy businessman named Bill Robbins and bring the murderer to court. The player has to do all the work a real detective would do: find clues, gather evidence, interrogate suspects, establish the motive for the crime â€” and in the end, make sure the case will stand up in the court.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fire Ball (Japan)": {
    "key": "Fire Ball (Japan)",
    "original_name": "Fire Ball (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Generic Pinball Game",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fleet Commander II - Koukon no Kaiiki (Japan)": {
    "key": "Fleet Commander II - Koukon no Kaiiki (Japan)",
    "original_name": "Fleet Commander II (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Fleet Commander II: Koukon no Kaiiki is a Strategy game, developed and published by ASCII, which was released in Japan in 1990.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gakuen Monogatari - High School Story (Japan)": {
    "key": "Gakuen Monogatari - High School Story (Japan)",
    "original_name": "Gakuen Monogatari (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Great Giana Sisters is a 2D side-scrolling arcade game like Nintendo's Super Mario Bros. \n \nAfter a long and deep sleep, Giana finds herself in a mysterious and evil dreamworld where everything is strange and different. \nIn 32 levels, Giana has to fight against bad monsters, huge spiders and lots of other creatures to find a magic diamond that makes it possible to return to her own world.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gambler Jiko Chuushinha 2 - Jishou! Kyougou Janshi Hen (Japan)": {
    "key": "Gambler Jiko Chuushinha 2 - Jishou! Kyougou Janshi Hen (Japan)",
    "original_name": "Gambler Jikichushinpa 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Gambler Jiko Chuushinha 2: Jisou! Kyougou Janshi Hen is a Board game, developed and published by Game Arts, which was released in Japan in 1989.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Garakuta (Japan)": {
    "key": "Garakuta (Japan)",
    "original_name": "ZZZ(notgame):Garakuta (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Garyuu Ou (Japan) (Alt 1)": {
    "key": "Garyuu Ou (Japan) (Alt 1)",
    "original_name": "Garyuoh (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "A spectacular battle scene that can not breathe in the background is backed by a magnificent story. You must break through a number of difficulties by using weapons that can shoot in 8 directions for high speed vertical scrolling.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Garyuu Ou (Japan)": {
    "key": "Garyuu Ou (Japan)",
    "original_name": "Garyuoh (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A spectacular battle scene that can not breathe in the background is backed by a magnificent story. You must break through a number of difficulties by using weapons that can shoot in 8 directions for high speed vertical scrolling.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 1)": {
    "key": "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 1)",
    "original_name": "The Pro Yakyuu Gekitotsu Pennant Race (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 2)": {
    "key": "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 2)",
    "original_name": "The Pro Yakyuu Gekitotsu Pennant Race (Japan) (Alt 2)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 3)": {
    "key": "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan) (Alt 3)",
    "original_name": "The Pro Yakyuu Gekitotsu Pennant Race (Japan) (Alt 3)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan)": {
    "key": "Gekitotsu Pennant Race - Pro Yakyuu, The (Japan)",
    "original_name": "The Pro Yakyuu Gekitotsu Pennant Race (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gekitotsu Pennant Race 2 (Japan)": {
    "key": "Gekitotsu Pennant Race 2 (Japan)",
    "original_name": "Gekitotsu Pennant Race 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Girly Block (Japan)": {
    "key": "Girly Block (Japan)",
    "original_name": "Girly Block (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A supercomputer called \"Omega\" has kidnapped a valious asset. At your hands the most powerful unit to stand a chance to rescue her.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hacker (Japan)": {
    "key": "Hacker (Japan)",
    "original_name": "Hacker (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hacker is an adventure/trading game based on what was then a unique idea. You're starting into the adventure as a real hacker would do, lacking information of what is to come, only driven by your ambition. Consequently, the game opens with a plain text screen, prompting you for the login password. To break into the system is the first puzzle you've got to solve. \n \nOnce in, you'll soon find out that you've accidentally stumbled upon a conspiracy of global impact. From then on, you'll maneuver a robotic drone around the globe through a tunnel system deep in the earth. In major cities, you may surface and talk to contact persons, who'll trade items for cash. When delivered to the correct city, you can exchange these items for a piece of evidence. If all evidence is collected, you're to inform the FBI. As if figuring out the correct routes and trades wasn't hard enough, frequent system malfunctions and security checks test your skill as well...",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hai no Majutsushi (Japan)": {
    "key": "Hai no Majutsushi (Japan)",
    "original_name": "Hai no Majutsushi - Mahjong 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hai no Majutsushi is an implementation of Mahjong tile game. The opponents in the game are characters from Konami's popular franchises: Simon Belmont from Castlevania series, Aphrodite and Poporon (Popolon) from Knightmare series, a snatcher from Snatcher, Dr. Venom from Gradius series, Goemon from Ganbare Goemon series, Penta the penguin from Antarctic Adventure series, and Moai from Gradius / Parodius series.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hal Note (Japan) (Program)": {
    "key": "Hal Note (Japan) (Program)",
    "original_name": "ZZZ(notgame):Hal Note (Japan) (Program)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Han Seimei Senki Andorogynus (Japan) (Alt 1)": {
    "key": "Han Seimei Senki Andorogynus (Japan) (Alt 1)",
    "original_name": "Andorogynus (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "In our universe matter and anti-matter co-exist with each other. However, prevalence of anti-matter may create chaos and eventually disrupt the normal flow of things. In a corner of a universe, a concentration of anti-matter led to the creation of an entire star, breeding forms of life threatening to destroy the world. Human beings, in an effort to save the universe, created the powerful Andorogynus - a life form capable of being male and female at once - and sent it on a mission to destroy the creation of anti-matter. \n \nAndorogynus (sic) is a top-down shoot-em-up. The player controls the titular hero(ine), shooting at constantly attacking enemies. Unlike in most games of the type, the screen scrolls down rather than up. The protagonist is equipped with a default single shot and has protective orbs revolving around that damage nearby enemies. The weapon can be enhanced (rapid fire, three-way fire, etc.) by collecting randomly descending power-ups. The player controls the male incarnation of the protagonist initially, but later switches to the female one.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Han Seimei Senki Andorogynus (Japan)": {
    "key": "Han Seimei Senki Andorogynus (Japan)",
    "original_name": "Andorogynus (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In our universe matter and anti-matter co-exist with each other. However, prevalence of anti-matter may create chaos and eventually disrupt the normal flow of things. In a corner of a universe, a concentration of anti-matter led to the creation of an entire star, breeding forms of life threatening to destroy the world. Human beings, in an effort to save the universe, created the powerful Andorogynus - a life form capable of being male and female at once - and sent it on a mission to destroy the creation of anti-matter. \n \nAndorogynus (sic) is a top-down shoot-em-up. The player controls the titular hero(ine), shooting at constantly attacking enemies. Unlike in most games of the type, the screen scrolls down rather than up. The protagonist is equipped with a default single shot and has protective orbs revolving around that damage nearby enemies. The weapon can be enhanced (rapid fire, three-way fire, etc.) by collecting randomly descending power-ups. The player controls the male incarnation of the protagonist initially, but later switches to the female one.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hard Ball (Japan)": {
    "key": "Hard Ball (Japan)",
    "original_name": "Hardball (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hard Ball is a baseball game for one or two players. You can throw a variety of pitches from fast balls to curve balls, steal bases, select team members, and substitute players as the game is played.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Heroes of the Lance (Japan)": {
    "key": "Heroes of the Lance (Japan)",
    "original_name": "Advanced Dungeons And Dragons - Heroes Of The Lance (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the later parts of the Dragonlance book Dragons of Autumn Twilight, the heroes descend into a ruined city in search of the disks of Mishakal. \n \nThe gameplay consists of horizontal fighting with a maze like map using doors to change the view. The party consists of the 8 Heroes of the Lance, using one at a time and the player can switch between them at any time. Each character has different types of attacks and spells making them more suited to fighting different enemies as well as acting as lives. \n \nOne of the AD&D games that takes a break from the usual RPG style.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Higemaru Makai Shima - Nanatsu no Shima Daibouken (Japan)": {
    "key": "Higemaru Makai Shima - Nanatsu no Shima Daibouken (Japan)",
    "original_name": "Makaijima - Higemaru (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Taking the basic concept of Pirate Ship Higemaru, the Arcade game on which it is based, and expandings on it, is an adventure game as expansive and in-depth as the Legend of Zelda. \n \n \n \nThe goal is to sail around until the player finds a pirate ship (the friendly green merchant ships will simply provide hints) and clear the boss. Doing so will allow the player to collect a port key which allows them to set anchor on one of the titular seven islands. The player must then remove the boss of that island and recover the treasure. At which point, the process must be repeated.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "High School! Kimengumi (Japan)": {
    "key": "High School! Kimengumi (Japan)",
    "original_name": "High School Kimengumi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Adventure game based on the manga by Motoei Shinzawa with the same name.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hinotori - Houou Hen (Japan) (Alt 1)": {
    "key": "Hinotori - Houou Hen (Japan) (Alt 1)",
    "original_name": "Firebird (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the \"Ho-o\" (or \"Karma\" volume) of Osamu Tezuka's famous manga Hi no tori (or \"Phoenix\"), \"Hi no tori Hououhen\" is a vertically-scrolling shooting game where Gaou's goal is to locate the mystical phoenix across 6 stages of labyrinths, enemies and various other obstacles. As the game progresses, Gaou can power up by obtaining phoenix plumes to activate special weapons and other items to help him gain abilities such as invulnerability and special shots. In order to reach the final boss and pay a visit to the phoenix, Gaou must obtain a series of keys scattered across the stages - and must even backtrack to find others. The game is over when all three lives are gone - or when Gaou has reached the phoenix's lair.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hinotori - Houou Hen (Japan) (Alt 2)": {
    "key": "Hinotori - Houou Hen (Japan) (Alt 2)",
    "original_name": "Firebird (Japan) (Alt 2)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the \"Ho-o\" (or \"Karma\" volume) of Osamu Tezuka's famous manga Hi no tori (or \"Phoenix\"), \"Hi no tori Hououhen\" is a vertically-scrolling shooting game where Gaou's goal is to locate the mystical phoenix across 6 stages of labyrinths, enemies and various other obstacles. As the game progresses, Gaou can power up by obtaining phoenix plumes to activate special weapons and other items to help him gain abilities such as invulnerability and special shots. In order to reach the final boss and pay a visit to the phoenix, Gaou must obtain a series of keys scattered across the stages - and must even backtrack to find others. The game is over when all three lives are gone - or when Gaou has reached the phoenix's lair.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hinotori - Houou Hen (Japan)": {
    "key": "Hinotori - Houou Hen (Japan)",
    "original_name": "Firebird (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the \"Ho-o\" (or \"Karma\" volume) of Osamu Tezuka's famous manga Hi no tori (or \"Phoenix\"), \"Hi no tori Hououhen\" is a vertically-scrolling shooting game where Gaou's goal is to locate the mystical phoenix across 6 stages of labyrinths, enemies and various other obstacles. As the game progresses, Gaou can power up by obtaining phoenix plumes to activate special weapons and other items to help him gain abilities such as invulnerability and special shots. In order to reach the final boss and pay a visit to the phoenix, Gaou must obtain a series of keys scattered across the stages - and must even backtrack to find others. The game is over when all three lives are gone - or when Gaou has reached the phoenix's lair.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hole in One Special (Japan) (Alt 1)": {
    "key": "Hole in One Special (Japan) (Alt 1)",
    "original_name": "Hole In One Special (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "After the huge success of the first two releases HAL Laboratory released a third golf simulation game. Again it is a standard 18-hole golf game, played from a top-down perspective. \nHole In One Special can be played  up to two players at three difficulty levels: average, expert and pro. \nYou can compete in stroke play, match play and tournament play. The tournament play can be set at one to four days. \n \nDuring the game the following options can be changed: the direction of the ball, pick a club, set the curve of the ball and the stroke power. \n \nThe main difference with the other two releases in the Hole In One series for MSX is that Hole In One Special makes full use of the MSX2 graphical capabilities and can only be played on MSX2 computers.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hole in One Special (Japan)": {
    "key": "Hole in One Special (Japan)",
    "original_name": "Hole In One Special (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "After the huge success of the first two releases HAL Laboratory released a third golf simulation game. Again it is a standard 18-hole golf game, played from a top-down perspective. \nHole In One Special can be played  up to two players at three difficulty levels: average, expert and pro. \nYou can compete in stroke play, match play and tournament play. The tournament play can be set at one to four days. \n \nDuring the game the following options can be changed: the direction of the ball, pick a club, set the curve of the ball and the stroke power. \n \nThe main difference with the other two releases in the Hole In One series for MSX is that Hole In One Special makes full use of the MSX2 graphical capabilities and can only be played on MSX2 computers.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hydlide 3 - The Space Memories (Japan)": {
    "key": "Hydlide 3 - The Space Memories (Japan)",
    "original_name": "Hydlide III - The Space Memories (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The third entry in the Hydlide series, continuing its action RPG legacy. Character creation allows the player to choose one of the four character classes: Warrior, Thief, Priest, and Monk. In combat, the protagonist uses melee or long-ranged weapons or casts magic spells. Unlike the previous games in the series, the player is required to press the attack button during melee combat, instead of simply \"bumping\" into the enemies. There is an internal clock in the game, which makes it necessary for the protagonist to sleep periodically and regain his strength. The main character also has to eat from time to time, otherwise his hit points will gradually decrease. The morality system from the previous game returns: killing friendly creatures will reduce the player's morality level, which will eventually have an effect on one of the game's most decisive battles.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ide Yousuke Meijin no Jissen Mahjong (Japan)": {
    "key": "Ide Yousuke Meijin no Jissen Mahjong (Japan)",
    "original_name": "Ide Yousuke no Jissen Mahjong (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Originally released for Famicom in 1987, Ide Yousuke Meijin no Jissen Mahjong made its way to MSX2 one year later, thanks to the good folks at Pack-In-Video. The game is identical to its Famicom counterpart and features some solid 1v1 mahjong action.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ikari (Japan) (Alt 1)": {
    "key": "Ikari (Japan) (Alt 1)",
    "original_name": "Ikari Warriors (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Better known as Ikari Warriors in the west, Ikari is a vertically scrolling action game where one or two players fight their way through a variety of terrain, such as jungles, rivers, and ruins. Along the way different weapons can be found, including machine guns, grenades, and rocket launchers.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ikari (Japan)": {
    "key": "Ikari (Japan)",
    "original_name": "Ikari Warriors (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Better known as Ikari Warriors in the west, Ikari is a vertically scrolling action game where one or two players fight their way through a variety of terrain, such as jungles, rivers, and ruins. Along the way different weapons can be found, including machine guns, grenades, and rocket launchers.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kikikai-kai (Japan)": {
    "key": "Kikikai-kai (Japan)",
    "original_name": "Kiki Kaikai (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The youngest child of a mysteriously disappeared family didn't join the family on a journey to a far and unknown place to board an odd ark because she had to keep on cultivating their land. An humble peasant spread the word: a creature coming from the underworld took away the ark! \n \nThe girl must have been touched by the hand of luck... and she alone is the only one who can save and take them safely back home. \n \nYou can move around in eight directions, trying to defend yourself against the attacks of creatures coming from the underworld. \nYou can defend yourself by means of scrolls with obscure magician runes, throwing cards and other weapons to be picked up en route. \n \nThe magic cards and magic spells have a limited range or last only for a short period of time but can be powered up by collecting the runes found after destroying a formation of red flames-shaped enemies or waving an black and white flag. \nSeveral items (mostly pearls) will be found along the way and can be picked up and used to defeat the enemy creatures. \n \nA round consist of multiple scenes (areas) and each scene is completed when the Scene Guard has been defeated and when a round is completed one family member will be free and return safely home...",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "King Kong 2 - Yomigaeru Densetsu (Japan)": {
    "key": "King Kong 2 - Yomigaeru Densetsu (Japan)",
    "original_name": "King Kong 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on King Kong Lives movie King Kong 2: Yomigaeru Densetsu is an action game with puzzle-solving and role-play elements, a more complex experience compared to Famicom version of King Kong 2. \n \nYou play as Mitchel (Hank Mitchell from the movie) who travels to Golnebo Isle in search of Lady Kong, the only creature whose blood can save King Kong, seriously wounded in the end of the first movie. Exploring the island Mitchel will fight enemies with melee weapons and magic scrolls and gain experience points. With enough experience he levels up and gets increase in strength, speed, health and magic points. By entering certain buildings Mitchel can engage in conversations, buy weapons or healing items and rest. In conversations Mitchel will also get hints needed to solve some puzzles. The game has several endings depending on how long it took the player to beat it (game time is measured in days) and how many continues were used.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kisei (Japan)": {
    "key": "Kisei (Japan)",
    "original_name": "Kisei Shogi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kisei is a Board game, developed by Shogi Master and published by Sony, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kitahei (Japan)": {
    "key": "Kitahei (Japan)",
    "original_name": "Kitahei (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kitahei is a computer version of the ancient Japanese game sh?gi, which is a board game that plays much like chess. You can play it against the computer or another player. You can also save your progress to disk to come back to the game later.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Koronis Rift (Europe)": {
    "key": "Koronis Rift (Europe)",
    "original_name": "Koronis Rift (Europe)",
    "name": "",
    "name_source": "",
    "original_desc": "You play as a techno scavenger in the year 2049, exploring the Koronis Rift, in one of Lucasfilms earliest games. \n \nThe Ancients abandoned the planet, leaving behind many different artifacts and ships, which you can loot. Send your droid to retrieve modules and try to figure out what the ancient technology is for. It could be batteries, shields or even weapons, to help you fight the trigger-happy saucers that want you dead. \n \nThe game uses fractal graphics, the terrain is vast and detailed, and the story behind it is quite complex, considering the type of game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Labyrinth (Japan) (Alt 1)": {
    "key": "Labyrinth (Japan) (Alt 1)",
    "original_name": "Labyrinth (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "The player starts this game off controlling the actions of an ordinary citizen on their way to a movie theater. In the south cinema, the player chats with two teenagers about the actual movie at which point a hush descends upon the room and the in-game film begins...where the player learns that they have been chosen to be the thrall of Jareth the Goblin King, who must be overcome to finish the game. A clock ticks down 13 meager hours to complete this task, lest the player's character end up lost in the labyrinth forever.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Labyrinth (Japan)": {
    "key": "Labyrinth (Japan)",
    "original_name": "Labyrinth (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The player starts this game off controlling the actions of an ordinary citizen on their way to a movie theater. In the south cinema, the player chats with two teenagers about the actual movie at which point a hush descends upon the room and the in-game film begins...where the player learns that they have been chosen to be the thrall of Jareth the Goblin King, who must be overcome to finish the game. A clock ticks down 13 meager hours to complete this task, lest the player's character end up lost in the labyrinth forever.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lupin Sansei - Babylon no Ougon Densetsu (Japan) (Alt 1)": {
    "key": "Lupin Sansei - Babylon no Ougon Densetsu (Japan) (Alt 1)",
    "original_name": "Arsene Lupin 3rd 2 - Babiron no Ougon Densetsu (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "A video game adaption of Hayao Miyazaki's Lupin III anime film of the same name.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lupin Sansei - Cagliostro no Shiro (Japan) (Alt 1)": {
    "key": "Lupin Sansei - Cagliostro no Shiro (Japan) (Alt 1)",
    "original_name": "Arsene Lupin the 3rd and the Castle of Cagliostro (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Lupin the 3rd: Cagliostro no Shiro is an adaption of Hayao Miyazaki's Lupin III anime film bearing the same name.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lupin Sansei - Cagliostro no Shiro (Japan)": {
    "key": "Lupin Sansei - Cagliostro no Shiro (Japan)",
    "original_name": "Arsene Lupin the 3rd and the Castle of Cagliostro (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Lupin the 3rd: Cagliostro no Shiro is an adaption of Hayao Miyazaki's Lupin III anime film bearing the same name.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mad Rider (Japan) (Alt 1)": {
    "key": "Mad Rider (Japan) (Alt 1)",
    "original_name": "Mad Rider (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Racing game against the clock. At the beginning you can select between six courses (Megacity, Plateau, Alps, Island, Egyptian and Canyon). Your driving a red sports car, and need to avoid other drivers and obstacles. You don't race other drivers.. If you hit objects you tend to explode, apart from water, oil and Motor Cyclists!? where you spin out and can regain control. The gameplay is laggy and the graphics for an MSX2 game are very poor.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mad Rider (Japan)": {
    "key": "Mad Rider (Japan)",
    "original_name": "Mad Rider (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Racing game against the clock. At the beginning you can select between six courses (Megacity, Plateau, Alps, Island, Egyptian and Canyon). Your driving a red sports car, and need to avoid other drivers and obstacles. You don't race other drivers.. If you hit objects you tend to explode, apart from water, oil and Motor Cyclists!? where you spin out and can regain control. The gameplay is laggy and the graphics for an MSX2 game are very poor.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite": {
    "key": "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite",
    "original_name": "Maison Ikkoku - Kanketsuhen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the manga Maison Ikkoku by Rumiko Takahashi. \n \nSet in Tokyo of the 80's, the story can be described as a romantic tale with a touch of comedy. It centers on a boarding house which is managed by the young and lovely widow Kyoko Otonashi. The protagonist is a college student named Yusaki Godai, and his relationship with Kyoko is the main plot line. The game's story approximately corresponds to the middle volumes of the manga until the conclusion. \n \nThe game is a \"puzzle-less\" adventure, the gameplay mostly focusing on simply depleting all the verb commands at every given screen and moving between locations. The commands include the usual \"Look\", \"Talk\", and Move\" typical for Japanese adventures (no \"Think\" command), but also context-sensitive commands \"Eat\", \"Drink\", etc., as well as the possibility to use certain inventory items.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Maison Ikkoku - Omoide no Photograph (Japan)": {
    "key": "Maison Ikkoku - Omoide no Photograph (Japan)",
    "original_name": "Maison Ikkoku (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A humble adventure game. This game will be enjoyed by fans, but others may not find it interesting. In addition to pleasing the tenants with various things like cup ramen and liquor you must also get on the good side of the manager. The story advances the more you enter the manager's room, but aside from that there are few restrictions on what you can do. Aside from a couple of exceptions you will not encounter \"game over",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Metal Gear (Europe)": {
    "key": "Metal Gear (Europe)",
    "original_name": "Metal Gear (Europe)",
    "name": "",
    "name_source": "",
    "original_desc": "Near the end of the 20th century, a small fortified nation named Outer Heaven (founded by a mysterious war hero whose name and identity are shrouded in secrecy) is threatening the nations of the \"West\" with the development of a new prototype weapon named Metal Gear, a walking tank which is capable of launching nuclear warheads from anywhere on the globe. As FOX-HOUND's (an elite black ops unit) newest recruit, going by the codename of Solid Snake, your mission is to infiltrate Outer Heaven and rescue your missing comrade, Grey Fox (who was captured after a failed infiltration), while gathering intelligence on Metal Gear.  \n \nIn order to fulfill this objective, the player must collect various weapons and equipments (including keycards for further access into the fortress), while avoiding visual contact with the enemy. The player must also confront bosses in the form of Outer Heaven's elite mercenary force and rescue hostages hidden within the fortress in order to increase player rank, which gives Snake an extended life bar and increased storage capacity for replenishable items and ammo. The player can use a wireless transceiver to come in touch with their commanding officer, Big Boss, to learn more about their current mission objectives or contact one of the local resistance members operating covertly within the fortress to gain useful tips and insights.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Metal Gear (Japan)": {
    "key": "Metal Gear (Japan)",
    "original_name": "Metal Gear (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Near the end of the 20th century, a small fortified nation named Outer Heaven (founded by a mysterious war hero whose name and identity are shrouded in secrecy) is threatening the nations of the \"West\" with the development of a new prototype weapon named Metal Gear, a walking tank which is capable of launching nuclear warheads from anywhere on the globe. As FOX-HOUND's (an elite black ops unit) newest recruit, going by the codename of Solid Snake, your mission is to infiltrate Outer Heaven and rescue your missing comrade, Grey Fox (who was captured after a failed infiltration), while gathering intelligence on Metal Gear.  \n \nIn order to fulfill this objective, the player must collect various weapons and equipments (including keycards for further access into the fortress), while avoiding visual contact with the enemy. The player must also confront bosses in the form of Outer Heaven's elite mercenary force and rescue hostages hidden within the fortress in order to increase player rank, which gives Snake an extended life bar and increased storage capacity for replenishable items and ammo. The player can use a wireless transceiver to come in touch with their commanding officer, Big Boss, to learn more about their current mission objectives or contact one of the local resistance members operating covertly within the fortress to gain useful tips and insights.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Metal Gear 2 - Solid Snake (Japan) (Demo)": {
    "key": "Metal Gear 2 - Solid Snake (Japan) (Demo)",
    "original_name": "Metal Gear 2 - Solid Snake (Japan) (Demo)",
    "name": "",
    "name_source": "",
    "original_desc": "In 1999, a great scientist named Kio Marv invented \"oilix\", a special petroleum-purifying substance that was supposed to help in the upcoming oil crisis. Shortly after the invention became known in the world, Dr. Marv was abducted. An investigation showed that he was held captive in Zanzibar Land, an isolated state in Central Asia which was ruled by a group of mercenaries from all around the world. Having oilix in addition to nuclear weapons are bound to Zanzibar an invincible state that would sooner or later attempt to conquer the entire world. Roy Campbell, ex-commander of special unit FOXHOUND, sends Solid Snake, the man who has single-handedly brought down the military nation of Outer Heaven four years ago, on a mission to infiltrate Zanzibar and to bring back the scientist and his invention. \n \nLike its predecessor, Metal Gear 2: Solid Snake is a stealth game. The driving element of the gameplay is to stay unnoticed. If guards spot you, you don't have much chance in combat, unless you are armed with appropriate weapons, which aren't easily acquired. Snake can use a variety of weapons and gadgets to help him survive during his mission. He can also hide behind objects, punch guards, and crawl. From time to time he'll have to participate in boss battles, where stealth won't help any more.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Metal Gear 2 - Solid Snake (Japan)": {
    "key": "Metal Gear 2 - Solid Snake (Japan)",
    "original_name": "Metal Gear 2 - Solid Snake (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In 1999, a great scientist named Kio Marv invented \"oilix\", a special petroleum-purifying substance that was supposed to help in the upcoming oil crisis. Shortly after the invention became known in the world, Dr. Marv was abducted. An investigation showed that he was held captive in Zanzibar Land, an isolated state in Central Asia which was ruled by a group of mercenaries from all around the world. Having oilix in addition to nuclear weapons are bound to Zanzibar an invincible state that would sooner or later attempt to conquer the entire world. Roy Campbell, ex-commander of special unit FOXHOUND, sends Solid Snake, the man who has single-handedly brought down the military nation of Outer Heaven four years ago, on a mission to infiltrate Zanzibar and to bring back the scientist and his invention. \n \nLike its predecessor, Metal Gear 2: Solid Snake is a stealth game. The driving element of the gameplay is to stay unnoticed. If guards spot you, you don't have much chance in combat, unless you are armed with appropriate weapons, which aren't easily acquired. Snake can use a variety of weapons and gadgets to help him survive during his mission. He can also hide behind objects, punch guards, and crawl. From time to time he'll have to participate in boss battles, where stealth won't help any more.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mirai (Japan)": {
    "key": "Mirai (Japan)",
    "original_name": "Mirai (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The year is 720 of the Galactic Era. Humans have ventured into deep space and found they were not alone in the universe. Alien life forms populated the galaxy, both friendly and hostile. The Rainbow Nebula is home to that last kind, and the protagonist of the game is the only one who can fight them. \n \nMirai is a sci-fi shooter with strong role-playing elements. The player controls the protagonist who uses a jetpack to fly through scrolling maze-like environments. Experience points and money are gained from defeating the numerous respawning enemies. Money can be used in the few friendly areas to purchase weapons and items. The player also has to keep an eye on the fuel gauge for the protagonist's jetpack.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mississippi Satsujinjiken (Japan)": {
    "key": "Mississippi Satsujinjiken (Japan)",
    "original_name": "Missisippi Satsujin Jiken (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The famous detective Sir Charles Foxworth is taking a holiday on the Mississippi with his servant Regis on the Delta Princess. He's just taking a stroll around the upper deck of the ship when he discovers an open cabin door. Behind it: a dead man. As it turns out, the body of Raleigh Cartwright III. Sir Charles has three days to find the murderer, because then, the ship will reach New Orleans, giving the culprit a safe chance to escape. The joystick controls the player's sprite to move into the respective direction, and pressing the button opens a menu with appropriate commands for the current situation. Walk around, Inspect an item, or examine evidence. You will meet some characters who also happen to be suspects. Use these encounters as a fact-finding session. Take notes on what he or she has said. Share these notes with other passengers and crew members. But your first job is to find the body. Until you do, any information you gather will be of little value. Once you find the body, the other passengers will prove to be much more talkative. Collect as many notes and evidence as you can to solve the mystery. Once you think that you have it solved, make an accusation by going to the character that you want to accuse and by using the joystick, point to Talk to [character's name], and press the joystick button. Then point to Accuse [character's name] and press the joystick button. Depending on the amount of evidence collected, you will know if your hunch was right or wrong. Murder on the Mississippi has four possible endings with many variations on each one. Don't let the Delta Princess arrive to New Orleans before you solve the mystery, or the murderer will get away.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Moero!! Nettou Yakyuu '88 (Japan)": {
    "key": "Moero!! Nettou Yakyuu '88 (Japan)",
    "original_name": "Moero!! Nettou Yakyuu '88 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Moero!! Nettou Yakyuu '88 is a Sports game, developed and published by Jaleco, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nekketsu Juudou (Japan) (Alt 1)": {
    "key": "Nekketsu Juudou (Japan) (Alt 1)",
    "original_name": "Nekketsu Juudou (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Sport competition of judo",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nekketsu Juudou (Japan)": {
    "key": "Nekketsu Juudou (Japan)",
    "original_name": "Nekketsu Juudou (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Sport competition of judo",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ninja-kun - Asura no Shou (Japan)": {
    "key": "Ninja-kun - Asura no Shou (Japan)",
    "original_name": "Ninja Kun - Ashura no Sho (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game tells another story in Ninja-kun series. This time itâ€™s a platform game with some twists. There are two tasks alternating through levels: you are required either to kill every enemy in the level (as in the previous games) or simply to reach the exit. Running into enemies usually wonâ€™t kill you, however if you are hit by a single projectile, youâ€™ll have to start from a checkpoint. Enemies vary from plain ninjas to giant skeletons or killer fish. Each level has a time limit, and when this limit is close to an end a fire wheel of death will appear on the screen, chasing Ninja-kun. \n \nNinja-kun has some techniques for successful progression though the levels: many enemies can be temporarily stunned by jumping on them or hitting them from below; and ninja can obtain some power-ups including boomerang, bombs, a devastating fire attack or invincibility. Ninja-kun is capable of wall climbing and wall jumping, the latter requiring some practice from the player. \n \nThe levels (called â€œscenesâ€  in-game) are scattered through mountains, caves, beaches and underwater locations. You can choose which set of levels youâ€™ll start in by playing a mini-game at the beginning.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nobunaga no Yabou - Bushou Fuuun Roku (Japan)": {
    "key": "Nobunaga no Yabou - Bushou Fuuun Roku (Japan)",
    "original_name": "Nobunaga no Yabou 4 - Bushou Fuuun Roku (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Nobunaga no Yabou: Bushou Fuuun Roku is the fourth game in the Nobunaga series. The story of Nobunaga takes place during the Japanese civil war of the 16th century. In this wartime strategy game, 15 different warlords are represented across several territories. \n \nGameplay is done in one of two scenarios; the beginning of the civil war in 1555 or Nobunaga surrounded by his enemies in 1571. Management of population, supplies and military are the gameplay and successful manipulation of these numbers in the right combination to attack and defend against hostile intentions is what will bring your forces to victory.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nobunaga no Yabou - Sengoku Gunyuuden (Japan)": {
    "key": "Nobunaga no Yabou - Sengoku Gunyuuden (Japan)",
    "original_name": "Nobunaga no Yabou 3 - Sengoku Gunyuuden (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Nobunaga no Yabou: Sengoku Gunyuuden is the third game in the Nobunaga series. The setting is 16th century feudal Japan, a period when ruthless daimyo (feudal lords) contended with each other for dominance. Ultimately, the winner in this struggle will become Shogun and hold actual power over the islands, while being nominally subject to the Emperor. \n \nThe game casts the player as one of the daimyo, allowing them freedom to decide the fate and future of feudal Japan, through diplomacy and ultimately war. The objective is to unify Japan under the player's rule. If the player fails through death on the battlefield, assassination at the hands of a ninja, or through natural causes, they can choose a successor and play on.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nobunaga no Yabou - Zenkoku Ban (Japan)": {
    "key": "Nobunaga no Yabou - Zenkoku Ban (Japan)",
    "original_name": "Nobunaga no Yabou 2 - Zenkokuban (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Nobunaga no Yabou: Zenkokuban is the second game in the Nobunaga series. In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling the entire country. One of those daimyos was the ambitious Nobunaga Oda, a merciless ruler and a renowned strategist. Players take on the role of Nobunaga Oda or one of many other daimyos to try to conquer Japan. \n \nPlayers begin by selecting either a 17 regions scenario or a larger 50 scenario. Then, the player must select a daimyo, each of which is rated attributes in several categories; Age, Health, Ambition, Luck, Charm and IQ. As the game progresses, these values change depending on events in the game. The age value represents a time limit of sorts, as an elderly daimyo becomes increasingly likely to die of old age or sickness.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ogre (Japan) (Alt 1)": {
    "key": "Ogre (Japan) (Alt 1)",
    "original_name": "Ogre (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Ogre is a 2D turn-based strategy game, and a direct computer conversion of Steve Jackson's board game of supertanks going against conventional infantry with howitzers. It plays exactly like the board game - on a hex-based board one player controls ordinary military units (soldiers, tanks etc.), and defends against the second player, who controls a supertank named \"Ogre\" - Ogre is very powerful, and can easily destroy normal weaponry and ground forces.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ouke no Tani - El Giza no Fuuin (Japan)": {
    "key": "Ouke no Tani - El Giza no Fuuin (Japan)",
    "original_name": "Ouke no tani - El Giza no fuuni (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Far, far into the future, inter-planetary archaeologist Vick XIII, makes a choking discovery. The pyramids on earth are malfunctioning devices of alien origin with enough energy to destroy earth. And it's up to Vick to switch off the core functions of El Giza. \n \nThe game consists of six pyramids each with its own wall engravings and color pattern; every pyramid contains 10 levels. The idea of the game is to collect crystals called soul stones in each level by solving the different puzzles and evading or killing the enemies using the many tools and weapons available to unlock the exit door that will take you to the next level. \n \nThe game was released both for the MSX1 and MSX2 systems. The MSX2 version only saw a release in Japan. The MSX 2 version was the same game except minor changes like the music was remixed and some of the items and backgrounds recolored.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ouke no Tani - El Giza no Fuuin - Edit Contest Yuushuu Sakuhinshuu (Japan)": {
    "key": "Ouke no Tani - El Giza no Fuuin - Edit Contest Yuushuu Sakuhinshuu (Japan)",
    "original_name": "Ouke no tani - El Giza no fuuni (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Far, far into the future, inter-planetary archaeologist Vick XIII, makes a choking discovery. The pyramids on earth are malfunctioning devices of alien origin with enough energy to destroy earth. And it's up to Vick to switch off the core functions of El Giza. \n \nThe game consists of six pyramids each with its own wall engravings and color pattern; every pyramid contains 10 levels. The idea of the game is to collect crystals called soul stones in each level by solving the different puzzles and evading or killing the enemies using the many tools and weapons available to unlock the exit door that will take you to the next level. \n \nThe game was released both for the MSX1 and MSX2 systems. The MSX2 version only saw a release in Japan. The MSX 2 version was the same game except minor changes like the music was remixed and some of the items and backgrounds recolored.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Out Run (Japan)": {
    "key": "Out Run (Japan)",
    "original_name": "Out Run (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "OutRun is a racing game that allows the player to race across varied terrain in a readily available Ferrari, complete with a female passenger, over a series of short tracks. \n \nGameplay is viewed from just above and behind the car. The roads are full of sharp bends and hazards, contact with which can cause the car to roll and lose the player's time. On each section of track there is a fork in the road, allowing the player to choose which direction he or she wishes to go in. The player has to to complete five track sections in total, out of the fifteen in the game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pac-Mania (Japan)": {
    "key": "Pac-Mania (Japan)",
    "original_name": "Pac-Mania (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Pac-Mania is a variation on the game Pac-Man. You need to guide Pac-Man around a maze and eat all of the dots on the board in order to proceed on to the next round. Numerous, multi-colored ghosts also roam the maze trying to stop you. If you eat one of the power pellets in the maze, the ghosts will temporarily turn blue and run from you. Pac-Man can earn bonus points by eating the ghosts when they are in this state. The maze is now shown in isometric perspective and is larger than screen which will scroll to follow the action. To help get out of tight spots, Pac-Man now has the ability to jump. But be careful, because some of the ghosts have learned this trick as well and you could end up in a mid air collision!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pachi Pro Densetsu (Japan)": {
    "key": "Pachi Pro Densetsu (Japan)",
    "original_name": "Pachipro Densetsu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Pachipro Densetsu is a Pachinko game for one player.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Penguin-kun Wars 2 (Japan) (Alt 1)": {
    "key": "Penguin-kun Wars 2 (Japan) (Alt 1)",
    "original_name": "Penguin Kun Wars 2 (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Penguin-Kun Wars 2 is the follow-up to Penguin-Kun Wars. It is similar to the original in that it is a game of dodgeball, with the goal being to hit the opponent the most amount of times to win the match and advance up the leader board. It has a wider variety of stages than its predecessor, including a garden stage, an ice stage, and a jungle stage, among others.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Penguin-kun Wars 2 (Japan)": {
    "key": "Penguin-kun Wars 2 (Japan)",
    "original_name": "Penguin Kun Wars 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Penguin-Kun Wars 2 is the follow-up to Penguin-Kun Wars. It is similar to the original in that it is a game of dodgeball, with the goal being to hit the opponent the most amount of times to win the match and advance up the leader board. It has a wider variety of stages than its predecessor, including a garden stage, an ice stage, and a jungle stage, among others.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Predator (Japan)": {
    "key": "Predator (Japan)",
    "original_name": "Predator (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Predator is a side-scrolling platformer which uses the imagery and characters from the classic Arnie movie of the same name. The game is not a faithfully conversion of the movie however - your unit has already been killed off when the game starts and you will battle scorpions, enemy soldiers and dodge obstacles etc, before facing the Predator itself a number of times. \n \nThe game is a fairly standard run-jump-shoot platformer, except that you start with no weapons at all and must collect them as the game goes on.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pro Yakyuu Family Stadium - Pennant Race (Japan)": {
    "key": "Pro Yakyuu Family Stadium - Pennant Race (Japan)",
    "original_name": "Pro Yakyuu Family Stadium (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Baseball game for one or two players. You can choose one of the 18 teams to play an exhibition match against computer or a friend. Or how about battling it out against five other teams in Pennant Race mode, where you can save your progress with passwords. There is also an edit mode, where you can change the player names and modify their abilities.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pro Yakyuu Fan - Telenet Stadium (Japan)": {
    "key": "Pro Yakyuu Fan - Telenet Stadium (Japan)",
    "original_name": "Pro Yakyuu Fan Telenet Stadium (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Pro Yakyuu Fan Telenet Stadium is a Baseball game, developed and published by Telenet Japan, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Professional Mahjong Gokuu (Japan)": {
    "key": "Professional Mahjong Gokuu (Japan)",
    "original_name": "Professional Mahjong Gokuh (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Professional Mahjong Gokuu features several variations of the game of four-player mahjong. The main idea behind mahjong games is that players receive and discard tiles until they complete hands by forming groups and pairs. The game also features a plethora of options to customize the rules of the game to their liking.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Project A2 - Shijousaidai no Hyouteki (Japan)": {
    "key": "Project A2 - Shijousaidai no Hyouteki (Japan)",
    "original_name": "Project A2 - Shijousaidai no Hyouteki (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Project A2: Shijousaidai no Hyouteki is an action game based on Jackie Chan's Project A2. You fight your way through regular enemies by punching and kicking. Enter to different rooms and you might face a tough enemy, who challenges you to a 1v1 fight.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Quarth (Japan) (Demo)": {
    "key": "Quarth (Japan) (Demo)",
    "original_name": "Quarth (Japan) (Demo)",
    "name": "",
    "name_source": "",
    "original_desc": "Quarth is a typical puzzle/arcade game. Quarth can be moved from right to left while the screen scrolls down. The playing field is filled with different blocks and your aim is to fill them in so they form complete rectangles or squares. Only when you succeed in this mission, the concerned blocks will disappear. New 'unformed' blocks appear while the playing field scrolls down making you play into full action at all times. As soon as a line of blocks reaches the bottom line, it is Game Over. Then you'll be granted 10 seconds to decide if you want continue the level. Each Level consists of 9 Areas and you progress to the next level once you've cleared the last area. The Battle mode is a dual player mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Quarth (Japan)": {
    "key": "Quarth (Japan)",
    "original_name": "Quarth (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Quarth is a typical puzzle/arcade game. Quarth can be moved from right to left while the screen scrolls down. The playing field is filled with different blocks and your aim is to fill them in so they form complete rectangles or squares. Only when you succeed in this mission, the concerned blocks will disappear. New 'unformed' blocks appear while the playing field scrolls down making you play into full action at all times. As soon as a line of blocks reaches the bottom line, it is Game Over. Then you'll be granted 10 seconds to decide if you want continue the level. Each Level consists of 9 Areas and you progress to the next level once you've cleared the last area. The Battle mode is a dual player mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Quarth (Korea)": {
    "key": "Quarth (Korea)",
    "original_name": "Quarth (Korea)",
    "name": "",
    "name_source": "",
    "original_desc": "Quarth is a typical puzzle/arcade game. Quarth can be moved from right to left while the screen scrolls down. The playing field is filled with different blocks and your aim is to fill them in so they form complete rectangles or squares. Only when you succeed in this mission, the concerned blocks will disappear. New 'unformed' blocks appear while the playing field scrolls down making you play into full action at all times. As soon as a line of blocks reaches the bottom line, it is Game Over. Then you'll be granted 10 seconds to decide if you want continue the level. Each Level consists of 9 Areas and you progress to the next level once you've cleared the last area. The Battle mode is a dual player mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Quinpl (Japan)": {
    "key": "Quinpl (Japan)",
    "original_name": "Quinpl (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Quinpl is a japanese puzzle game of the King's Valley II and Eggerland Mystery variety. The main objective is to reach a exit door by jumping over and destroying blocks and monsters. The player's character can shoot stakes that kill the monsters and stick to the blocks (he can jump on these stakes and eventually break those blocks, clearing the path to the exit door). If he touches any of the monsters or dangerous environments, he transforms into a blue frog and the player loses one life. There are several items that can be collected: some of them are immobile, some randomly float around the screen. \n \nOn the top of the screen there are a inventory of collected items, a timer and the number of lives. Both the cartridge and disk versions allow saving the game between levels.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Rastan Saga (Japan)": {
    "key": "Rastan Saga (Japan)",
    "original_name": "Rastan Saga (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Rastan Saga features five levels of hacking and slashing gameplay with a boss at the end of each level. Numerous enemies assault you on your journey such as flying demons, chimeras, valkyries, piranhas, skeleton undead and more. Fight through to the end and save the land of Lograth from certain doom. \n \nThe game features different weapons such as axes, maces and fire swords, each with its own attributes like extended range or attack power. Armour can also be picked up in the forms shields, cloaks and armour, reducing the damage from enemy attacks. Other items include rings (increase the speed of your weapon) and jewelery for bonus points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Relics (Japan)": {
    "key": "Relics (Japan)",
    "original_name": "Relics (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Relics is an Action game, developed and published by Bothtec, which was released in Japan in 1986.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Replicart (Japan)": {
    "key": "Replicart (Japan)",
    "original_name": "Replicart (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "It is the 22nd century. Earth is invaded by a aliens, led by a gigantic robotic snake. To repel the attack, Earth's scientists construct the Replicart machine, a deadly robot snake. The player takes the role of the pilot of the Replicart. \n \nReplicart is a single-player only Snake game variant. In each of the 300 stages you have to collect a certain amount of a substance called 'Biteslime'. Once you fulfill your quota you can enter the next stage through an exit that opens on the left side of the screen. Collecting biteslime increases the length of your snake. If the head of your snake hits a wall, an enemy or part of its body you lose a life.  Replicart enhances the basic Snake game formula by adding power ups like a Time Stop, which freezes enemies, speed increase/decrease or level warps. \n \nThe Famicom Disk System version has undergone a few changes. There are only 100 stages and after each 10 stages you have to face a boss, which must be shot down before continuing to the next set of stages.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Return of Ishtar, The (Japan)": {
    "key": "Return of Ishtar, The (Japan)",
    "original_name": "The Return of Ishtar (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Return of Ishtar is a sequel to The Tower of Druaga. It is an action game with light puzzle-solving elements that requires you to control two different characters. The characters are maiden Ki who fights with magic and the other one is Gilgamesh, the sword-wielding knight. Search for keys and special items. The tower has a few different ways to exit, and the aggregate total of levels is 128. \n \nPlayers are presented a password to allow them to continue from where they left off.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Return of Jelda (Japan)": {
    "key": "Return of Jelda (Japan)",
    "original_name": "Return of Jelda (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Return of Jelda is a Shooter game, developed and published by Carry Lab, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Rick to Mick no Daibouken (Japan)": {
    "key": "Rick to Mick no Daibouken (Japan)",
    "original_name": "Rick to Mick no Daibouken (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Rick to Mick no Daibouken is an Action game for one or two players (cooperative), developed and published by Humming Bird Soft in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sangokushi (Japan)": {
    "key": "Sangokushi (Japan)",
    "original_name": "Sangokushi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the events of the Three Kingdoms era in China (3rd century), and on Luo Guanzhong's famous novel Sanguo Yanyi, the game casts the player in the role of one of the many warlords rivaling for control after the Yellow Turban Rebellion. \n \nThis turn-based strategy game introduces hundreds of historical characters of the Three Kingdoms era. The game's main objective is to become the supreme ruler of the remnants of the falling Han Dynasty. To do this the player has to build a mighty empire by conquering provinces and recruiting generals worthy of command. Fight massive battles, triumph over natural disasters and capture enemy strongholds.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sangokushi II (Japan)": {
    "key": "Sangokushi II (Japan)",
    "original_name": "Sangokushi 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The sequel to Sangokushi. The game concept is still the same, though they did improve a lot of features that one may consider 'disturbing' from RTK I (e.g. Generals dying easily due to disease, etc.). RTK can be said to be much more 'stable' where players no longer have to worry that much about time length in the game, as the game take a slower time rate to allow the players to build up their forces without much interference. The RTK II gameplay and interface is closely similar to Nobunaga's Ambition II.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Scramble Formation (Japan)": {
    "key": "Scramble Formation (Japan)",
    "original_name": "Scramble Formation (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Conversion of Taito's arcade classic, Scramble Formation is a vertical shoot'em up.  The player pilots a biplane over what is presumably the city of Tokyo. Power-ups include multiple biplanes. The option of using plane formations increases gameplay substantially. \n \nAt the end of each level you 'll have to face the Big Enemy.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Seikima II Special - Akuma no Gyakushuu (Japan) (Alt 1)": {
    "key": "Seikima II Special - Akuma no Gyakushuu (Japan) (Alt 1)",
    "original_name": "Seikima II Special - Akuma no Gyakushuu (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Players take control of Demon Kogure, a member of the real life Japanese heavy metal band Seikima-II. He is on a mission to rescue his fellow \"demon\" bandmates who have been captured and imprisoned by the God Zeus. \n \nThe game is broken up into four zones that are composed of eight areas each. In each area players have to collect all the visible items laying around to complete that area. Once all the items are collected in the seven areas of a zone, players can then enter the eighth area where they will find one of their bandmates locked inside a cage. While collecting all the visible items, players will be continuously attacked by enemies that they can either try to jump and dodge or shoot their projectile weapon at them. Getting hit by an enemy will decrease the players life, which is already constantly draining. \n \nOne of the items the player collects are moneybags. Collected moneybags earn the player money which can in turn be spent at the various shops found throughout the game. Shops sell life potions, stronger weapons, and also musical instruments for each band member.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Seikima II Special - Akuma no Gyakushuu (Japan)": {
    "key": "Seikima II Special - Akuma no Gyakushuu (Japan)",
    "original_name": "Seikima II Special - Akuma no Gyakushuu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Players take control of Demon Kogure, a member of the real life Japanese heavy metal band Seikima-II. He is on a mission to rescue his fellow \"demon\" bandmates who have been captured and imprisoned by the God Zeus. \n \nThe game is broken up into four zones that are composed of eight areas each. In each area players have to collect all the visible items laying around to complete that area. Once all the items are collected in the seven areas of a zone, players can then enter the eighth area where they will find one of their bandmates locked inside a cage. While collecting all the visible items, players will be continuously attacked by enemies that they can either try to jump and dodge or shoot their projectile weapon at them. Getting hit by an enemy will decrease the players life, which is already constantly draining. \n \nOne of the items the player collects are moneybags. Collected moneybags earn the player money which can in turn be spent at the various shops found throughout the game. Shops sell life potions, stronger weapons, and also musical instruments for each band member.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Shanghai (Japan)": {
    "key": "Shanghai (Japan)",
    "original_name": "Shanghai (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Shanghai is one of the first video game adaptations of the tile-based game played with the Chinese mahjong stones - essentially a puzzle game that has little to do with real mahjong rules. \n \nThe gameplay involves 144 tiles, each depicting different images, which have to be removed by matching them into pairs. The tiles are arranged in a gridded pattern, which is higher near the centre. A tile can only be removed if it has no tile next to it on at least one side. \n \nThis computer implementation can generate a random board layout to take on and features five preset challenges, some of which have time limits of five or ten minutes, as well as a multiplayer mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Shiryou Sensen - War of the Dead (Japan)": {
    "key": "Shiryou Sensen - War of the Dead (Japan)",
    "original_name": "Shiryou Sensen. War of the Dead (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Due to mysterious circumstances, a flourishing city called Chinese Hill was cut off the rest of the world. Investigators found out that most of the buildings were destroyed, horrifying creatures are roaming the wilderness, and the few survivors have no means of escaping. The SSWAT (Supernatural Special Weapon Attack Team) sends an agent named Laila to the city. The young woman has powerful psychic abilities, which can enhance her firearms, helping her deal with the monsters. She must rescue the survivors and escort them to safety, at any cost... \n \nShiryo Sensen - War of the Dead is an action game with slight RPG elements. The player navigates Laila over the top-down \"world map\": the ruined city has basically turned into large wilderness areas with a few buildings that are represented by icons on the map and can be explored. Enemies attack randomly. The battles take place on separate side-scrolling screens, and are fully action-based. Laila can jump, duck, and attack with melee or weapons or firearms (which require ammunition). Typically there are several enemies on the screen; Laila escapes the battle if she reaches the end of the short side-scrolling area.  \n \nThe goal of the game is to find and rescue the few survivors trapped in the buildings infested by enemies. Laila has to bring these survivors back to the church. Even though the map is almost completely open to the player (especially after Laila acquires a boat, which makes the world fully explorable), the rescuing must be completed in a linear fashion, by talking to characters in different buildings and receiving clues. The game has a day/night cycle; Laila can sleep at any time, which will restore a portion of her health.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Star Virgin (Japan) (Alt 1)": {
    "key": "Star Virgin (Japan) (Alt 1)",
    "original_name": "Star Virgin (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Star Virgins about as obscure as it comes, its a promotional hour long straight to video film from Japan. That was made to promote a little seen videogame of the same name distributed by Activision that only ever appeared on the long forgotten msx system. \n \nPlays out pretty much like a bonkers live action anime movie. Its a camp science fiction fantasy comedy about a girl whose secretly the lone fighter of justice Star Virgin, its her pursuit to stop the planet being attacked from robotic & puppet monsters, giant spiders and whatever else would warrant as being an end of level boss in an 80s video game... at least I think thats the overall idea, because its obviously never been translated into English its hard to totally fathom out what the hells going on, but hey thats the beauty of the Japanese movies right. \n \nStar Virgin herself is every Japanorama fanboys wetdream, shes a cute pink power ranger with her own spacecraft & powerbike and she kicks ass with a bazooka. The whole thing would have made an awesome music video for The Flaming Lips - Yoshimi Battles the Pink Robots (what I'm oddly playing while writing this). Sure its none essential throwaway stuff, but its a fun hour even without knowing what they're saying. \n \n[Personal Reasons For Remembering] \nReally loved the spacecraft scenes complete with their robotic butler drivers and its not every day I get to see a movie featuring a robotic Statue of Liberty and an evil genius who lives on a floating volcanic island.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Star Virgin (Japan)": {
    "key": "Star Virgin (Japan)",
    "original_name": "Star Virgin (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Star Virgins about as obscure as it comes, its a promotional hour long straight to video film from Japan. That was made to promote a little seen videogame of the same name distributed by Activision that only ever appeared on the long forgotten msx system. \n \nPlays out pretty much like a bonkers live action anime movie. Its a camp science fiction fantasy comedy about a girl whose secretly the lone fighter of justice Star Virgin, its her pursuit to stop the planet being attacked from robotic & puppet monsters, giant spiders and whatever else would warrant as being an end of level boss in an 80s video game... at least I think thats the overall idea, because its obviously never been translated into English its hard to totally fathom out what the hells going on, but hey thats the beauty of the Japanese movies right. \n \nStar Virgin herself is every Japanorama fanboys wetdream, shes a cute pink power ranger with her own spacecraft & powerbike and she kicks ass with a bazooka. The whole thing would have made an awesome music video for The Flaming Lips - Yoshimi Battles the Pink Robots (what I'm oddly playing while writing this). Sure its none essential throwaway stuff, but its a fun hour even without knowing what they're saying. \n \n[Personal Reasons For Remembering] \nReally loved the spacecraft scenes complete with their robotic butler drivers and its not every day I get to see a movie featuring a robotic Statue of Liberty and an evil genius who lives on a floating volcanic island.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Strategic Mars (Japan)": {
    "key": "Strategic Mars (Japan)",
    "original_name": "Strategic Mars (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Strategic Mars is a shooter from dB-Soft. You start the game from player base, where you can buy upgrades when you get enough points from shooting enemies. At first you can upgrade your engine, repair the ship and get missiles which launch automatically against every enemy wave you face. \n \nYou navigate and warp to fight enemies from the map screen, which tells you the difficulty of the enemies. Fuchsia dots have the easiest enemies and red icons the hardest. Once you clear all enemies from the map, you move to the next level. There are 12 levels in total, and you can even start from the last level if you so wish from the start screen, no passwords needed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Suikoden - Tenmei no Chikai (Japan)": {
    "key": "Suikoden - Tenmei no Chikai (Japan)",
    "original_name": "Suikoden - Tenmei no Chikai (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In the 12th century, the Emperor Hui Zhong is faced with an internal rebellion led by Imperial Minister Gao Qiu. The Song Dynasty comes to an end, and Gao Qiu became the new ruler. You take the role of an exiled ruler, and you must build your stats up to be able to challenge- and destroy- Gao Qiu and restore Hui Zhong to the throne. \n \nThe game is a military strategy game, like most of Koei's games, but instead of conquering a country, the goal is to depose the despotic ruler of China. You start out lowly, and have to work your way up by conquering smaller prefectures, forming alliances, and fighting small battles. You have to earn the right to attack Gao Qiu's home prefecture, though- he is off limits until you are powerful.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Daisenryaku (Japan)": {
    "key": "Super Daisenryaku (Japan)",
    "original_name": "Super Daisenryaku (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Super Daisenryaku is one of the many titles in SystemSoft's long-running war strategy series. The game mechanics are based on Daisenryaku II, but many of the included maps are unique to this release, including several based on Phantasy Star in Sega's console version. There is no campaign mode, and any of the included maps can be played. Some maps are for two players, some for four, and any map can be played with any combination of human and computer players. The computer versions also feature an editor. \n \nThe game is played on a large map made up of hexagonal spaces, each of which consists of one of the included  terrain types. Each player controls a number of units (bought with money), which each take up one space on the grid. The unit types are for the most part based on real-life military equipment from around the time the game was released, what is available to the player depends on the chosen faction. The choices range from single nations, such as China or the USA (the CD port by Microcabin in particular adds a lot of smaller ones, like Sweden and Libya),  to alliances and blocs, for example NATO, which uses a mixture of equipment of it's members.  \n \nDifferent units have different strengths and weaknesses, which affect their performance in combat and their general role on the battlefield. The cheap infantry units for example are not very strong and mobile, but may capture facilities and cities, unlike battle tanks. Terrain also affects the outcome of battles. The goal of each game is to capture the other players' capitals.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Load Runner (Japan)": {
    "key": "Super Load Runner (Japan)",
    "original_name": "Super Lode Runner (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Between 1984 to 1986, Irem released four more different Lode Runner arcade games in Japan after the original arcade games release.  55 stages were culled from these arcade games and were packaged into Super Lode Runner for the Famicom Disk System. The game also kept the innovation from the arcade games of the two-player mode and brought in 15 stages for simultaneous action. \n \nThe game keeps the typical gameplay of the Lode Runner series. Players have to collect all the gold on the stage, while either avoiding or trapping the robotic guards who are constantly giving them chase. The game also features a level editor so players can create their own stages to play on. \n \nA few months after this game was released, Super Lode Runner II was released which is similar to this game, only it included different stages from the arcade games. Also, this game shouldn't be confused with the MSX game with the same title. While in a similar situation as this game, it contains an entirely different set of stages to play.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Rambo Special (Japan)": {
    "key": "Super Rambo Special (Japan)",
    "original_name": "Super Rambo Special (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Super Rambo Special is an action game based on movie Rambo: First Blood Part 2. As in the movie you play the part of one-man-army John Rambo who is busted out of prison by his former CO to go deep into the Vietnamese jungle and rescue a group of P.O.W.s. \n \nYou control Rambo from a top-down perspective as he explores the jungle looking for keys and avoiding enemy patrols, the keys allow you to unlock the many huts you will come across in the jungle and must be explored to release the P.O.W.s and gather weapons and munitions in order to raise some hell, as your trusty knife is not going to cut it against all those Vietnamese and Russian soldiers.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Runner (Japan)": {
    "key": "Super Runner (Japan)",
    "original_name": "Super Runner (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Sports type running game with a twist. This game can be played with two players or against the computer. You need to pick up an object that resembles an American Football and be the first to cross the finish line. The other player needs to try to take the ball from you. For this you can hit and kick each other. \n \nOn the first level it is just a straight run, there are no objects or enemies to stop you. But on subsequent levels you will need to avoid varies enemies and use your hitting and kicking to break blocks that are in your way. The blocks can fall on your head which stuns you for a few seconds, likewise if you get hit by an enemy. Get hit too often and you die.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Tritorn (Japan)": {
    "key": "Super Tritorn (Japan)",
    "original_name": "Super Tritorn (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Real-Time Role Playing Adventure game. \n \nThe game is a big maze where you need to find objects, primary amongst them seem to be bottles of different colours. The game is laggy, in particular when wielding your weapon. Enemies in the first couple of screens don't seem to do you any real harm. You can kill them typically with a single hit, and you can even walk over them. Killing enemies gives you experience (EXP), and when your experience bar is full your life bar increases (H.P). After a few screens though the enemies suddenly get a lot tougher and can kill you almost immediately.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Synthe Saurus (Japan) (Program)": {
    "key": "Synthe Saurus (Japan) (Program)",
    "original_name": "Synthe Saurus (Japan) (Program)",
    "name": "",
    "name_source": "",
    "original_desc": "From the Bit² house, Synth Saurus is a music editing program for the second generation MSX, published in 1989. The music created with this program can be saved to disk or exported to a MSX-BASIC list ready to be executed. The relation time invested-result in the creation of music with Synth Saurus is positive in comparison with the direct programming on MSX-BASIC. The program is handled with a mouse.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Taiyou no Shinden - Asteka II (Japan)": {
    "key": "Taiyou no Shinden - Asteka II (Japan)",
    "original_name": "Taiyou no Shinden - Asteka II. Temple of the Sun (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Despite its name (a misspelling of Azteca), the story of Taiyo no Shinden: Asteka II is dedicated to the Maya people, indigenous inhabitants of Southern Mexico and Central America, rather than the Aztecs. The player controls a nameless adventurer who searches for the Sun Key, a mysterious ancient artifact which can unlock the secrets of the Mayan civilization. \n \nTaiyo no Shinden: Asteka II is an adventure game which takes place in the ruins of the ancient city Chichen Itza on the Yucatan peninsula in Mexico. There is a top-down overworld on which the player can physically navigate the protagonist, entering temples and other locations. In such locations, the view switches to first-person perspective. The player interacts with the environment by selecting various verb commands (\"Look\", \"Take\", \"Use\", etc.), represented by icons, from a menu, and combining them with objects on the screen. In spite of its Japanese origins, the game features inventory item usage and puzzle-solving, which are more typical of Western-style adventures.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tanikawa Hiroshi no Shougi Shinan 2 (Japan)": {
    "key": "Tanikawa Hiroshi no Shougi Shinan 2 (Japan)",
    "original_name": "Koji Tanigawa's Shougi Shinan II (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Tanigawa Kouji no Shougi Shinan II is a Strategy game, developed and published by Pony Canyon, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Teitoku no Ketsudan (Japan)": {
    "key": "Teitoku no Ketsudan (Japan)",
    "original_name": "Teitoku no Ketsudan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Teitoku no Ketsudan is another military sim from KOEI. In this game you can choose to be either Japan or the Allies. By managing your fleets and ordering new warships you can control many different sides of the conflict (Ship development, Base defense, Fleet arrangement, Direct battle control, Economic decisions). There are many different options of play in Teitoku no Ketsudan, you can choose to play from one of many different famous battles or you can play the campaign. You can control one side or both. There are also limited controls on victory conditions.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tengoku Yoitoko (Japan)": {
    "key": "Tengoku Yoitoko (Japan)",
    "original_name": "Tengoku Yoitoko (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Tengoku Yoitoko is a Role-Playing game, developed and published by Taito, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tetris (Japan)": {
    "key": "Tetris (Japan)",
    "original_name": "Tetris (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The original commercially-licensed version of Alexey Pajitnov's classic Tetris puzzle game.  Geometric shapes fall from the top of a playfield to rest on the bottom; fit the pieces together, and the line they form disappears.  If the pieces don't form lines and eventually stack up to the top of the playfield, the game is over.  Difficulty increases by dropping the pieces faster and faster over time.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Treasure of Usas, The (Japan, Europe) (Alt 1)": {
    "key": "Treasure of Usas, The (Japan, Europe) (Alt 1)",
    "original_name": "The Treasure of Usas (Japan, Europe) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "The Treasure Of Usas is a platform game. Centuries ago, the War God Induras banished Usas, the supreme Mother God, and threw the four pieces of her jewel in the winds. Wit and Cles are attempting to find the broken jewel to try and achieve one of the greatest discoveries of the academic world. Their adventures, controlled by you, will lead them to many strange places to fight many unusual enemies. There are five stages in the game. \n \nThere are emotion icons in the game and by touching these icons your player will change emotion. At the top of the screen you can see which emotion you have. This is important because you 'll have to have the same emotion of the demon of the level to fight him.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Treasure of Usas, The (Japan, Europe)": {
    "key": "Treasure of Usas, The (Japan, Europe)",
    "original_name": "The Treasure of Usas (Japan, Europe)",
    "name": "",
    "name_source": "",
    "original_desc": "The Treasure Of Usas is a platform game. Centuries ago, the War God Induras banished Usas, the supreme Mother God, and threw the four pieces of her jewel in the winds. Wit and Cles are attempting to find the broken jewel to try and achieve one of the greatest discoveries of the academic world. Their adventures, controlled by you, will lead them to many strange places to fight many unusual enemies. There are five stages in the game. \n \nThere are emotion icons in the game and by touching these icons your player will change emotion. At the top of the screen you can see which emotion you have. This is important because you 'll have to have the same emotion of the demon of the level to fight him.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tsurikichi Sanpei - Blue Marine Hen (Japan)": {
    "key": "Tsurikichi Sanpei - Blue Marine Hen (Japan)",
    "original_name": "Turikichi Sampei Burumarine-Hen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Tsurikichi Sanpei: Blue Marine Hen is a Sports game, developed and published by Victor Musical Industries, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tsurikichi Sanpei - Tsuri Sennin Hen (Japan)": {
    "key": "Tsurikichi Sanpei - Tsuri Sennin Hen (Japan)",
    "original_name": "Turikichi Sampei Turisennin-Hen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ultima Exodus (Japan)": {
    "key": "Ultima Exodus (Japan)",
    "original_name": "Ultima III - Exodus (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "After the defeat of the evil wizard Mondain and his mistress Minax in the previous two Ultimas, peace has returned to the land of Sorsaria. Times passes and eventually geological disruptions and a resurgence of the monster populace occur, and it is soon learned that Mondain and Minax had conceived a child named Exodus before their death. Now that child has become an adult with the power to avenge the death of his parents. Obviously, it falls upon the hero from Earth to find and stop him. The third title in the Ultima series was the first to feature a party of adventurers instead of a single player character. The party is created at the beginning of the game by assigning various class combinations and determining the characters' attributes. The game has larger and more detailed towns, populated by NPCs the protagonist can converse with to obtain clues. Like in earlier Ultima games, exploration is divided between top-down overworld locations and first-person 3D dungeons. This installment introduces separate combat screens where player-controlled party fights multiple monsters in a turn-based tile-based system.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Urusei Yatsura - Koi no Survival Birthday (Japan)": {
    "key": "Urusei Yatsura - Koi no Survival Birthday (Japan)",
    "original_name": "Urusei Yatsura - Koi no Survival Birthday (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Urusei Yatsura: Koi no Survival Birthday is an Adventure game, developed and published by Micro Cabin, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Vampire Killer (Japan, Europe) (Alt 1)": {
    "key": "Vampire Killer (Japan, Europe) (Alt 1)",
    "original_name": "Akumajyo Drakyula (Japan, Europe) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "You are Simon, who has just entered Dracula's Satanic Castle. \nThe world of Dransylvania is in trouble, and you are the one to set it right. You have to fight your way through 18 stages of demons to where Dracula is hiding. Once you have destroyed Dracula, the evil force behind all the trouble will show up, attempting to destroy you! Destroy this menace, and Dransylvania will return to it's happy days after a wait of hundreds of years. \n \nVampire Killer follows the same plot as Castlevania, but with a different gameplay. At each stage, Simon has to find a white key to open the exit door which leads to the next stage. The keys are usually hidden in the castle's walls, in which he will also find useful items. Items can also be found by whipping candles and other sources of light inside the castle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Vampire Killer (Japan, Europe) (Alt 3)": {
    "key": "Vampire Killer (Japan, Europe) (Alt 3)",
    "original_name": "Akumajyo Drakyula (Japan, Europe) (Alt 3)",
    "name": "",
    "name_source": "",
    "original_desc": "You are Simon, who has just entered Dracula's Satanic Castle. \nThe world of Dransylvania is in trouble, and you are the one to set it right. You have to fight your way through 18 stages of demons to where Dracula is hiding. Once you have destroyed Dracula, the evil force behind all the trouble will show up, attempting to destroy you! Destroy this menace, and Dransylvania will return to it's happy days after a wait of hundreds of years. \n \nVampire Killer follows the same plot as Castlevania, but with a different gameplay. At each stage, Simon has to find a white key to open the exit door which leads to the next stage. The keys are usually hidden in the castle's walls, in which he will also find useful items. Items can also be found by whipping candles and other sources of light inside the castle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Vampire Killer (Japan, Europe)": {
    "key": "Vampire Killer (Japan, Europe)",
    "original_name": "Akumajyo Drakyula (Japan, Europe)",
    "name": "",
    "name_source": "",
    "original_desc": "You are Simon, who has just entered Dracula's Satanic Castle. \nThe world of Dransylvania is in trouble, and you are the one to set it right. You have to fight your way through 18 stages of demons to where Dracula is hiding. Once you have destroyed Dracula, the evil force behind all the trouble will show up, attempting to destroy you! Destroy this menace, and Dransylvania will return to it's happy days after a wait of hundreds of years. \n \nVampire Killer follows the same plot as Castlevania, but with a different gameplay. At each stage, Simon has to find a white key to open the exit door which leads to the next stage. The keys are usually hidden in the castle's walls, in which he will also find useful items. Items can also be found by whipping candles and other sources of light inside the castle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Victorious Nine II - Koukou Yakyuu Hen (Japan)": {
    "key": "Victorious Nine II - Koukou Yakyuu Hen (Japan)",
    "original_name": "Victorious Nine II (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Victorious Nine II is a baseball game where you can pitch, hit, field, and run just like in a real baseball game. You can choose your own team and players line up, the stadium you want to play. In the 1-player mode, you play against the computer. The 2-player mode consist of 2 game play choices: opponent mode (you against a friend) or computer mode (the two of you against the computer).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Wizardry (Japan)": {
    "key": "Wizardry (Japan)",
    "original_name": "Wizardry - Proving Grounds of Mad Overload (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Mad Overlord Trebor was once only power-mad, but went off the deep end after he acquired a magical amulet of immense power, only to have it stolen from him by his nemesis, the evil archmage Werdna. Werdna, not quite sure how to use the amulet properly, accidentally causes an earthquake which creates a ten-level dungeon beneath Trebor's castle. To avoid looking silly, Werdna declares the dungeon to be the new lair for him and his monster hordes. Trebor, not to be outdone, declares the labyrinth his new Proving Grounds where adventurers must prove themselves for membership in his elite honor guard, and incidentally retrieve his amulet in the process. \n \nThe first Wizardry was one of the original dungeon-crawling role-playing games, and stands along with Ultima and Might & Magic as one of the defining staples of the genre. \n \nThe player generates and control a party of up to six different adventurers, choosing from four races (humans, elves, dwarves, gnomes and hobbits), three alignments (good, neutral and evil), and four basic classes (fighter, priest, mage and thief). These can later evolve into elite classes (bishop: priest with mage spells; samurai: fighter with mage spells; lord: fighter with priest spells, and ninja: fighter with thief abilities) if they meet the necessary level requirements. After outfitting the party with basic weapons and armor, the player sends it into a 3D vector maze-like dungeon to fight monsters in turn-based combat and find treasure.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Woody Poco (Japan) (Alt 1)": {
    "key": "Woody Poco (Japan) (Alt 1)",
    "original_name": "Woody Poco (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Woody Poco is a side-scrolling action role-playing game similar to Mystical Ninja. \n \nThe player controls an old wooden figure named \"Poco.\" He is a hero who has lived in harmony with humans for many years. For Poco, the journey is to find the fairy who teaches people to get back to being friendly with wooden dolls. Enemies encountered through the game are strange creatures and bothersome old men. The player attacks by using his fists at them. Players can steal the items in the store. But after stealing, the player's appearance is changed to resemble that of a thief. Hotels and pawn shops can no longer admit the player for the remainder of the game after a theft has taken place. \n \nThe player can equip one hand with a weapon, and the other with a passive tool, such as a lamp for dark areas. The player can buy gear, sleep at hotels, gamble, steal, and bribe non-player characters. The player needs to eat to prevent hunger, with recharging health based on food level. It features an in-game clock, with day/night cycles and four seasons; the color changes to reflect the time of day and the season.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Woody Poco (Japan)": {
    "key": "Woody Poco (Japan)",
    "original_name": "Woody Poco (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Woody Poco is a side-scrolling action role-playing game similar to Mystical Ninja. \n \nThe player controls an old wooden figure named \"Poco.\" He is a hero who has lived in harmony with humans for many years. For Poco, the journey is to find the fairy who teaches people to get back to being friendly with wooden dolls. Enemies encountered through the game are strange creatures and bothersome old men. The player attacks by using his fists at them. Players can steal the items in the store. But after stealing, the player's appearance is changed to resemble that of a thief. Hotels and pawn shops can no longer admit the player for the remainder of the game after a theft has taken place. \n \nThe player can equip one hand with a weapon, and the other with a passive tool, such as a lamp for dark areas. The player can buy gear, sleep at hotels, gamble, steal, and bribe non-player characters. The player needs to eat to prevent hunger, with recharging health based on food level. It features an in-game clock, with day/night cycles and four seasons; the color changes to reflect the time of day and the season.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Xevious - Fardraut Saga (Japan) (Alt 1)": {
    "key": "Xevious - Fardraut Saga (Japan) (Alt 1)",
    "original_name": "Xevious - Fardraut Saga (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Xevious: Fardraut Saga is a vertically-scrolling shooter that contains two modes: Recon and Scramble. The Recon mode is a port of the arcade game Xevious; the Scramble mode can be considered its sequel, adding sixteen new stages, enemies, and boss battles, as the brave fighter pilots continue to defend the Earth against its former inhabitants, who migrated to the planet Xevious thousands of years ago and are now determined to re-capture their ancestral homeland. \n \nThe game's Scramble mode allows the player to control three other aircrafts in addition to the seris' trademark Solvalou, each possessing unique weapons. These aircrafts include Solgrado (armed with spread shot), Zeodalley (twin back fire), and Gampmission, a large ship that is also a combination of the previous three, with massive firepower and enhanced lock-on abilities. A specific aircraft can be assigned to each of the player's \"lives\". The amount of points needed to gather an extra life increases if the player selects more powerful ships. Also, enemies become progressively harder as the controlled aircraft collects power-ups.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Yaksa (Japan)": {
    "key": "Yaksa (Japan)",
    "original_name": "Yaksa (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Yaksa is an Action Role-Playing game, developed and published by Wolf Team, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Yamamura Misa Suspense - Kyoto Ryuu no Tera Satsujinjiken (Japan)": {
    "key": "Yamamura Misa Suspense - Kyoto Ryuu no Tera Satsujinjiken (Japan)",
    "original_name": "Kyoto Ryu no Tera Satsujin Jiken (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Yuurei-kun (Japan)": {
    "key": "Yuurei-kun (Japan)",
    "original_name": "Yuurei Kun (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Yuurei-kun is an Action game, developed and published by System Sacom, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zanac Ex (Japan) (Alt 1)": {
    "key": "Zanac Ex (Japan) (Alt 1)",
    "original_name": "Zanac Ex (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Zanax EX is an enhanced version of the vertically scrolling shooter Zanac A.I.. While preserving the locations and the gameplay system of the original version, this release builds upon the graphical enhancements of the Famicom/NES version of Zanac A.I.. \n \nThe backgrounds are noticeably more detailed than in the original version; also, some locations have different graphical design. The scrolling is also smoother than in the previous releases, effectively altering the feeling of control and gameplay speed. The status bar, which has occupied the right side of the screen in the original release, has been moved to the top of the screen, occupying significantly less space.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zanac Ex (Japan)": {
    "key": "Zanac Ex (Japan)",
    "original_name": "Zanac Ex (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Zanax EX is an enhanced version of the vertically scrolling shooter Zanac A.I.. While preserving the locations and the gameplay system of the original version, this release builds upon the graphical enhancements of the Famicom/NES version of Zanac A.I.. \n \nThe backgrounds are noticeably more detailed than in the original version; also, some locations have different graphical design. The scrolling is also smoother than in the previous releases, effectively altering the feeling of control and gameplay speed. The status bar, which has occupied the right side of the screen in the original release, has been moved to the top of the screen, occupying significantly less space.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zoids - Chuuou Tairiku no Tatakai (Japan)": {
    "key": "Zoids - Chuuou Tairiku no Tatakai (Japan)",
    "original_name": "Zoids (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Zoids: Chuuou Tairiku no Tatakai is a Role-Playing game, developed by Micronics and published by Toshiba EMI, which was released in Japan in 1988.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zombie Hunter (Japan)": {
    "key": "Zombie Hunter (Japan)",
    "original_name": "Zombie Hunter (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The city of Palma has always been protected by the spirits of the four elements. However, Dolgo, the spirit of the earth, revolts and makes off with the Life Seeker, the controller of the world's life energies, to his underground lair. In doing so, the people of Palma begin to lose their very souls. The spirit of the air has ordered that a champion needs to be found, to retrieve the Life Seeker from the clutches of Dolgo. You are that champion. \n \nZombie Hunter is an action role-playing game, somewhat similar to Zelda II with its side-scrolling battles. You receive experience from defeating your enemies and you have an inventory complete with armor and weapons.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zukkoke Yajikita Onmitsu Douchuu (Japan) (Alt 1)": {
    "key": "Zukkoke Yajikita Onmitsu Douchuu (Japan) (Alt 1)",
    "original_name": "Zukkoke Yajikita Onmitsudoutyuu (Japan) (Alt 1)",
    "name": "",
    "name_source": "",
    "original_desc": "Zukkoke Yajikita Onmitsu Douchuu is an Action game, developed and published by HAL Laboratory, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Zukkoke Yajikita Onmitsu Douchuu (Japan)": {
    "key": "Zukkoke Yajikita Onmitsu Douchuu (Japan)",
    "original_name": "Zukkoke Yajikita Onmitsudoutyuu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Zukkoke Yajikita Onmitsu Douchuu is an Action game, developed and published by HAL Laboratory, which was released in Japan in 1987.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "[BIOS] Kanji ROM - JIS 1st+2nd Class (Japan)": {
    "key": "[BIOS] Kanji ROM - JIS 1st+2nd Class (Japan)",
    "original_name": "[BIOS] Kanji ROM - JIS 1st+2nd Class (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "1942 (Japan)": {
    "key": "1942 (Japan)",
    "original_name": "1942 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "1942 is a vertically scrolling shooter for one or two players. The year is 1942, and you are a daring fighter pilot \"Super Ace\". You begin and end each of the numerous levels on an aircraft carrier and then fly your plane into battle against the enemy over both sea and land. After destroying certain plane formations you can collect several different power ups to increase your fire power and chances of survival. You can also make your plane roll to avoid enemy attacks 3 times per life.  There are 24 levels, the first being Midway and the last The Final Area.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite.": {
    "key": "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite.",
    "original_name": "Maison Ikkoku - Kanketsuhen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the manga Maison Ikkoku by Rumiko Takahashi. \n \nSet in Tokyo of the 80's, the story can be described as a romantic tale with a touch of comedy. It centers on a boarding house which is managed by the young and lovely widow Kyoko Otonashi. The protagonist is a college student named Yusaki Godai, and his relationship with Kyoko is the main plot line. The game's story approximately corresponds to the middle volumes of the manga until the conclusion. \n \nThe game is a \"puzzle-less\" adventure, the gameplay mostly focusing on simply depleting all the verb commands at every given screen and moving between locations. The commands include the usual \"Look\", \"Talk\", and Move\" typical for Japanese adventures (no \"Think\" command), but also context-sensitive commands \"Eat\", \"Drink\", etc., as well as the possibility to use certain inventory items.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite..": {
    "key": "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite..",
    "original_name": "Maison Ikkoku - Kanketsuhen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the manga Maison Ikkoku by Rumiko Takahashi. \n \nSet in Tokyo of the 80's, the story can be described as a romantic tale with a touch of comedy. It centers on a boarding house which is managed by the young and lovely widow Kyoko Otonashi. The protagonist is a college student named Yusaki Godai, and his relationship with Kyoko is the main plot line. The game's story approximately corresponds to the middle volumes of the manga until the conclusion. \n \nThe game is a \"puzzle-less\" adventure, the gameplay mostly focusing on simply depleting all the verb commands at every given screen and moving between locations. The commands include the usual \"Look\", \"Talk\", and Move\" typical for Japanese adventures (no \"Think\" command), but also context-sensitive commands \"Eat\", \"Drink\", etc., as well as the possibility to use certain inventory items.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dragon Slayer Jr. - Romancia (Japan)": {
    "key": "Dragon Slayer Jr. - Romancia (Japan)",
    "original_name": "Dragon Slayer III - Romancia (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This game exists in two editions, one for the MSX1 and one for the MSX2 with better graphics. \n \nIn Romancia: Dragon Slayer Jr., you are a young warrior whom the king sends on a mission to rescue a lost princess. You must leave the town and enter the dreadful monster-infested catacombs in order to complete your quest. \n \nThe game is a departure from Dragon Slayer RPG-oriented gameplay style. It tends more towards medieval-themed platformer action. The hero has hit points, can buy items and weapons, use magic, and stay in inns to recover health. However, instead of receiving experience points and becoming stronger, you simply must attack quicker (by bumping into your opponent on platform levels) and jump higher.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite... (Japan)": {
    "key": "Maison Ikkoku - Kanketsu Hen - Sayonara, Soshite... (Japan)",
    "original_name": "Maison Ikkoku - Kanketsuhen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the manga Maison Ikkoku by Rumiko Takahashi. \n \nSet in Tokyo of the 80's, the story can be described as a romantic tale with a touch of comedy. It centers on a boarding house which is managed by the young and lovely widow Kyoko Otonashi. The protagonist is a college student named Yusaki Godai, and his relationship with Kyoko is the main plot line. The game's story approximately corresponds to the middle volumes of the manga until the conclusion. \n \nThe game is a \"puzzle-less\" adventure, the gameplay mostly focusing on simply depleting all the verb commands at every given screen and moving between locations. The commands include the usual \"Look\", \"Talk\", and Move\" typical for Japanese adventures (no \"Think\" command), but also context-sensitive commands \"Eat\", \"Drink\", etc., as well as the possibility to use certain inventory items.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  }
}