{
  "goalx3": {
    "key": "goalx3",
    "original_name": "Goal! Goal! Goal!",
    "name": "目標！目標！目標！",
    "name_source": "api",
    "original_desc": "A soccer game with all the right ingredients, skill, flair, passion, and of course, GOALS! With 28 national teams to choose from, compete in a tournament to become the best soccer nation in the world. Get past the opening group stage and go on to a round-robin elimination stage where failure is not an option. To help you on your way, hold down the shoot button until the power bar fills up and you can do a POWERFUL SUPER SHOT!",
    "desc": "一場足球比賽，擁有所有正確的要素、技巧、天賦、激情，當然還有進球！有 28 支國家隊可供選擇，參加錦標賽，成為世界上最好的足球國家。通過小組賽首輪比賽，進入循環淘汰賽階段，失敗是不可能的。為了幫助您順利完成任務，請按住射擊按鈕直至能量條填滿，然後您就可以進行強大的超級射擊！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:15:26",
    "desc_translated_at": "2026-01-02T13:15:26",
    "original_name_hash": "d98589ad",
    "original_desc_hash": "f8e458e7"
  },
  "pspikes2": {
    "key": "pspikes2",
    "original_name": "Power Spikes II",
    "name": "功率尖峰 II",
    "name_source": "api",
    "original_desc": "Power Spikes 2 on Neo Geo is a sport game in which you control one of three categories of volleyball teams: male or female internationals and futuristic teams. The encounters are divided into three phases of the game: attack, defense and service. Vary the attacks by the panoply of special moves and anticipate your opponent to come out the winner of various tournaments.",
    "desc": "Neo Geo 上的 Power Spikes 2 是一款體育遊戲，您可以在其中控制三類排球隊之一：男性或女性國際排球隊和未來排球隊。比賽分為三個階段：進攻、防守和發球。通過一系列特殊動作來改變攻擊，並預測你的對手在各種錦標賽中獲勝。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:15:38",
    "desc_translated_at": "2026-01-02T13:15:38",
    "original_name_hash": "b67e3fe2",
    "original_desc_hash": "81f11189"
  },
  "neocup98": {
    "key": "neocup98",
    "original_name": "Neo Geo Cup '98 : The Road to the Victory",
    "name": "Neo Geo Cup '98：勝利之路",
    "name_source": "api",
    "original_desc": "Neo Geo Cup'98 is a football simulation based on the World Cup 1998. This title is a new installment in the series Super Sidekicks and updates all data to focus on the event. In qualification phase or during games knockout, lead one of the 64 available teams to victory.",
    "desc": "Neo Geo Cup'98 是一款基於 1998 年世界杯的足球模擬遊戲。該遊戲是 Super Sidekicks 系列的新作，並更新了所有數據以關注賽事。在資格賽階段或淘汰賽階段，帶領 64 支隊伍中的一支取得勝利。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:15:49",
    "desc_translated_at": "2026-01-02T13:15:49",
    "original_name_hash": "43dcd002",
    "original_desc_hash": "7c70741b"
  },
  "galaxyfg": {
    "key": "galaxyfg",
    "original_name": "Galaxy Fight: Universal Warriors",
    "name": "銀河之戰：環球戰士",
    "name_source": "api",
    "original_desc": "People have prayed to the gods, but the devil descends from the sky. Your mission is to defeat Felden Kryse, ruler of the underworld. The fantastic challenge ferociously unfolds on eight different planets. Screen image changes on-the-fly to zoom in and out based on how the battle unfolds. Use Dash to your utmost advantage, and speed through the field of infinity.",
    "desc": "人們向神明祈禱，魔鬼卻從天而降。你的任務是擊敗地下世界的統治者菲爾登·克里斯。奇妙的挑戰在八個不同的星球上展開。屏幕圖像會根據戰鬥的進展情況實時放大和縮小。充分發揮 Dash 的優勢，加速穿越無限領域。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:01",
    "desc_translated_at": "2026-01-02T13:16:01",
    "original_name_hash": "1351d66f",
    "original_desc_hash": "5a353b8a"
  },
  "sonicwi2": {
    "key": "sonicwi2",
    "original_name": "Aero Fighters 2",
    "name": "航空戰士2",
    "name_source": "api",
    "original_desc": "Aero Fighters 2 is a vertically-scrolling shooter in the same vein as 1942 and similar games. It supports up to two players and  has 8 different aircraft to choose from, each equipped with unique primary and secondary weapons. Power-ups upgrade the look, power, size and shape of the shots. Bombs activate a special power that usually wipes off the enemies on the screen. The game has a total of 10 stages (Japan, Brazil, Atlantic, U.S.A., France, Australia, Himalayas, Mexico, Hawaii and Space), all of them with a boss battle.",
    "desc": "Aero Fighters 2 是一款垂直捲軸射擊遊戲，與 1942 和類似遊戲一脈相承。它最多支持兩名玩家，並有 8 種不同的飛機可供選擇，每架都配備了獨特的主要和次要武器。強化道具可升級鏡頭的外觀、威力、大小和形狀。炸彈會激活一種特殊的力量，通常可以消滅屏幕上的敵人。遊戲共有10個關卡（日本、巴西、大西洋、美國、法國、澳大利亞、喜馬拉雅山、墨西哥、夏威夷和太空），全部都有boss戰。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:12",
    "desc_translated_at": "2026-01-02T13:16:12",
    "original_name_hash": "f4dd2fc7",
    "original_desc_hash": "ebbd81ce"
  },
  "ridhero": {
    "key": "ridhero",
    "original_name": "Riding Hero",
    "name": "騎馬英雄",
    "name_source": "api",
    "original_desc": "Riding Hero is a motorcycle racing game with three modes of play: W.G.P. mode, R.P.G. (Story) mode, and Multi-Play mode.\n\nIn W.G.P mode, you pick your bike that you want to use, and then race up to ten world circuits, including France, Germany, Italy, U.S.A, Spain, Sweden, and more. You race against the top riders. Try to aim for the top.\n\nR.P.G. mode is interactive. You travel between locations, and explore them, and speak to any people here. You start with no bike, so you must go to the Bike Shop and purchase one. Then with some help with the owner, you can race against up to six opponents. The more races you win, the more money you earn. Keep winning and you will be able to race the Suzuki 8-hour. During this mode, a timer will count down. If this expires, you must insert a coin in order to continue.\n\nMulti-Play mode lets you \"link\" cabinets together so that two players can race each other side-by-side.",
    "desc": "《Riding Hero》是一款摩托車賽車遊戲，具有三種遊戲模式：W.G.P.模式，R.P.G. （故事）模式和多人遊戲模式。\n\n在 W.G.P 模式中，您可以選擇想要使用的自行車，然後在多達 10 個世界賽道上比賽，包括法國、德國、意大利、美國、西班牙、瑞典等。您將與頂級騎手比賽。嘗試瞄準頂部。\n\n角色扮演遊戲模式是交互的。你在不同地點之間旅行，探索它們，並與這裡的任何人交談。你一開始沒有自行車，所以你必須去自行車商店購買一輛。然後在主人的幫助下，您可以與最多六名對手比賽。您贏得的比賽越多，您賺到的錢就越多。繼續獲勝，您將能夠參加鈴木 8 小時比賽。在此模式下，計時器將倒計時。如果過期，您必須插入硬幣才能繼續。\n\n多人遊戲模式可讓您將機櫃“鏈接”在一起，以便兩個玩家可以並排比賽。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:24",
    "desc_translated_at": "2026-01-02T13:16:24",
    "original_name_hash": "971eb9ae",
    "original_desc_hash": "1a57d390"
  },
  "ssideki3": {
    "key": "ssideki3",
    "original_name": "Super Sidekicks 3 : The Next Glory",
    "name": "超級夥伴3：下一個榮耀",
    "name_source": "api",
    "original_desc": "Loaded with world class excitement! Features 6 competition modes like World Cup for 64 worldwide teams. Utilizes Digitized Trace Animation and 3D camera angled shots for a realistic on-the-fly action graphic explosion. With 8 different playing modes including options such as Speed and Stamina, you can mix and match 512 different team configurations. Accidents hinder or enhance a team's ability within head-to-head gameplay for the ultimate super-real soccer experience!",
    "desc": "充滿世界級的興奮！擁有世界杯等 6 種比賽模式，全球 64 支球隊參賽。利用數字化跟踪動畫和 3D 攝像機角度拍攝，實現逼真的動態動作圖形爆炸。通過 8 種不同的遊戲模式（包括速度和耐力等選項），您可以混合搭配 512 種不同的團隊配置。事故會阻礙或增強球隊在面對面的比賽中的能力，以獲得終極的超真實足球體驗！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:36",
    "desc_translated_at": "2026-01-02T13:16:36",
    "original_name_hash": "7863092d",
    "original_desc_hash": "646e9020"
  },
  "savagere": {
    "key": "savagere",
    "original_name": "Savage Reign",
    "name": "野蠻統治",
    "name_source": "api",
    "original_desc": "The evil King Lion has crowned himself as the master of Fuun-Ken, a new style of martial arts that includes throwing weapons in addition to hand-to-hand combat. This does not sit well with the rest of the Fuun-Ken fighters around the world, so they all decide to beat each other up in classic 2 round fights to decide who gets to get down with King Lion himself.\n\nSavage Reign is a one-on-one 2D fighter in which you select your character and try to defeat all challengers using your basic attacks and special moves. The game features 2 different horizontal planes to which the characters can freely jump to in order to avoid attacks a la Fatal Fury. You cannot escape completely however, as all characters have a throwing weapon they can use in different ways to reach each other no matter where they are.",
    "desc": "邪惡的獅子王自封為風拳大師，這是一種新的武術流派，除了肉搏戰之外還包括投擲武器。這與世界各地的其他 Fuun-Ken 戰士不太相符，因此他們都決定在經典的兩回合戰鬥中互相毆打，以決定誰能打敗獅子王本人。\n\nSavage Reign 是一款一對一的 2D 格鬥遊戲，您可以選擇角色並嘗試使用基本攻擊和特殊動作擊敗所有挑戰者。遊戲有 2 個不同的水平面，角色可以自由跳躍到這些水平面，以避免像《餓狼傳說》那樣的攻擊。然而，你無法完全逃脫，因為所有角色都有投擲武器，他們可以以不同的方式使用投擲武器來接近對方，無論他們身在何處。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:47",
    "desc_translated_at": "2026-01-02T13:16:47",
    "original_name_hash": "0d14bfc0",
    "original_desc_hash": "dd084bef"
  },
  "tpgolf": {
    "key": "tpgolf",
    "original_name": "Top Player's Golf",
    "name": "頂級高爾夫球手的高爾夫",
    "name_source": "api",
    "original_desc": "First Class Competition! On a beautiful course, silent competition will begin. Select from four individual players. Play a Nassau game for a different twist. Enjoy real-life golf excitement!",
    "desc": "一級競賽！美麗的球場上，無聲的比賽即將開始。從四名個人玩家中進行選擇。玩拿騷遊戲，感受不同的變化。享受現實生活中的高爾夫刺激！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:16:59",
    "desc_translated_at": "2026-01-02T13:16:59",
    "original_name_hash": "bba7c3a2",
    "original_desc_hash": "9caafa39"
  },
  "totc": {
    "key": "totc",
    "original_name": "Treasure of the Caribbean",
    "name": "加勒比海的寶藏",
    "name_source": "api",
    "original_desc": "Treasure of the Caribbean is a puzzle game: you must combine three ghosts or more of the same color. The number of combined ghosts above three are sent to the opponent in the form of graves. Of course, these can in turn be returned if they are close to a combination of three colored ghosts. Of course, the speed also increases but not enough to make the game impossible as a Puyo Puyo or Tetris for example.",
    "desc": "加勒比海寶藏是一款益智遊戲：您必須組合三個或更多相同顏色的幽靈。合計三隻以上的鬼魂，以墳墓的形式傳送給對方。當然，如果它們接近三種顏色的幽靈的組合，這些可以依次返回。當然，速度也會增加，但不足以使遊戲無法進行，例如 Puyo Puyo 或俄羅斯方塊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:17:11",
    "desc_translated_at": "2026-01-02T13:17:11",
    "original_name_hash": "77ae2ab3",
    "original_desc_hash": "f7d6e769"
  },
  "sdodgeb": {
    "key": "sdodgeb",
    "original_name": "Super Dodge Ball",
    "name": "超級躲避球",
    "name_source": "api",
    "original_desc": "Super Dodgeball uses the same basic gameplay used in the other games in the series with some minor differences. The game puts you in control of a team of 3 characters (with you controlling the lead character or the one with the ball at the time) that must defeat a selection of other teams in order to become the champion. This time around the teams are all formed by characters from the Nekketsu Kunio Kun universe, each representing different suburbs of Tokyo that compete in an amusement park for the ultimate title. Each character has their unique stats and special moves, which now depend on a power bar that can be charged-up by holding both attack buttons.",
    "desc": "《超級躲避球》使用與該系列其他遊戲相同的基本遊戲玩法，但有一些細微的差別。遊戲讓你控制一支由 3 名角色組成的球隊（由你控制主角或當時持球的角色），他們必須擊敗一系列其他球隊才能成為冠軍。這一次，各支隊伍均由《熱結國夫君》宇宙中的角色組成，各自代表東京的不同郊區，在遊樂園中爭奪最終冠軍。每個角色都有其獨特的統計數據和特殊動作，現在依賴於可以通過按住兩個攻擊按鈕來充電的能量條。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:17:22",
    "desc_translated_at": "2026-01-02T13:17:22",
    "original_name_hash": "8854bd38",
    "original_desc_hash": "22d17062"
  },
  "mslug2": {
    "key": "mslug2",
    "original_name": "Metal Slug 2 : Super Vehicle-001/II",
    "name": "合金彈頭 2 : 超級車輛-001/II",
    "name_source": "api",
    "original_desc": "As Marco, Eri, Tarma, or Fio, you must defeat the evil General Morden and his henchman. To do this, you must defeat various enemies that get in your way. Throughout the game, you can collect new weapons including the Heavy Machine Gun, Shot Gun, Rocket Launcher, Flame Shot, Laser Shot, Flame Bottles, and Armor Piercer. Also scattered throughout the game, you can ride in  four different vehicles (aka: Slugs) such as the Metal Slug, Slug Flyer, Camel Slug, and SlugNoid. By using these vehicles, you can cause awesome destruction against Morden's evil army. Other items such as energy, extra ammunition, and food (eat too much and your player will gain weight) are also found throughout the game.",
    "desc": "扮演馬可、埃里、塔爾瑪或菲奧，你必須擊敗邪惡的莫登將軍和他的追隨者。為此，你必須擊敗各種阻礙你的敵人。在整個遊戲中，您可以收集新武器，包括重機槍、霰彈槍、火箭發射器、火焰彈、激光彈、火焰瓶和穿甲彈。遊戲中還分佈著四種不同的載具（又名：鼻涕蟲），例如合金彈頭、鼻涕蟲飛行器、駱駝鼻涕蟲和鼻涕蟲。通過使用這些車輛，您可以對摩登的邪惡軍隊造成可怕的破壞。在整個遊戲中還可以找到其他物品，例如能量、額外彈藥和食物（吃得太多，你的玩家會增加體重）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:17:34",
    "desc_translated_at": "2026-01-02T13:17:34",
    "original_name_hash": "c379ca70",
    "original_desc_hash": "6ab1fb90"
  },
  "samsho2": {
    "key": "samsho2",
    "original_name": "Samurai Shodown II",
    "name": "侍魂 II",
    "name_source": "api",
    "original_desc": "One of SNK's legendary fighting game series has made a return! In Samurai Shodown II, you can take on one of the roles of 15 warriors as you fight your way through the land to defeat the evil Mizuki! Slash, kick, and slice your opponents in half...do whatever it takes...live by the sword, and die by its blade.",
    "desc": "SNK 的傳奇格鬥遊戲系列之一回歸了！在《侍魂曉 II》中，您可以扮演 15 位武士之一，在這片土地上殺出一條血路，打敗邪惡的水樹！砍、踢、把你的對手切成兩半……不惜一切代價……生於劍下，死於劍下。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:17:46",
    "desc_translated_at": "2026-01-02T13:17:46",
    "original_name_hash": "8731d0e0",
    "original_desc_hash": "c633554d"
  },
  "pbobblen": {
    "key": "pbobblen",
    "original_name": "Puzzle Bobble",
    "name": "泡泡龍",
    "name_source": "api",
    "original_desc": "Puzzle Bobble (known as Bust-A-Move outside of Japan) is a spin-off of the Bubble Bobble series, featuring themes from the original game (such as enemies trapped in bubbles by the cutesy dinosaur duo Bub and Bob that must be popped). Players attempt to clear a board of colored bubbles by firing other bubbles at an angle and matching multiple bubbles of the same color. Its characteristically cute Japanese animation and music, along with its play mechanics and level designs, made it successful as an arcade title and spawned several sequels and ports to home gaming systems.",
    "desc": "《泡泡龍》（在日本以外地區稱為 Bust-A-Move）是《泡泡龍》系列的衍生作品，以原版遊戲的主題為特色（例如，可愛的恐龍二人組巴布和鮑勃將敵人困在泡泡中，必須將其彈出）。玩家嘗試通過以一定角度發射其他氣泡並匹配多個相同顏色的氣泡來清除板上的彩色氣泡。其典型的可愛日本動畫和音樂，以及其遊戲機制和關卡設計，使其成為一款成功的街機遊戲，並催生了幾款續集和家庭遊戲系統的移植版。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:17:57",
    "desc_translated_at": "2026-01-02T13:17:57",
    "original_name_hash": "1b97a256",
    "original_desc_hash": "f61a143c"
  },
  "shocktr2": {
    "key": "shocktr2",
    "original_name": "Shock Troopers : 2nd Squad",
    "name": "突擊隊：第二小隊",
    "name_source": "api",
    "original_desc": "As one of four playable characters each with unique methods of attack and power-ups, go through the level and destroy any enemies that get in your way, and defeat the boss at the end of that area. When you have completed the first area, you need to select a path to continue the game on.\n\nThe second game in the Shock Troopers series enables shot locking, close proximity attacks, and evasive maneuvers allowing for flexible operation. In addition to the four characters, versatile modes of attack are featured using powerful vehicles and special shots. Letters that make up certain keywords can be collected throughout the game, and by collecting each letter in the keyword, you will receive a high score.",
    "desc": "作為四個可玩角色之一，每個角色都有獨特的攻擊方法和能力提升，通過關卡並摧毀任何阻礙你的敵人，並擊敗該區域盡頭的老闆。當你完成第一個區域後，你需要選擇一條路徑繼續遊戲。\n\n《突擊隊》系列的第二款遊戲支持射擊鎖定、近距離攻擊和躲避機動，從而實現靈活的操作。除了四個角色之外，還具有使用強大車輛和特殊鏡頭的多種攻擊模式。組成某些關鍵字的字母可以在整個遊戲中收集，通過收集關鍵字中的每個字母，您將獲得高分。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:18:09",
    "desc_translated_at": "2026-01-02T13:18:09",
    "original_name_hash": "0b6a4079",
    "original_desc_hash": "5dfd8906"
  },
  "svc": {
    "key": "svc",
    "original_name": "SNK vs. Capcom : SVC Chaos",
    "name": "SNK vs. Capcom：SVC 混沌",
    "name_source": "api",
    "original_desc": "SVC Chaos: SNK vs. Capcom on Neo Geo is a fighting game featuring the warriors of the two famous series Street Fighter and King of Fighters. The game offers an arcade mode where one follows the story of his hero, as well as modes versus, challenge and survival.",
    "desc": "Neo Geo 上的 SVC Chaos: SNK vs. Capcom 是一款以《街頭霸王》和《拳皇》兩大系列的戰士為主角的格鬥遊戲。該遊戲提供了一種街機模式，玩家可以跟隨英雄的故事，以及對抗、挑戰和生存模式。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:18:20",
    "desc_translated_at": "2026-01-02T13:18:20",
    "original_name_hash": "a5c361ff",
    "original_desc_hash": "b2a4c1a6"
  },
  "rbffspec": {
    "key": "rbffspec",
    "original_name": "Real Bout Fatal Fury Special",
    "name": "餓狼傳說特別版",
    "name_source": "api",
    "original_desc": "It was the sequel of Real Bout Fatal Fury, with which sixth delivery of the series was arrived at his, in this we had 20 characters (Terry Bogard, Andy Bogard, Joe Higashi, Mai Shiranui, Tung Fu Rue, Cheng Chinzan, Laurence Blood, Wolfgang Krauser, Duck King, Kim Kaphwan, Blue Mary, Hon-Fu, Bob Wilson, Mochizuki Sokaku, Franco Bash, Ryuji Yamazaki, Jin Chonshu, Jin Chonrei, Billy Kane and Geese Howard) and their aspects are 100% remodeled.\nAlso, the game maintains the capacity to destroy some things of the fight zone.",
    "desc": "這是《餓狼傳說》的續集，該系列的第六部作品已經到了他的手中，其中有 20 個角色（Terry Bogard、Andy Bogard、Joe Higashi、Mai Shiranui、Tung Fu Rue、Cheng Chinzan、Laurence Blood、Wolfgang Krauser、Duck King、Kim Kaphwan、Blue Mary、Hon-Fu、Bob Wilson、Mochizuki Sokaku、Franco Bash、Ryuji Yamazaki、 Jin Chonshu、Jin Chonrei、Billy Kane 和 Geese Howard）及其外觀均經過 100% 改造。\n此外，遊戲保留了摧毀戰鬥區域某些東西的能力。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:18:32",
    "desc_translated_at": "2026-01-02T13:18:32",
    "original_name_hash": "82e2a74c",
    "original_desc_hash": "947653eb"
  },
  "sengoku3": {
    "key": "sengoku3",
    "original_name": "Sengoku 3",
    "name": "戰國3",
    "name_source": "api",
    "original_desc": "The third game in the Sengoku series of beat 'em ups, Sengoku 3 once again pits you and a friend against the undead forces of Nobunaga, however this time you can freely select from a group of different characters each with their own weapons and abilities, as well as choose which location in the world (or level) to tackle whenever you want.\n\nThe game incorporates a more complex fighting system similar to a one-on-one fighting game, by giving players different attack buttons, special moves based on directional inputs, combos and even a super bar used to unleash devastating super moves. You cannot change weapons or transform into other characters as in the previous games, but you can acquire different ranged weapons for additional attacks as well as unlock certain bosses to increase your available characters.",
    "desc": "作為戰國系列清版遊戲的第三款遊戲，《戰國 3》再次讓你和朋友對抗信長的不死勢力，不過這一次你可以從一組不同的角色中自由選擇，每個角色都有自己的武器和能力，也可以隨時選擇要攻克世界上的哪個位置（或關卡）。\n\n該遊戲採用了類似於一對一格鬥遊戲的更複雜的格鬥系統，為玩家提供了不同的攻擊按鈕、基於方向輸入的特殊動作、連擊，甚至還有用於釋放毀滅性超級動作的超級棒。你不能像之前的遊戲那樣改變武器或變身為其他角色，但你可以獲取不同的遠程武器進行額外的攻擊，並解鎖某些老闆來增加你的可用角色。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:18:44",
    "desc_translated_at": "2026-01-02T13:18:44",
    "original_name_hash": "c5a76b9a",
    "original_desc_hash": "36482354"
  },
  "ninjamas": {
    "key": "ninjamas",
    "original_name": "Ninja Master's: Haō Ninpō Chō",
    "name": "忍者大師：好忍法町",
    "name_source": "api",
    "original_desc": "Ninja Master's, is set in the fictional land of \"Zipangu\". Players can select from 10 different ninjas and warriors with which to test their might. The main feature of this game is the ability for each character to use a wide variety of weapons. Also, as each character's Super Attacks change depending on whether they are armed or unarmed, the player needs to respond differently according to the situation. Damage increases with respect to the Super Power Gauge. There are also many must-see deadly techniques like \"Super Death Blow\", \"Ultimate Super Mode\", \"Dark Super Power\" and \"Dark Combo!",
    "desc": "忍者大師的故事發生在虛構的土地“Zipangu”。玩家可以從 10 名不同的忍者和戰士中進行選擇來測試他們的力量。該遊戲的主要特點是每個角色都能夠使用多種武器。此外，由於每個角色的超級攻擊會根據他們是否武裝或徒手而變化，因此玩家需要根據情況做出不同的反應。傷害隨著超級能量計的增加而增加。還有“超級致命一擊”、“終極超級模式”、“黑暗超能力”、“黑暗連擊”等許多必看的致命技巧！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:18:56",
    "desc_translated_at": "2026-01-02T13:18:56",
    "original_name_hash": "7dfc3fb5",
    "original_desc_hash": "4fb0c7f2"
  },
  "rotd": {
    "key": "rotd",
    "original_name": "Rage of the Dragons",
    "name": "巨龍之怒",
    "name_source": "api",
    "original_desc": "Originally designed by Evoga to be a sequel to the 1995 fighting game Double Dragon (changing it to a homage after failing to acquire the intellectual rights to the series), Rage of the Dragons is a 2-on-2 tag-team fighting game with the same art style as Noise Factory's earlier Sengoku 3.\n\nThe story involves various pairs of martial artists and those with supernatural powers, with everybody having personal motivations for fighting in Sunshine City. Some of these fighters harness the power of dragon spirits (with brothers Billy and Jimmy Lewis controlling the Blue and Red Dragons and main antagonist Johann controlling the Black Dragon).",
    "desc": "Rage of the Dragons 最初由 Evoga 設計，是 1995 年格鬥遊戲《雙截龍》的續作（在未能獲得該系列的知識產權後將其改為致敬），是一款 2 對 2 團隊格鬥遊戲，其藝術風格與 Noise Factory 早期的《戰國 3》相同。\n\n故事涉及多對武者和神通者，每個人都有個人動機在陽光城戰鬥。其中一些戰士利用龍魂的力量（比利和吉米·劉易斯兄弟控制著藍龍和紅龍，主要對手約翰控制著黑龍）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:19:07",
    "desc_translated_at": "2026-01-02T13:19:07",
    "original_name_hash": "9eacf522",
    "original_desc_hash": "28d6d26f"
  },
  "androdun": {
    "key": "androdun",
    "original_name": "Andro Dunos",
    "name": "安德羅·杜諾斯",
    "name_source": "api",
    "original_desc": "The invasion of an unknown life source is getting worse. Nobody knows if the defensive line or the heart of the enemy base is ruined first. With the people's hope, the most advanced fighter will be dispatched into multi-scrolling space.\n\nFight your way through seven stages in this horizontal-scrolling game, and defeat a boss at the end of each one. You start the game with four main weapons, which you can switch from with the click of a button. Some of these weapons are more powerful than others. You can also fire off a charged shot if your main weapon level is two or greater, simply by holding down the fire button for about two seconds. Using charged shots can do more damage to an enemy ship. If you happen to die, you will lose one power level from all four weapons. If all your lives are lost and are forced to continue, you will start again with your main weapon on the second power level and all three sub-weapons on the first power level.",
    "desc": "未知生命源的入侵愈演愈烈。沒有人知道是敵方的防線先被破壞，還是敵方基地的中心被破壞。帶著人們的希望，最先進的戰鬥機將被派遣到多捲軸空間。\n\n在這款水平捲軸遊戲中奮力闖過七個關卡，並在每個關卡結束時擊敗 Boss。您以四種主要武器開始遊戲，只需單擊按鈕即可切換。其中一些武器比其他武器更強大。如果你的主武器等級為 2 或更高，你也可以發射蓄力射擊，只需按住開火按鈕約兩秒鐘即可。使用帶電射擊可以對敵艦造成更多傷害。如果你不幸死亡，你將失去所有四種武器的一個力量等級。如果你失去了所有的生命並被迫繼續，你將以第二威力等級的主武器和第一威力等級的所有三個副武器重新開始。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:19:19",
    "desc_translated_at": "2026-01-02T13:19:19",
    "original_name_hash": "05090b59",
    "original_desc_hash": "181c4e72"
  },
  "breakrev": {
    "key": "breakrev",
    "original_name": "Breakers Revenge",
    "name": "破壞者的複仇",
    "name_source": "api",
    "original_desc": "8 initially selectable characters face off to become the Tae Kwon Do master! After defeating the absolutely WACKY Master Taekuk, he becomes selectable as well to face off against end boss Karate Kenji.",
    "desc": "8 位初始可選角色對決，成為跆拳道大師！在擊敗了絕對古怪的太極大師後，他也可以選擇對抗最終老闆空手道健司。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:19:31",
    "desc_translated_at": "2026-01-02T13:19:31",
    "original_name_hash": "2899b197",
    "original_desc_hash": "27a22e34"
  },
  "mslug": {
    "key": "mslug",
    "original_name": "Metal Slug : Super Vehicle-001",
    "name": "合金彈頭 : 超級車輛-001",
    "name_source": "api",
    "original_desc": "Metal Slug, originally released on the Neo Geo, is a side-scrolling shoot'em'up.\n\nThe player(s) takes the role of a soldier (or two) and fights a gigantic army. Every level consists of running forward blasting anything that moves, while collecting power-ups along the way (there's also a wide selection of weaponry in the game). In the end of each level the player goes up against one gigantic boss. \n\nThe PlayStation port introduces some extra features: there is a combat school where the player may fight with other players for the best time on each level and an art gallery.",
    "desc": "《合金彈頭》最初在 Neo Geo 上發布，是一款橫向捲軸射擊遊戲。\n\n玩家扮演一名（或兩名）士兵的角色並與一支龐大的軍隊作戰。每個關卡都包括向前奔跑，炸毀任何移動的物體，同時收集沿途的能量道具（遊戲中還有多種武器可供選擇）。在每個關卡的最後，玩家都會對抗一個巨大的老闆。\n\nPlayStation 端口引入了一些額外的功能：有一個戰鬥學校，玩家可以在每個級別上與其他玩家戰鬥以獲得最佳時間，還有一個藝術畫廊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:19:42",
    "desc_translated_at": "2026-01-02T13:19:42",
    "original_name_hash": "a3569687",
    "original_desc_hash": "34794205"
  },
  "samsho3": {
    "key": "samsho3",
    "original_name": "Samurai Shodown III",
    "name": "侍魂 III",
    "name_source": "api",
    "original_desc": "The 12 samurai (and ninja) elite are back, this time to answer the threat of the demon Zankuro, Minazuki. The possessed swordsman has brutally slaughtered innocents in his path, yet could not raise his blade to the cries of an innocent baby. Vowing never to spill innocent blood again, he targets those who live by the way of the sword...but now the hunter becomes the hunted. The third series of Samurai Shodown introduces 2 different techniques for each character. The \"Slash\" techniques are the original moves of the most of the characters whereas the \"Bust\" techniques maybe the \"darker\" version of each character.",
    "desc": "12 位武士（和忍者）精英回來了，這次是為了回應惡魔 Zankuro、水無月的威脅。被附身的劍客殘酷地屠殺了路上的無辜者，卻無法在無辜嬰兒的哭聲中舉起劍。他發誓不再讓無辜者流血，他的目標是那些靠劍生存的人……但現在獵人變成了獵物。《侍魂曉》第三季為每個角色引入了 2 種不同的技巧。“斜線”技術是大多數角色的原始動作，而“半身像”技術可能是每個角色的“黑暗”版本。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:19:54",
    "desc_translated_at": "2026-01-02T13:19:54",
    "original_name_hash": "3f25002b",
    "original_desc_hash": "53fe0085"
  },
  "lresort": {
    "key": "lresort",
    "original_name": "Last Resort",
    "name": "最後的手段",
    "name_source": "api",
    "original_desc": "Last Resort is a 1-2 player horizontal shooter game where you pilot a spacecraft across horizontally scrolling cityscapes and wastelands, while destroying hordes of enemy spacecraft, either metallic or organic, including huge mid- and end-level guardians. Getting power-up pods provide the craft with a movable drone which can be charged up and fired or locked into position and used as an extra gun or 'battering ram'/shield. A clone of R-Type (both one and two), but with much improved graphics and sound",
    "desc": "Last Resort 是一款 1-2 人水平射擊遊戲，您將駕駛一艘飛船穿過水平滾動的城市景觀和荒地，同時摧毀成群的敵方飛船，無論是金屬的還是有機的，包括巨大的中端和末級守護者。獲得動力吊艙為飛行器提供了一架可移動的無人機，它可以充電並發射或鎖定到位並用作額外的槍或“攻城錘”/盾牌。R-Type 的克隆（一號和二號），但圖形和聲音有了很大改進",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:20:05",
    "desc_translated_at": "2026-01-02T13:20:05",
    "original_name_hash": "4a8cd79e",
    "original_desc_hash": "86c0fe95"
  },
  "wh1": {
    "key": "wh1",
    "original_name": "World Heroes",
    "name": "世界英雄",
    "name_source": "api",
    "original_desc": "An alien entity known as Geegus threatens the Earth in the year 3091.  As all of Earth's forces have been defeated, a scientist uses his recently-built time machine to find the greatest fighters of different eras to compete against Geegus.\n\nFeaturing a cast of characters ranging from ninjas to a cybernetic supersoldier, you'll fight your way through standard-fare one-on-one matches or take on an opponent in a Deathmatch, where spiked walls and landmines add to the danger.",
    "desc": "3091 年，一個名為 Geegus 的外星實體威脅著地球。地球上的所有力量都已被擊敗，一位科學家利用他最近建造的時間機器尋找不同時代最偉大的戰士來與 Geegus 競爭。\n\n從忍者到控制論超級士兵等一系列角色，你將在標準票價的一對一比賽中殺出一條血路，或者在死亡競賽中與對手較量，其中尖刺的牆壁和地雷會增加危險。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:20:17",
    "desc_translated_at": "2026-01-02T13:20:17",
    "original_name_hash": "90a9cce4",
    "original_desc_hash": "ae4a9b3a"
  },
  "sonicwi3": {
    "key": "sonicwi3",
    "original_name": "Aero Fighters 3",
    "name": "空戰戰士3",
    "name_source": "api",
    "original_desc": "Aero Fighters 3 is a vertically-scrolling shooter in the same vein as 1942 and similar games. It supports up to two players and  has 10 different aircraft to choose from, each equipped with unique primary and secondary weapons. Power-ups upgrade the look, power, size and shape of the shots. Bombs activate a special power that usually wipes off the enemies on the screen. The game has a total of 8 stages placed on several countries (Japan, Germany, Libya, Egypt, Pacific, U.S.A., England, France, Panama, Thailand, Ukraine, Atlantic and Space), all of them with a boss battle.",
    "desc": "Aero Fighters 3 是一款垂直捲軸射擊遊戲，與 1942 和類似遊戲一脈相承。它最多支持兩名玩家，並有 10 種不同的飛機可供選擇，每架都配備了獨特的主要和次要武器。強化道具可升級鏡頭的外觀、威力、大小和形狀。炸彈會激活一種特殊的力量，通常可以消滅屏幕上的敵人。遊戲共有8個舞台，分佈在多個國家（日本、德國、利比亞、埃及、太平洋、美國、英國、法國、巴拿馬、泰國、烏克蘭、大西洋和太空），全部都有boss戰。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:20:29",
    "desc_translated_at": "2026-01-02T13:20:29",
    "original_name_hash": "691a6192",
    "original_desc_hash": "a7cfb7a6"
  },
  "wh2": {
    "key": "wh2",
    "original_name": "World Heroes 2",
    "name": "世界英雄2",
    "name_source": "api",
    "original_desc": "The time traveling tournament fighters are back! The original eight characters from the popular arcade hit return, along with six new characters hand-picked from several different eras and locations all through time. But a new boss awaits the victor... who or what is behind this new tournament? You'll have to get to him to find out!\n\nThis sequel features all-new stages and music, and improved animation and graphics. You can now reflect projectile moves at your opponent, and reverse normal throws if your timing is right! The original game's Death Match mode is also back, but with a new feature - the life bar will increase or decrease as you inflict or receive damage. Get your side's life bar to 100% and your enemy will lose.",
    "desc": "時間旅行錦標賽戰士回來了！來自流行街機遊戲的原始八個角色回歸，同時還有來自多個不同時代和地點的六個新角色。但新的老闆正在等待勝利者……誰或什麼是這場新錦標賽的幕後黑手？你必須去找他才能知道！\n\n這部續作具有全新的舞台和音樂，以及改進的動畫和圖形。現在，您可以向對手反射投射物移動，如果時機正確，還可以反轉正常投擲！原版遊戲的死亡競賽模式也回來了，但有一個新功能——生命條會隨著你造成或受到傷害而增加或減少。讓你方的生命條達到 100%，你的敵人就會失敗。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:20:40",
    "desc_translated_at": "2026-01-02T13:20:40",
    "original_name_hash": "9a3d0ffe",
    "original_desc_hash": "59d95385"
  },
  "turfmast": {
    "key": "turfmast",
    "original_name": "Neo Turf Masters",
    "name": "新草坪大師賽",
    "name_source": "api",
    "original_desc": "Neo Turf Masters is a golf game that offers play in three different countries. You can play in the US, Germany, and Japan. There are 18 holes per course, just like in real life, which totals to 54 holes. The game features a two-player versus mode and three single player modes. You can choose from one of six different characters, who each have their own strengths and weaknesses. Like many other golf games, you use an accurate click type of play, where you click in an overhead map where you want to hit the ball, then adjust hook, slice, and power. In Versus mode, you can earn \"super-clubs\" that can only be used once. These can also be traded between friends.",
    "desc": "Neo Turf Masters 是一款在三個不同國家進行比賽的高爾夫遊戲。您可以在美國、德國和日本玩。每個球場有 18 個洞，就像現實生活中一樣，總共 54 個洞。該遊戲具有兩人對戰模式和三種單人遊戲模式。您可以從六個不同的角色中選擇一個，每個角色都有自己的優點和缺點。與許多其他高爾夫遊戲一樣，您使用精確的點擊式遊戲，在俯視圖上點擊您想要擊球的位置，然後調整左曲球、右曲球和力量。在對戰模式中，您可以獲得只能使用一次的“超級俱樂部”。這些也可以在朋友之間進行交易。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:20:52",
    "desc_translated_at": "2026-01-02T13:20:52",
    "original_name_hash": "8d047bc1",
    "original_desc_hash": "a3fa6db6"
  },
  "lastbld2": {
    "key": "lastbld2",
    "original_name": "The Last Blade 2",
    "name": "最後之刃2",
    "name_source": "api",
    "original_desc": "The Last Blade 2: Heart of the Samurai is a 2D fighting game which features anime-style characters that fight each other with swords, clubs, and even fishing poles. These characters pull off their special moves with that 'quarter-circle-to-half-circle' and 'double-half-circle' controller motions, reminiscent of Street Fighter.",
    "desc": "《The Last Blade 2: Heart of the Samurai》是一款 2D 格鬥遊戲，遊戲中的動漫風格角色會使用劍、棍棒甚至釣魚竿互相戰鬥。這些角色通過“四分之一圓到半圓”和“雙半圓”控制器動作來完成他們的特殊動作，讓人想起《街頭霸王》。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:04",
    "desc_translated_at": "2026-01-02T13:21:04",
    "original_name_hash": "099a13c5",
    "original_desc_hash": "e2ae6cb1"
  },
  "neomrdo": {
    "key": "neomrdo",
    "original_name": "Neo Mr. Do!",
    "name": "Sign (Mr.Children單曲)",
    "name_source": "wiki",
    "original_desc": "Neo Mr. Do! is an enhanced version of Mr. Do!, and features greatly improved graphics, stereo sound, and intermissions that can be viewed when an area is completed. You can also travel to the bonus stages, where the object is to make your way toward the exit by carefully dropping apples to create a path. These bonus stages can be reached by killing all enemies on the screen, rather than collecting all the items that are in groups.",
    "desc": "Neo 先生！是《Mr. Do!》的增強版，具有極大改進的圖形、立體聲和可以在區域完成時觀看的中場休息。您還可以前往獎勵階段，其中的目標是通過小心地放下蘋果來創建一條路徑來通往出口。這些獎勵階段可以通過殺死屏幕上的所有敵人來達到，而不是收集成組的所有物品。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:05",
    "desc_translated_at": "2026-01-02T13:21:05",
    "original_name_hash": "0fceb6cd",
    "original_desc_hash": "46b512ae"
  },
  "magdrop3": {
    "key": "magdrop3",
    "original_name": "Magical Drop III",
    "name": "魔法掉落 III",
    "name_source": "api",
    "original_desc": "This is the third installment in the puzzle frenzy series Magical Drop. In the game you control a clown who throws marbles up on the screen into the cluster of multi-colored marbles, rocks and crystals. The goal is to get three or more of the same color to remove marbles, but you can also grab more than one at the time to create long chain combos and gain better \"special\" blocks at the top of the screen.\n\nYou can play the game in single player modes or versus a friend in versus mode. In versus mode you get to pick your character, much like in a fighting game, each with their own counter attacks and abilities.\n\nFor the PSX version, the first Magical Drop was included on a separate disc.",
    "desc": "這是瘋狂解謎系列 Magical Drop 的第三部分。在遊戲中，你控制一個小丑，將屏幕上的彈珠扔進一堆彩色彈珠、岩石和水晶中。目標是獲得三個或更多相同顏色的彈珠來消除彈珠，但您也可以同時抓住多個彈珠來創建長鏈組合，並在屏幕頂部獲得更好的“特殊”塊。\n\n您可以在單人模式下玩遊戲，也可以在對戰模式下與朋友對抗。在對抗模式中，你可以選擇你的角色，就像在格鬥遊戲中一樣，每個角色都有自己的反擊和能力。\n\n對於 PSX 版本，第一個 Magical Drop 包含在單獨的光盤中。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:20",
    "desc_translated_at": "2026-01-02T13:21:20",
    "original_name_hash": "91ac885f",
    "original_desc_hash": "116f444e"
  },
  "ncombat": {
    "key": "ncombat",
    "original_name": "Ninja Combat",
    "name": "忍者戰鬥",
    "name_source": "api",
    "original_desc": "Ninja Combat puts you in the middle of, you guessed it, a Ninja invasion! The Kage Ichizoku clan has caused a giant tower to appear in the middle of the city, and it's up to our heroes Joe (Player One) and Hayabusa (Player Two) to take them down. Both characters can attack incoming enemies by using Shuriken (throwing stars) which can be upgraded and they can also unleash a fairly strong special attack which destroys many enemies on the screen, or does heavy damage to the bosses, but it takes away a quarter of your life.",
    "desc": "你猜對了，忍者戰鬥讓你置身於忍者入侵之中！Kage Ichizoku 氏族在城市中央出現了一座巨大的塔，我們的英雄 Joe（玩家一）和 Hayabusa（玩家二）需要將其擊倒。兩個角色都可以使用可以升級的手裡劍（飛鏢）攻擊來襲的敵人，他們還可以釋放相當強大的特殊攻擊，摧毀屏幕上的許多敵人，或者對老闆造成嚴重傷害，但它會奪走你四分之一的生命。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:32",
    "desc_translated_at": "2026-01-02T13:21:32",
    "original_name_hash": "9ebcd7af",
    "original_desc_hash": "9b4a49c2"
  },
  "kotm2": {
    "key": "kotm2",
    "original_name": "King of the Monsters 2 : The Next Thing",
    "name": "怪獸之王2：接下來的事",
    "name_source": "api",
    "original_desc": "The object of King of the Monsters 2 is similar to its predecessor. Choose from three monsters which include a large lizard, a large robotic ape, and a huge mutant human. Then walk through each city, making sure to destroy everything in site, including planes, buildings, and other creatures. When smashed, some buildings reveal power-ups that make your character more powerful. At the end of each city, you go head-to-head with the boss creature. There are small stages in between where you fight a second monster for bonus points, or you fall from the sky and land underwater where you try to collect points and power-ups while falling.",
    "desc": "《怪獸之王2》的目標與其前作相似。從三種怪物中進行選擇，其中包括一隻大蜥蜴、一隻大型機器猿和一個巨大的變異人類。然後穿過每個城市，確保摧毀現場的一切，包括飛機、建築物和其他生物。當被砸碎時，一些建築物會釋放出能量，讓你的角色變得更加強大。在每個城市的盡頭，你都會與頭目生物正面交鋒。中間有一些小階段，你可以與第二個怪物戰鬥以獲得獎勵積分，或者你從天上掉下來並降落在水下，在掉落時嘗試收集積分和能量提升。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:44",
    "desc_translated_at": "2026-01-02T13:21:44",
    "original_name_hash": "fe114238",
    "original_desc_hash": "1a7be947"
  },
  "matrim": {
    "key": "matrim",
    "original_name": "Matrimelee",
    "name": "矩陣混戰",
    "name_source": "api",
    "original_desc": "The king of certain country wants to find a worthy successor for the throne and the ideal husband for his little daughter (or a beautiful and strong woman for his older son). So he holds a fighting tournament where the prize is the hand of the princess and the throne succession.",
    "desc": "某個國家的國王想為他的小女兒找到一個有價值的王位繼承人，並為他的小女兒找到一個理想的丈夫（或者為他的大兒子找到一個美麗而堅強的女人）。於是他舉辦了一場格鬥錦標賽，獎品是公主之手和王位繼承人。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:21:55",
    "desc_translated_at": "2026-01-02T13:21:55",
    "original_name_hash": "576352d2",
    "original_desc_hash": "c77db112"
  },
  "vliner": {
    "key": "vliner",
    "original_name": "V-Liner",
    "name": "V型襯裡",
    "name_source": "api",
    "original_desc": "V-Liner is simply a money game (virtual) as a slot machine like a real Casino!",
    "desc": "V-Liner 是一款簡單的金錢遊戲（虛擬），就像真正的賭場一樣的老虎機！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:22:07",
    "desc_translated_at": "2026-01-02T13:22:07",
    "original_name_hash": "bd65117c",
    "original_desc_hash": "4d621486"
  },
  "samsho4": {
    "key": "samsho4",
    "original_name": "Samurai Shodown IV : Amakusa's Revenge",
    "name": "侍魂 IV : 天草的複仇",
    "name_source": "api",
    "original_desc": "Bringing a new breath to SNK's swordsman fighting series, this 4th installment marks the return of 3 classic characters (Yagyu Jubei, Charlotte and Tam Tam, now with updated stuff), introduces 2 newcomers for the pantheon (the brothers Sogetsu Kazama and Kazuki Kazama) and brings some new backgrounds.\n\nIn spite of these little improvements, the game preserved (and improved a lot) many elements that did the previous one (Samurai Shodown III: Blades of Blood) a quite popular title, like the dodge move and the chance to choose between two versions of the fighter: the standard one and an alternative dark-styled one (SLASH and BUST, respectively).\n\nWith the intention to provide more action in the battles, the \"No Contest\" Moves were introduced: working in similar way (and under certain conditions) to the many games of Mortal Kombat Series, your fighter will execute an ultimate-slaughter move in a stunned opponent.",
    "desc": "第 4 部作品為 SNK 的劍俠格鬥系列注入了新的氣息，標誌著 3 個經典角色（柳生十兵衛、夏洛特和 Tam Tam，現已更新）的回歸，引入了 2 位萬神殿新人（風間草月和風間一樹兄弟），並帶來了一些新的背景。\n\n儘管有這些小小的改進，遊戲還是保留了（並且改進了很多）前一款（《侍魂 III：血刃》）相當受歡迎的遊戲的許多元素，例如閃避動作以及在兩個版本的戰鬥機之間進行選擇的機會：標準版本和另類黑暗風格版本（分別是 SLASH 和 BUST）。\n\n為了在戰鬥中提供更多的動作，引入了“無比賽”動作：以與《真人快打》系列的許多遊戲類似的方式（在某些條件下）工作，你的戰士將對震驚的對手執行終極屠殺動作。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:22:19",
    "desc_translated_at": "2026-01-02T13:22:19",
    "original_name_hash": "add59f9b",
    "original_desc_hash": "8cb8b3b0"
  },
  "neodrift": {
    "key": "neodrift",
    "original_name": "Neo Drift Out : New Technology",
    "name": "新漂移：新技術",
    "name_source": "api",
    "original_desc": "Neo Drift Out on Neo Geo is a rally game including 3 vehicles (Toyota Celica, Subaru Impreza and Mitsubishi Lancer) and 6 races for many environments. The driving is done exclusively by drifting and each course must be completed within the allowed time in order to reach the next level.",
    "desc": "Neo Drift Out on Neo Geo 是一款拉力遊戲，包括 3 輛汽車（豐田 Celica、斯巴魯翼豹和三菱 Lancer）以及適合多種環境的 6 場比賽。駕駛完全通過漂移來完成，每個課程必須在允許的時間內完成才能達到下一個級別。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:22:30",
    "desc_translated_at": "2026-01-02T13:22:30",
    "original_name_hash": "8ce52b5e",
    "original_desc_hash": "783a2f12"
  },
  "kof99": {
    "key": "kof99",
    "original_name": "The King of Fighters '99 : Millennium Battle",
    "name": "拳皇'99：千年之戰",
    "name_source": "api",
    "original_desc": "A new hero and surprising plot twists offer white-hot excitement! It is the season of KOF! A new chapter in the saga begins! With a story centering around the new hero K' (K Prime), along with an overhauled game system that pits 4-member teams against each other, KOF '99 is sure to raise excitement levels through the roof. The new battle begins here!\nAlong with K', six new characters and two Kyo Kusanagi clones appear as Edit Mode characters. This means players can choose their favorite from a whopping total of 32 characters!",
    "desc": "新英雄和令人驚訝的曲折情節帶來白熱化的刺激！這是KOF的季節！傳奇的新篇章開始了！憑藉以新英雄 K'（K Prime）為中心的故事，以及讓 4 人隊伍互相對抗的徹底改革的遊戲系統，《KOF '99》一定會提升興奮度。新的戰鬥從這裡開始！\n與 K' 一起，六個新角色和兩個草薙京克隆體也作為編輯模式角色出現。這意味著玩家可以從多達 32 個角色中選擇自己喜歡的角色！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:22:42",
    "desc_translated_at": "2026-01-02T13:22:42",
    "original_name_hash": "ce36e047",
    "original_desc_hash": "e2af72be"
  },
  "bstars2": {
    "key": "bstars2",
    "original_name": "Baseball Stars 2",
    "name": "棒球明星2",
    "name_source": "api",
    "original_desc": "This follow up to Baseball Stars Professional features a fast-paced arcade style baseball with six fictitious teams, each with their own strengths and weaknesses.  There are two difficulties of play: Beginner, which automatically fields the ball for the player while Exciting has the player do the field manually.  Additionally, there are two main modes of play where in the single player mode the player will compete in a fifteen-team tournament or go head-to-head against a friend in a multiplayer mode.\n\nThe standard rules of baseball still apply, but it adds power-ups that the player can pick up and use during the game, such as the ability for their pitcher to throw faster or their batter to hit better.  They can also substitute a player during the game, but are limited to three substitutions per game. The game is shown through 2D graphics with comic-style cutscenes to illustrate the action, such as dramatic catches and home runs that will pop-up during the game.",
    "desc": "《棒球明星職業》的後續作品以快節奏的街機風格棒球為特色，有六支虛構的球隊，每支球隊都有自己的優勢和劣勢。遊戲有兩個難度：初級，自動為玩家接球，而興奮則讓玩家手動接球。此外，還有兩種主要的遊戲模式，在單人遊戲模式中，玩家將參加十五支球隊的錦標賽，或者在多人遊戲模式中與朋友正面交鋒。\n\n棒球的標準規則仍然適用，但它增加了玩家在比賽中可以拾取和使用的能力提升，例如投手投球更快或擊球手擊球更好的能力。他們還可以在比賽中替換一名球員，但每場比賽最多只能替換 3 名球員。遊戲通過 2D 圖形和漫畫風格的過場動畫來展示動作，例如游戲過程中會彈出的戲劇性接球和本壘打。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:22:53",
    "desc_translated_at": "2026-01-02T13:22:53",
    "original_name_hash": "bb8be641",
    "original_desc_hash": "a692b37e"
  },
  "ganryu": {
    "key": "ganryu",
    "original_name": "Ganryu",
    "name": "甘流",
    "name_source": "api",
    "original_desc": "One month has passed since Musashi defeated his sworn enemy, Kojiro. Musashi was on the way to Kyoto, where his beloved Otsu was waiting for him. Around this time, many abductions had occurred by a mysterious group of ninjas, and Otsu was one of the missing. What is the true purpose of these ninjas? The time to fight has come again for Musashi!!\n\nYou must guide Musashi or his sister, Suzame, around several locations defeating a horde of ninjas with only a sword. Weapon power-ups and life bonuses can be collected along the way. You can jump high and use your grappling hook to attach to and climb some ceilings, as well as attaching yourself to faraway objects. At the end of each location, you must defeat a guardian in order to continue the game. Cut-scenes are viewed between locations.",
    "desc": "距離武藏打敗死敵小次郎已經過去一個月了。武藏正在前往京都的路上，他心愛的大津正在那裡等著他。大約在這個時候，一群神秘的忍者發生了多起綁架事件，大津就是失踪者之一。這些忍者的真正目的是什麼？武藏的戰鬥時刻再次來臨！ ！\n\n你必須引導武藏或他的妹妹蘇薩姆在幾個地點中僅用一把劍擊敗一群忍者。一路上可以收集武器強化和生命獎勵。你可以跳得很高，並使用抓鉤附著並攀爬一些天花板，也可以將自己附著在遠處的物體上。在每個地點的末尾，您必須擊敗守衛才能繼續遊戲。在地點之間查看過場動畫。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:23:05",
    "desc_translated_at": "2026-01-02T13:23:05",
    "original_name_hash": "4d10a11b",
    "original_desc_hash": "c4bf921a"
  },
  "sengoku": {
    "key": "sengoku",
    "original_name": "Sengoku",
    "name": "戰國",
    "name_source": "api",
    "original_desc": "A 2D side-scrolling beat 'em up, Sengoku casts you and a friend as two renegade fighters out to beat the crap out of the many assorted gangs that threaten the post-apocalyptic cities of the future. Unfortunately for them they also get caught in a time-warping scheme caused by the evil Nobunaga who attempts to invade the time period with mythical warriors and evil creatures from the Japanese sengoku period.\n\nThe game thus takes you from the city to a spirit-realm from time to time, in which you must fight all sorts of Japanese mythical figures, and release three haunted spirits that can aid you in your battle. Collecting orbs from defeated enemies allows you heal up, gain weapons and even energy attacks and also summon the warrior forms of the spirits you released, which change your character's form and give you a new collection of attacks and powers.",
    "desc": "《戰國》是一款 2D 橫向捲軸清版遊戲，你和你的朋友將扮演兩名叛徒戰士，去擊敗威脅未來後世界末日城市的眾多幫派。不幸的是，對他們來說，他們也陷入了由邪惡的信長引起的時間扭曲計劃，信長試圖用來自日本戰國時代的神話武士和邪惡生物入侵這個時代。\n\n遊戲因此時不時地把你從城市帶到一個靈界，在那裡你必須與各種日本神話人物戰鬥，並釋放三個可以幫助你戰鬥的鬼魂。從被擊敗的敵人那裡收集球體可以讓你治愈，獲得武器甚至能量攻擊，還可以召喚你釋放的靈魂的戰士形態，這會改變你的角色的形態並為你提供新的攻擊和力量集合。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:23:16",
    "desc_translated_at": "2026-01-02T13:23:16",
    "original_name_hash": "b4310e9b",
    "original_desc_hash": "fc3cc32c"
  },
  "ssideki": {
    "key": "ssideki",
    "original_name": "Super Sidekicks",
    "name": "超級搭檔",
    "name_source": "api",
    "original_desc": "Experience the roar of the crowd and the thrills of the stadium. SNK's live-action soccer game is here! Along with your Ace Striker and his array of sliding, overhead, and diving shots, lead your team to victory and seize the prized SNK Cup. Watch players perform miraculous overhead and diving shots, dazzle your opponent with gravity-defying dribbling. Avoid sliding defense players and bone-crushing blocks. Be overwhelmed with in-your-face action so real, you'll be washing the grass stains off your clothing when you're finished!",
    "desc": "體驗人群的歡呼聲和體育場的刺激。SNK 的真人足球比賽來了！與你的王牌前鋒和他一系列的滑行、頭頂和魚躍射門一起，帶領你的球隊取得勝利並奪得珍貴的 SNK 獎杯。觀看球員神奇的過頂和俯衝投籃，用抗重力的運球讓對手眼花繚亂。避免滑動防守球員和碎骨塊。面對如此真實的動作，您會不知所措，完成後您會洗掉衣服上的草漬！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:23:28",
    "desc_translated_at": "2026-01-02T13:23:28",
    "original_name_hash": "4b6ea75c",
    "original_desc_hash": "4c3a1198"
  },
  "mslug5": {
    "key": "mslug5",
    "original_name": "Metal Slug 5",
    "name": "合金彈頭5",
    "name_source": "api",
    "original_desc": "The latest installment of the most famous arcade-shooting series brings a lot of changes: this time, you will not face Morden's army like in the previous games, but with a new group of enemies that composes the already mentioned Ptolemaic Army. More content in this title, 3 guns and 2 vehicles from past games were reincorporated, as well as all brand new stuff of 3 vehicles. The most important addition is a sliding move: pressing the B Button when ducking will make your character slide for a short time in the ground. You are not be able to throw grenades, but your gun can be fired normally.",
    "desc": "最著名的街機射擊系列的最新版本帶來了很多變化：這一次，你不會像之前的遊戲那樣面對摩登的軍隊，而是面對一群新的敵人，他們組成了已經提到的托勒密軍隊。本作內容更多，重新加入了過去遊戲中的3把槍和2輛車，以及3輛車的全部全新東西。最重要的附加功能是滑動動作：在躲避時按下 B 按鈕將使你的角色在地面上滑動一小段時間。你不能投擲手榴彈，但你的槍可以正常射擊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:23:40",
    "desc_translated_at": "2026-01-02T13:23:40",
    "original_name_hash": "2d458bfa",
    "original_desc_hash": "8af88665"
  },
  "fatfury1": {
    "key": "fatfury1",
    "original_name": "Fatal Fury : King of Fighters",
    "name": "餓狼傳說:拳皇",
    "name_source": "api",
    "original_desc": "Southtown City plays host to the King of Fighters Tournament. Andy & Terry Bogard take part in the tournament cause winning the tournament is the only way they can defeat Geese Howard. Geese Howard controls Southtown City and killed their father several years ago. Also taking part is Joe Higashi, a Japanese kickboxer. Select either Joe, Andy or Terry, visit several locations in Southtown City and win that tournament!\n\nFatal Fury is a 2D fighter and is the first game in a series of one-on-one fighting games by SNK. It's a conversion of the original Fatal Fury arcade game. This first game does not yet feature the series' trademark pseudo 3D mode (which allows you to move between the foreground & background while fighting). Includes a two-player vs. mode.",
    "desc": "南鎮市舉辦拳皇錦標賽。安迪·博加德和特里·博加德參加比賽，因為贏得比賽是他們擊敗吉斯·霍華德的唯一途徑。吉斯·霍華德控制了南鎮市，並在幾年前殺死了他們的父親。參加比賽的還有日本跆拳道運動員東喬。選擇喬、安迪或特里，參觀南鎮市的多個地點並贏得錦標賽！\n\n《餓狼傳說》是一款 2D 格鬥遊戲，也是 SNK 推出的一系列一對一格鬥遊戲中的第一款遊戲。它是原始《餓狼傳說》街機遊戲的轉換版。第一款遊戲尚未採用該系列標誌性的偽 3D 模式（允許您在戰鬥時在前景和背景之間移動）。包括兩人對戰模式。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:23:52",
    "desc_translated_at": "2026-01-02T13:23:52",
    "original_name_hash": "56ff5cff",
    "original_desc_hash": "b5ca40f8"
  },
  "kof98": {
    "key": "kof98",
    "original_name": "The King of Fighters '98 : The Slugfest",
    "name": "拳皇'98：激戰",
    "name_source": "api",
    "original_desc": "For all you King of Fighters fans, SNK offers the ultimate KOF installment! A total of 38 of your favorite fighters from all the characters appearing in the '94 to '97 versions. The nostalgic American Sports team, Lugal, as well as Heidern, Takuma, Saishu Kusanagi and other long-awaited characters are back! The ultimate reunion is about to begin in The King of Fighters '98!",
    "desc": "SNK 為所有《拳皇》粉絲提供終極 KOF 遊戲！94 至 97 版本中出現的所有角色中共有 38 名您最喜歡的戰士。懷舊的美國運動隊盧格爾，以及海德恩、琢馬、草薙齋周等期待已久的角色又回來了！拳皇98終極重聚即將拉開帷幕！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:24:03",
    "desc_translated_at": "2026-01-02T13:24:03",
    "original_name_hash": "65474c06",
    "original_desc_hash": "91d13128"
  },
  "wjammers": {
    "key": "wjammers",
    "original_name": "Windjammers",
    "name": "風衣",
    "name_source": "api",
    "original_desc": "Windjammers is based on a real-life sport known as Saucer Tennis or Frisbee Tennis. You and an opponent face off in an arena with a low net in the middle. Points are scored by throwing a disc into the goals behind a player or whenever your opponent is not able to catch the disc in time. There are two moves: a regular throw and a lob. By using quarter-circle movement, you can also add effect to the throw. To catch difficult discs, you can slide to move more quickly. There are six characters to choose from, with specific abilities and their own court fit for their skills. A single game consists of short sets of thirty seconds. The game is won after two winning sets or sudden death after two draws.",
    "desc": "《Windjammers》基於現實生活中的一項名為“碟式網球”或“飛盤網球”的運動。您和對手在中間有低網的競技場中對峙。通過將飛盤扔進球員身後的球門或當您的對手無法及時接住飛盤時得分。有兩種動作：常規投擲和高球。通過使用四分之一圓運動，您還可以為投擲添加效果。要接住困難的飛盤，您可以滑動以更快地移動。有六名角色可供選擇，他們具有特定的能力和適合他們技能的球場。一場比賽由三十秒的短組組成。兩盤獲勝後獲勝或兩平後突然死亡。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:24:15",
    "desc_translated_at": "2026-01-02T13:24:15",
    "original_name_hash": "f8d9c4a8",
    "original_desc_hash": "8be2b886"
  },
  "gpilots": {
    "key": "gpilots",
    "original_name": "Ghost Pilots",
    "name": "幽靈飛行員",
    "name_source": "api",
    "original_desc": "Ghost Pilots is an overhead military plane shooter, in which you must shoot down fighter jets by either using bullets or bombs. Once you have killed enough fighter jets, you will have to defeat a boss fighter jet in order to continue. After some stages, you must select a route to continue your journey on. Power-ups can be collected that will increase your firepower, and stars can be obtained for extra points.",
    "desc": "《Ghost Pilots》是一款高空軍用飛機射擊遊戲，您必須使用子彈或炸彈擊落戰鬥機。一旦你殺死了足夠多的戰鬥機，你就必須擊敗首領戰鬥機才能繼續。經過一些階段後，您必須選擇一條路線繼續您的旅程。可以收集能量道具來增強你的火力，還可以獲得星星以獲得額外積分。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:24:27",
    "desc_translated_at": "2026-01-02T13:24:27",
    "original_name_hash": "0b5e2c6b",
    "original_desc_hash": "6a318a1c"
  },
  "cyberlip": {
    "key": "cyberlip",
    "original_name": "Cyber-Lip",
    "name": "賽博唇",
    "name_source": "api",
    "original_desc": "Cyber-Lip is a 1-2 player side-scrolling game where you must fight your way through several areas, and defeat a boss at the end of each one. Along the way, you can pick up a variety of weapons along the way, and use them against the invaders. By destroying certain enemies, you receive a \"core bot\", which is a ring that surrounds you, and when this touches the invaders, they are destroyed. Time is against you. When it expires, you lose a life.",
    "desc": "Cyber-Lip 是一款 1-2 人橫向捲軸遊戲，您必須在多個區域中殺出一條血路，並在每個區域的最後擊敗 Boss。一路上，你可以拾取沿途的各種武器，並用它們來對抗入侵者。通過消滅某些敵人，你會收到一個“核心機器人”，它是一個圍繞著你的環，當它接觸到入侵者時，它們就會被摧毀。時間對你不利。當它過期時，你就會失去生命。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:24:38",
    "desc_translated_at": "2026-01-02T13:24:38",
    "original_name_hash": "beef1aef",
    "original_desc_hash": "44e24bf5"
  },
  "kotm": {
    "key": "kotm",
    "original_name": "King of the Monsters",
    "name": "怪獸之王",
    "name_source": "api",
    "original_desc": "King of the Monsters is a two player (or one player vs. computer) fighting game, in which the players take control of two gargantuan monsters (like Godzillas) and battle it out in different city locations.\n\nThe city gets gradually destroyed as the two creatures fight it out. The players can also interact with the scenery by picking up boats and such, to use as weapons against the other player.",
    "desc": "《怪物之王》是一款兩人（或單人對電腦）格鬥遊戲，玩家控制兩個巨大的怪物（如哥斯拉）並在不同的城市地點進行戰鬥。\n\n隨著這兩種生物的戰鬥，這座城市逐漸被摧毀。玩家還可以通過拾取船隻等與場景互動，將其用作對抗其他玩家的武器。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:24:50",
    "desc_translated_at": "2026-01-02T13:24:50",
    "original_name_hash": "f9c57862",
    "original_desc_hash": "38cbfa5d"
  },
  "kabukikl": {
    "key": "kabukikl",
    "original_name": "Far East of Eden: Kabuki Klash",
    "name": "伊甸園的遠東：歌舞伎班",
    "name_source": "api",
    "original_desc": "\"Kabuki Klash\" is a 2D fighting game that features characters from the famous Japanese role-playing series  Tengai Makyou, also known as Far East of Eden. The heroes of the three first Tengai Makyou games must participate in a tournament and find out who is the most skillful fighter in the magical land of Jipang (which is very similar to the medieval Japan). The characters include well-known Far East of Eden heroes such as Ziria, Manjimaru, Kabuki, Orochimaru, and others - a total of eight playable characters. During the fights, you can either punch, kick, or use special attacks, that require a precise usage of buttons and also deplete your magic gauge. There are random items (such as healing potions) thrown on the battle field while you are fighting, which you can pick up.",
    "desc": "《Kabuki Klash》是一款 2D 格鬥遊戲，遊戲主角來自日本著名角色扮演系列《天外魔鏡》（又名《遠東伊甸園》）。前三款《天外魔鏡》遊戲的英雄必須參加一場錦標賽，並找出誰是魔法土地 Jipang（與中世紀的日本非常相似）中最熟練的戰士。角色包括著名的《遠東伊甸園》英雄，如茲利亞、萬吉丸、歌舞伎、大蛇丸等，總共八個可玩角色。在戰鬥中，你可以拳打腳踢，也可以使用特殊攻擊，這需要精確地使用按鈕，同時也會耗盡你的魔法量表。戰鬥時，戰場上會隨機掉落一些物品（例如治療藥水），你可以撿起它們。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:25:01",
    "desc_translated_at": "2026-01-02T13:25:01",
    "original_name_hash": "129f256f",
    "original_desc_hash": "96686e66"
  },
  "puzzledp": {
    "key": "puzzledp",
    "original_name": "Puzzle De Pon!",
    "name": "拼圖兩座橋！",
    "name_source": "api",
    "original_desc": "The player clears the colored balls on the screen by firing balls against other balls of the same colour, the objective of the game is not to clear the screen of balls. It is instead to clear all the balls from around the level shape, referred to as the \"drop token\". Once this shape is freed, it explodes and the player travels onto the next level. There are 39 levels in the game, divided in groups of three levels. In the first two levels, the shape is something generic; in the third level the shape is a Zodiac sign, up to level 36 (since there are 12 signs). Level 39's shape is the Solar Symbol.",
    "desc": "玩家通過向其他相同顏色的球發射球來清除屏幕上的彩色球，遊戲的目標不是清除屏幕上的球。相反，它是清除關卡形狀周圍的所有球，稱為“掉落令牌”。一旦這個形狀被釋放，它就會爆炸，玩家就會進入下一個關卡。遊戲共有 39 個關卡，分為三個關卡一組。在前兩個級別中，形狀是通用的；第三層的形狀是黃道十二宮，最高可達 36 層（因為有 12 個星座）。39級的形狀是太陽符號。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:25:13",
    "desc_translated_at": "2026-01-02T13:25:13",
    "original_name_hash": "c7572ff7",
    "original_desc_hash": "c0067011"
  },
  "fbfrenzy": {
    "key": "fbfrenzy",
    "original_name": "Football Frenzy",
    "name": "足球狂熱",
    "name_source": "api",
    "original_desc": "You'll never play another football game again, after you play Football Frenzy! Football Frenzy, with on-going play-by-play announcing, is hard-hitting action at its best! You will hear, in full stereo, every bone-crushing tackle and helmet-to-helmet, metal-on-metal hit. The piercing grunts and groans of players sacrificing their bodies for the team puts you right on the field with them! The camera zooms give you the most dazzling close-ups ever seen. So, bring your pads and helmet! Tournament mode, cinematic displays and over 10 teams to choose from make this football package complete. Play against the computer or a friend in this 46-MEG bone-jarring gridiron great... Football Frenzy!",
    "desc": "玩完瘋狂足球後，您將再也不會玩足球遊戲了！《足球狂熱》將持續公佈比賽實況，是最精彩的強力動作遊戲！您將聽到全立體聲的每一次令人碎骨的鏟球和頭盔對頭盔、金屬對金屬的撞擊聲。球員們為球隊犧牲自己的身體，發出刺耳的咕噥聲和呻吟聲，讓您彷彿置身於他們的場上！相機變焦為您提供有史以來最耀眼的特寫鏡頭。所以，帶上你的護墊和頭盔吧！錦標賽模式、電影展示以及超過 10 支球隊可供選擇，使這個足球包更加完整。在這個令人震驚的 46 兆網格球場中與電腦或朋友對戰……足球狂熱！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:25:25",
    "desc_translated_at": "2026-01-02T13:25:25",
    "original_name_hash": "e36c031d",
    "original_desc_hash": "ad254c1d"
  },
  "trally": {
    "key": "trally",
    "original_name": "Thrash Rally",
    "name": "鞭打拉力賽",
    "name_source": "api",
    "original_desc": "Thrash Rally is a fast-paced racing game, similar to Neo Drift Out and Overtop, but using a top-down view. You can either participate in a World Championship or do a complete Paris Dakar rally.\nUsing basic controls: accelerate with automatic transmission, brake and a combination of both to power drift, you have to follow a set path of courses. In the World Championship, each location consists of different stages that need to be finished in a single run. There is a strict time limit and you receive a time bonus upon finishing a section. The Dakar mode is one long track without stops. The championship uses regular cars, but in the Dakar race you can also choose a sand buggy, off-road bike or a truck.\n\nA global ranking is kept while racing, but it is based on your time, not on the number of cars you pass during the race. Aside from your opponents, you'll also find water, animals, hills, bridges, bushes and different obstacles in your path.",
    "desc": "Thrash Rally 是一款快節奏的賽車遊戲，類似於 Neo Drift Out 和 Overtop，但使用自上而下的視圖。您可以參加世界錦標賽或參加完整的巴黎達喀爾拉力賽。\n使用基本控制：通過自動變速箱加速、制動以及兩者的組合來驅動漂移，你必須遵循設定的路線。在世界錦標賽中，每個地點都由不同的賽段組成，需要在一次運行中完成。有嚴格的時間限制，完成一個部分後您將獲得時間獎勵。達喀爾模式是一條沒有停靠點的長賽道。錦標賽使用普通汽車，但在達喀爾比賽中您也可以選擇沙地車、越野自行車或卡車。\n\n比賽時會保留全球排名，但它是基於您的時間，而不是您在比賽期間通過的汽車數量。除了你的對手之外，你還會在你的道路上發現水、動物、山丘、橋樑、灌木叢和不同的障礙物。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:25:37",
    "desc_translated_at": "2026-01-02T13:25:37",
    "original_name_hash": "517314e1",
    "original_desc_hash": "d911730e"
  },
  "ctomaday": {
    "key": "ctomaday",
    "original_name": "Captain Tomaday",
    "name": "托馬迪船長",
    "name_source": "api",
    "original_desc": "A comical vertically scrolling shoot'em up starring a mutated tomato who punches the enemy and can transform to other weird characters.",
    "desc": "這是一款滑稽的垂直捲軸射擊遊戲，主角是一個變異的番茄，它會猛擊敵人並可以變身為其他奇怪的角色。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:25:49",
    "desc_translated_at": "2026-01-02T13:25:49",
    "original_name_hash": "e513840c",
    "original_desc_hash": "5df1d1a5"
  },
  "kof2003": {
    "key": "kof2003",
    "original_name": "The King of Fighters 2003",
    "name": "拳皇2003",
    "name_source": "api",
    "original_desc": "Like The King of Fighters 2002, this game reverts back to the old 3-on-3 format used from KOF '94 to KOF '98. A new feature to this game that old-school KOF fans might have trouble getting used to is the new interchangeable team system. You still pick three characters and decide your character order before a match, but now you have the option to change to another character during a match. You can change at any time during a match, but you cannot when two of your teammates have been taken out, and only one character is left in reserve.",
    "desc": "與《拳皇 2002》一樣，這款遊戲恢復了 KOF '94 到 KOF '98 所使用的舊 3 對 3 格式。這款遊戲的一個新功能可能會讓老派 KOF 粉絲難以適應，那就是新的可互換隊伍系統。您仍然可以在比賽前選擇三個角色並決定角色順序，但現在您可以選擇在比賽期間更改為另一個角色。在一場比賽中，你可以隨時更換，但當你的兩名隊友被淘汰，並且只剩下一個角色時，你就不能更換。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:00",
    "desc_translated_at": "2026-01-02T13:26:00",
    "original_name_hash": "e0d9b1b8",
    "original_desc_hash": "7a6578dc"
  },
  "pbobbl2n": {
    "key": "pbobbl2n",
    "original_name": "Puzzle Bobble 2",
    "name": "泡泡龍2",
    "name_source": "api",
    "original_desc": "Bub and Bob are back! Like in Tetris in reverse, you shoot bubbles at an array of different-colored bubbles stuck in an ever descending ceiling, attempting to match them up three by three to make them disappear. This edition contains both puzzle challenges, multiplayer and normal progressive stages.",
    "desc": "布布和鮑勃回來了！就像在相反的俄羅斯方塊中一樣，你向粘在不斷下降的天花板上的一系列不同顏色的氣泡發射氣泡，試圖將它們三三個匹配以使它們消失。此版本包含解謎挑戰、多人遊戲和正常的漸進階段。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:12",
    "desc_translated_at": "2026-01-02T13:26:12",
    "original_name_hash": "6084810d",
    "original_desc_hash": "bc28faca"
  },
  "burningf": {
    "key": "burningf",
    "original_name": "Burning Fight",
    "name": "燃燒的戰鬥",
    "name_source": "api",
    "original_desc": "The Castella family from the Metro City started ruining the peaceful city of Osaka with the violent Japanese group, \"Heiwa-gumi\". To stop the fight, Metro police detectives dispatched two dangerous characters, Duke and Billy, to Japan. With the support of the famous Japanese detective Ryu, they decided to rush into the enemy's fortress. Ruthless violence in the neon lights of Osaka. Will there be an end to this war?\n\nBurning Fight is a side-scrolling street-fighting game similar to Final Fight. As Duke, Billy, or Ryu, you must fight your way through the various locations in Osaka. At the start of the game, you can only use your fists to deal with gangs, but by by breaking things like phone booths and street signs along the way, you can get new weapons and more health. At the end of each location, you will have to defeat a boss in order to continue the mission.",
    "desc": "來自美羅城的卡斯特拉家族與日本暴力組織“平和組”開始破壞大阪市的和平。為了阻止這場打鬥，地鐵警探將杜克和比利這兩個危險人物派往日本。在日本著名偵探Ryu的支持下，他們決定衝進敵人的堡壘。大阪霓虹燈下的無情暴力。這場戰爭會有結束嗎？\n\nBurning Fight 是一款類似於 Final Fight 的橫向捲軸街頭格鬥遊戲。扮演杜克、比利或龍，你必須在大阪的各個地點殺出一條血路。遊戲開始時，你只能用拳頭對付幫派，但通過破壞沿途的電話亭和路牌等東西，你可以獲得新的武器和更多的生命值。在每個地點的最後，你必須擊敗老闆才能繼續任務。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:24",
    "desc_translated_at": "2026-01-02T13:26:24",
    "original_name_hash": "6cdcae06",
    "original_desc_hash": "4c650cbb"
  },
  "kof95": {
    "key": "kof95",
    "original_name": "The King of Fighters '95",
    "name": "拳皇'95",
    "name_source": "api",
    "original_desc": "Summer, 1995. The world's toughest combatants once again team up for the supreme competition. A stellar cast of fighting stars gather in the most colossal conflagration in history! Along with terrifying new challenges... out of the storm of battle comes The King of Fighters '95! Experience a new age in fighting games with the original Team Edit Mode!\n\nChoose from 24 characters! Take your pick from a bountiful selection to create history's most awesome team of pure pugilism. Create your own original bruise-giving team of 3 by selecting your favorite fighters!",
    "desc": "1995 年夏天。世界上最強悍的選手再次組隊參加最高級別的比賽。群星璀璨的格鬥明星齊聚，掀起史上最大規模的大火！伴隨著可怕的新挑戰……《拳皇 '95》從戰鬥風暴中襲來！通過原創的團隊編輯模式體驗格鬥遊戲的新時代！\n\n從 24 個角色中選擇！從豐富的選擇中進行選擇，創建歷史上最出色的純粹拳擊團隊。選擇您最喜歡的戰士，創建您自己的原創 3 人團隊！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:35",
    "desc_translated_at": "2026-01-02T13:26:35",
    "original_name_hash": "e54b6654",
    "original_desc_hash": "6061b18b"
  },
  "aodk": {
    "key": "aodk",
    "original_name": "Aggressors of Dark Kombat",
    "name": "黑暗格鬥的侵略者",
    "name_source": "api",
    "original_desc": "Aggressors of Dark Kombat is another one-on-one street fighting beat 'em up from the Neo-Geo's seemingly endless library of fighters.\n\nIt pits 8 fighters of different styles and strengths against each other in a tournament to see who's the toughest mofo on the streets of Tokyo. Your objective as usual is to deplete your opponent's health bar within the time limit by using your basic attacks and special moves (triggered by specific controller motions) while avoiding his moves and attacks.\n\nUnique to Aggressors of Dark Kombat is the combination of traditional side-scrolling beat 'em up elements, meaning characters can freely move in an isometric space instead of being restricted to a single plane of movement. Weapons and throw-able items are usually thrown into the arena by the crowds and you can pick them up and wield them for added damage. Additionally, matches are 1-round only affairs, with an extended multi-layered health bar that allows for longer rounds than usual.",
    "desc": "《黑暗格鬥侵略者》是 Neo-Geo 看似無窮無盡的戰士庫中的另一款一對一巷戰清版遊戲。\n\n8 位風格和實力各異的拳手將在一場錦標賽中相互較量，看看誰才是東京街頭最強悍的怪物。你的目標和往常一樣，是通過使用你的基本攻擊和特殊動作（由特定的控制器動作觸發）在時限內耗盡對手的生命值，同時避開他的動作和攻擊。\n\n《黑暗格鬥侵略者》的獨特之處在於結合了傳統的橫向捲軸清版元素，這意味著角色可以在等距空間中自由移動，而不是局限於單一的移動平面。武器和可投擲物品通常被人群扔進競技場，你可以撿起它們並使用它們來增加傷害。此外，比賽僅限一輪，具有擴展的多層健康欄，允許比平常更長的回合。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:47",
    "desc_translated_at": "2026-01-02T13:26:47",
    "original_name_hash": "aa292796",
    "original_desc_hash": "1ebec426"
  },
  "stakwin": {
    "key": "stakwin",
    "original_name": "Stakes Winner",
    "name": "賭注獲勝者",
    "name_source": "api",
    "original_desc": "Stakes Winner is a 2D horse racing game. Taking the role of horse jockeys, players must win a series of races using one of the game's eight selectable horses. Each horse is rated in strength, speed, and stamina, making each horse different in handling. During the game, horse ratings can be boosted through completing bonus levels. Each horse has a stamina bar displayed at the bottom of the screen, next to a picture of the horse's head showing its current health. The stamina bar decreases as the horse runs, and when it is depleted, the race is over for that horse.",
    "desc": "Stakes Winner 是一款 2D 賽馬游戲。玩家扮演騎師的角色，必須使用遊戲中八匹可選馬匹中的一匹贏得一系列比賽。每匹馬的力量、速度和耐力都有評級，這使得每匹馬的操控性都不同。在遊戲過程中，馬匹評級可以通過完成獎勵關卡來提高。每匹馬的屏幕底部都會顯示一個耐力條，旁邊是一張顯示其當前健康狀況的馬頭圖片。耐力條會隨著馬的奔跑而減少，當耐力條耗盡時，該馬的比賽就結束了。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:26:58",
    "desc_translated_at": "2026-01-02T13:26:58",
    "original_name_hash": "46b5c7f6",
    "original_desc_hash": "27f84069"
  },
  "gowcaizr": {
    "key": "gowcaizr",
    "original_name": "Voltage Fighter Gowcaizer",
    "name": "電壓戰鬥機 Gowcaizer",
    "name_source": "api",
    "original_desc": "The ultimate warriors are ready for battle! The Auto-Zoom feature draws you in to the red-hot action! Use the new \"Special Attack Tracing System\" to copy the special abilities of the foes you defeat and build your own warrior from over 100 combinations!",
    "desc": "終極戰士已準備好戰鬥！自動縮放功能將您帶入火熱的動作之中！使用新的“特殊攻擊追踪系統”複製你擊敗的敵人的特殊能力，並從超過 100 種組合中打造你自己的戰士！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:27:10",
    "desc_translated_at": "2026-01-02T13:27:10",
    "original_name_hash": "1634fac0",
    "original_desc_hash": "5df395ce"
  },
  "lastblad": {
    "key": "lastblad",
    "original_name": "The Last Blade",
    "name": "最後的刀鋒",
    "name_source": "api",
    "original_desc": "Choose one of several characters to play with, each with their own unique moves and special attacks. Each stage in the game has two battles, where the object of each is to drain your opponent's energy in order to complete the battle, and you will complete the stage if you do this twice. If there is a draw, then a third battle is then played. There is a time limit, and when this expires, the player with the most energy wins the battle.",
    "desc": "選擇多個角色之一進行遊戲，每個角色都有自己獨特的動作和特殊攻擊。遊戲中的每個階段都有兩次戰鬥，每次的目的都是消耗對手的能量以完成戰鬥，如果你這樣做兩次，你就完成了階段。如果打平，則進行第三場比賽。有時間限制，當時間結束時，能量最多的玩家贏得戰鬥。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:27:22",
    "desc_translated_at": "2026-01-02T13:27:22",
    "original_name_hash": "c650fea3",
    "original_desc_hash": "3b8cb06b"
  },
  "mslug4": {
    "key": "mslug4",
    "original_name": "Metal Slug 4",
    "name": "合金彈頭4",
    "name_source": "api",
    "original_desc": "The 5th episode of the most famous arcade-shooting-series comes bringing the unaltered classic gameplay, a new weapon, 6 new vehicles as well as 2 new soldiers for the pantheon. The most notable introduction to the series is the Metalish System, giving to the player a new possibility to score more points: after pick up certain shield-shape emblems, a timer bar will be displayed at the top of the screen. During this time, you must to shoot rapidly as many enemies as possible and, depending on your acting, you will receive a corresponding badge bonus that will be added to your score after completing it. When you die, the bonus wears off.",
    "desc": "最著名的街機射擊系列的第五集帶來了不變的經典遊戲玩法、新武器、6 種新車輛以及 2 名萬神殿新士兵。該系列最引人注目的介紹是金屬系統，為玩家提供了獲得更多積分的新可能性：拾取某些盾形徽章後，屏幕頂部將顯示一個計時器欄。在此期間，你必須快速射擊盡可能多的敵人，根據你的表現，你將獲得相應的徽章獎勵，完成後將添加到你的分數中。當你死後，獎金就會消失。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:27:33",
    "desc_translated_at": "2026-01-02T13:27:33",
    "original_name_hash": "b4251fe7",
    "original_desc_hash": "277099b7"
  },
  "fightfev": {
    "key": "fightfev",
    "original_name": "Fight Fever",
    "name": "對抗發燒",
    "name_source": "api",
    "original_desc": "There are 8 characters to select from and two boss characters (the first boss character is only playable in two player mode). The object of the game is to win two matches out of three. Each character has a set of moves in addition to two basic punches and kicks. Each character also has a super move called a \"Danger Move\", which are similar to the Desperation Moves from Fatal Fury 2. Players also have the ability to taunt others, but unlike games such as Art of Fighting, this has no effect and would actually leave the player open to attacks.",
    "desc": "有 8 個角色可供選擇，還有兩個 Boss 角色（第一個 Boss 角色只能在兩人模式下玩）。遊戲的目標是在三場比賽中贏得兩場。除了兩種基本的拳打腳踢之外，每個角色都有一套動作。每個角色還有一個超級招式，稱為“危險招式”，類似於《餓狼傳說 2》中的絕望招式。玩家還可以嘲諷他人，但與《格鬥藝術》等遊戲不同，這沒有任何效果，實際上會讓玩家容易受到攻擊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:27:45",
    "desc_translated_at": "2026-01-02T13:27:45",
    "original_name_hash": "943eb5da",
    "original_desc_hash": "ac2c6b80"
  },
  "kof2001": {
    "key": "kof2001",
    "original_name": "The King of Fighters 2001",
    "name": "拳皇2001",
    "name_source": "api",
    "original_desc": "In this eighth installment of the King of Fighters series, ten different teams once again battle it out in several countries to decide which team will be this year's King of Fighters. However, the NESTS organization is once again standing in the participant's way; they have deployed their own team of four fighters, lead by two individuals of high-rank within NESTS: a man claiming to be the original Zero and Igniz, the CEO of NESTS. The character roster has been updated yet again for this release in the series.",
    "desc": "在《拳皇》系列的第八部中，十支不同的隊伍再次在多個國家展開角逐，決定哪支隊伍將成為今年的《拳皇》。然而，NESTS組織再次阻擋了參賽者的腳步；他們部署了自己的由四名戰士組成的團隊，由 NESTS 內的兩名高級人員領導：一名自稱是最初的“零”的男子和 NESTS 的首席執行官伊格尼茲。該系列的這個版本的角色名單再次更新。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:27:57",
    "desc_translated_at": "2026-01-02T13:27:57",
    "original_name_hash": "d649f2a0",
    "original_desc_hash": "037501a2"
  },
  "popbounc": {
    "key": "popbounc",
    "original_name": "Pop 'n Bounce",
    "name": "流行彈跳",
    "name_source": "api",
    "original_desc": "Pop'n Bounce is a puzzle game similar to Break Out; the player must bounce a ball off a paddle in order to knock out a wall of sprites. However, in Pop'n Bounce, the sprites are of assorted living creatures instead of bricks.",
    "desc": "Pop'n Bounce 是一款類似於 Break Out 的益智遊戲；玩家必須將球從球拍上彈起，才能擊倒精靈牆。然而，在 Pop'n Bounce 中，精靈是各種生物而不是磚塊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:08",
    "desc_translated_at": "2026-01-02T13:28:08",
    "original_name_hash": "0e1b8041",
    "original_desc_hash": "59d0dd80"
  },
  "tophuntr": {
    "key": "tophuntr",
    "original_name": "Top Hunter: Roddy & Cathy",
    "name": "頂級獵人：羅迪和凱茜",
    "name_source": "api",
    "original_desc": "Clean up the Space Pirates! Time: The age of space colonialism. The dreaded Klaptons are on the loose, turning peaceful settlements into ghost towns. Searching for the price on the Klapton's heads come the cosmic bounty hunters RODDY and CATHY. Do these two have what it takes to save the universe? Can they work together without competing for the rewards themselves? Their fate, and the fate of the free universe is IN YOUR HANDS - the legendary team known as TOP HUNTER!",
    "desc": "消滅宇宙海盜！時間：太空殖民主義時代。可怕的克拉普頓人逍遙法外，將和平的定居點變成了鬼城。宇宙賞金獵人羅迪和凱茜正在尋找克萊普頓的頭顱。這兩個人有能力拯救宇宙嗎？他們可以一起工作而不自己爭奪獎勵嗎？他們的命運，以及自由宇宙的命運都掌握在你的手中——被稱為“頂級獵人”的傳奇團隊！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:20",
    "desc_translated_at": "2026-01-02T13:28:20",
    "original_name_hash": "5676c434",
    "original_desc_hash": "4cdb159c"
  },
  "maglord": {
    "key": "maglord",
    "original_name": "Magician Lord",
    "name": "魔法師領主",
    "name_source": "api",
    "original_desc": "Magician Lord puts you in charge of Elta, a wizard who has the task of collecting eight books of wisdom from the clutches of Az Atorse, the god of destruction. By collecting the right power-ups along the way, you can transform into different characters, including the Rajin, Samurai, Waterman, Shinobi, Poseidon, and Dragon Warrior. Each character has different abilities. There are eight areas in the game, and each stage ends with you trying to defeat both a guardian and the end-of-area boss (which are basically Atorse's incarnations). One of the first games that demonstrated the graphical abilities of the Neo-Geo.",
    "desc": "魔法師領主讓你負責艾爾塔，這位巫師的任務是從破壞之神阿茲·阿托斯的手中收集八本智慧之書。通過沿途收集正確的能量提升，你可以變身為不同的角色，包括羅金、武士、沃特曼、忍者、波塞冬和龍戰士。每個角色都有不同的能力。遊戲中有八個區域，每個階段都以你試圖擊敗守護者和區域末端的首領（基本上是阿托斯的化身）結束。最早展示 Neo-Geo 圖形功能的遊戲之一。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:31",
    "desc_translated_at": "2026-01-02T13:28:31",
    "original_name_hash": "7e0a2690",
    "original_desc_hash": "ee9b5d99"
  },
  "preisle2": {
    "key": "preisle2",
    "original_name": "Prehistoric Isle 2",
    "name": "史前島 2",
    "name_source": "api",
    "original_desc": "Different types of dinosaurs have emerged: big ones, small ones and some even have wings! Your mission is to eliminate these primitive beasts from the city. Rescue and help all the trapped citizens!nnWith one or two players, pilot a combat helicopter and annihilate these prehistoric monsters. The title is made up of levels set in a variety of horizontally-scrolling environments, including the city, the sea and the jungle. Whenever possible, you must also rescue civilians in distress.",
    "desc": "不同類型的恐龍出現了：大的、小的，有些甚至有翅膀！你的任務是消滅城市中的這些原始野獸。營救並幫助所有被困的公民！與一兩個玩家一起，駕駛一架戰鬥直升機並消滅這些史前怪物。該遊戲由設置在各種水平滾動環境中的關卡組成，包括城市、海洋和叢林。只要有可能，你還必須營救遇險平民。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:43",
    "desc_translated_at": "2026-01-02T13:28:43",
    "original_name_hash": "66057c87",
    "original_desc_hash": "911e4576"
  },
  "fatfursp": {
    "key": "fatfursp",
    "original_name": "Fatal Fury Special",
    "name": "餓狼傳說特別版",
    "name_source": "api",
    "original_desc": "Fatal Fury Special is an improved version of SNK's 2D one-on-one fighter Fatal Fury 2. It's a conversion of the 1993 arcade game of the same name. The objective is still to win the tournament by defeating all other fighters including end boss Wolfgang Krauser. Fatal Fury Special features a fairly large selection of fighters. A new Count Down mode (defeat as many opponents as possible in 3 minutes).Extra color schemes for every character.New & improved background graphics.Dolby Surround Sound support.",
    "desc": "《Fatal Fury Special》是 SNK 的 2D 一對一格鬥遊戲《Fatal Fury 2》的改進版本。它是 1993 年同名街機遊戲的轉換版。目標仍然是通過擊敗包括最終老闆沃爾夫岡·克勞瑟在內的所有其他戰士來贏得比賽。《餓狼傳說》特別版擁有相當多的戰士可供選擇。新的倒計時模式（在 3 分鐘內擊敗盡可能多的對手）。每個角色都有額外的配色方案。新的和改進的背景圖形。杜比環繞聲支持。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:55",
    "desc_translated_at": "2026-01-02T13:28:55",
    "original_name_hash": "932b5ad4",
    "original_desc_hash": "89481131"
  },
  "blazstar": {
    "key": "blazstar",
    "original_name": "Blazing Star",
    "name": "崩坏：星穹铁道的音乐",
    "name_source": "wiki",
    "original_desc": "The unofficial sequel to Pulstar, Blazing Star is again a horizontal-scrolling shoot-'em-up. One or two players proceed along levels, each with a boss enemy at the end, trying to redeem the humankind. There are six ships to choose from, each with its own pilot (four of them females), weapons and characteristics of movement. Each ship has its own types of shots, but also a standard shot, charged shot (more powerful) and split shot (a charged shot can be parted into more bullets, lowering the power of each bullet while widening the fire range).",
    "desc": "作為 Pulstar 的非官方續作，Blazing Star 又是一款橫向捲軸射擊遊戲。一兩個玩家沿著關卡前進，每個人在最後都有一個頭目敵人，試圖拯救人類。有六艘船可供選擇，每艘船都有自己的飛行員（其中四名女性）、武器和運動特徵。每艘船都有自己的射擊類型，但也有標準射擊、帶電射擊（威力更大）和分裂射擊（帶電射擊可以分成更多子彈，降低每顆子彈的威力，同時擴大射程）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:28:56",
    "desc_translated_at": "2026-01-02T13:28:56",
    "original_name_hash": "76dc4200",
    "original_desc_hash": "112d554a"
  },
  "aof": {
    "key": "aof",
    "original_name": "Art of Fighting",
    "name": "格鬥藝術",
    "name_source": "api",
    "original_desc": "The storyline of Art of Fighting takes place in 1978. Ryo Sakazaki and Robert Garcia set out to find Ryo's sister, Yuri, who was kidnapped by Mr. Big. Mr. Big took Yuri to entice Takuma Sakazaki, Ryo's father and originator of Kyokugen Karate, and also because Ryo refused to work for Big. After Ryo & Robert defeat Mr. Big, they face the enigmatic Mr. Karate. Art of Fighting's story ends with a cliff-hanger; Yuri is about to disclose the true identity of Mr. Karate as their father Takuma.",
    "desc": "《格鬥藝術》的故事情節發生在 1978 年，坂崎亮和羅伯特·加西亞出發尋找坂崎亮的妹妹尤里，後者被大佬先生綁架了。Big先生帶著Yuri來引誘Ryo的父親、極元空手道的鼻祖坂崎琢馬，也是因為Ryo拒絕為Big工作。亮和羅伯特擊敗大先生後，他們將面對神秘的空手道先生。《格鬥藝術》的故事以懸念結尾。尤里即將揭露空手道先生的真實身份，即他們的父親琢磨。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:08",
    "desc_translated_at": "2026-01-02T13:29:08",
    "original_name_hash": "a9714bcf",
    "original_desc_hash": "b2c2feff"
  },
  "aof2": {
    "key": "aof2",
    "original_name": "Art of Fighting 2",
    "name": "超級英雄：武力對決2",
    "name_source": "wiki",
    "original_desc": "In this sequel to the original Art of Fighting, and prequel to the original Fatal Fury, we learn that Mr. Karate, the final boss of the original game, behind the mask, is really Takuma Sakazaki, Ryo and Yuri's father, that Takuma was being used by Geese Howard for his own evil intentions, and that Mr. Big was the one who had originally kidnapped Yuri.\n\nMany of the problems that existed in the first game have been fixed in this installment (it is easier to execute special moves, you no longer have only Ryo or Robert to choose from in 1 player mode, etc.).\n\nThe entire cast from the first Art of Fighting is here (with the exceptions of Todo and Mr. Karate), along with a few new characters: Takuma Sakazaki, Ryo and Yuri's father; Yuri Sakazaki, Takuma's daughter and Ryo's sister; Eiji Kisaragi, a sworn enemy of the Sakazakis; Temjin, a Mongolian trucker; and a younger version of Geese Howard, whom you face as the last boss if you beat the game without losing a round.",
    "desc": "在原版《格鬥藝術》的續集中，也是原版《餓狼傳說》的前傳中，我們了解到，原版遊戲的最終boss空手道先生，在面具後面，實際上是坂崎拓真、涼和尤里的父親，拓真被吉斯·霍華德利用，以達到自己的邪惡目的，而大先生正是最初綁架尤里的人。\n\n第一部遊戲中存在的許多問題已在本部分中得到修復（更容易執行特殊動作，在單人模式中你不再只有 Ryo 或 Robert 可供選擇等）。\n\n第一部《格鬥藝術》的全部演員陣容（除了藤堂和空手道先生），還有一些新角色：坂崎琢馬、涼和尤里的父親；坂崎由里，琢磨的女兒，涼的妹妹；如月英二，坂崎家的死敵；鐵木真，蒙古卡車司機；還有年輕版的吉斯·霍華德（Geese Howard），如果你在沒有輸掉一輪的情況下擊敗遊戲，你將面對他作為最後的老闆。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:10",
    "desc_translated_at": "2026-01-02T13:29:10",
    "original_name_hash": "d44538fa",
    "original_desc_hash": "7c146849"
  },
  "breakers": {
    "key": "breakers",
    "original_name": "Breakers",
    "name": "斷路器",
    "name_source": "api",
    "original_desc": "In Breakers, choose one of eight fighters who have their own moves and special attacks. There are eight stages in the game, and each stage has two battles. The object of each battle is to drain your opponent's energy in order to win the battle. If there is a draw, a third battle takes place. If the time limit expires, the player with the less energy loses the battle. Once you have completed all eight stages, you will face a opponent that is much tougher than previous ones. Different endings and in-game dialog are viewed depending on the character that you select.",
    "desc": "在《破壞者》中，從八名擁有自己的動作和特殊攻擊的戰士中選擇一名。遊戲共有八個階段，每個階段有兩場戰鬥。每場戰鬥的目的都是消耗對手的能量以贏得戰鬥。如果平局，則進行第三場戰鬥。如果時間限製到期，則能量較少的玩家輸掉戰鬥。一旦你完成了全部八個階段，你將面對一個比之前更難對付的對手。根據您選擇的角色，會看到不同的結局和遊戲內對話。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:22",
    "desc_translated_at": "2026-01-02T13:29:22",
    "original_name_hash": "5f2068ca",
    "original_desc_hash": "4dfbf300"
  },
  "2020bb": {
    "key": "2020bb",
    "original_name": "2020 Super Baseball",
    "name": "2020 超級棒球",
    "name_source": "api",
    "original_desc": "In the year 2020, baseball finally evolved. There is no longer conventional professional baseball in 2020. Baseball designed by the Super Baseball Association has been very popular and is the best sport.\n\nHowever, the truth is that the association has used a colossal sum of money to promote Super Baseball as show business. They have manipulated each player's ability using the control computer to secretly decide victory or defeat in every game. The players who knew this removed the connecting parts of the computer to play their own game of baseball. Finally, a fair game is going to be played at Cyber Egg Stadium.\n\nIn 2020 Super Baseball is a fast-paced game with new rules, where you can select 1 of 12 individual men, women, or robot players. During play, you can make your team stronger with prizes earned from amazing catches.",
    "desc": "2020年，棒球終於進化了。2020年不再有傳統的職業棒球。超級棒球協會設計的棒球非常受歡迎，是最好的運動。\n\n然而，事實是，該協會花費了巨額資金來將超級棒球推廣為演藝事業。他們利用控制電腦操縱每個玩家的能力，暗中決定每場比賽的勝負。知道這一點的玩家移除了計算機的連接部件來玩他們自己的棒球遊戲。終於，一場公平的比賽將在賽博蛋體育場進行。\n\n2020 年超級棒球是一款採用新規則的快節奏遊戲，您可以從 12 名男子、女子或機器人球員中選擇一名。在比賽過程中，您可以通過驚人的接球獲得獎品來增強您的團隊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:34",
    "desc_translated_at": "2026-01-02T13:29:34",
    "original_name_hash": "52816e0b",
    "original_desc_hash": "f8056842"
  },
  "irrmaze": {
    "key": "irrmaze",
    "original_name": "The Irritating Maze",
    "name": "惱人的迷宮",
    "name_source": "api",
    "original_desc": "The Irritating Maze on Neo Geo is a game where you control a metal ball through a maze. The goal is to reach the finish without making contact with the electrified ledges. To further complicate the task of the player, the 3 course of the game are enhanced with various traps and time is limited.",
    "desc": "Neo Geo 上的刺激迷宮是一款控制金屬球穿過迷宮的遊戲。目標是在不接觸帶電壁架的情況下到達終點。為了使玩家的任務更加複雜，遊戲的 3 個過程中增加了各種陷阱，並且時間有限。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:45",
    "desc_translated_at": "2026-01-02T13:29:45",
    "original_name_hash": "8c6361ac",
    "original_desc_hash": "3529b9a0"
  },
  "samsh5sp": {
    "key": "samsh5sp",
    "original_name": "Samurai Shodown V Special",
    "name": "侍魂 V 特別版",
    "name_source": "api",
    "original_desc": "An ordained meeting of 28 fierce warriors begins, to precede a series of duels to the death. These individuals entrust their fates to their skill and their weapons. For those not up to the task, a cherished end in battle is their only hope. The twenty-eight Samurai characters clash in one epic title.",
    "desc": "28 名勇猛戰士的任命會議開始，隨後進行一系列生死決鬥。這些人將自己的命運託付給他們的技能和武器。對於那些無法勝任這項任務的人來說，在戰鬥中獲得寶貴的結局是他們唯一的希望。二十八個武士角色在一部史詩般的作品中展開衝突。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:29:58",
    "desc_translated_at": "2026-01-02T13:29:58",
    "original_name_hash": "6462cfae",
    "original_desc_hash": "0a3312e3"
  },
  "joyjoy": {
    "key": "joyjoy",
    "original_name": "Puzzled",
    "name": "困惑",
    "name_source": "api",
    "original_desc": "This game is a crossover between Tetris and Breakout (or Arkanoid) in that your balloon is trapped at the bottom of the puzzle, and you have to break the lines down far enough to give it a clear flight path to the top. Open up a space, and your balloon (shark-shaped if you're the boy) floats to the top, and it's on to the next floor in the tower. Sound easy? It is... at first. The tower is divided into multiple floors, with 10 stages (puzzles) per floor. There are over 50 puzzles here and the action gets pretty furious.",
    "desc": "該遊戲是俄羅斯方塊和打磚塊（或打磚塊）之間的交叉遊戲，因為你的氣球被困在拼圖的底部，你必須將線分解得足夠遠，以使其有一條清晰的飛行路徑到達頂部。打開一個空間，你的氣球（如果你是男孩的話是鯊魚形狀的）會漂浮到頂部，然後到達塔的下一層。聽起來很容易嗎？起初是這樣。塔樓分為多層，每層有 10 個階段（謎題）。這裡有 50 多個謎題，動作非常激烈。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:30:09",
    "desc_translated_at": "2026-01-02T13:30:09",
    "original_name_hash": "2ba789a2",
    "original_desc_hash": "3c6f5d06"
  },
  "rbff2": {
    "key": "rbff2",
    "original_name": "Real Bout Fatal Fury 2 : The Newcomers",
    "name": "《餓狼傳說 2》真實對決：新人",
    "name_source": "api",
    "original_desc": "SNK's Fatal Fury fighting series reaches its 7th episode bringing a lot of \"innovations\" and some significant changes, starting from characters: all the 20 fighters from previous game return with new artworks and battle stages completely redrawn, as well as some remodeled (or new) moves.\n\nThe traditional fighting system comes with sensible modifications, like the removal of both \"Rank System\" (SSS, SS, S, AAA etc.) and ground breakable objects. The match system using 2 battle plans (foreground/background) remains semi-intact, because now some battle fields (like Cheng Sinzan's stage) uses a single plane, forcing the players to use only the basic defense to avoid attacks.\n\nBut the main addition of this title (and the reason for subtitle \"The Newcomers\") are 2 new characters entering for Fatal Fury's main cast: Rick Strowd, a mysterious fighter with a particular fighting style and Li Xiangfei, a young female Chinese martial arts fighter.",
    "desc": "SNK 的《餓狼傳說》格鬥系列迎來了第七集，帶來了很多“創新”和一些重大變化，從角色開始：前作中的所有 20 名戰士都帶著新的藝術作品和完全重畫的戰鬥階段以及一些改造（或新的）動作回歸。\n\n傳統的戰鬥系統進行了合理的修改，例如刪除了“等級系統”（SSS、SS、S、AAA 等）和地面可破壞物體。使用2個作戰計劃（前景/背景）的比賽系統仍然保持半完整，因為現在一些戰場（例如鄭辛山的舞台）使用單個平面，迫使玩家只能使用基本防禦來躲避攻擊。\n\n但這個標題的主要補充（以及副標題“新人”的原因）是《餓狼傳說》主要演員陣容中加入了兩個新角色：瑞克·斯特勞德（Rick Strowd），一位具有特殊戰鬥風格的神秘戰士和李翔飛，一位年輕的中國女武術戰士。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:30:21",
    "desc_translated_at": "2026-01-02T13:30:21",
    "original_name_hash": "c2e7f72d",
    "original_desc_hash": "35630c3f"
  },
  "rbff1": {
    "key": "rbff1",
    "original_name": "Real Bout Fatal Fury",
    "name": "真正的《餓狼傳說》",
    "name_source": "api",
    "original_desc": "The fourth title of fighting Fatal Fury series. Now, you can destroy fight scene objects and the \"Fatal Fury 2\" fighters are back forming this list: Terry Bogard, Andy Bogard, Joe Higashi, Franco Bash, Mai Shiranui, Bob Wilson, Geese Howard, Billy Kane, Hon-Fu, Ryuji Yamazaki, Sokaku Mochizuki, Blue Mary, Kim Kaphwan, Jin Chonrei, Jin Chonshu and Duck King.",
    "desc": "《餓狼傳說》格鬥系列的第四部作品。現在，你可以摧毀戰斗場景對象，《餓狼傳說 2》的戰士們又回來了：Terry Bogard、Andy Bogard、Joe Higashi、Franco Bash、Mai Shiranui、Bob Wilson、Geese Howard、Billy Kane、Hon-Fu、Ryuji Yamazaki、Sokaku Mochizuki、Blue Mary、Kim Kaphwan、Jin Chonrei、Jin Chonshu 和 Duck King。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:30:33",
    "desc_translated_at": "2026-01-02T13:30:33",
    "original_name_hash": "43cf29db",
    "original_desc_hash": "129e9ad4"
  },
  "nam1975": {
    "key": "nam1975",
    "original_name": "NAM-1975",
    "name": "NAM-1975",
    "name_source": "keep",
    "original_desc": "As a soldier, you and/or a friend must travel through Vietnam to stop the scientist and his world destroying laser machine. In the game, you must shoot enemy soldiers, tanks, helicopters, jeeps, and more by aiming the machine gun cursor and shooting at them. Within each location, you can pick up more powerful weapons such as machine guns and flame throwers, but these have a limited supply of ammunition. Pressing down on the joystick while running at the same time will cause your character to perform a somersault and be invincible for a second. At the end of every location, you will need to defeat a series of bosses, which are not the same every play. Cut-scenes are viewed in between locations, and contain dramatic digitized dialogue.",
    "desc": "作為一名士兵，您和/或您的朋友必須穿越越南，阻止科學家和他的世界摧毀激光機。在遊戲中，你必須通過瞄準機槍光標並射擊敵方士兵、坦克、直升機、吉普車等。在每個地點，你都可以拾取更強大的武器，例如機槍和火焰噴射器，但這些武器的彈藥供應有限。在奔跑的同時按下操縱桿會讓你的角色翻筋斗，並獲得一秒的無敵狀態。在每個地點的最後，你都需要擊敗一系列的 Boss，這些 Boss 的每場比賽都不相同。過場動畫在地點之間觀看，並包含戲劇性的數字化對話。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:30:44",
    "desc_translated_at": "2026-01-02T13:30:44",
    "original_name_hash": "bf512f27",
    "original_desc_hash": "b7b7054a"
  },
  "twinspri": {
    "key": "twinspri",
    "original_name": "Twinkle Star Sprites",
    "name": "閃爍的星精靈",
    "name_source": "api",
    "original_desc": "Competitive shooter with flavors of Galaga, Fighting Games, and Sailor Moon.",
    "desc": "具有 Galaga、格鬥遊戲和美少女戰士風格的競技射擊遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:30:56",
    "desc_translated_at": "2026-01-02T13:30:56",
    "original_name_hash": "c3944f6d",
    "original_desc_hash": "9ab7a747"
  },
  "fatfury2": {
    "key": "fatfury2",
    "original_name": "Fatal Fury 2",
    "name": "餓狼傳說2",
    "name_source": "api",
    "original_desc": "Again, the Lone Wolves return!\n\nGeese Howard may have been defeated, but that doesn't mean all is peaceful. A new opponent, Wolfgang Krauser, has come forth to begin a new Fatal Fury tournament. The Lone Wolves return, with new faces amongst them. Only one can be declared the winner though.",
    "desc": "獨狼再次回歸！\n\n吉斯·霍華德可能被擊敗了，但這並不意味著一切都太平了。新的對手沃爾夫岡·克勞瑟 (Wolfgang Krauser) 即將開始一場新的《餓狼傳說》錦標賽。獨狼隊帶著新面孔回歸。但只有一個人可以被宣佈為獲勝者。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:31:08",
    "desc_translated_at": "2026-01-02T13:31:08",
    "original_name_hash": "58dbf496",
    "original_desc_hash": "bfb5a96c"
  },
  "mslugx": {
    "key": "mslugx",
    "original_name": "Metal Slug X : Super Vehicle-001",
    "name": "合金彈頭 X : 超級車輛-001",
    "name_source": "api",
    "original_desc": "Jump! Shoot! Evade! The time to test your reflexes has come once again! Scatter the swarms of oncoming enemies with triple the firepower (compared with past SNK games). A festival of dazzling destruction, take on the Metal Slug world, if you dare!",
    "desc": "跳！射擊！逃避！考驗你反應能力的時候又到了！以三倍的火力驅散迎面而來的敵人（與過去的 SNK 遊戲相比）。一場令人眼花繚亂的破壞盛宴，挑戰合金彈頭世界，如果你有膽量的話！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:31:20",
    "desc_translated_at": "2026-01-02T13:31:20",
    "original_name_hash": "bb8f9a3f",
    "original_desc_hash": "432d8d0e"
  },
  "kof96": {
    "key": "kof96",
    "original_name": "The King of Fighters '96",
    "name": "拳皇'96",
    "name_source": "api",
    "original_desc": "SNK's flagship series returns for another year. Many of the changes in this year's KOF release come in the form of improved graphics, sound effects, music and totally redone character sprites. The gameplay of the system has been altered with the addition of \"Rush\" multi-hit combos and new moves for practically every character. The storyline of the series receives heavy focus in this release with the Orochi Saga swinging into high-gear. Other features carried over from the previous year include the ability to choose between the default \"Team Fighting\" mode or the traditional \"Single Fighter\" style of gameplay, plus the \"Versus\" and \"Survival\" gameplay modes.",
    "desc": "SNK 旗艦系列又一年回歸。今年《拳皇》版本中的許多變化都體現在改進的圖形、音效、音樂和完全重做的角色精靈上。系統的遊戲玩法已經改變，添加了“Rush”多重連擊組合和幾乎每個角色的新動作。該系列的故事情節在本次發布中受到高度關注，《Orochi Saga》進入高潮。繼承前一年的其他功能包括可以選擇默認的“團隊戰鬥”模式或傳統的“單人戰鬥機”遊戲風格，以及“對抗”和“生存”遊戲模式。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:31:32",
    "desc_translated_at": "2026-01-02T13:31:32",
    "original_name_hash": "cdc92c44",
    "original_desc_hash": "6913bfbf"
  },
  "alpham2": {
    "key": "alpham2",
    "original_name": "Alpha Mission II",
    "name": "阿爾法任務 II",
    "name_source": "api",
    "original_desc": "The lunar nightmare of a bloody 200-year space war was thought to be over in the \"original\" ALPHA MISSION. But now with the advent of more technically sophisticated weapons, the evil \"Fulvar\" and his \"Seven Star Alliance\" have returned to destroy all planets that stand in their way of the ultimate target... Earth! Now in the year of 2525! Your mission as pilot of the new SYD-FX fighter is to use every weapon at your disposal to rid the galaxy once and for all of the evil that now dominates and threatens Earth. So suit up, hold your breath, and stand ready for unbelievable graphics and stereo sound that'll suck you into the far reaches of deep, dark inner space. Be prepared... you may never come back!",
    "desc": "長達 200 年的血腥太空戰爭的月球噩夢被認為在“最初的”阿爾法任務中結束了。但現在隨著技術更先進的武器的出現，邪惡的“Fulvar”和他的“七星聯盟”已經回來摧毀所有阻礙他們到達最終目標的行星......地球！現在是2525年！作為新型 SYD-FX 戰鬥機飛行員，你的任務是使用你可以使用的所有武器，一勞永逸地消滅銀河系現在統治和威脅地球的邪惡。因此，穿上衣服，屏住呼吸，準備好迎接令人難以置信的圖形和立體聲，這將把您帶入深處、黑暗的內部空間。做好準備……你可能再也不會回來了！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:31:43",
    "desc_translated_at": "2026-01-02T13:31:43",
    "original_name_hash": "269d7790",
    "original_desc_hash": "470b8cba"
  },
  "whp": {
    "key": "whp",
    "original_name": "World Heroes Perfect",
    "name": "世界英雄完美",
    "name_source": "api",
    "original_desc": "In the final entry in the World Heroes saga, all sixteen fighters from previous games return for another tournament. New features include:\n\n1. An all-new attack mode where you use all four buttons to attack an enemy.\n2. A power bar which grants you special abilities depending on the character.\n3. All-new stages and music set across different locations in Earth's past and future.\n4. Three secret characters to choose from, including a character new to the series",
    "desc": "在世界英雄傳奇的最後一篇中，前幾場比賽中的所有 16 名戰士都將返回參加另一場比賽。新功能包括：\n\n1.全新的攻擊模式，您可以使用所有四個按鈕來攻擊敵人。\n2. 能量條，根據角色賦予你特殊能力。\n3.全新的舞台和音樂設置在地球過去和未來的不同地點。\n4. 三個秘密角色可供選擇，包括該系列的新角色",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:31:55",
    "desc_translated_at": "2026-01-02T13:31:55",
    "original_name_hash": "8ebca9bf",
    "original_desc_hash": "d6faef6a"
  },
  "flipshot": {
    "key": "flipshot",
    "original_name": "Battle Flip Shot",
    "name": "戰鬥翻轉射擊",
    "name_source": "api",
    "original_desc": "Battle Flip Shot is an arcade game that mixes elements of Pong with Japanese character design.",
    "desc": "Battle Flip Shot 是一款融合了 Pong 元素和日本角色設計的街機遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:32:06",
    "desc_translated_at": "2026-01-02T13:32:06",
    "original_name_hash": "8669d715",
    "original_desc_hash": "8ddc2288"
  },
  "gururin": {
    "key": "gururin",
    "original_name": "Gururin",
    "name": "古魯林",
    "name_source": "api",
    "original_desc": "Your goal is to make three people of the same color line up and disappear--but to do that, you won't flip the people around as they fall but rather rotate the entire pit once they've landed. Like clothes in a dryer, you've got to flip the whole playfield around and try to match up the midgets as they slide down to the bottom of the screen, reorganizing themselves as they go.",
    "desc": "你的目標是讓三個相同顏色的人排成一排然後消失——但要做到這一點，你不會在人們墜落時翻轉他們，而是在他們落地後旋轉整個坑。就像烘乾機裡的衣服一樣，你必須翻轉整個遊戲場，並在侏儒滑落到屏幕底部時嘗試匹配它們，並在它們移動時重新組織自己。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:32:18",
    "desc_translated_at": "2026-01-02T13:32:18",
    "original_name_hash": "653195f4",
    "original_desc_hash": "0227fe67"
  },
  "legendos": {
    "key": "legendos",
    "original_name": "Legend of Success Joe",
    "name": "成功傳奇喬",
    "name_source": "api",
    "original_desc": "Joe Yabuki is a little punk wandering the streets. He was spotted by a boxing coach retired from the circuit that sees him as a future champion and decides to manage him. Such is the plot of this boxing game on Neo Geo, adapted from the manga \"Ashita no Joe\" created by Tetsuya Chiba and Asao Takamori in the 70s.",
    "desc": "矢吹喬是一個在街頭閒逛的小朋克。一位從拳擊場退休的拳擊教練發現了他，將他視為未來的冠軍並決定管理他。這就是 Neo Geo 上這款拳擊遊戲的劇情，改編自 70 年代千葉哲也和高森朝夫創作的漫畫《明日之師》。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:32:30",
    "desc_translated_at": "2026-01-02T13:32:30",
    "original_name_hash": "eda14b18",
    "original_desc_hash": "21534373"
  },
  "bangbead": {
    "key": "bangbead",
    "original_name": "Bang Bead",
    "name": "棒珠",
    "name_source": "api",
    "original_desc": "Bang Bead, known in Japan as Bang Beads, is a 2001 ball-and-paddle game developed and published by Visco exclusively for the arcade cabinet known as the SNK Neo-Geo MVS hardware. It combines the genres of the Magnavox Odyssey Tennis game, Atari's Pong and Breakout arcades, and Nintendo's Spitball Sparky of the Game & Watch series. You can select from 9 characters and play against another player or the computer. Knock out the stars behind the other player then get the bouncing ball through to win the round.",
    "desc": "Bang Bead，在日本稱為 Bang Beads，是一款由 Visco 於 2001 年開發和發行的球拍遊戲，專為稱為 SNK Neo-Geo MVS 硬件的街機櫃而開發和發行。它結合了 Magnavox Odyssey 網球遊戲、Atari 的 Pong 和 Breakout 街機遊戲以及任天堂的 Game & Watch 系列 Spitball Sparky 的類型。您可以從 9 個角色中進行選擇，並與其他玩家或計算機對戰。擊倒另一名玩家身後的星星，然後讓彈跳球通過以贏得該回合。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:32:41",
    "desc_translated_at": "2026-01-02T13:32:41",
    "original_name_hash": "73ea3e58",
    "original_desc_hash": "74081126"
  },
  "kof94": {
    "key": "kof94",
    "original_name": "The King of Fighters '94",
    "name": "拳皇'94",
    "name_source": "api",
    "original_desc": "The King of Fighters '94 is notable in that it is one of the first known fighting games that pits a team of fighters against each other in single combat. Each team consists of three fighters for each player, the winner being the player who is able to eliminate the other team first. Each active character can charge up \"Art of Fighting\" style in order to gain access to \"Desperation Moves\", or \"DMs\" (moves which operate very much like Street Fighter's Super Combos). Playing against the computer, the player must defeat all 8 teams in the game in order to reach the final boss, Rugal Bernstein.",
    "desc": "《拳皇 '94》的值得注意之處在於，它是最早已知的讓一群拳手在單人戰鬥中相互對抗的格鬥遊戲之一。每隊由三名選手組成，最先消滅另一隊的選手獲勝。每個活躍角色都可以充能“格鬥藝術”風格，以獲得“絕望招式”或“DM”（其操作方式與《街頭霸王》的超級連擊非常相似）。在與電腦對戰時，玩家必須擊敗遊戲中的全部 8 支隊伍，才能到達最終的 Boss Rugal Bernstein。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:32:53",
    "desc_translated_at": "2026-01-02T13:32:53",
    "original_name_hash": "8b01ada6",
    "original_desc_hash": "673287e0"
  },
  "roboarmy": {
    "key": "roboarmy",
    "original_name": "Robo Army",
    "name": "機器人軍隊",
    "name_source": "api",
    "original_desc": "A mad scientist decides to create an army of robots to destroy the city, capture all the citizens, and use their brains for more robots to take over the world. You control one of two robots who use its fists and special attacks to take on the army throughout a jungle stage and various buildings in the destroyed city. Robots and robot dogs sometimes leave arms or metal bars that can be used as weapons. At the end of each area, you need to defeat a boss in order to proceed to the next area.",
    "desc": "一位瘋狂的科學家決定創建一支機器人軍隊來摧毀這座城市，捕獲所有公民，並利用他們的大腦讓更多機器人接管世界。您控制兩個機器人之一，它們使用拳頭和特殊攻擊在叢林舞台和被摧毀城市的各種建築物中對抗軍隊。機器人和機器狗有時會留下可以用作武器的手臂或金屬棒。在每個區域的盡頭，您需要擊敗老闆才能進入下一個區域。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:33:05",
    "desc_translated_at": "2026-01-02T13:33:05",
    "original_name_hash": "55a4239c",
    "original_desc_hash": "edd467cc"
  },
  "kof2000": {
    "key": "kof2000",
    "original_name": "The King of Fighters 2000",
    "name": "拳皇2000",
    "name_source": "api",
    "original_desc": "The final King of Fighters game released by SNK in its original state, The King of Fighters 2000 expands on the story and gameplay presented in The King of Fighters '99. This year's tournament is sponsored by the Ikari Warriors in an attempt to discover more about the NESTS organization, and to derail the plans of potential NESTS agents K' and Maxima. Not everything is as straight-forward as it usually is, however, and even the Ikari Warriors themselves are at risk of being betrayed from within by the end of the tournament.",
    "desc": "《拳皇 2000》是 SNK 以原始狀態發行的最後一款《拳皇》遊戲，它擴展了《拳皇 '99》中的故事和遊戲玩法。今年的比賽由 Ikari Warriors 贊助，旨在更多地了解 NESTS 組織，並破壞潛在 NESTS 特工 K' 和 Maxima 的計劃。然而，並非一切都像通常那樣直接，甚至連碇勇士隊本身也面臨著在錦標賽結束時被內部背叛的風險。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:33:16",
    "desc_translated_at": "2026-01-02T13:33:16",
    "original_name_hash": "107114f6",
    "original_desc_hash": "9d7fd881"
  },
  "s1945p": {
    "key": "s1945p",
    "original_name": "Strikers 1945 Plus",
    "name": "前鋒 1945 Plus",
    "name_source": "api",
    "original_desc": "The player chooses one of six planes or can opt for a random choice. The first four stages are in random order, while the last four are sequential. Players collect weapon powerups, bombs, and gold bars for points. Each plane has a unique \"supershot\" which is charged by damaging enemies and fired by holding then releasing the fire button. Supershots can be stored, although the number varies from plane to plane. Using a bomb results in a large friendly fighter swooping onto the screen and blocking shots while returning fire for a few seconds.\n\nAfter the player beats the final boss, the game starts again from the beginning, albeit at a much higher difficulty level. All level are similar to the ones in Strikers 1945 II. Only one of the four bosses that are randomly chosen and the sixth boss is changed.",
    "desc": "玩家可以選擇六架飛機之一，也可以隨機選擇。前四個階段是隨機順序的，而後四個階段是順序的。玩家收集武器能量、炸彈和金條來獲得積分。每架飛機都有一個獨特的“超級射擊”，它可以通過傷害敵人來蓄力，並通過按住然後釋放開火按鈕來發射。超級鏡頭可以被存儲，儘管數量因飛機而異。使用炸彈會導致一架大型友方戰鬥機猛撲到屏幕上並擋住射擊，同時還擊幾秒鐘。\n\n玩家擊敗最終首領後，遊戲會從頭開始，儘管難度要高得多。所有關卡都與《Strikers 1945 II》中的類似。只有隨機選擇的四個boss中的一個和第六個boss發生了變化。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:33:28",
    "desc_translated_at": "2026-01-02T13:33:28",
    "original_name_hash": "7824cb1e",
    "original_desc_hash": "c9cca0fb"
  },
  "pgoal": {
    "key": "pgoal",
    "original_name": "Pleasure Goal : 5 on 5 Mini Soccer",
    "name": "快樂球門：5 對 5 迷你足球",
    "name_source": "api",
    "original_desc": "Released in 1996, Pleasure Goal (Japanese title: Futsal) is Saurus' first and only football (Soccer) game for the Neo Geo. It features 16 teams which compete for the \"Saurus Cup\". Your team plays against all the others in your group, then it goes into an elimination tournament's semifinals and then the final to win the cup. It's worth mentioning that Pleasure Goal's rules barely base on Futsal, which is basically a 5-on-5 player indoor soccer style.",
    "desc": "Pleasure Goal（日文名稱：Futsal）於 1996 年發布，是 Saurus 為 Neo Geo 推出的第一款也是唯一一款足球遊戲。共有 16 支球隊角逐“索魯斯盃”。您的球隊與小組中的所有其他球隊進行比賽，然後進入淘汰賽的半決賽，然後進入決賽以贏得獎杯。值得一提的是，Pleasure Goal 的規則幾乎不以五人制足球為基礎，五人制足球基本上是一種 5 對 5 的室內足球風格。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:33:40",
    "desc_translated_at": "2026-01-02T13:33:40",
    "original_name_hash": "63ece073",
    "original_desc_hash": "d0794e0b"
  },
  "ragnagrd": {
    "key": "ragnagrd",
    "original_name": "Ragnagard",
    "name": "拉格納加德",
    "name_source": "api",
    "original_desc": "This is a fighting game originaly designed in 3D , and 2D sprites transposed (known as Computer Graphics, or CG), like Donkey Kong Country or Pulstar. Story: It is a world occupied by gods, the world in which reign the god of the Arc of Orion. He decided to offer his succession in a tournament at eight gods. The winner will have access to the throne of the god of the Arc of Orion. A struggle between the gods is about to begin.",
    "desc": "這是一款最初以 3D 和 2D 精靈轉置（稱為計算機圖形或 CG）設計的格鬥遊戲，如《Donkey Kong Country》或《Pulstar》。故事： 這是一個眾神佔據的世界，獵戶座之弧之神統治的世界。他決定在八神錦標賽中獻上自己的繼承權。獲勝者將有機會登上獵戶座之弧神的寶座。眾神之間的鬥爭即將開始。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:33:51",
    "desc_translated_at": "2026-01-02T13:33:51",
    "original_name_hash": "197d26e0",
    "original_desc_hash": "85104d73"
  },
  "panicbom": {
    "key": "panicbom",
    "original_name": "Panic Bomber",
    "name": "恐慌轟炸機",
    "name_source": "api",
    "original_desc": "That one-player game consists in facing nine opponents through duels with individual screens. Each one in his playground have to stack blocks composed of three different colored helmets. Like Tetris, it is possible to rotate, move left or right or accelerate the fall of these blocks. Starting from three identical helmets lined up horizontally, vertically or diagonally, they explode and generate a bomb in the playground. When they disappear, they can initiate chain reactions, for example with the blocks lying above falling. After a certain number of removed blocks, comes an activated bomb: player have to place it in order to make the most of these bombs explode on his table.",
    "desc": "這種單人遊戲包括通過個人屏幕與九名對手進行決鬥。他的操場上的每個人都必須堆疊由三種不同顏色的頭盔組成的塊。與俄羅斯方塊一樣，可以旋轉、向左或向右移動或加速這些塊的下落。從水平、垂直或對角排列的三個相同的頭盔開始，它們在操場上爆炸並產生炸彈。當它們消失時，它們可以引發連鎖反應，例如上面的方塊掉落。移除一定數量的方塊後，就會出現一個激活的炸彈：玩家必須放置它才能使大部分炸彈在他的桌子上爆炸。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:34:03",
    "desc_translated_at": "2026-01-02T13:34:03",
    "original_name_hash": "c42352da",
    "original_desc_hash": "8923cff9"
  },
  "kizuna": {
    "key": "kizuna",
    "original_name": "Kizuna Encounter : Super Tag Battle",
    "name": "傷無遭遇戰：超級標籤對戰",
    "name_source": "api",
    "original_desc": "Fight Alone!\nCompetition or Team Battles. The Tage Battle of a Lifetime Begins!\nOr Fight with a Friend!\n\nWhy Do You Fight?! For money? For glory? For...?!\nThe Fate of 10 of the World's Mightiest Warriors Rests on the Grand Ambitions of King Lion!",
    "desc": "孤軍奮戰！\n競爭或團隊戰鬥。一生難忘的塔格之戰開始了！\n或者和朋友一起戰鬥！\n\n你為什麼打架？ ！為了錢？為了榮耀？為了...？ ！\n世界上最強大的 10 位戰士的命運取決於獅子王的宏偉野心！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:34:15",
    "desc_translated_at": "2026-01-02T13:34:15",
    "original_name_hash": "084e3834",
    "original_desc_hash": "dc8e59b7"
  },
  "wakuwak7": {
    "key": "wakuwak7",
    "original_name": "Waku Waku 7",
    "name": "哇庫哇庫 7",
    "name_source": "api",
    "original_desc": "The seven magical Waku Waku balls have surfaced once again and the few that know of their existence decide to battle against each other in order to collect them all. If they are able to defeat the powerful monster enslaved in them, the Waku Waku balls will grant the lucky victor whatever wish they desire. The game was created as a parody of animé series in general, WW7 pools together all the mainstays of the genre and has them fight against each other. From furry catgirls and effeminate, super-cool elfs to cute pokémon-like creatures and dumb and loud heroes.",
    "desc": "七個神奇的瓦庫瓦庫球再次浮出水面，少數知道它們存在的人決定互相戰鬥，以收集全部它們。如果他們能夠擊敗被奴役的強大怪物，瓦庫瓦庫球將滿足幸運的勝利者他們想要的任何願望。這款遊戲是作為一般動漫系列的模仿而創作的，《WW7》匯集了該類型的所有支柱，並讓他們互相戰鬥。從毛茸茸的貓女和柔弱、超酷的精靈，到可愛的神奇寶貝般的生物和愚蠢而大聲的英雄。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:34:26",
    "desc_translated_at": "2026-01-02T13:34:26",
    "original_name_hash": "1a6f2b5a",
    "original_desc_hash": "8a60967f"
  },
  "ssideki2": {
    "key": "ssideki2",
    "original_name": "Super Sidekicks 2 : The World Championship",
    "name": "超級夥伴2：世界錦標賽",
    "name_source": "api",
    "original_desc": "This is a soccer game on Neo-Geo. When you start the game, you go into a \"Regional Qualifying Round Final\" against another team from your region. After beating it, your team goes into the World (Cup) Tournament, in which you are grouped with three other countries in a round-robin. After winning against all of them, you go into an elimination tournament: the quarterfinals, semifinals, and the final for the World Cup. This type of tournament thus is more reminiscent of the real-life World Cup. If a match ends in a draw, you also have the option of replaying a full game, go to the penalty kick tiebreaker, or play a sudden death game.",
    "desc": "這是 Neo-Geo 上的足球遊戲。當您開始遊戲時，您將進入“地區資格賽決賽”，對陣來自您所在地區的另一支球隊。擊敗它後，您的球隊將進入世界（杯）錦標賽，您將與其他三個國家隊進行循環賽。擊敗所有人後，您將進入淘汰賽：四分之一決賽、半決賽和世界杯決賽。因此，這種類型的比賽更讓人想起現實生活中的世界杯。如果比賽以平局結束，您還可以選擇重玩整場比賽、進入點球決勝局或進行突然死亡遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:34:38",
    "desc_translated_at": "2026-01-02T13:34:38",
    "original_name_hash": "5fe37fc6",
    "original_desc_hash": "e5ca17e4"
  },
  "wh2j": {
    "key": "wh2j",
    "original_name": "World Heroes 2 Jet",
    "name": "世界英雄2噴氣機",
    "name_source": "api",
    "original_desc": "World Heroes 2 JET is the third game in the World Heroes series. A third tournament featuring warriors from all over the world (and different periods in time) has begun, and it's up to you to fight to the finish to find out who is organizing it. The game is an upgrade / fine-tuning of World Heroes 2.",
    "desc": "World Heroes 2 JET 是 World Heroes 系列的第三款遊戲。由來自世界各地（以及不同時期）的戰士參加的第三場錦標賽已經開始，你要奮戰到底，找出組織者。該遊戲是《世界英雄2》的升級/微調。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:34:49",
    "desc_translated_at": "2026-01-02T13:34:49",
    "original_name_hash": "80d65c4f",
    "original_desc_hash": "18a312d6"
  },
  "aof3": {
    "key": "aof3",
    "original_name": "Art of Fighting 3 : The Path of the Warrior",
    "name": "格鬥藝術3:戰士之路",
    "name_source": "api",
    "original_desc": "In this third and final entry in the Art of Fighting series, the story shifts from Ryo Sakazaki to his best friend and rival, Robert Garcia, as he ventures into Mexico to try and locate Freia Lawrence, a childhood friend, who asked for his help. However, he leaves without the consent of The Garcia Foundation, which sends an agent named Karman Cole to get him back. But not everything is as simple as it looks... because Robert is not the only one looking for Freia.\n\nArt of Fighting 3: The Path of The Warrior features ten playable characters with different fighting styles, a completely new fighting system based on joystick and button combinations, and incredibly detailed graphics and animation.",
    "desc": "在《格鬥藝術》系列的第三部也是最後一部中，故事從坂崎亮轉移到他最好的朋友兼競爭對手羅伯特·加西亞，他冒險進入墨西哥，試圖找到尋求他幫助的兒時朋友弗雷亞·勞倫斯。然而，他未經加西亞基金會同意就離開了，加西亞基金會派了一位名叫卡曼·科爾的特工去把他找回來。但並非一切都像看上去那麼簡單……因為羅伯特並不是唯一一個尋找弗雷亞的人。\n\n《格鬥藝術 3：戰士之路》擁有 10 個具有不同格鬥風格的可玩角色，基於操縱桿和按鈕組合的全新格鬥系統，以及令人難以置信的詳細圖形和動畫。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:35:01",
    "desc_translated_at": "2026-01-02T13:35:01",
    "original_name_hash": "2266bfda",
    "original_desc_hash": "20d6f8bd"
  },
  "overtop": {
    "key": "overtop",
    "original_name": "Over Top",
    "name": "過頂",
    "name_source": "api",
    "original_desc": "In 1991, ADK (then Alpha team) released Thrash Rally for the Neo Geo. While fun to play, it was most noted for its woefully bad graphics. Five years later, ADK released another \"look-out-for-the-next-turn!\" game called Overtop. This time they got it almost all right: Great graphics, good sounds, lots of vehicles, and kept the excellent playability of its predecessor.",
    "desc": "1991 年，ADK（當時的 Alpha 團隊）為 Neo Geo 發布了 Thrash Rally。雖然玩起來很有趣，但它最出名的是其糟糕的圖形。五年後，ADK 發布了另一篇《注意下一個回合！》遊戲名為《Overtop》。這次他們幾乎一切順利：出色的圖形、良好的聲音、大量的車輛，並保持了前作的出色可玩性。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:35:13",
    "desc_translated_at": "2026-01-02T13:35:13",
    "original_name_hash": "86932795",
    "original_desc_hash": "56a4b9f9"
  },
  "zupapa": {
    "key": "zupapa",
    "original_name": "Zupapa!",
    "name": "爸爸！",
    "name_source": "api",
    "original_desc": "Is a 2001 release of SNK for MVS. It's pretty much a puzzler / screen-cleaning game with bright and colourful optics and simple gameplay.",
    "desc": "是 SNK 2001 年發布的 MVS 版。這幾乎是一款益智/屏幕清理遊戲，具有明亮多彩的光學效果和簡單的遊戲玩法。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:35:25",
    "desc_translated_at": "2026-01-02T13:35:25",
    "original_name_hash": "6e47c9fb",
    "original_desc_hash": "14048b94"
  },
  "fatfury3": {
    "key": "fatfury3",
    "original_name": "Fatal Fury 3: Road to the Final Victory",
    "name": "餓狼傳說3：最終勝利之路",
    "name_source": "api",
    "original_desc": "An adaptation of the Neo-Geo fighting game.  2-D scrolling one-on-one fighter with pseudo-3D aspects (that allows for players to \"escape\" holds, throws, and other attacks.)  Part of the incestuously-popular SNK fighting game pantheon...",
    "desc": "Neo-Geo 格鬥遊戲的改編版。具有偽 3D 方面的 2D 滾動一對一格鬥遊戲（允許玩家“逃脫”抓握、投擲和其他攻擊。）是廣受歡迎的 SNK 格鬥遊戲萬神殿的一部分......",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:35:37",
    "desc_translated_at": "2026-01-02T13:35:37",
    "original_name_hash": "ce9d57c0",
    "original_desc_hash": "72b754ae"
  },
  "garou": {
    "key": "garou",
    "original_name": "Garou: Mark of the Wolves",
    "name": "狼人：狼之印記",
    "name_source": "api",
    "original_desc": "It's been several years since Geese Howard was defeated in a battle with Terry Bogard, a young man looking to avenge his father. Rather than looking to be saved from death after falling off his office balcony, Geese instead decided to die, and left behind his young son, Rock. Terry took Rock in and became like a big brother to him, raising the boy throughout his life.\n\nNow Rock is a teenager, and Terry is a man in his 30s, and both are about to come together in a new clash...new faces and old come together for the greatest battle yet!",
    "desc": "吉斯·霍華德 (Geese Howard) 在與特里·博加德 (Terry Bogard) 的一場戰鬥中被擊敗已經過去了幾年，特里·博加德是一位想要為父親報仇的年輕人。從辦公室陽台上摔下來後，吉斯並沒有尋求拯救，而是決定去死，並留下了他年幼的兒子洛克。特里收養了洛克，並把他當作一個大哥哥，撫養這個男孩一生。\n\n現在，洛克已是青少年，特里已是 30 多歲的男人，兩人即將在一場新的衝突中齊聚……新面孔和老面孔齊聚一堂，進行迄今為止最偉大的戰鬥！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:35:48",
    "desc_translated_at": "2026-01-02T13:35:48",
    "original_name_hash": "20140cd3",
    "original_desc_hash": "7649f601"
  },
  "shocktro": {
    "key": "shocktro",
    "original_name": "Shock Troopers",
    "name": "突擊隊",
    "name_source": "api",
    "original_desc": "Shock Troopers is a 1-2 player game where players select one of eight characters to play as. Each character has their own attack. Players also have to choose one of three routes to take. The object of the game is to go toward the end of the level and defeat the end-of-level boss, which is usually a huge vehicle. Crates that are scattered throughout the levels can be broken into to reveal new weapons and power-ups.\n\nThere is a team mode where players have to select three characters. The characters can be switched on-the-fly during gameplay, which is useful if one of them is badly injured. Players can use the other teammates until life-ups can be found.",
    "desc": "Shock Troopers 是一款 1-2 人遊戲，玩家可以從八個角色中選擇一個進行遊戲。每個角色都有自己的攻擊方式。玩家還必須選擇三條路線之一。遊戲的目標是走向關卡的盡頭並擊敗關卡結束的頭目，它通常是一輛巨大的車輛。散佈在各個關卡中的板條箱可以被打破，以揭示新的武器和能力提升。\n\n有一個團隊模式，玩家必須選擇三個角色。角色可以在遊戲過程中即時切換，如果其中一個角色受了重傷，這會很有用。玩家可以使用其他隊友，直到找到生命補充品。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:00",
    "desc_translated_at": "2026-01-02T13:36:00",
    "original_name_hash": "0bc41a99",
    "original_desc_hash": "5679bb82"
  },
  "sengoku2": {
    "key": "sengoku2",
    "original_name": "Sengoku 2",
    "name": "戰國2",
    "name_source": "api",
    "original_desc": "A sequel to Sengoku, Sengoku 2 once again casts you as two street fighting heroes caught in the midst of a supernatural attack by the undead forces of the evil Nobunaga from the Japanese sengoku period, although this time the game warps you through several time periods and locations to fight evil, from feudal Japan to WWII Europe.\n\nAs in the original, the game plays as a standard 2D side-scrolling beat 'em up, in which you have to proceed through each stage killing all enemies that cross your path and defeating the stage boss to proceed. New for the sequel is the inclusion of swords as your default weapons, which now feature both high and low attacks, as well as a block move that allows you to parry enemy attacks. Collecting orbs gives you weapon upgrades and energy attacks, as well as the ability to morph into any of the three spirits released in the original which give you a new arsenal of moves and powers.",
    "desc": "作為《戰國》的續作，《戰國 2》再次讓你扮演兩名街頭格鬥英雄，陷入日本戰國時期邪惡信長不死勢力的超自然攻擊之中，不過這一次遊戲將帶你穿越多個時間段和地點，從封建日本到二戰歐洲，與邪惡作鬥爭。\n\n與原版一樣，遊戲是標準的 2D 橫向捲軸清版遊戲，您必須完成每個階段，殺死所有遇到的敵人並擊敗階段老闆才能繼續。續作的新功能是將劍作為默認武器，現在具有高攻擊力和低攻擊力，以及可讓您招架敵人攻擊的格擋移動。收集球體可以讓你進行武器升級和能量攻擊，還可以變身為原作中釋放的三種靈魂中的任何一種，從而為你提供新的動作和力量。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:12",
    "desc_translated_at": "2026-01-02T13:36:12",
    "original_name_hash": "7eaf0bf2",
    "original_desc_hash": "41440cae"
  },
  "nitd": {
    "key": "nitd",
    "original_name": "Nightmare in the Dark",
    "name": "解除好友2：暗网",
    "name_source": "wiki",
    "original_desc": "This was an ancient story when people still believed in witchcraft.\n\nThere lived one gravedigger at a very small village in a remote region. He lived a quiet, solitary life in a corner of the cemetery. He kept away from the village people due to his very ugly appearance. One day, he found the graves were ransacked and some corpses were stolen. He didn't want the village people to find out, so he decided to eliminate the grave burglars by himself. Thus, he patrolled the cemetery every night.\n\nThere are five stages with five levels each, and each one of them has you throwing fireballs at ghouls, ghosts, goblins, and zombies. When you keep throwing fireballs at these enemies, they will ignite into a giant fireball, which you can throw at other enemies to kill them, and get the remaining treasure before moving on to the next level. At the end of the fifth level, a boss must be defeated in order to continue the game.",
    "desc": "這是一個古老的故事，當時人們還相信巫術。\n\n在一個偏遠地區的一個小村莊里住著一位掘墓人。他在墓地的一角過著安靜、孤獨的生活。由於相貌醜陋，他遠離村里人。有一天，他發現墳墓被洗劫一空，一些屍體被盜。他不想讓村里的人知道，所以他決定親自消滅盜墓賊。於是，他每天晚上都在墓地巡邏。\n\n有五個階段，每個階段有五個級別，每個階段都需要你向食屍鬼、幽靈、妖精和殭屍投擲火球。當你不斷向這些敵人扔火球時，它們會點燃成一個巨大的火球，你可以將火球扔向其他敵人殺死他們，並獲得剩餘的寶藏，然後進入下一關。在第五關結束時，必須擊敗 Boss 才能繼續遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:13",
    "desc_translated_at": "2026-01-02T13:36:13",
    "original_name_hash": "fb493ab6",
    "original_desc_hash": "79e08751"
  },
  "samsho5": {
    "key": "samsho5",
    "original_name": "Samurai Shodown V",
    "name": "侍魂 V",
    "name_source": "api",
    "original_desc": "Seven years after the fourth game in the series, Samurai Shodown returns. In the game's time frame, this is the earliest game, hence the Japanese title Samurai Spirits Zero. It takes place in 1786 from January through the later summer. The game is therefore considered a prequel to the series.\n\nThe overall gameplay was slightly altered. It is a little faster, and the Slash/Bust system has been removed. Each character now has only one version, or the Bust mode is simply replaced by a new character of very similar setup. Combo slashes, sidestepping and fatalities have also vanished. The basic moves have been modeled after the first games in the series. They consist of three types of slashes, a single kick, and various dodge maneuvers similar to Samurai Shodown II.\n\nThere are 24 characters, a familiar cast with some new faces. Unlike the previous games, it is not possible to kill your opponent.",
    "desc": "該系列第四款遊戲七年後，《侍魂曉》回歸。在遊戲的時間範圍內，這是最早的遊戲，因此日文標題為“Samurai Spirits Zero”。它發生在 1786 年，從一月到夏末。因此，該遊戲被認為是該系列的前傳。\n\n整體遊戲玩法略有改變。它有點快，並且削減/破壞系統已被刪除。每個角色現在只有一個版本，或者半身像模式只是被一個設置非常相似的新角色所取代。連擊、閃避和死亡也消失了。基本動作是根據該系列的第一場比賽建模的。它們由三種類型的斬擊、單踢和類似於《侍魂 II》的各種閃避動作組成。\n\n共有 24 個角色，既有熟悉的演員陣容，也有一些新面孔。與之前的遊戲不同，你不可能殺死你的對手。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:25",
    "desc_translated_at": "2026-01-02T13:36:25",
    "original_name_hash": "98234fd7",
    "original_desc_hash": "ff4bdfa1"
  },
  "pnyaa": {
    "key": "pnyaa",
    "original_name": "Pochi and Nyaa",
    "name": "波奇與妮雅",
    "name_source": "api",
    "original_desc": "A nice puzzle game that is pretty similar to Super Puzzle Fighter but doesnt reach the same quality level!",
    "desc": "一款不錯的益智遊戲，與 Super Puzzle Fighter 非常相似，但沒有達到相同的質量水平！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:37",
    "desc_translated_at": "2026-01-02T13:36:37",
    "original_name_hash": "3c3b5883",
    "original_desc_hash": "52aade8d"
  },
  "eightman": {
    "key": "eightman",
    "original_name": "Eight Man",
    "name": "八人",
    "name_source": "api",
    "original_desc": "The super-hero must stop the destruction of a city at the hands of a giant robot and its maker. The object, as Eightman (or Nineman), is to move left or right punching enemies and fight a boss at the end of the level. In some levels, you are chasing after a vehicle while enemies jump out at you. Power-ups can be collected along the way, which, when collected will make your kicks and punches stronger as well as give you bombs which are used to damage all enemies. If a two-player game is in progress, a spark will be between them and their bomb power will be increased.",
    "desc": "超級英雄必須阻止巨型機器人及其製造者對城市的破壞。作為八人（或九人），目標是向左或向右移動拳打敵人並在關卡結束時與老闆戰鬥。在某些關卡中，你正在追趕車輛，而敵人卻向你撲來。一路上可以收集能量道具，收集後會讓你的拳打腳踢變得更強，並為你提供炸彈，用於傷害所有敵人。如果進行兩人遊戲，兩人之間會產生火花，炸彈威力也會增加。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:36:49",
    "desc_translated_at": "2026-01-02T13:36:49",
    "original_name_hash": "ee1bea02",
    "original_desc_hash": "4d5b0c3f"
  },
  "strhoop": {
    "key": "strhoop",
    "original_name": "Street Hoop",
    "name": "街頭希望",
    "name_source": "api",
    "original_desc": "Which team is the best at 3-on-3? Choose from ten countries to find out. Shots vary according to the shooting distance. Fake dunk, aloof - a variety of techniques to choose from! Speedy! Powerful! Move your body to hip hoppin' rap music. When the power gauge reaches its max, Super Dunk sparks!",
    "desc": "哪支球隊最擅長3對3？從十個國家中選擇一個來找出答案。根據拍攝距離的不同，拍攝效果也會有所不同。假扣籃、超然——多種技法可供選擇！迅速！強大的！隨著嘻哈說唱音樂移動你的身體。當能量表達到最大值時，Super Dunk 就會火花四射！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:00",
    "desc_translated_at": "2026-01-02T13:37:00",
    "original_name_hash": "aca7d45c",
    "original_desc_hash": "11c775c6"
  },
  "doubledr": {
    "key": "doubledr",
    "original_name": "Double Dragon",
    "name": "雙龍",
    "name_source": "api",
    "original_desc": "Released around the same time as the film of the same name and loosely based on its story, this installment in the Double Dragon series also moves away from the traditional roam-the-streets-fighting to a pure one-on-one fighter. There are ten characters to choose from, including Billy and Jimmy and the game has colorful interactive backgrounds, screen zooming, over-the-top special moves and with the inclusion of double jumps, combos, charges for the losing player and counter hits, there is plenty of room for advanced fighting strategies.",
    "desc": "《雙截龍》系列的這部作品與同名電影大約在同一時間上映，並大致根據其故事改編，也從傳統的街頭格斗轉向純粹的一對一格鬥。有十個角色可供選擇，包括比利和吉米，遊戲擁有豐富多彩的互動背景、屏幕縮放、誇張的特殊動作，還包括二段跳、連擊、對失敗者的衝鋒和反擊，為高級戰鬥策略提供了足夠的空間。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:12",
    "desc_translated_at": "2026-01-02T13:37:12",
    "original_name_hash": "fc087002",
    "original_desc_hash": "0fc3046e"
  },
  "stakwin2": {
    "key": "stakwin2",
    "original_name": "Stakes Winner 2",
    "name": "賭注獲勝者 2",
    "name_source": "api",
    "original_desc": "Stakes Winner 2 is a sports game in which you get in the saddle to compete in horse races in Europe and the United States. Accelerating and sprinting at the right time while managing the horse's fatigue are the keys to a good performance. If you win, use your winnings to buy accessories and become even better at it. The handling is a bit smoother than in the first episode. The realisation is also a bit better, although the game is still very close to the first one.",
    "desc": "Stakes Winner 2 是一款體育遊戲，您將在其中參加歐洲和美國的賽馬比賽。在正確的時間加速和衝刺，同時控制馬匹的疲勞是獲得良好表現的關鍵。如果你贏了，可以用你的獎金購買配件並變得更好。處理比第一集中流暢一些。儘管遊戲仍然非常接近第一款，但實現也更好一些。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:24",
    "desc_translated_at": "2026-01-02T13:37:24",
    "original_name_hash": "737744d5",
    "original_desc_hash": "4416d4c0"
  },
  "pulstar": {
    "key": "pulstar",
    "original_name": "Pulstar",
    "name": "普爾斯塔",
    "name_source": "api",
    "original_desc": "An alien threat looms over the galaxy and only you and your trusty star fighter can defeat them.\n\nPulstar is a 2D side-scrolling shooter in which you control your ship as it makes its way past stages filled with waves after waves of enemies bent on your destruction. You can upgrade your main weapons by collecting power-ups and charging up energy allows you to release charged attacks at the cost of power-up consumption. Additionally your ship comes with an ever-prescent \"option\" gun pod that floats around your ship and which can be positioned in several configurations to help protect the ship or increase its firepower.\n\nWhile completely 2D, the game uses pre-rendered 3D sprites and includes fully animated cutscenes between each level. Also features support for two-player gameplay.",
    "desc": "銀河系上空籠罩著外星威脅，只有你和你值得信賴的星際戰士才能擊敗他們。\n\nPulstar 是一款 2D 橫向捲軸射擊遊戲，您可以在遊戲中控制您的飛船，讓它通過充滿一波又一波一波又一波一波又一波想要摧毀您的敵人的關卡。你可以通過收集能量來升級你的主要武器，並充能能量讓你以能量消耗為代價釋放蓄力攻擊。此外，你的飛船還配備了一個隨時存在的“選項”炮艙，它漂浮在你的飛船周圍，可以以多種配置定位，以幫助保護飛船或增強其火力。\n\n雖然完全是 2D 遊戲，但遊戲使用預渲染的 3D 精靈，並在每個關卡之間包含完全動畫的過場動畫。還支持兩人遊戲。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:35",
    "desc_translated_at": "2026-01-02T13:37:35",
    "original_name_hash": "c27eeee4",
    "original_desc_hash": "fb244ddf"
  },
  "neobombe": {
    "key": "neobombe",
    "original_name": "Neo Bomberman",
    "name": "新炸彈人",
    "name_source": "api",
    "original_desc": "As Bomberman, you must kill all the enemies in the level before proceeding to the next. To do this, you clear a path of blocks by setting bombs that will detonate a few seconds later, and then use the bombs to wipe out enemies. Some blocks will uncover power-ups, and depending on which ones you collect, you will receive more bombs, more lives, more time, manual bomb detonation, expanded blast zone, and the ability to move faster. In some levels some blocks will reveal eggs that you can hatch to produce a bird that you can ride on and allows you to take an additional hit from an enemy or bomb blast without losing a life.",
    "desc": "作為炸彈人，您必須殺死該關卡中的所有敵人，然後才能進入下一關卡。為此，您可以通過設置幾秒鐘後爆炸的炸彈來清除一條路徑上的方塊，然後使用炸彈消滅敵人。有些方塊會發現能量提升，根據你收集的能量提升，你將收到更多的炸彈、更多的生命、更多的時間、手動炸彈爆炸、擴大的爆炸區域以及更快移動的能力。在某些關卡中，某些方塊會顯示雞蛋，您可以孵化這些雞蛋，生成一隻可以騎在身上的鳥，並允許您承受敵人或炸彈爆炸的額外打擊而不會失去生命。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:47",
    "desc_translated_at": "2026-01-02T13:37:47",
    "original_name_hash": "a4b00430",
    "original_desc_hash": "1e6da525"
  },
  "bstars": {
    "key": "bstars",
    "original_name": "Baseball Stars Professional",
    "name": "職業棒球明星",
    "name_source": "api",
    "original_desc": "Baseball Stars Professional is the follow-up to Baseball Stars for the Nintendo Entertainment System, and features comic-style graphics. Choose from a variety of teams that include Celestial Planets, Heavenly Bodies, Shadow Demons, Battle Knights, Fabulous Superstars, and many others. Then select the field where the game is to be held: The SNK stadium or the SNK dome. Each field has the same dimensions, but their capacity varies. The game is played the same way as normal baseball. Features a VS. mode in which two players can play against each other.",
    "desc": "《棒球明星職業版》是任天堂娛樂系統《棒球明星》的後續作品，具有漫畫風格的圖形。從各種團隊中進行選擇，包括天體行星、天體、暗影惡魔、戰鬥騎士、神話般的超級巨星等等。然後選擇要舉行比賽的場地：SNK 體育場或 SNK 巨蛋。每個字段具有相同的尺寸，但其容量不同。比賽的方式與普通棒球相同。具有 VS。兩名玩家可以互相對戰的模式。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:37:59",
    "desc_translated_at": "2026-01-02T13:37:59",
    "original_name_hash": "215255b3",
    "original_desc_hash": "b54e7114"
  },
  "ghostlop": {
    "key": "ghostlop",
    "original_name": "Ghostlop",
    "name": "格甚洛普",
    "name_source": "api",
    "original_desc": "Ghost Lop is an excellent Ghostbusters themed puzzle game by Data East from 1996. It combines the fast action of an Arkanoid style game, with the quick thinking of a Bust-A-Move type game. The game was re-considered for release in 2001, but SNK's untimely demise later that same year may have ended that possibility. Data East was best known for its' Chain Reaction / Magical Drop series of puzzle games, and even later included the Ghostlop characters in one of the later releases for modern home game systems.",
    "desc": "Ghost Lop是Data East於1996年推出的一款優秀的捉鬼敢死隊主題益智遊戲。它結合了打磚塊風格遊戲的快速動作和Bust-A-Move類型遊戲的快速思維。2001 年，該遊戲被重新考慮發行，但同年晚些時候 SNK 的過早消亡可能結束了這種可能性。Data East 以其“連鎖反應/魔法掉落”系列益智遊戲而聞名，甚至後來在現代家庭遊戲系統的後續版本之一中包含了 Ghostlop 角色。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:38:10",
    "desc_translated_at": "2026-01-02T13:38:10",
    "original_name_hash": "0ceabe77",
    "original_desc_hash": "c1f1d29d"
  },
  "superspy": {
    "key": "superspy",
    "original_name": "The Super Spy",
    "name": "超級間諜",
    "name_source": "api",
    "original_desc": "Roy Heart has been asked by the CIA to wipe out terrorists who have taken over a large skyscraper of a major auto-maker in Japan. \nUsing your fists, knife, or gun, you must use the elevators to travel between floors and wipe out terrorists that try to bring you down. Each weapon has its disadvantages. The gun, for example, will only have so many bullets per life, and the knife will decrease in strength with every use. During your mission, you will also earn experience points, and meet and free hostages along the way. These hostages will heal you, fix your knife, and give you a machine gun. Some floors end with you defeating a boss, while others end at elevators. Your must reach the top of the building where you will confront the leader.",
    "desc": "中央情報局要求羅伊·哈特消滅佔領日本一家大型汽車製造商一座大型摩天大樓的恐怖分子。\n你必須使用你的拳頭、刀或槍，使用電梯在樓層之間移動，並消滅試圖將你打倒的恐怖分子。每種武器都有其缺點。例如，槍每次只能發射一定數量的子彈，而刀的強度會隨著每次使用而減弱。在執行任務期間，您還將獲得經驗值，並沿途會見並解救人質。這些人質會治愈你，修好你的刀，並給你一把機槍。有些樓層以擊敗老闆結束，而另一些樓層則以電梯結束。你必須到達建築物的頂部，在那裡你將面對領導者。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:38:22",
    "desc_translated_at": "2026-01-02T13:38:22",
    "original_name_hash": "b4168b54",
    "original_desc_hash": "101efe91"
  },
  "karnovr": {
    "key": "karnovr",
    "original_name": "Karnov's Revenge",
    "name": "卡諾夫的複仇",
    "name_source": "api",
    "original_desc": "Karnov's Revenge is a 2-D Street Fighter II clone from Data East. Choose one of 13 fighters from around the world to play as, each with their unique moves and special attacks. As usual, there are two rounds in each stage, and the object of each round is to drain your opponent's energy in order to win the battle. If there is a tie after two rounds, a third round is played. There is a time limit, and if this expires, the player with the less energy loses.",
    "desc": "《卡諾夫的複仇》是 Data East 的 2D 街頭霸王 II 克隆版。從世界各地的 13 名戰士中選擇一名進行遊戲，每位戰士都有獨特的動作和特殊攻擊。和往常一樣，每個階段有兩輪，每一輪的目標都是耗盡對手的能量以贏得戰鬥。如果兩輪後平局，則進行第三輪。有時間限制，如果超過了時間，能量較少的玩家就會失敗。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:38:34",
    "desc_translated_at": "2026-01-02T13:38:34",
    "original_name_hash": "d090ef54",
    "original_desc_hash": "449094cf"
  },
  "mslug3": {
    "key": "mslug3",
    "original_name": "Metal Slug 3",
    "name": "合金彈頭3",
    "name_source": "api",
    "original_desc": "In the third installment of the Metal Slug series, General Morden is back and he plans to establish a new world order. You guide one of the heroes: Marco, Tarma, Eri or Fio as they blast their way through sidescrolling levels with a unique theme, filled with countless enemies and difficult bosses. You have to free hostages and you can ride bizarre vehicles such as camels, elephants, tanks and robots.\n\nIn the Xbox version, additional game modes, such as Storming the Mothership and Chubby Isle Paradiso, can be unlocked upon completing the five arcade stages. A co-op mode has been included, but no online multiplayer. The only Xbox Live feature available allows you to compare singleplayer scores.",
    "desc": "在《合金彈頭》系列的第三部中，莫登將軍回來了，他計劃建立一個新的世界秩序。你將引導其中一位英雄：Marco、Tarma、Eri 或 Fio，讓他們在具有獨特主題的橫向捲軸關卡中殺出一條血路，其中充滿了無數的敵人和棘手的頭目。你必須解救人質，你可以乘坐駱駝、大象、坦克和機器人等奇異的車輛。\n\n在 Xbox 版本中，完成五個街機階段後即可解鎖額外的遊戲模式，例如風暴母艦和胖乎乎的天堂島。包含了合作模式，但沒有在線多人遊戲。唯一可用的 Xbox Live 功能允許您比較單人遊戲分數。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:38:45",
    "desc_translated_at": "2026-01-02T13:38:45",
    "original_name_hash": "a7fcd0a6",
    "original_desc_hash": "08624975"
  },
  "ssideki4": {
    "key": "ssideki4",
    "original_name": "The Ultimate 11: SNK Football Championship",
    "name": "終極11：SNK足球錦標賽",
    "name_source": "api",
    "original_desc": "Super Sidekicks 4, also known as The Ultimate 11: SNK Football Championship, is a sports retro arcade football (soccer) game created for the Neo Geo arcade system, and is the fourth of the popular Super Sidekicks series. The game features 80 national teams divided into 8 regions of the globe. Build power the more you hold the ball. Maintain your dribble and guard off against enemy steals. Amass enough foot power and kick the ball to the goal!",
    "desc": "《Super Sidekicks 4》又名《終極11：SNK足球錦標賽》，是一款專為Neo Geo街機系統打造的運動復古街機足球（足球）遊戲，是熱門Super Sidekicks系列的第四部。該比賽有分佈在全球 8 個地區的 80 支國家隊參加。持球越多，力量就越強。保持運球並防止敵人搶斷。積累足夠的腳力，將球踢向球門！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:38:57",
    "desc_translated_at": "2026-01-02T13:38:57",
    "original_name_hash": "1140bc69",
    "original_desc_hash": "93c1b6ad"
  },
  "zedblade": {
    "key": "zedblade",
    "original_name": "Zed Blade",
    "name": "劫刃",
    "name_source": "api",
    "original_desc": "You and/or a friend must choose one of three characters to play as, each with different speeds at which they control their ships. Then select three weapons to use for the front and back of your ship. During play, you must travel to every planet in the solar system, and defeat the various enemy ships and the boss near the end of the planet. Your weapons can be upgraded during the battle, and you can also collect HyperBombs if you want to do maximum damage. Contains a nice soundtrack reminiscent of early 1990s \"rave\" music.",
    "desc": "您和/或朋友必須選擇三個角色之一來玩，每個角色控制船隻的速度都不同。然後選擇三種武器用於你的船的前部和後部。在遊戲過程中，你必須前往太陽系的每一個星球，並擊敗各種敵方船隻和星球盡頭附近的boss。你的武器可以在戰鬥中升級，如果你想造成最大傷害，還可以收集超級炸彈。包含令人想起 20 世紀 90 年代早期“狂歡”音樂的美妙配樂。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:39:08",
    "desc_translated_at": "2026-01-02T13:39:08",
    "original_name_hash": "a7f93202",
    "original_desc_hash": "21512ed2"
  },
  "ncommand": {
    "key": "ncommand",
    "original_name": "Ninja Commando",
    "name": "忍者突擊隊",
    "name_source": "api",
    "original_desc": "The Mars Corporation has caused a problem in the time continuum, and it's up to the Ninja Commandos to go after Spider, leader of the MC, and stop his evil work.\n\nAs one of three Ninja Commandos, you must fight your opponents through different time periods, such as The Primitive Age, The Egyptian Era, and the Japanese Civil War Era. Each of the Ninja Commandos have their own specific style of attack and a special \"ninja trick\" super power. Boxes and other storage units can be broken to reveal power-ups that upgrade your weapons. The bosses are super-powered historical figures and include a dinosaur, a medieval samurai, an Egyptian pharaoh, etc. Cut-scenes occur between the different time periods.",
    "desc": "火星公司在時間連續體中造成了問題，忍者突擊隊有責任追捕 MC 領袖蜘蛛，並阻止他的邪惡行為。\n\n作為三名忍者突擊隊之一，你必須與不同時期的對手戰鬥，例如原始時代、埃及時代和日本內戰時代。每個忍者突擊隊都有自己特定的攻擊風格和特殊的“忍者技巧”超能力。盒子和其他存儲單元可以被打破，以顯示升級你的武器的能力。Boss都是超能力的歷史人物，包括恐龍、中世紀武士、埃及法老等。過場動畫發生在不同的時間段之間。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:39:20",
    "desc_translated_at": "2026-01-02T13:39:20",
    "original_name_hash": "90a08f0b",
    "original_desc_hash": "d464c430"
  },
  "viewpoin": {
    "key": "viewpoin",
    "original_name": "Viewpoint",
    "name": "觀點",
    "name_source": "api",
    "original_desc": "Viewpoint is a top-down orthographic perspective game in the tradition of Zaxxon. The PlayStation and Saturn versions feature 3D rendered graphics with texture maps, unlike the other versions which primarily feature shaded polygons.\n\nOne or two players (in hot-seat or cooperative mode) control a spaceship equipped with a laser cannon which can be charged (by holding the shooting button down) for a stronger blast. Besides the main weapon, three special weapons are available: a wall of fire which wipes the screen up in a wave, a nova-like blast and a circle of spherical-green homing missiles.",
    "desc": "Viewpoint 是一款繼承了 Zaxxon 傳統的自上而下的正交透視遊戲。PlayStation 和 Saturn 版本採用帶有紋理貼圖的 3D 渲染圖形，與主要採用陰影多邊形的其他版本不同。\n\n一到兩名玩家（在熱座或合作模式下）控制一艘配備激光炮的宇宙飛船，激光炮可以充電（按住射擊按鈕）以獲得更強的爆炸力。除了主要武器外，還可以使用三種特殊武器：一波波地擦過屏幕的火牆、新星般的爆炸和一圈球形綠色尋的導彈。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:39:32",
    "desc_translated_at": "2026-01-02T13:39:32",
    "original_name_hash": "75780ba1",
    "original_desc_hash": "b72adbd8"
  },
  "bjourney": {
    "key": "bjourney",
    "original_name": "Blue's Journey",
    "name": "藍色的旅程",
    "name_source": "api",
    "original_desc": "The planet of Raguy was once beautiful and peaceful, but all hell broke loose when it was invaded by the Daruma tribe. The pollution started to spread through the city. Blue was summoned to get rid of the Daruma tribe, and save Raguy from the Daruma Empire that has turned the inhabitants into slaves.\n\nYou control Blue, who only has one weapon to deal with the Darumas. You can use his leaf to whip enemies upside-down, and hurl these enemies at others. Along the way, you can get flowers for use at the shop to buy items that will help you along the way. These items include flower honey (increases stamina), swim fins (easier swimming), light safe (protects all your items), spikes, and ocarinas. Later in the game, you can also get the shopkeeper to sing you a song. This helps you break curses that are placed on you by a witch.You will also interact with other characters along the way that can also help you if you tell the truth.\n\nYou exit each stage by jumping on a huge plant. The higher up you are on this plant, the more points you are awarded. Every two or so stages, you have to defeat a boss before a guy in a devil suit offers you something. You can refuse or accept the other. If you accept the offer, you will have to pull one of four strings that will give you a life ball, more stamina, 30 flowers, cocoons, or five flowers.\n\nYou are on a time limit. If you run out of time, a black creature appears out of nowhere, and starts firing \"bird\" missiles at you.",
    "desc": "拉吉星球曾經美麗而和平，但當達摩部落入侵時，一切都陷入了混亂。污染開始向整個城市蔓延。布魯被召喚來消滅達摩部落，並從將居民變成奴隸的達摩帝國手中拯救拉吉。\n\n你控制藍色，他只有一件武器來對付達摩。你可以用他的葉子將敵人鞭打顛倒，並將這些敵人扔向其他人。一路上，您可以在商店購買鮮花來購買對您一路有幫助的物品。這些物品包括花蜜（增加耐力）、腳蹼（更容易游泳）、燈箱（保護您的所有物品）、尖刺和陶笛。遊戲後期，你還可以讓店主給你唱首歌。這可以幫助你打破女巫對你施加的詛咒。一路上你還將與其他角色互動，如果你說實話，這些角色也可以幫助你。\n\n你通過跳上一棵巨大的植物來退出每個階段。您在該工廠的地位越高，獲得的積分就越多。每隔兩個左右的階段，你必須先擊敗一個老闆，然後一個穿著魔鬼套裝的傢伙會給你一些東西。你可以拒絕也可以接受對方。如果你接受這個提議，你必須拉動四根繩子中的一根，這會給你一個生命球、更多的耐力、30朵花、繭或五朵花。\n\n你有時間限制。如果你沒時間了，一個黑色生物會突然出現，並開始向你發射“鳥”導彈。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:39:44",
    "desc_translated_at": "2026-01-02T13:39:44",
    "original_name_hash": "869b5ee2",
    "original_desc_hash": "bcec6a7d"
  },
  "magdrop2": {
    "key": "magdrop2",
    "original_name": "Magical Drop II",
    "name": "魔法掉落II",
    "name_source": "api",
    "original_desc": "In Magical Drop II, you control a clown that can grab and throw balloons. You have to match three balloons of the same colour or more vertically to pop them and clear the screen. You can hold multiple balloons of the same colour at once and cause consecutive collisions. There are special balloons that cannot be removed that easily and power-ups that clear entire rows or provide additional help.\n\nDepending of the originating country, there are different game modes:\n\n1. Survival: Play as long as you can - an endless flow of balloons appears at a rapidly increasing speed while you move up levels.\n\n2. Puzzle: You have a limited time to clear a fixed set of balloons before time runs out.\n\n3. VS Mode: Fight the CPU or a fellow player in a direct split-screen duel. Each character has specific item balloons during gameplay.",
    "desc": "在 Magical Drop II 中，您控制一個可以抓住和投擲氣球的小丑。您必須匹配三個相同顏色或更多垂直方向的氣球才能彈出它們並清除屏幕。您可以同時握住多個相同顏色的氣球並引起連續碰撞。有些特殊的氣球無法輕易移除，而能量提升可以清除整行或提供額外的幫助。\n\n根據來源國家/地區的不同，有不同的遊戲模式：\n\n1.生存：盡可能長時間地玩——當你升級時，無盡的氣球會以快速增加的速度出現。\n\n2. 謎題：在時間耗盡之前，您必須在有限的時間內清除一組固定的氣球。\n\n3. VS模式：與CPU或其他玩家進行直接分屏對決。每個角色在遊戲過程中都有特定的物品氣球。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:39:56",
    "desc_translated_at": "2026-01-02T13:39:56",
    "original_name_hash": "625cc32f",
    "original_desc_hash": "ddec405c"
  },
  "mutnat": {
    "key": "mutnat",
    "original_name": "Mutation Nation",
    "name": "突變國度",
    "name_source": "api",
    "original_desc": "The Slum... an area of town completely forgotten. No one could imagine the cruelness suffered by innocent people who were transformed into horrible mutant creatures by genetic experiments. They hovered everywhere and completely took control of the town.\n\nMutation Nation is a 1-2 player action game where you must control your hero and beat up any mutant that gets in your way, by either using your fists or one of four special attacks. A boss at the end of each area needs to be defeated if you want to proceed further through the game.",
    "desc": "貧民窟……城鎮中完全被遺忘的區域。誰都無法想像，無辜的人們被基因實驗變成了可怕的變異生物，所遭受的殘酷。他們四處盤旋，完全控制了小鎮。\n\nMutation Nation 是一款 1-2 人動作遊戲，您必須控制您的英雄，並通過使用拳頭或四種特殊攻擊之一擊敗任何擋路的變種人。如果你想繼續遊戲，就需要擊敗每個區域盡頭的頭目。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:40:08",
    "desc_translated_at": "2026-01-02T13:40:08",
    "original_name_hash": "a00bf578",
    "original_desc_hash": "240aad7b"
  },
  "kof2002": {
    "key": "kof2002",
    "original_name": "The King of Fighters 2002",
    "name": "拳皇2002",
    "name_source": "api",
    "original_desc": "The second plotless \"dream match\" in The King of Fighters series, this game sports 39 normal characters and 5 hidden characters, some of whom haven't appeared since KOF98. The King of Fighters 2002 also has five characters exclusive to the X-Box, the PS2 and/or Dreamcast systems: Shingo Yabuki, King, Geese Howard, \"Riot of the Blood\" Iori and Leopold Goenitz. Shingo and King are available on all the non-Neo Geo systems, while Geese and the rest are only available on the PS2 and X-Box platforms.\n\nThe gameplay system has also changed. The striker system and four-character teams found in the last three KOF releases have been totally removed. In their place are the old-school three man teams and the \"Advanced system\" from The King of Fighters '97 and The King of Fighters '98.",
    "desc": "《拳皇》系列中第二款無劇情的“夢幻對決”，這款遊戲擁有 39 個普通角色和 5 個隱藏角色，其中一些角色自 KOF98 以來就沒有出現過。《拳皇 2002》還擁有 X-Box、PS2 和/或 Dreamcast 系統獨有的五個角色：Shingo Yabuki、King、Geese Howard、“Riot of the Blood”Iori 和 Leopold Goenitz。Shingo 和 King 可在所有非 Neo Geo 系統上使用，而 Geese 和其他系統僅可在 PS2 和 X-Box 平台上使用。\n\n遊戲系統也發生了變化。前三款 KOF 版本中的前鋒系統和四角色隊伍已被完全刪除。取而代之的是老式的三人隊伍以及《拳皇’97》和《拳皇’98》中的“高級系統”。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:40:19",
    "desc_translated_at": "2026-01-02T13:40:19",
    "original_name_hash": "57eade30",
    "original_desc_hash": "1449e636"
  },
  "lbowling": {
    "key": "lbowling",
    "original_name": "League Bowling",
    "name": "保齡球聯賽",
    "name_source": "api",
    "original_desc": "The lanes are crowded every night with Big Time Pin Slammin' action! You call the shots selecting a right or left handed bowler. Determine ball weight, and develop the skills of the pro's as you skillfully throw a variety of shots that you control. So pop some refreshments and settle into this indoor sport like you've never seen before!",
    "desc": "每天晚上，球道上都擠滿了“Big Time Pin Slammin”活動！您可以選擇右手或左手投球手。確定球的重量，並在熟練地投出您控制的各種擊球時培養專業人士的技能。所以，帶上一些茶點，開始這項您以前從未見過的室內運動吧！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:40:31",
    "desc_translated_at": "2026-01-02T13:40:31",
    "original_name_hash": "9bf407c3",
    "original_desc_hash": "7cf6dbcf"
  },
  "crsword": {
    "key": "crsword",
    "original_name": "Crossed Swords",
    "name": "交叉的劍",
    "name_source": "api",
    "original_desc": "As a knight, you must travel the countryside fighting monsters and bandits using your sword and shield. When you enter combat the view changes to a pseudo 1st-person perspective where the body of your knight is outlined so that you can see the creatures that you are fighting. When enemies have been defeated, they drop money and power-ups. There are seven chapters in the game, and each chapter (except one) starts with you entering a merchant's shop and buying weapons using the money that you have collected so far. There are also alternate paths which take you to different parts of the game. At the start of the game, you may choose a chapter (from one to three only) you want to start at.",
    "desc": "作為一名騎士，你必須使用你的劍和盾牌在鄉村中與怪物和強盜作戰。當您進入戰鬥時，視圖會變為偽第一人稱視角，其中騎士的身體被勾勒出輪廓，以便您可以看到正在戰鬥的生物。當敵人被擊敗時，他們會掉落金錢和能量。遊戲共有七個章節，每一章（除一章外）都是從你進入商人的商店並使用你目前收集到的錢購買武器開始的。還有替代路徑可帶您前往遊戲的不同部分。遊戲開始時，您可以選擇要開始的章節（僅限一到三章）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:40:43",
    "desc_translated_at": "2026-01-02T13:40:43",
    "original_name_hash": "47f09704",
    "original_desc_hash": "43a47b0a"
  },
  "samsho": {
    "key": "samsho",
    "original_name": "Samurai Shodown",
    "name": "侍魂曉",
    "name_source": "api",
    "original_desc": "In early Japan, a man named Shiro Tokisada Amakusa preaches a heretic religion. Little does anyone know that Amakusa is really a servant of the evil Ambrosia, who took over Amakusa's body. Ambrosia wishes to shroud the world in darkness.\nNow, choose between 12 warriors (and 3 bonus characters) to fight for the honor of destroying Amakusa, and fulfilling a mission.",
    "desc": "在早期的日本，有一位名叫天草時定四郎的人宣揚異端宗教。很少有人知道天草實際上是邪惡安布羅西亞的僕人，安布羅西亞佔據了天草的身體。安布羅西亞希望將世界籠罩在黑暗之中。\n現在，從 12 名戰士（以及 3 名獎勵角色）中進行選擇，為摧毀天草並完成任務的榮譽而戰。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:40:54",
    "desc_translated_at": "2026-01-02T13:40:54",
    "original_name_hash": "2c93d625",
    "original_desc_hash": "def0d894"
  },
  "spinmast": {
    "key": "spinmast",
    "original_name": "Spin Master",
    "name": "旋轉大師",
    "name_source": "api",
    "original_desc": "An evil doctor has kidnapped John and Tom's friend, Mary, and has stolen their treasure map. Rescuing Mary and getting back all pieces of the map takes them through 5 levels of arcade-style Jump'n Shoot-action.\n\nThere are several weapons to acquire, ranging from a yo-yo (the standard weapon) to bombs, icicles, missiles and more. Weapons differ in range, shooting frequency, and power, and can be shot in all directions. Each weapon also has a unique chargeable attack as well as a super-attack (which uses up one bomb-symbol).\n\nIt is also possible to jump on enemies or perform a sliding attack.",
    "desc": "一名邪惡的醫生綁架了約翰和湯姆的朋友瑪麗，並偷走了他們的藏寶圖。營救瑪麗並取回地圖上的所有碎片，他們將經歷 5 個街機風格的跳躍射擊動作關卡。\n\n有多種武器可供獲取，從溜溜球（標準武器）到炸彈、冰柱、導彈等等。武器的射程、射擊頻率和威力各不相同，並且可以向各個方向射擊。每種武器還具有獨特的可充電攻擊以及超級攻擊（消耗一個炸彈符號）。\n\n也可以跳向敵人或進行滑動攻擊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:41:06",
    "desc_translated_at": "2026-01-02T13:41:06",
    "original_name_hash": "265bceab",
    "original_desc_hash": "8c0f357a"
  },
  "kof97": {
    "key": "kof97",
    "original_name": "The King of Fighters '97",
    "name": "拳皇'97",
    "name_source": "api",
    "original_desc": "Another year, another KOF. Additions this year come in the form of slightly improved graphics and sounds, new moves and a new game mode. Gameplay is much more plot-driven, as you have middle-bosses that can change depending on what team you select. In addition, there are several special endings which are only shown when certain \"Edit Team\" combinations are selected. New characters include the New Face Team, the Fatal Fury Outlaw Team (featuring the KOF debut of \"Blue\" Mary Ryan and Ryuji Yamazaki, and the return of Billy Kane), and Kyo's pupil Shingo Yabuki. In total, The King of Fighters '97 sports 29 separate characters.",
    "desc": "又一年，又一個KOF。今年的新增內容包括稍微改進的圖形和聲音、新動作和新遊戲模式。遊戲玩法更加受情節驅動，因為你的中層老闆可以根據你選擇的團隊而改變。此外，還有一些特殊結局只有在選擇某些“編輯團隊”組合時才會顯示。新角色包括新面孔小隊、餓狼傳說小隊（以“藍色”瑪麗·瑞恩和山崎龍二的 KOF 首秀以及比利·凱恩的回歸為特色）以及京的學生矢吹慎吾。《拳皇 97》總共有 29 個獨立角色。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:41:18",
    "desc_translated_at": "2026-01-02T13:41:18",
    "original_name_hash": "c590502a",
    "original_desc_hash": "beca4219"
  },
  "socbrawl": {
    "key": "socbrawl",
    "original_name": "Soccer Brawl",
    "name": "足球亂鬥",
    "name_source": "api",
    "original_desc": "The Cybernetic players use special kick shots and built-in arm phasers to destroy other players. Make sure your power meter is FULL when exercising these brutal tactics. Both stadiums, which are magnetically enclosed, enable you to kick or pass... off the wall! There are no fouls in this league, so watch your back or you'll get pulverized by the opposing team! You'll find here the most advanced sport in the world of soccer... SOCCER BRAWL!",
    "desc": "控制論玩家使用特殊的踢球和內置手臂移相器來摧毀其他玩家。在運用這些殘酷的策略時，請確保你的功率計已滿。兩個體育場均採用磁力封閉，可讓您從牆上踢或傳球！這個聯賽沒有犯規，所以小心你的背後，否則你會被對方球隊碾壓！您將在這裡找到足球世界中最先進的運動……足球亂鬥！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T13:41:29",
    "desc_translated_at": "2026-01-02T13:41:29",
    "original_name_hash": "5af9c9bd",
    "original_desc_hash": "4033e205"
  }
}