{
  "Android Assault - The Revenge of Bari-Arm (USA)": {
    "key": "Android Assault - The Revenge of Bari-Arm (USA)",
    "original_name": "Android Assault - The Revenge of Bari-Arm",
    "name": "Android 攻擊 - Bari-Arm 的複仇",
    "name_source": "api",
    "original_desc": "Launched by the alien planet Zias, an armada of androids has crushed the Earth's conventional space fleet. Desperate and defeated, The United Nations of Earth has no choice but to counterattack with its own living, fighting machine, Bari-Arm. Upgrade weapons to get the awesome firepower of the Thundercracker, Burning Wave and Chase Cannon.",
    "desc": "由外星球齊亞斯發射的一支機器人艦隊摧毀了地球的傳統太空艦隊。絕望和失敗的地球聯合國別無選擇，只能用自己的活生生的戰鬥機器巴里臂進行反擊。升級武器以獲得雷霆炮、燃燒波和追擊砲的強大火力。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:00",
    "desc_translated_at": "2026-01-02T15:18:00",
    "original_name_hash": "76b216f7",
    "original_desc_hash": "87f13f85"
  },
  "Batman Returns (USA)": {
    "key": "Batman Returns (USA)",
    "original_name": "Batman Returns",
    "name": "蝙蝠俠歸來",
    "name_source": "api",
    "original_desc": "Batman Returns on Mega-CD is an action game that allows the player to embody the famous batman. The objective of the game is to bring down the insecurity in Gotham City aboard your Batmobile, the Batskiboat (Jet-Ski in the sewers) or directly in single combat.",
    "desc": "Mega-CD 上的《蝙蝠俠歸來》是一款動作遊戲，讓玩家可以扮演著名的蝙蝠俠。遊戲的目標是乘坐蝙蝠車、蝙蝠船（下水道中的摩托艇）或直接在單人戰鬥中消除哥譚市的不安全局勢。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:11",
    "desc_translated_at": "2026-01-02T15:18:11",
    "original_name_hash": "797003ea",
    "original_desc_hash": "d5c69db3"
  },
  "Dark Wizard (USA)": {
    "key": "Dark Wizard (USA)",
    "original_name": "Dark Wizard",
    "name": "暗夜魔法使",
    "name_source": "wiki",
    "original_desc": "Dark Wizard on Mega CD is a role-playing game that takes the player to the heart of the kingdom of Cheshire, which has fallen into the hands of the Machiavellian Velonese. Play as one of four characters of your choice and restore order and law in a world in perdition. The combat phases are turn-based and each battle won is rewarded with experience points to upgrade the character's characteristics.",
    "desc": "Mega CD 上的《黑暗巫師》是一款角色扮演遊戲，將玩家帶到柴郡王國的中心，該王國已落入馬基雅維利派維洛尼斯之手。扮演您選擇的四個角色之一，在毀滅的世界中恢復秩序和法律。戰鬥階段是回合製的，每場胜利都會獎勵經驗值來升級角色的特性。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:13",
    "desc_translated_at": "2026-01-02T15:18:13",
    "original_name_hash": "0a37e5be",
    "original_desc_hash": "5c6be40a"
  },
  "Earthworm Jim - Special Edition (USA) (RE)": {
    "key": "Earthworm Jim - Special Edition (USA) (RE)",
    "original_name": "Earthworm Jim - Special Edition",
    "name": "蚯蚓吉姆 - 特別版",
    "name_source": "api",
    "original_desc": "This special edition includes: a password system, a new world & new hidden Areas, a new weapon, over 1000 additional frames of animation. All new CD quality soundtrack, totally new endings in two of the worlds, all the extra cool ideas and special features that Shiny couldn't fit onto the cartridge are on this special edition.",
    "desc": "這個特別版包括：密碼系統、新世界和新隱藏區域、新武器、超過 1000 幀額外的動畫。所有新的 CD 品質配樂、兩個世界的全新結局、所有 Shiny 無法安裝到盒帶上的超酷創意和特殊功能都包含在這個特別版本中。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:25",
    "desc_translated_at": "2026-01-02T15:18:25",
    "original_name_hash": "1ba09dae",
    "original_desc_hash": "13d0ec19"
  },
  "Eternal Champions - Challenge from the Dark Side (USA) (RE)": {
    "key": "Eternal Champions - Challenge from the Dark Side (USA) (RE)",
    "original_name": "Eternal Champions - Challenge From The Dark Side",
    "name": "永恆的冠軍 - 來自黑暗面的挑戰",
    "name_source": "api",
    "original_desc": "Like the first game, Eternal Champions: Challenge from the Dark Side follows the story of the Eternal Champion, who felt the balance of the universe and time had been disturbed by the deaths of key individuals who had been destined to change the world for the greater good. To restore the balance, he held a great contest in which the winner would be granted the gift of new life, allowing them to fulfill their rightful destiny. \n \nIn this second chapter, it is revealed that the Eternal Champion has an evil counterpart: the Dark Champion. The Dark Champion appears and declares that he also will enter the contest and that he has hidden four more warriors, preventing the contest from truly being fulfilled. The contestants must not only achieve the aims of the Eternal Champion but also face the Dark Champion if they want their lives back.",
    "desc": "與第一款遊戲一樣，《永恆冠軍：來自黑暗面的挑戰》講述了永恆冠軍的故事，他感到宇宙和時間的平衡因注定要為了更大的利益而改變世界的關鍵人物的死亡而受到干擾。為了恢復平衡，他舉辦了一場偉大的競賽，獲勝者將被授予新生命的禮物，讓他們完成自己應有的命運。\n\n在第二章中，我們揭示了永恆冠軍有一個邪惡的對手：黑暗冠軍。黑暗冠軍出現並宣布他也將參加比賽，並且他還隱藏了四名戰士，阻止比賽真正完成。參賽者要想重獲新生，不僅要實現永恆冠軍的目標，還要面對黑暗冠軍。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:38",
    "desc_translated_at": "2026-01-02T15:18:38",
    "original_name_hash": "c63761ed",
    "original_desc_hash": "71d9d3c9"
  },
  "Final Fight CD (USA)": {
    "key": "Final Fight CD (USA)",
    "original_name": "Final Fight Cd",
    "name": "決戰CD",
    "name_source": "api",
    "original_desc": "The game is set in the metropolis of Metro City, a town constantly plagued by crime and violence. When the mayor, Mike Haggar, promises to clean up the city, the Mad Gear gang kidnaps his daughter Jessica and warns him not to interfere. Haggar responds going on a battle across the city to free her, bringing along her boyfriend Cody, and the ninjitsu master Guy to assist him. \n \n",
    "desc": "遊戲以大都市Metro City為背景，這是一個經常受到犯罪和暴力困擾的小鎮。當市長邁克·哈格 (Mike Haggar) 承諾清理這座城市時，Mad Gear 團伙綁架了他的女兒傑西卡並警告他不要干涉。哈格回應，帶著她的男友科迪和忍術大師蓋伊前往整個城市進行戰鬥以釋放她。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:18:49",
    "desc_translated_at": "2026-01-02T15:18:49",
    "original_name_hash": "cd65180f",
    "original_desc_hash": "88c07299"
  },
  "Heart of the Alien - Out of This World Parts I and II (USA) (RE)": {
    "key": "Heart of the Alien - Out of This World Parts I and II (USA) (RE)",
    "original_name": "Heart Of The Alien - Out Of This World Parts 1 And 2",
    "name": "外星人之心 - 走出這個世界第 1 部分和第 2 部分",
    "name_source": "api",
    "original_desc": "Heart of the Alien is a cinematic platformer video game developed by Interplay Entertainment and Virgin Interactive and was released by Virgin Interactive in 1994 for the Sega CD exclusively in North America. It is a sequel to Another World and continues the story directly from where the original ended. The game switches the player's role from Another World; this time the player takes control of Buddy, the main character's alien ally from the previous game. \n \nThe story picks up immediately after the end of Another World. Buddy lands the pterodactyl in the ruins of his village, lays Lester down on a cot to rest and walks through the village, thinking of his past. This sequence contains many flashbacks of events that lead up to Buddy's capture and his and Lester's escape from prison. In the game, Buddy is searching for the red-eyed alien responsible for the destruction of his village and the imprisonment of his people. Buddy enters again the prison in search of the red-eyed alien. \n \nNear the end of the game, Lester who wakes back up, helps Buddy out, but then dies in the process. Buddy then goes to find again the red-eyed alien in a fortress. Eventually, he is able to find him and traps him in a cage with a beast that kills him. At the end of the game, Buddy gives Lester's body a ceremonial cremation. It is shown later how Buddy's village is rebuilt with its citizens living again in harmony.",
    "desc": "《異形之心》是一款由 Interplay Entertainment 和 Virgin Interactive 開發的電影平台視頻遊戲，由 Virgin Interactive 於 1994 年在北美獨家發行，並以 Sega CD 形式發行。這是《另一個世界》的續集，故事直接從原作的結尾處繼續。遊戲將玩家的角色從異世界切換；這次玩家控制的是上一款遊戲中主角的外星盟友巴迪。\n\n故事發生在異世界結束後。巴迪將翼手龍降落在村莊的廢墟上，將萊斯特放在小床上休息，然後在村莊里散步，想著他的過去。該序列包含許多導致巴迪被捕以及他和萊斯特越獄的事件的閃回。在遊戲中，巴迪正在尋找對他的村莊造成破壞並監禁他的人民負責的紅眼外星人。巴迪再次進入監獄尋找紅眼外星人。\n\n遊戲接近尾聲時，萊斯特醒來，幫助巴迪擺脫困境，但隨後在過程中死亡。巴迪隨後前往堡壘再次尋找紅眼外星人。最終，他找到了他，並將他困在籠子裡，裡面有一頭野獸殺死了他。遊戲結束後，巴迪為萊斯特的屍體舉行了火葬儀式。稍後將展示巴迪的村莊如何重建，居民們再次和諧相處。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:19:01",
    "desc_translated_at": "2026-01-02T15:19:01",
    "original_name_hash": "6f2d0dfd",
    "original_desc_hash": "9b5db9ca"
  },
  "Keio Flying Squadron (USA)": {
    "key": "Keio Flying Squadron (USA)",
    "original_name": "Keio Flying Squadron",
    "name": "慶應義塾飛行隊",
    "name_source": "api",
    "original_desc": "Keio Flying Squadron chronicles the adventures of Rami, the little bunny-suited member of the flying squadron tasked with the protection of the \"Special Holy Object\". Unfortunately as the game starts the object in question gets stolen by the evil Dr. Pon, and so Rami jumps atop her trusty dragon in pursuit of Dr. Pon.\n\nThe game plays as a classic 2D shooter with upgradable weapons and option characters, with a distinct cartoonish and family-friendly design.\n\nFeatures 7 levels and 3 difficulty settings.",
    "desc": "《慶應義塾飛行中隊》講述了拉米的冒險經歷，拉米是飛行中隊中身著兔子裝的小成員，肩負著保護“特殊聖物”的任務。不幸的是，當遊戲開始時，有問題的物體被邪惡的龐博士偷走了，因此拉米跳到她值得信賴的龍上追捕龐博士。\n\n該遊戲是一款經典的 2D 射擊遊戲，具有可升級的武器和可選角色，具有獨特的卡通風格和適合家庭的設計。\n\n具有 7 個級別和 3 種難度設置。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:19:13",
    "desc_translated_at": "2026-01-02T15:19:13",
    "original_name_hash": "573185be",
    "original_desc_hash": "a7e0ef26"
  },
  "Lords of Thunder (USA)": {
    "key": "Lords of Thunder (USA)",
    "original_name": "Lords Of Thunder",
    "name": "雷霆之主",
    "name_source": "api",
    "original_desc": "In the land of Mistral, the Garuda Empire and its six Dark Generals plan to resurrect the evil god Deoric. Duran, descendant of the knight Drak who once sealed Deoric away, sets out to stop them using Drak's mystical armors. Players can tackle the six continents in any order, each guarded by a Dark General and filled with demons. Before each stage, one of four elemental armors can be chosen, each with unique attacks that can be powered up with jewels. Crystals dropped by enemies can be spent between levels on health, bombs, and continues. After clearing all six continents, the final battle against Sornbul awaits.",
    "desc": "在米斯特拉爾大陸，嘉魯達帝國及其六位黑暗將軍計劃復活邪神德奧里克。杜蘭是曾經封印迪奧瑞克的騎士德拉克的後裔，他開始使用德拉克的神秘盔甲阻止他們。玩家可以以任意順序攻克六大大陸，每片大陸都由黑暗將軍守護，充滿了惡魔。在每個階段之前，可以選擇四種元素盔甲之一，每種盔甲都有獨特的攻擊，可以用珠寶增強。敵人掉落的水晶可以在關卡之間用於生命值、炸彈和繼續。清除所有六大洲後，與索恩布爾的最終戰鬥正在等待著。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:19:24",
    "desc_translated_at": "2026-01-02T15:19:24",
    "original_name_hash": "8f286fcb",
    "original_desc_hash": "2491a7b1"
  },
  "Lunar - Eternal Blue (USA) (RE)": {
    "key": "Lunar - Eternal Blue (USA) (RE)",
    "original_name": "Lunar - Eternal Blue",
    "name": "月亮 - 永恆之藍",
    "name_source": "api",
    "original_desc": "Come back to the enchanting world of Lunar! Join Hiro and Ruby 1,000 years after the first adventure, as they work to unlock the secrets of the Blue Spire and the strange young girl they found within it! But be careful! Forces are at work trying to revive the evil Zophar and immerse Lunar in darkness forever! Journey to distant lands in search of the Goddess Althena, who may be the only one powerful enough to stop Zophar. Along the way, you'll meet exciting new characters, fight fully animated monsters, traverse snow-covered peaks, and crawl through slimy dungeons as you work towards the terrifying climax!",
    "desc": "回到迷人的月球世界！在第一次冒險 1000 年後，與阿宏和魯比一起，努力解開藍色尖塔的秘密以及他們在其中發現的奇怪的年輕女孩！但要小心！各種力量正在努力復活邪惡的瑣法，並讓月球永遠陷入黑暗！前往遙遠的土地尋找女神阿爾西娜，她可能是唯一有能力阻止瑣法的女神。一路上，你會遇到令人興奮的新角色，與完全動畫的怪物戰鬥，穿越白雪覆蓋的山峰，爬過粘糊糊的地牢，努力達到可怕的高潮！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:19:36",
    "desc_translated_at": "2026-01-02T15:19:36",
    "original_name_hash": "9d6bbe0b",
    "original_desc_hash": "12024951"
  },
  "Lunar - The Silver Star (USA) (RE)": {
    "key": "Lunar - The Silver Star (USA) (RE)",
    "original_name": "Lunar - The Silver Star",
    "name": "月球 - 銀星",
    "name_source": "api",
    "original_desc": "Welcome to the world of Lunar, where dragons yet live and magic is valued above all else. Join Alex, the young adventurer as he begins a quest with his friends to save their land from the crushing advances of the Magic Emperor. Explore dungeons, fight terrifying monsters, and gather information from the locals as you advance toward the explosive confrontation with the Magic Emperor himself! Exciting, menu-driven combat will keep you challenged until the last. And thanks to the storage power of the CD, Lunar contains awesome animation sequences that'll get you involved in the story -- fast! Get ready for the ride of your life...",
    "desc": "歡迎來到月球世界，這裡還生活著龍，魔法的價值高於一切。加入年輕的冒險家亞歷克斯，與他的朋友們一起開始探索，從魔法皇帝的毀滅性進攻中拯救他們的土地。探索地下城，對抗可怕的怪物，並從當地人那裡收集信息，與魔帝本人進行爆炸性的對抗！令人興奮的、菜單驅動的戰鬥將讓你保持挑戰直到最後。得益於 CD 的存儲能力，Lunar 包含精彩的動畫序列，讓您快速融入故事之中！準備好迎接你的人生之旅吧……",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:19:48",
    "desc_translated_at": "2026-01-02T15:19:48",
    "original_name_hash": "ec0e6013",
    "original_desc_hash": "a7e80694"
  },
  "Flink (USA)": {
    "key": "Flink (USA)",
    "original_name": "Misadventures Of Flink, The",
    "name": "Flink 的不幸遭遇",
    "name_source": "api",
    "original_desc": "The Misadventures of Flink is a Jump'n Run set in the fantasy world of Imagica. The evil wizard Wicked Wainwright has captured the four elders and it is up to Flink, a wizard's apprentice, to set them free and defeat Wicked Wainwright.\n\nApart from the usual platformer elements, the game has a unique feature: Flink's ability to create spells. Whenever the game is paused, Flink can combine three ingredients to create a spell. Ingredients can be collected throughout the game. They are usually carried around by a certain type of enemy or hidden in treasure chests. There are ten different spells, the \"recipes\" which are contained in scrolls that are given to Flink by rescued elders or found within certain levels. The spells include different attack spells (for example a demon that accompanies Flink and attacks his enemies), a shield spell, a shrink spell, a quick grow spell that lets certain plants grow so that Flink can reach new areas of a level, magic keys that open locked treasure chests and more. \nCasting spells uses up magic energy that can be replenished by collecting magic bottles or defeating enemies. Similar to the Sonic games, when Flink is hit, he looses all of his magic energy and has only limited time to pick it up again. If he is hit while having no magic energy, he loses a life.",
    "desc": "The Misadventures of Flink 是一款以 Imagica 奇幻世界為背景的 Jump'n Run 遊戲。邪惡巫師邪惡的溫賴特俘虜了四位長老，巫師學徒弗林克必須解救他們並擊敗邪惡的溫賴特。\n\n除了常見的平台遊戲元素外，該遊戲還有一個獨特的功能：Flink 創造咒語的能力。每當遊戲暫停時，Flink 就可以結合三種成分來創建咒語。可以在整個遊戲過程中收集原料。它們通常被某種類型的敵人攜帶或隱藏在寶箱中。有十種不同的咒語，“食譜”包含在由獲救的長老給予弗林克的捲軸中或在某些級別中找到。這些法術包括不同的攻擊法術（例如陪伴 Flink 並攻擊敵人的惡魔）、護盾法術、收縮法術、讓某些植物生長以便 Flink 能夠到達關卡新區域的快速生長法術、打開上鎖寶箱的魔法鑰匙等等。\n施展法術會消耗魔法能量，可以通過收集魔法瓶或擊敗敵人來補充魔法能量。與索尼克遊戲類似，當弗林克被擊中時，他會失去所有的魔法能量，並且只有有限的時間來重新拾取它。如果他在沒有魔法能量的情況下被擊中，他就會失去生命。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:00",
    "desc_translated_at": "2026-01-02T15:20:00",
    "original_name_hash": "10092594",
    "original_desc_hash": "b8ccf730"
  },
  "Popful Mail (USA) (RE)": {
    "key": "Popful Mail (USA) (RE)",
    "original_name": "Popful Mail",
    "name": "充滿郵件",
    "name_source": "api",
    "original_desc": "In this platform action game, you play as a cute bounty hunter known as Popful Mail. While you might think that a cute Anime chick would have no trouble making a living slashing bad guys with her sword, Popful is having a hard time making ends meet.  One day, however, Popful learns about a magician who has gone rogue and has a hefty bounty on his head. So, her adventure begins as Popful fights her way through a new adventure, and makes new friends along the way.\n\nPrimarily this is an action game with very slight RPG elements. As you make your way through the plethora of levels, you will have to collect money from slain foes. You use this money in the shops to buy weapons, armor, health, and so on. Also, this game features interaction with many, many characters through both on-screen dialog and fully animated sequences. Some of these characters become playable as you progress through the game.\n\nThis release has the same story and general gameplay style as the  earlier version, but otherwise was made from scratch, having entirely different graphics, locations, enemies, challenges, etc.",
    "desc": "在這款平台動作遊戲中，您將扮演一位可愛的賞金獵人，名為 Popful Mail。雖然你可能認為一個可愛的動漫小妞會毫不費力地用她的劍砍壞人為生，但 Popful 卻很難維持收支平衡。然而有一天，波普福爾得知一名魔術師變得無賴，並懸賞巨額懸賞追捕他的人頭。因此，她的冒險開始了，Popful 奮力完成新的冒險，並一路上結識了新朋友。\n\n這主要是一款帶有少量 RPG 元素的動作遊戲。當你通過眾多關卡時，你將不得不從被殺的敵人那裡收集金錢。你可以用這些錢在商店裡購買武器、盔甲、生命值等等。此外，這款遊戲還可以通過屏幕對話和全動畫序列與許多角色進行互動。隨著遊戲的進展，其中一些角色將變得可玩。\n\n此版本與早期版本具有相同的故事和一般遊戲風格，但其他方面是從頭開始製作的，具有完全不同的圖形、位置、敵人、挑戰等。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:12",
    "desc_translated_at": "2026-01-02T15:20:12",
    "original_name_hash": "35d80ca2",
    "original_desc_hash": "d36fbc24"
  },
  "Rise of the Dragon (USA) (Rerelease) (RE)": {
    "key": "Rise of the Dragon (USA) (Rerelease) (RE)",
    "original_name": "Rise of the Dragon",
    "name": "龍之崛起",
    "name_source": "api",
    "original_desc": "A futuristic adventure game that borrows graphical elements from Blade Runner (in fact, the title character's name is \"Blade Hunter\").  You must find out what is killing--by horrible, spontaneous mutation--inhabitants of the city, before it's too late.  An oriental cult, drugs, and street informants are among the places you find clues.",
    "desc": "一款借用《銀翼殺手》圖形元素的未來冒險遊戲（事實上，標題角色的名字是“刀片獵人”）。你必須找出是什麼通過可怕的自發突變殺死了城市居民，以免為時已晚。東方邪教、毒品和街頭線人都是你可以找到線索的地方。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:23",
    "desc_translated_at": "2026-01-02T15:20:23",
    "original_name_hash": "fd9cdce0",
    "original_desc_hash": "3ca05284"
  },
  "Road Avenger (USA)": {
    "key": "Road Avenger (USA)",
    "original_name": "Road Avenger",
    "name": "公路復仇者",
    "name_source": "api",
    "original_desc": "Road Avenger dates from the era when interactive movies (e.g. Dragon's Lair, Escape from Cybercity, Time Gal...) with film-quality graphics, but limited player movement, were highly popular.\n\nPlayers assume the role of an angry cop on a wild ride as he pursues a gang of bikers who killed his wife. Players need to race through oncoming traffic, squeeze between trucks, trash motorcycles and steer through lots of explosions. The only thing needed are quick reflexes to follow the instructions on the screen (with an increasing difficulty) in order to keep the animation going.\n\nThe action is shown from a first-person view and fast-paced, while still maintaining smooth and detailed anime drawn graphics.",
    "desc": "《Road Avenger》可以追溯到具有電影品質圖形但玩家動作有限的互動電影（例如《龍之巢穴》、《逃離網絡城》、《時光女孩》……）非常流行的時代。\n\n玩家扮演一名憤怒的警察，在狂野的騎行中追捕殺害他妻子的一夥騎車人。玩家需要在迎面而來的車流中競速，擠在卡車、垃圾摩托車之間，並通過大量的爆炸。唯一需要的是快速反應以遵循屏幕上的說明（難度越來越大），以保持動畫繼續進行。\n\n該動作以第一人稱視角和快節奏呈現，同時仍然保持流暢和詳細的動畫繪製圖形。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:35",
    "desc_translated_at": "2026-01-02T15:20:35",
    "original_name_hash": "ad9c9f2d",
    "original_desc_hash": "bb1ce5d7"
  },
  "Road Rash (USA)": {
    "key": "Road Rash (USA)",
    "original_name": "Road Rash",
    "name": "路疹",
    "name_source": "api",
    "original_desc": "This is a remake of the original Road Rash from the early nineties. For those who have not played the original, you are competing against thirteen other \"Road Rashers\" who will stop at nothing to win 1st, 2nd, or 3rd place. During the race, you have two options available to you: you can either do your best to cross the finish line, or use your weapon to bring the Rashers to the ground if they are giving you trouble. If you do the latter, your opponents will do the same to you during the next race that takes place. \n\nThere are five circuits to race: The City, The Peninsula, Pacific Highway, Sierra Nevada, and Napa Valley. Some of these circuits are dangerous. As well as the obstacles and traffic that you encounter along the way, there are also cops driving on bikes who will arrest you if you happen to crash or stop your bike near them, and you have to pay a fine in order to get in any more races. Your bike will be wrecked if you crash too many times, and you have to pay for damages, but the amount you have to pay depends on the bike that you are riding. Once you have completed the first five circuits, you have to race them again another four times - but at a much more difficult level. Manage to win all five circuits on all levels, and you win the Road Rash cup.\n\nThere are about five bikes to choose from, which are divided into three groups. Rat, Sport, and Super. You start the first level with a Rat bike, but as you proceed through the levels, it is important to pick bikes from a different bike class.\n\nIf you have no plans to win the Road Rash cup, you can choose the game's Thrash mode. The difference between this and the other mode is that there is no money involved (ie: you are not allowed to buy bikes), and you are competing against fourteen opponents. And if you wreck your bike or you get busted, you have to start all over again. Regardless of the mode you pick, you will always start in the last place.\n\nThe remake also contains FMV movies that usually depict the outcome of the races, as well as limited songs performed by various recording artists, including Soundgarden, Therapy?, Monster Magnet, and Swervedriver. These songs can be changed on-the-fly via the game's options menu.",
    "desc": "這是九十年代初原版《Road Rash》的翻拍版。對於那些沒有玩過原版的人來說，您將與其他 13 名“Road Rashers”競爭，他們將不惜一切代價贏得第一、第二或第三名。在比賽期間，你有兩種選擇：你可以盡最大努力衝過終點線，或者在 Rasher 給你帶來麻煩時使用你的武器將他們擊倒在地。如果您這樣做，您的對手將在下一場比賽中對您做同樣的事情。\n\n有五個賽道可供比賽：城市賽道、半島賽道、太平洋公路賽道、內華達山脈賽道和納帕谷賽道。其中一些電路是危險的。除了沿途遇到的障礙和交通之外，還有騎自行車的警察，如果您碰巧撞車或將自行車停在他們附近，他們會逮捕您，並且您必須支付罰款才能參加更多比賽。如果你撞車次數太多，你的自行車就會被毀壞，你必須支付損害賠償金，但你需要支付的金額取決於你騎的自行車。一旦你完成了前五場比賽，你就必須再參加四次比賽 - 但級別要高得多。設法贏得所有級別的所有五個賽道，您就贏得了 Road Rash 杯。\n\n大約有五輛自行車可供選擇，分為三組。老鼠、運動和超級。您從一輛老鼠自行車開始第一個關卡，但當您繼續完成各個關卡時，從不同的自行車類別中挑選自行車非常重要。\n\n如果您沒有計劃贏得 Road Rash 杯，您可以選擇遊戲的 Thrash 模式。這種模式與其他模式的區別在於，不涉及金錢（即：您不能購買自行車），並且您將與十四個對手競爭。如果你毀壞了你的自行車或者被抓了，你就必須重新開始。無論您選擇哪種模式，您都將始終從最後一個位置開始。\n\n翻拍版還包含通常描述比賽結果的 FMV 電影，以及由 Soundgarden、Therapy?、Monster Magnet 和 Swervedriver 等多位唱片藝術家演奏的有限歌曲。這些歌曲可以通過遊戲的選項菜單即時更改。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:47",
    "desc_translated_at": "2026-01-02T15:20:47",
    "original_name_hash": "a5354dc9",
    "original_desc_hash": "fcceab59"
  },
  "Secret of Monkey Island, The (USA) (RE)": {
    "key": "Secret of Monkey Island, The (USA) (RE)",
    "original_name": "Secret Of Monkey Island ,the",
    "name": "猴島的秘密",
    "name_source": "api",
    "original_desc": "Deep in the Caribbean lies Melee Island, ruled by the beautiful governor Elaine Marley. The cruel pirate LeChuck is deeply in love with her - so deeply that he refuses to accept his own death! As a ghost, he dwells with his undead crew somewhere near the mysterious Monkey Island. You are Guybrush Threepwood, a young man whose only wish is to become a real pirate. At the Scumm Bar you meet three pirates who tell you'll have to complete three difficult tasks in order to be worthy of this title. Could Guybrush ever suspect that while trying to complete those tasks, he will encounter the governor Elaine Marley, fall in love with her, and face the anger of the dreadful ghost pirate LeChuck?! This is when Guybrush' adventure truly begins!\n\nThe Secret of Monkey Island is an adventure game that utilizes the command verb-based SCUMM interface first introduced in  Maniac Mansion: you construct commands for Guybrush by clicking on the appropriate verb, and then clicking on the inventory item or an object in the room you want to interact with. It is the first LucasArts' adventure game in which it is impossible to get irrevocably stuck or to die. The branching dialogue system, where you choose one of the available responses while talking to people, allows you to talk to characters in different ways without fearing a wrong choice. There are plenty of inventory-based puzzles to solve, and even \"insult swordfighting\" to participate in, where Guybrush has to prove his wit is as sharp as his sword!",
    "desc": "加勒比海深處坐落著米利島，由美麗的總督伊萊恩·馬利統治。殘忍的海盜勒查克深深地愛著她——愛得深到他不肯接受自己的死亡！作為一個幽靈，他和他的亡靈船員居住在神秘的猴島附近的某個地方。你是 Guybrush Threepwood，一個唯一的願望就是成為一名真正的海盜的年輕人。在人渣酒吧，您遇到了三名海盜，他們告訴您必須完成三項艱鉅的任務才能配得上這個稱號。蓋布拉什是否曾懷疑，在嘗試完成這些任務的過程中，他會遇到總督伊萊恩·馬利，愛上她，並面對可怕的幽靈海盜勒查克的憤怒？ ！這就是 Guybrush 的冒險真正開始的時候！\n\n《猴島的秘密》是一款冒險遊戲，它利用了 Maniac Mansion 中首次引入的基於命令動詞的 SCUMM 界面：您可以通過單擊相應的動詞來構建 Guybrush 的命令，然後單擊庫存物品或房間中您想要交互的對象。這是 LucasArts 推出的第一款冒險遊戲，玩家不可能陷入不可挽回的困境或死亡。分支對話系統，您在與人交談時選擇可用的響應之一，允許您以不同的方式與角色交談，而不必擔心錯誤的選擇。有大量基於庫存的謎題需要解決，甚至還有“侮辱劍術”需要參與，Guybrush 必須證明他的智慧和他的劍一樣鋒利！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:20:58",
    "desc_translated_at": "2026-01-02T15:20:58",
    "original_name_hash": "3cc3321c",
    "original_desc_hash": "496bfd35"
  },
  "Shining Force CD (USA) (5R, 6R)": {
    "key": "Shining Force CD (USA) (5R, 6R)",
    "original_name": "Shining Force Cd",
    "name": "光輝力量CD",
    "name_source": "api",
    "original_desc": "This is a compilation of two strategy RPG titles from Shining Force titles:  Shining Force Gaiden (the original version released in Japan only), and its sequel, known outside of Japan as  Shining Force II: The Sword of Hajya, both for GameGear. In those games you control Nick, the Prince of Cypress. In the first game his task is to rescue Arni, the princess of Gardiana; in the second game, he has to conquer his kingdom back, that was captured by the evil empire of Iom. The re-release includes re-mastered graphics and higher quality music.",
    "desc": "這是《光輝力量》兩款策略 RPG 遊戲的合集：《光輝外傳》（原版僅在日本發行）及其續集（在日本以外地區稱為《光輝力量 II：哈吉亞之劍》），均由 GameGear 製作。在這些遊戲中，你控制柏樹王子尼克。在第一場比賽中，他的任務是營救加爾迪亞納公主阿爾尼；在第二場比賽中，他必須奪回被邪惡帝國伊奧姆佔領的王國。重新發行的版本包括重新製作的圖形和更高質量的音樂。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:21:10",
    "desc_translated_at": "2026-01-02T15:21:10",
    "original_name_hash": "255c0ecb",
    "original_desc_hash": "e426f37b"
  },
  "Silpheed (USA)": {
    "key": "Silpheed (USA)",
    "original_name": "Silpheed",
    "name": "西爾菲德",
    "name_source": "api",
    "original_desc": "Silpheed for the Sega CD is a shoot-'em-up sequel to the PC title of the same name. Gameplay is similar: this is basically a 2D shooter with 3D graphics.  You move your ship in a 2D plane that reaches into the screen, kind of like a pinball table. The Sega CD version of Silpheed uses pre-rendered video for the backdrops, and filled polygon graphics for the player ship and enemies. \n\nThe story here is typical for a game of this type. The central computer system controlling the galaxy network has been hacked by terrorists.  The terrorists are using the computer to attack colony planets throughout the system.  You are the Galaxy Union's last resort: you must fight your way across 11 stages to reach Earth, and re-take control of the computer.",
    "desc": "Silpheed for the Sega CD 是同名 PC 遊戲的射擊遊戲續作。遊戲玩法類似：這基本上是一款具有 3D 圖形的 2D 射擊遊戲。你可以在一個伸入屏幕的二維平面上移動你的飛船，有點像彈球桌。Silpheed 的世嘉 CD 版本使用預渲染視頻作為背景，並為玩家飛船和敵人使用填充的多邊形圖形。\n\n這裡的故事是此類游戲的典型故事。控制銀河網絡的中央計算機系統已被恐怖分子入侵。恐怖分子正在利用計算機攻擊整個星系的殖民地行星。你是銀河聯盟的最後手段：你必須殺出一條血路，穿越 11 個階段才能到達地球，並重新控制計算機。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:21:21",
    "desc_translated_at": "2026-01-02T15:21:21",
    "original_name_hash": "7bb96a92",
    "original_desc_hash": "c18e85cc"
  },
  "Snatcher (USA)": {
    "key": "Snatcher (USA)",
    "original_name": "Snatcher",
    "name": "搶奪者",
    "name_source": "api",
    "original_desc": "A.D. 2047. Neo Kobe City, Japan, a place of madness and decadence... A mysterious Bio-roid life form has appeared. Its true nature and purpose are unknown. Is it some country's secret weapon, or an alien from another world? They slay their victims and take their place, earning them the nickname \"SNATCHERS.\" A new police division - J.U.N.K.E.R.s - has been formed. They are trained specifically to combat the SNATCHERS. The fate of mankind hangs in the balance. The war between the SNATCHERS and J.U.N.K.E.R.s has begun!",
    "desc": "公元2047年，日本新神戶市，一個瘋狂和頹廢的地方……一種神秘的仿生生命體出現了。其真實性質和目的尚不清楚。是某個國家的秘密武器，還是來自另一個世界的外星人？他們殺死受害者並取代他們的位置，為他們贏得了“搶奪者”的綽號。一個新的警察部門——J.U.N.K.E.R.s——已經成立。他們經過專門訓練來對抗掠奪者。人類的命運懸而未決。SNATCHERS 和 J.U.N.K.E.R. 之間的戰爭已經開始！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:21:33",
    "desc_translated_at": "2026-01-02T15:21:33",
    "original_name_hash": "a7160888",
    "original_desc_hash": "501a3444"
  },
  "Sonic CD (USA) (RE125)": {
    "key": "Sonic CD (USA) (RE125)",
    "original_name": "Sonic The Hedgehog Cd",
    "name": "Sonic The Hedgehog Cd",
    "name_source": "keep",
    "original_desc": "This is a standard Sonic the Hedgehog side-scrolling action game. Dr. Robotnik has taken over the Little Planet, captured Amy, and created Metal Sonic with the goal of collecting all the Time Stones to be able to manipulate time and conquer the world.  It is up to Sonic to stop him, by rushing through levels set in different time periods, collecting Time Stones.\n\nSonic CD has features that take advantage of the CD format such as CD audio, video clips, and more levels (over 50 in total).",
    "desc": "這是一款標準的刺猬索尼克橫向捲軸動作遊戲。機器人博士接管了小星球，俘虜了艾米，並創造了金屬索尼克，目標是收集所有時間寶石，以便能夠操縱時間並征服世界。索尼克需要通過衝過不同時間段的關卡並收集時間寶石來阻止他。\n\nSonic CD 具有利用 CD 格式的功能，例如 CD 音頻、視頻剪輯和更多級別（總共超過 50 個）。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:30",
    "desc_translated_at": "2026-01-25T16:21:01",
    "original_name_hash": "f32d60b9",
    "original_desc_hash": "394d0377"
  },
  "SoulStar (USA)": {
    "key": "SoulStar (USA)",
    "original_name": "Soul Star",
    "name": "弑星者",
    "name_source": "wiki",
    "original_desc": "Soulstar for the Sega CD/Mega CD is a 3D shoot-'em up that combines several different types of gameplay into one game. Some levels in this game are on a fixed path, similar to Space Harrier or Star Fox. Other levels allow your space craft to hover freely around a 3D environment, and in other levels your craft transforms into a walker robot for close-up attacks.",
    "desc": "Soulstar for the Sega CD/Mega CD 是一款 3D 射擊遊戲，將多種不同類型的遊戲玩法結合到一款遊戲中。該遊戲中的某些關卡位於固定路徑上，類似於“太空鷂”或“星際火狐”。其他關卡允許您的太空飛船在 3D 環境中自由懸停，而在其他關卡中，您的太空飛船會轉變為步行機器人以進行近距離攻擊。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:21:37",
    "desc_translated_at": "2026-01-02T15:21:37",
    "original_name_hash": "beaa4824",
    "original_desc_hash": "c96f1259"
  },
  "Terminator, The (USA)": {
    "key": "Terminator, The (USA)",
    "original_name": "Terminator, The",
    "name": "終結者",
    "name_source": "api",
    "original_desc": "Similar to adaptations of The Terminator on other systems, the Sega CD game is a platformer where the player controls Kyle Reese, who travels back in time from the year 2029 to protect Sarah Connor from the unstoppable killing machine known as the Terminator.\n\nThe game consists of 10 levels. Future locations include the post-apocalyptic wasteland of 2029 Los Angeles and the time displacement complex. In the present of 1984, Reese must traverse the streets and rooftops of L.A., as well as the Tech Noir club, the police station, and, for the finale, an automated factory. \n\nReese is armed with a gun with unlimited ammo as well as a limited number of grenades to dispatch the many enemies, including Terminators and HKs in the future and punks in the present. In addition to these, several bosses must also be fought. The boss battles include several encounters with the Terminator, who naturally cannot be completely destroyed until the finale, but must be driven back to keep him from harming Sarah.\n\nBetween levels, the game shows small digitized clips from the film that advance the storyline. The game also features a fully CD-based soundtrack with tracks ranging from heavy rock to electronic tunes.",
    "desc": "與其他系統上的《終結者》改編作品類似，世嘉 CD 遊戲是一款平台遊戲，玩家控制凱爾·里斯 (Kyle Reese)，她從 2029 年回到過去，保護莎拉·康納 (Sarah Connor) 免遭被稱為“終結者”的不可阻擋的殺人機器的侵害。\n\n遊戲由 10 個級別組成。未來的地點包括 2029 年洛杉磯的後世界末日荒地和時間位移綜合體。1984 年的現在，里斯必須穿越洛杉磯的街道和屋頂，以及 Tech Noir 俱樂部、警察局，最後還要穿越一座自動化工廠。\n\n里斯手持一把無限彈藥的槍和有限數量的手榴彈來消滅眾多敵人，包括未來的終結者和HK以及現在的朋克。除了這些之外，還必須要打幾個boss。Boss 戰包括與終結者的多次遭遇，終結者自然無法在結局之前被完全摧毀，但必須將其擊退以防止他傷害莎拉。\n\n在關卡之間，遊戲會展示電影中推動故事情節的數字化小片段。該遊戲還具有完全基於 CD 的配樂，曲目範圍從重搖滾到電子音樂。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:21:49",
    "desc_translated_at": "2026-01-02T15:21:49",
    "original_name_hash": "c852c599",
    "original_desc_hash": "b5f4f1cb"
  },
  "AH3 - Thunderstrike (USA)": {
    "key": "AH3 - Thunderstrike (USA)",
    "original_name": "Thunderhawk",
    "name": "雷鷹",
    "name_source": "api",
    "original_desc": "Thunderhawk is an action game on Mega-CD that gives you control of a combat helicopter in a series of six futuristic campaigns. The original version includes a total of 60 operations with various objectives. Before flying in the sky, the player can adapt the embarked arsenal to suit it. Piloting is technical but accessible, without being as complex as other simulations available in 1993.",
    "desc": "Thunderhawk 是一款 Mega-CD 上的動作遊戲，讓您在一系列六個未來戰役中控制一架戰鬥直升機。原始版本總共包含 60 個具有不同目標的操作。在飛上天空之前，玩家可以調整搭載的武器庫以適應它。駕駛是技術性的，但也很容易實現，不像 1993 年的其他模擬那麼複雜。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:22:01",
    "desc_translated_at": "2026-01-02T15:22:01",
    "original_name_hash": "68aaeffe",
    "original_desc_hash": "43927da4"
  },
  "Vay (USA)": {
    "key": "Vay (USA)",
    "original_name": "Vay",
    "name": "獲得貸款",
    "name_source": "api",
    "original_desc": "Vay is the story of Prince Sandor of Lorath, and his quest to avenge the assassination of his parents and rescue his beloved Lady Elin. On what is to be the day of their wedding, Castle Lorath is assaulted by the Danek, who have been able to partially reconstruct alien mecha technology from a millennium ago. The castle defenses are powerless against the giant robots, and the king and queen are killed in the attack. The invaders steal Elin in the midst of her wedding vows. Prince Sandor, now the king of the realm, sets out to rescue his betrothed, and find a way to defeat the fearsome alien technology.\n\nThe game is a thoroughly \"old-school\" Japanese-style RPG, meaning that the focus of the game is on fighting random enemies in turn-based combat, gaining experience and gold in process, without any additional gimmicks. The characters come with pre-set \"classes\" (wizard, bard, etc.), and learn their own abilities/magic spells automatically as they level up.",
    "desc": "《Vay》講述了洛拉斯桑鐸王子的故事，以及他為父母被暗殺而報仇並拯救他心愛的艾琳女士的故事。在他們結婚的那天，洛拉斯城堡遭到丹麥人的襲擊，他們已經能夠部分重建千年前的外星機甲技術。城堡的防禦力量對巨型機器人無能為力，國王和王后在攻擊中喪生。入侵者在艾琳宣誓結婚時偷走了她。桑鐸王子現在是王國的國王，他著手營救他的未婚夫，並找到擊敗可怕的外星技術的方法。\n\n該遊戲是一款徹頭徹尾的“老派”日式RPG，這意味著遊戲的重點是在回合製戰鬥中與隨機敵人戰鬥，在過程中獲得經驗和金幣，沒有任何額外的噱頭。角色帶有預設的“類別”（巫師、吟遊詩人等），並在升級時自動學習自己的能力/魔法咒語。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-02T15:22:12",
    "desc_translated_at": "2026-01-02T15:22:12",
    "original_name_hash": "e8b756aa",
    "original_desc_hash": "7e9d9ead"
  }
}