{
  "Alien (199x) (Supervision)": {
    "key": "Alien (199x) (Supervision)",
    "original_name": "Alien (199x) (Supervision)",
    "name": "外星人",
    "name_source": "api",
    "original_desc": "Alien is a basic side-scrolling shooter where the player controls a fighter jet and must shoot down a variety of different enemies. The game scrolls continuously to the right, while enemies attack the player by either shooting or attempting to crash into the player's craft. The player can fire normal shots, or charge up to fire an extra powerful shot, which is required to defeat certain types of enemies. At the end of each stage, a large boss enemy appears, which must be defeated to continue the game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:12",
    "desc_translated_at": "",
    "original_name_hash": "ca2498d4",
    "original_desc_hash": "01b65cfd"
  },
  "Balloon Fight (199x) (Watara)": {
    "key": "Balloon Fight (199x) (Watara)",
    "original_name": "Balloon Fight (199x) (Watara)",
    "name": "氣球大戰",
    "name_source": "api",
    "original_desc": "Balloon Fight is a simple platform action game very similar to the better known NES title of the same name. The player controls a creature suspended by a pair of balloons who floats around a room, and must pop the balloons of enemy creatures by landing on top of them. If an enemy touches the player's balloons, they will pop, causing the player to fall and lose a life.\n\nThere are several different stages, each with a different layout and various objects such as platforms, deadly spike pits, and fans that push the balloons around. The playfield also loops horizontally, and both the player and the enemies can leave one side of the screen and return through the other. When all enemies on a stage are defeated, the player is awarded a bonus for time remaining and moves on to the next stage.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:13",
    "desc_translated_at": "",
    "original_name_hash": "9840e0ad",
    "original_desc_hash": "71314300"
  },
  "Block Buster & Cross High (199x) (Supervision)": {
    "key": "Block Buster & Cross High (199x) (Supervision)",
    "original_name": "2 in 1 : Block Buster & Cross High (199x) (Supervision)",
    "name": "2 合 1：Block Buster 和 Cross High",
    "name_source": "api",
    "original_desc": "2 in 1: Block Buster/Cross contains Tetris clone Block Buster, as well as a motocross game called Cross High. It is unknown if Cross High ever received a standalone release",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:13",
    "desc_translated_at": "",
    "original_name_hash": "6e5e6227",
    "original_desc_hash": "00e42779"
  },
  "Block Buster (199x) (Supervision)": {
    "key": "Block Buster (199x) (Supervision)",
    "original_name": "Block Buster (199x) (Supervision)",
    "name": "百視達",
    "name_source": "api",
    "original_desc": "Block Buster is a simple Tetris clone for one player. The goal is to place pieces made up of four tiles in the playfield, organizing them into complete rows, which then disappear. As rows are cleared, the pace of the game increases, and the game ends if the stack reaches the top of the well.\n\nThe most notable difference from regular Tetris is that the game features a 12-by-16-block playfield, compared with the 10-by-20 field found in licensed Tetris titles. There is only one game mode (endless), though the starting level (speed) and amount of garbage can be chosen before starting the game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:37",
    "desc_translated_at": "",
    "original_name_hash": "a76a48ad",
    "original_desc_hash": "33c7e133"
  },
  "Brain Power (199x) (Supervision)": {
    "key": "Brain Power (199x) (Supervision)",
    "original_name": "Brain Power (199x) (Supervision)",
    "name": "腦力",
    "name_source": "api",
    "original_desc": "Brain Power is a collection of four primarily logic-and-puzzle minigames:\n\nMine Detector, a clone of Minesweeper. The player is presented with a board filled with mines, and must find all of the open squares without clicking on any of the mines. Open squares contain a number, which indicates how many of the adjacent squares contains a mine. There are easy (55 mines), medium (66 mines), and hard (77 mines) modes.\n\nFortune Four, a version of the board game Qubic, also known as 3-D Tic-Tac-Toe. The player takes turn with the computer placing stones on a 4x4x4 grid, the goal being to create a chain of four stones in any direction.\n\nCaterpillar, a clone of Snake. The player controls a snake that must avoid obstacles and eat food placed around the level. When the snake eats a piece of food, it grows longer, but if it runs into an obstacle or its own body, it dies.\n\nHopper, a version of the board game Peg Solitaire. The player is given a grid with marbles arranged on it, and can remove marbles by \"jumping\" over them with an adjacent marble. The goal is to only have a single marble remaining. There are seven different layouts to choose from.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:38",
    "desc_translated_at": "",
    "original_name_hash": "81b9a86d",
    "original_desc_hash": "50b5ac82"
  },
  "Carrier (199x) (Travellmate) [o1]": {
    "key": "Carrier (199x) (Travellmate) [o1]",
    "original_name": "Carrier (199x) (Travellmate) [o1]",
    "name": "載體",
    "name_source": "api",
    "original_desc": "Carrier is a variant of the logic puzzle game Soko-Ban. The player controls a warehouse manager who must rearrange crates in a confined space, moving them all into the designated locations. It is possible to rewind a single move, as well as reset the puzzle or switch to any other puzzle in the set.\n\nStages are grouped in sets of ten, and the player must clear all ten stages to move on to the next stage. There are five stages, for a total of 50 puzzles. Many of the puzzles are taken directly from the Game Boy version of Soko-Ban, Boxxle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:39:39",
    "desc_translated_at": "",
    "original_name_hash": "f53b7f80",
    "original_desc_hash": "ea80f9a9"
  },
  "Carrier (199x) (Travellmate)": {
    "key": "Carrier (199x) (Travellmate)",
    "original_name": "Carrier (199x) (Travellmate)",
    "name": "載體",
    "name_source": "api",
    "original_desc": "Carrier is a variant of the logic puzzle game Soko-Ban. The player controls a warehouse manager who must rearrange crates in a confined space, moving them all into the designated locations. It is possible to rewind a single move, as well as reset the puzzle or switch to any other puzzle in the set.\n\nStages are grouped in sets of ten, and the player must clear all ten stages to move on to the next stage. There are five stages, for a total of 50 puzzles. Many of the puzzles are taken directly from the Game Boy version of Soko-Ban, Boxxle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:02",
    "desc_translated_at": "",
    "original_name_hash": "0c45b599",
    "original_desc_hash": "ea80f9a9"
  },
  "Pyramid (199x) (Watara)": {
    "key": "Pyramid (199x) (Watara)",
    "original_name": "Pyramid (199x) (Watara)",
    "name": "金字塔",
    "name_source": "api",
    "original_desc": "Pyramid is a real-time puzzle game similar to Tetris. Stones of various shapes and sizes fall from the top of the screen, and you need to move and rotate the stones so they fill complete lines at the bottom of the screen. Should the stones reach the top of the screen the game is over. If you get in trouble, there are a limited number of bombs that can be used to clear a small section of stones at the bottom hopefully giving you more room to work with. Unlike the square and rectangular shaped pieces found in Tetris, each of the shapes in Pyramid have one or more angles to them making complete lines more difficult to form.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:03",
    "desc_translated_at": "",
    "original_name_hash": "1302ceac",
    "original_desc_hash": "c7124763"
  },
  "Soccer Champion (199x) (Hartung)": {
    "key": "Soccer Champion (199x) (Hartung)",
    "original_name": "Soccer Champion (199x) (Hartung)",
    "name": "足球冠軍",
    "name_source": "api",
    "original_desc": "Soccer Champion is an overhead-view soccer game for one player. The player automatically controls the player closest to the ball, or the goalkeeper when he is visible. There are eight national teams to choose from, and two different modes. Exercise mode is a regular exhibition match against the computer, while Champion mode is a tournament where the player must defeat all the other teams in sequence. It is possible to choose between a three-minute, five-minute, and eight-minute game.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:04",
    "desc_translated_at": "",
    "original_name_hash": "1afa4b92",
    "original_desc_hash": "eb2353ea"
  },
  "SSSnake (199x) (Watara)": {
    "key": "SSSnake (199x) (Watara)",
    "original_name": "Sssnake (199x) (Watara)",
    "name": "蛇蛇",
    "name_source": "api",
    "original_desc": "Sssnake is a basic Snake game. The player controls a snake in a small room filled with food and obstacles. The goal is to eat all the food while avoiding the obstacles, but whenever the snake eats a piece of food, it grows longer, making it more difficult to maneuver. The snake moves forward at a constant speed and can be turned in the four cardinal directions. Holding a button will make the snake move faster, making it harder to control, but increasing the potential for a time bonus.\n\nIn this particular version, there are a number of apples on each stage. When an apple is eaten, it disappears, and an apple core appears elsewhere on the stage, and when the apple core is eaten, a deadly skull appears somewhere else. The player must eat all of the apples and apple cores in one run; they will all be reset if the snake touches an obstacle. The player will also earn bonus points if all the normal apples are eaten before any apple core is eaten.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:27",
    "desc_translated_at": "",
    "original_name_hash": "afd78682",
    "original_desc_hash": "03a8dd6a"
  },
  "Super Block (1992) (Bon Treasure) [o1]": {
    "key": "Super Block (1992) (Bon Treasure) [o1]",
    "original_name": "Super Block (1992) (Bon Treasure) [o1]",
    "name": "超級街區",
    "name_source": "api",
    "original_desc": "Super Block is a collection of three block puzzle games:\nPlay Block is a clone of Flipull. The objective is to launch blocks at other blocks with matching patterns to clear them from the field. Clear enough blocks without running out of moves to move to the next stage.\nFill Block is a clone of Quarth. Groups of blocks fall from the top of the screen, and the objective is to shoot additional blocks at them to create rectangles, causing the blocks to clear. If a block passes the line at the bottom of the screen, the game is over.\nHit Block is a mixture of the two other games. Blocks of varying types fall from the top of the screen, and the player must launch a matching block at it to remove it from play. Launching the wrong type will add it to the stack. If a block passes the line at the bottom of the screen, the game is over.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:28",
    "desc_translated_at": "",
    "original_name_hash": "02f88690",
    "original_desc_hash": "b7a752e8"
  },
  "Super Block (1992) (Bon Treasure)": {
    "key": "Super Block (1992) (Bon Treasure)",
    "original_name": "Super Block (1992) (Bon Treasure)",
    "name": "超級街區",
    "name_source": "api",
    "original_desc": "Super Block is a collection of three block puzzle games:\nPlay Block is a clone of Flipull. The objective is to launch blocks at other blocks with matching patterns to clear them from the field. Clear enough blocks without running out of moves to move to the next stage.\nFill Block is a clone of Quarth. Groups of blocks fall from the top of the screen, and the objective is to shoot additional blocks at them to create rectangles, causing the blocks to clear. If a block passes the line at the bottom of the screen, the game is over.\nHit Block is a mixture of the two other games. Blocks of varying types fall from the top of the screen, and the player must launch a matching block at it to remove it from play. Launching the wrong type will add it to the stack. If a block passes the line at the bottom of the screen, the game is over.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:29",
    "desc_translated_at": "",
    "original_name_hash": "af6443a2",
    "original_desc_hash": "b7a752e8"
  },
  "Super Kong (1992) (Thin Chen Enterprise)": {
    "key": "Super Kong (1992) (Thin Chen Enterprise)",
    "original_name": "Super Kong (1992) (Thin Chen Enterprise)",
    "name": "超級任天堂",
    "name_source": "wiki",
    "original_desc": "Super Kong is a simple action game that plays like a cross between Pooyan and Donkey Kong 3. The titular Super Kong slowly climbs a vine on the left edge of the screen, while the player controls a young child on a vine at the right edge. The object is to throw balls at Kong to knock him down the vine, ultimately knocking him out at the bottom. However, many obstructions fall from the top of the screen, and Kong himself can throw a large projectile that can knock the child out, losing a life. There are a handful of power-ups to assist the player, and it is also possible to jump off the vine to avoid Kong's attacks. The game includes three stages of increasing difficulty.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:27",
    "desc_translated_at": "",
    "original_name_hash": "6b6fe765",
    "original_desc_hash": "6919ab8e"
  },
  "Tasac 2010 (1992) (Thin Chen Enterprise)": {
    "key": "Tasac 2010 (1992) (Thin Chen Enterprise)",
    "original_name": "Tasac 2010 (1992) (Thin Chen Enterprise)",
    "name": "塔薩克2010",
    "name_source": "api",
    "original_desc": "Tasac 2010 is a vertically-scrolling space shoot-'em-up game. The player controls a high-powered space fighter through ten stages, which each consist of several waves of smaller enemies followed by a large boss that must be destroyed. There are several power-ups to increase the ship's power, but one hit will destroy it causing all upgrades to be lost. There are two different shot types, and ten stages in total.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:52",
    "desc_translated_at": "",
    "original_name_hash": "529abea3",
    "original_desc_hash": "e85a757e"
  },
  "Tennis Pro '92 (1992) (B": {
    "key": "Tennis Pro '92 (1992) (B",
    "original_name": "Tennis Pro '92 (1992) (B.I.T.S)",
    "name": "職業網球 '92",
    "name_source": "api",
    "original_desc": "Tennis Pro '92 is a no-frills tennis game for one player. The game offers singles play only against a computer opponent at three different levels of difficulty. The player can serve, swing at the ball, and run freely around the court during play. An animated scoreboard keeps track of game progress.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-26T14:55:36",
    "desc_translated_at": "",
    "original_name_hash": "06fac289",
    "original_desc_hash": "564e38e2"
  },
  "Treasure Hunter (199x) (Watara)": {
    "key": "Treasure Hunter (199x) (Watara)",
    "original_name": "Treasure Hunter (199x) (Watara)",
    "name": "寶藏獵人",
    "name_source": "api",
    "original_desc": "Treasure Hunter is a basic Boulder Dash clone. The player controls an explorer who digs through an underground cave in search of treasure. Each stage contains a number of boulders and treasures. Boulders will fall downward if there is nothing supporting them, and the player must be careful not to get crushed or trapped. The goal is to collect a certain number of treasures, which will open the gate to the next stage. There is also a strict time limit.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:40:54",
    "desc_translated_at": "",
    "original_name_hash": "c91bff82",
    "original_desc_hash": "169baa3a"
  },
  "Challenger Tank (199x) (Watara)": {
    "key": "Challenger Tank (199x) (Watara)",
    "original_name": "Challenger Tank (199x) (Watara)",
    "name": "挑戰者坦克",
    "name_source": "api",
    "original_desc": "Challenger Tank is a vertically-scrolling action game similar to Ikari Warriors. The player controls a tank which moves continually forward, and can freely move about the screen firing in any direction; the tank's cannon can be rotated independently of its movement. Enemy tanks appear from all sides, shooting at the player, and must be destroyed or avoided. At the end of each stage, a large boss appears that must be defeated to continue. Power-ups will occasionally appear that will allow the tank to fire in multiple directions simultaneously, but these are lost if the tank takes a hit.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:17",
    "desc_translated_at": "",
    "original_name_hash": "d7a24119",
    "original_desc_hash": "365444aa"
  },
  "Chimera (199x) (Supervision)": {
    "key": "Chimera (199x) (Supervision)",
    "original_name": "Chimera (199x) (Supervision)",
    "name": "奇美拉",
    "name_source": "api",
    "original_desc": "A strange alien spacecraft has been discovered orbiting the Earth, it its weaponry primed and ready to destroy the planet. Your mission: To infiltrate the craft, disable the weapons, initiate the self-destruct sequence, and escape with your life.\n\nChimera is an isometric adventure game set on an uninhabited space ship. The player must explore the ship, which is divided into a grid of rooms. There are various items scattered around the maze-like craft, which will be either a help or a hindrance. For example, food and water will keep the player alive, while radiators will quickly deplete water reserves while standing in the same room.\n\nThe only actions the player can perform are to move and to interact with objects. Many objects ? such as electric fences, or the aforementioned radiators ? are deadly to the touch unless the player has the correct item in their possession. The ultimate goal is to prime and activate the four-stage self destruct sequence in the correct order by using items found on the ship. A scrolling message indicator at the bottom of the screen provides useful status information.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:18",
    "desc_translated_at": "",
    "original_name_hash": "f2d61131",
    "original_desc_hash": "fd6ed04a"
  },
  "Crystball (1991) (Travellmate)": {
    "key": "Crystball (1991) (Travellmate)",
    "original_name": "Crystball (1991) (Travellmate)",
    "name": "水晶球",
    "name_source": "api",
    "original_desc": "Crystball is a Breakout clone in the tradition of Arkanoid. The player controls a paddle at the bottom of the screen, and must bounce a ball off the bricks on the screen, with the goal of destroying them all. Destroying certain bricks will release power-ups or release enemies that wander the screen. If the ball falls out the bottom of the screen, a life is lost, and if all lives are lost, the game is over.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:19",
    "desc_translated_at": "",
    "original_name_hash": "69b9c558",
    "original_desc_hash": "d7052281"
  },
  "Delta Hero (1992) (Bon Treasure)": {
    "key": "Delta Hero (1992) (Bon Treasure)",
    "original_name": "Delta Hero (1992) (Bon Treasure)",
    "name": "三角洲英雄",
    "name_source": "api",
    "original_desc": "Delta Hero is an action maze game starring a young soldier trapped in a strange land. The goal of each stage is to collect enough bags of money and then reach the goal. The hero's only mode of defense against the strange creatures he encounters is a rather short-range gun. There are many items and enemies strewn around each stage, including food that will replenish the player's life, x-ray glasses that will reveal the many hidden items and pathways, and the money required to exit the stage. It is also possible to reveal hidden areas by shooting at them.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:42",
    "desc_translated_at": "",
    "original_name_hash": "5eeaff55",
    "original_desc_hash": "6067622a"
  },
  "Eagle Plan (1992) (GTC Inc)": {
    "key": "Eagle Plan (1992) (GTC Inc)",
    "original_name": "Eagle Plan (1992) (GTC Inc)",
    "name": "鷹計劃",
    "name_source": "api",
    "original_desc": "Eagle Plan is an arcade-style flight sim game in the tradition of After Burner. Each mission tasks the player with destroying a certain number of enemies of specific types ? fighter planes, tanks, and warships ? and ends immediately once the conditions have been met. The player's craft has a gun with infinite ammo, as well as a limited number of missiles, tough certain enemies can only be destroyed with a specific type of weapon. Completing missions will earn money, which can be spent between missions to upgrade the player's craft, as well as replenish missiles and fuel. If the player runs out of fuel, which is also depleted from taking hits, the game is over.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:43",
    "desc_translated_at": "",
    "original_name_hash": "1f5af840",
    "original_desc_hash": "175042d7"
  },
  "Earth Defender (1992) (Bon Treasure)": {
    "key": "Earth Defender (1992) (Bon Treasure)",
    "original_name": "Earth Defender (1992) (Bon Treasure)",
    "name": "地球衛士",
    "name_source": "api",
    "original_desc": "Earth Defender is an action shooting game, and a clone of Data East's Atomic Runner. The player controls an armored superhero fighting an alien invasion, and can freely move about the screen, even hovering in place using a jetpack. However, the screen is always scrolling forward, and it is impossible to backtrack. Each stage consists of a lengthy onslaught of flying enemies, followed by a boss at the end. There are also several power-ups that can be collected to increase the hero's firepower or refill his life.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:41:44",
    "desc_translated_at": "",
    "original_name_hash": "fe496e10",
    "original_desc_hash": "16636ce4"
  },
  "Fatal Craft (1992) (Bon Treasure)": {
    "key": "Fatal Craft (1992) (Bon Treasure)",
    "original_name": "Fatal Craft (1992) (Bon Treasure)",
    "name": "致命工藝",
    "name_source": "api",
    "original_desc": "Fatal Craft is a horizontally-scrolling shooter modeled after Konami's seminal arcade classic Gradius, right down to the enemy formations and power-up system. As in most any scrolling shoot-'em-up, the goal is to reach the end of each stage and destroy the boss, defeating enemies and collecting power-ups along the way. Some enemies drop capsules, which when collected will increment the power-up bar at the bottom of the screen; press the power-up button to collect the selected item and reset the bar. There are six types of upgrades available, including a speed-up, a shield, three types of weapon upgrades, and an Option unit that mimic's the ship's movement, providing another source of fire.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:07",
    "desc_translated_at": "",
    "original_name_hash": "cc7a77a4",
    "original_desc_hash": "d191e137"
  },
  "Matta Blatta (199x) (Watara)": {
    "key": "Matta Blatta (199x) (Watara)",
    "original_name": "Matta Blatta (199x) (Watara)",
    "name": "地毯布拉塔",
    "name_source": "api",
    "original_desc": "Matta Blatta is a simple side-scrolling shoot-'em'-up. The player controls a space ship traveling down a long corridor against endless waves of erratically-moving enemies. Each wave consists of a different type of enemy with a different movement and firing pattern. There are two types of power-ups that appear; one will increase the ship's firepower and movement speed, while the other will grant a temporary shield.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:08",
    "desc_translated_at": "",
    "original_name_hash": "6ec02c05",
    "original_desc_hash": "b62b664e"
  },
  "Olympic Trials (1992) (Watara)": {
    "key": "Olympic Trials (1992) (Watara)",
    "original_name": "Olympic Trials (1992) (Watara)",
    "name": "奧運會選拔賽",
    "name_source": "api",
    "original_desc": "Olympic Trials is a track & field sports game for up to four players. The game features six events: Hurdles, Long Jump, Archery, Shot Put, Rowing, and Cycling. It is possible to choose a single event, or to play all six events in order. Success in each game is determined by either quick button mashing, rhythm, or precise timing.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:09",
    "desc_translated_at": "",
    "original_name_hash": "29010570",
    "original_desc_hash": "abdb3d54"
  },
  "P-52 Sea Battle (199x) (Watara)": {
    "key": "P-52 Sea Battle (199x) (Watara)",
    "original_name": "P-52 Sea Battle (199x) (Watara)",
    "name": "P-52 海戰",
    "name_source": "api",
    "original_desc": "P52 Sea Battle is an arcade naval battle game with four types of targets: Destroyer, Torpedo (Submarines), Aircraft (Carrier), and Cruiser. Choosing either a British, American, or USSR sub, the goal is to destroy all the given targets without running out of torpedoes or being sunk. There are four difficulty levels of each mode available, and clearing missions will earn points which can be used to purchase upgrades for the player's sub, including stronger armor and higher torpedo capacity.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:31",
    "desc_translated_at": "",
    "original_name_hash": "efd79e25",
    "original_desc_hash": "d09a1c8d"
  },
  "PacBoy & Mouse (199x) (Watara)": {
    "key": "PacBoy & Mouse (199x) (Watara)",
    "original_name": "Pacboy And Mouse (199x) (Watara)",
    "name": "吃豆子和老鼠",
    "name_source": "api",
    "original_desc": "Pacboy & Mouse in an arcade action game similar to Pengo. A young boy's lady friend has been accosted by mice, and it's up to him to catch them. The player controls the boy in a maze made up of blocks, which can be kicked to make them slide. The goal is to use the blocks to crush all the mice on the stage, but if the player takes too long more mice will appear. It is also possible to kick the walls, which will stun any mice next to that wall. Touching a mouse directly will cause the player to lose a life. Once all the mice have been killed, the player moves on to the next stage.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:33",
    "desc_translated_at": "",
    "original_name_hash": "75277050",
    "original_desc_hash": "bafad282"
  },
  "Penguin Hideout (1992) (Thin Chen Enterprise) [o1]": {
    "key": "Penguin Hideout (1992) (Thin Chen Enterprise) [o1]",
    "original_name": "Penguin Hideout (1992) (Thin Chen Enterprise) [o1]",
    "name": "企鵝藏身處",
    "name_source": "api",
    "original_desc": "Penguin & Seal is an arcade action game similar to Pengo. The player controls a penguin who must gather gems and deposit them into an igloo while avoiding becoming lunch for the seals wandering nearby. Each stage is filled with blocks, most of which can be destroyed, as well as three gems. The goal is to push the blocks to destroy them and crush the seals, while gathering the gems and depositing them in the igloo on the right side of the screen. Contact with either a seal or a kicked block will kill the penguin instantly. Successfully deposit all three gems to move on to the next stage.\n\nThe NES version also includes a 2-player mode and a puzzle construction mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:34",
    "desc_translated_at": "",
    "original_name_hash": "2870ea14",
    "original_desc_hash": "1dc9b58f"
  },
  "Penguin Hideout (1992) (Thin Chen Enterprise)": {
    "key": "Penguin Hideout (1992) (Thin Chen Enterprise)",
    "original_name": "Penguin Hideout (1992) (Thin Chen Enterprise)",
    "name": "企鵝藏身處",
    "name_source": "api",
    "original_desc": "Penguin & Seal is an arcade action game similar to Pengo. The player controls a penguin who must gather gems and deposit them into an igloo while avoiding becoming lunch for the seals wandering nearby. Each stage is filled with blocks, most of which can be destroyed, as well as three gems. The goal is to push the blocks to destroy them and crush the seals, while gathering the gems and depositing them in the igloo on the right side of the screen. Contact with either a seal or a kicked block will kill the penguin instantly. Successfully deposit all three gems to move on to the next stage.\n\nThe NES version also includes a 2-player mode and a puzzle construction mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:56",
    "desc_translated_at": "",
    "original_name_hash": "16a14dca",
    "original_desc_hash": "1dc9b58f"
  },
  "Cave Wonders (1992) (Bon Treasure)": {
    "key": "Cave Wonders (1992) (Bon Treasure)",
    "original_name": "Cave Wonders (1992) (Bon Treasure)",
    "name": "洞穴奇觀",
    "name_source": "api",
    "original_desc": "Cave Wonders is a roguelike set in a cave. The player must explore a randomly-generated labyrinth in search of treasures, moving from screen to screen or by using teleporters. There are many enemies in the cave, which must be either fought or avoided, as well as treasure chests that contain useful items such as fire to destroy enemies, a small plane to move elsewhere in the room, and hearts to refill the player's health. There are four different caves to choose from, each with multiple difficulty levels; increasing the difficulty will increase the complexity of the generated cave, as well as the number of treasures that must be collected before the exit will appear.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:57",
    "desc_translated_at": "",
    "original_name_hash": "db2eae60",
    "original_desc_hash": "95207908"
  },
  "Final Combat (199x) (Watara)": {
    "key": "Final Combat (199x) (Watara)",
    "original_name": "Final Combat (199x) (Watara)",
    "name": "最終幻想XV",
    "name_source": "wiki",
    "original_desc": "Final Combat is a top-view tank action game similar to Namco's Battle City. Each stage contains a large number of enemy units and other objects to destroy. The goal is to destroy the fortified enemy base in each area, though the base cannot be damaged until enough enemy units -- tanks and turrets -- are destroyed. When the OK is given, destroy the base to complete the stage. If the player's tank takes too much damage, it will be destroyed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:34",
    "desc_translated_at": "",
    "original_name_hash": "f958a40f",
    "original_desc_hash": "8647f599"
  },
  "Magincross (1992) (Thin Chen Enterprise)": {
    "key": "Magincross (1992) (Thin Chen Enterprise)",
    "original_name": "Magincross (1992) (Thin Chen Enterprise)",
    "name": "魔法十字",
    "name_source": "api",
    "original_desc": "\"In A.D. 2X00 alien Saya Empire secretly built a \"Time space\" Frontier Post on the Moon, intentionally intrude the earth... In order to defeat the alien's intrusion, the Earth Defense Arms has launched an unprecedented outer space war with the alien Saya Empire...\"\n\nMagincross is a horizontally-scrolling space shooter. The player shoots down waves of alien ships until the boss of each stage is reached. Instead of the usual lives system in most shooters, the player's ship instead has a power bar, which will deplete when the player takes a hit, but can be replenished by collecting power-ups that occasionally appear. After defeating the stage boss, the player moves on to the next stage. There are three stages total.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:42:59",
    "desc_translated_at": "",
    "original_name_hash": "37ffb2a1",
    "original_desc_hash": "cfdab167"
  },
  "Police Bust (199x) (Bon Treasure)": {
    "key": "Police Bust (199x) (Bon Treasure)",
    "original_name": "Police Bust (199x) (Bon Treasure)",
    "name": "警察半身像",
    "name_source": "api",
    "original_desc": "Police Bust is a dot-collecting maze game in the tradition of Pac-Man. The player controls a fugitive who is being chased by two police officers. He must collect all the dots strewn about a maze while avoiding capture. To aid in the escape, the player has access to barriers which will block the officers' path, as well as bombs which will stun them for a short time, but both items are in limited supply. Collect all the dots to move on to the next stage.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:21",
    "desc_translated_at": "",
    "original_name_hash": "78822ea4",
    "original_desc_hash": "d75c6fd8"
  },
  "Galactic Crusader (199x) (Watara)": {
    "key": "Galactic Crusader (199x) (Watara)",
    "original_name": "Galactic Crusader (199x) (Watara)",
    "name": "銀河十字軍",
    "name_source": "api",
    "original_desc": "Your starship is alive! A metamorphic creature that can transform from a huge flying insect into a metallic destroyer. Face squadron after squadron of alien fighters, marching ever onward towards a final confrontation with an all-powerful enemy.\n\nThis is basically a scrolling, shoot-it-if-it-moves, action game. As your ship scrolls up the screen, you fire on ships coming from the top of the screen. Occasionally, after ships have been destroyed, you can pick up a power up to increase your firing ability. At the end of each level is a boss you must defeat to move onward.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:23",
    "desc_translated_at": "",
    "original_name_hash": "b241fa23",
    "original_desc_hash": "783fe04a"
  },
  "Galaxy Fighter (1992) (Thin Chen Enterprise)": {
    "key": "Galaxy Fighter (1992) (Thin Chen Enterprise)",
    "original_name": "Galaxy Fighter (1992) (Thin Chen Enterprise)",
    "name": "銀河鬥士",
    "name_source": "api",
    "original_desc": "Galaxy Fighter is a vertically-scrolling space shooter. Many kinds of enemies appear in waves to attack the player, piloting an advanced fighter ship. When destroyed, enemies will sometimes drop power-up items, which include firepower upgrades and three different types of sub weapon: small homing missiles, large forward-firing missiles, and a rotating shield that damages nearby enemies. Every so often, a large boss enemy will appear, which must be destroyed in order to proceed. Similar to Toaplan's Truxton, there are no breaks between stages; the entire game scrolls continuously forward, only interrupted when the player's ship is destroyed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:24",
    "desc_translated_at": "",
    "original_name_hash": "a0305cdf",
    "original_desc_hash": "0372fb0b"
  },
  "Grand Prix (1992) (Bon Treasure)": {
    "key": "Grand Prix (1992) (Bon Treasure)",
    "original_name": "Grand Prix (1992) (Bon Treasure)",
    "name": "大獎賽",
    "name_source": "api",
    "original_desc": "Grand Prix is a simple F1 racing game for one player. The player's car has a turbo boost that can be used to pass other vehicles. The goal is simply to win each race by coming in first, continuing on to the next course. There are eight courses in total, each taking place in a different country.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:46",
    "desc_translated_at": "",
    "original_name_hash": "50146a46",
    "original_desc_hash": "bbb9d295"
  },
  "Happy Pairs (1992) (Sachen)": {
    "key": "Happy Pairs (1992) (Sachen)",
    "original_name": "Happy Pairs (1992) (Sachen)",
    "name": "幸福的情侶",
    "name_source": "api",
    "original_desc": "Happy Pairs is a tile-matching puzzle game based on the Japanese game Shisensh?. Similar to the well-known Shanghai, the object is to remove tiles from the board in matching pairs until the entire board is clear. Pairs can only be removed if they can be connected by a line with no more than two turns. The game is timed, and if the time runs out, the puzzle must be restarted. It is also possible to have the computer find a match for you, but this can only be done a limited number of times. The game includes more than a dozen different backgrounds, each representing a different location around the world, and several dozen different puzzle layouts to solve.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:47",
    "desc_translated_at": "",
    "original_name_hash": "ee2b611c",
    "original_desc_hash": "66a82ef2"
  },
  "Hash Blocks & Eagle Plan (1992) (GTC Inc)": {
    "key": "Hash Blocks & Eagle Plan (1992) (GTC Inc)",
    "original_name": "Hash Blocks And Eagle Plan (1992) (GTC Inc)",
    "name": "哈希塊和鷹計劃",
    "name_source": "api",
    "original_desc": "The game contains both Hash Block and Eagle Plan on a single cartridge. The games have reduced feature sets over their stand alone counterparts. When starting the game there is a menu screen that allows players to choose which game to play.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:43:49",
    "desc_translated_at": "",
    "original_name_hash": "c87d48b8",
    "original_desc_hash": "eaa73cd9"
  },
  "Hash Blocks (1991) (GTC Inc)": {
    "key": "Hash Blocks (1991) (GTC Inc)",
    "original_name": "Hash Blocks (1991) (GTC Inc)",
    "name": "哈希塊",
    "name_source": "api",
    "original_desc": "Hash Blocks is a falling-blocks puzzle game similar to Columns. Blocks fall in sets of three from the top of the well, and can be cycled and rotated freely. If four blocks of the same type are lined up horizontally, vertically, or diagonally, they are cleared and removed from the playfield, causing any blocks above them to fall into the open space. If the blocks reach the top of the screen, the game is over.\n\nThe game includes two modes. Normal mode tasks the player with clearing a certain number of blocks before the playfield fills up. Flash mode requires the player to clear a specific, flashing block, which may be buried under multiple other blocks. Both modes offer three levels of difficulty, as well as multiple different block graphic sets to use.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:11",
    "desc_translated_at": "",
    "original_name_hash": "1eed6179",
    "original_desc_hash": "e69b2ccf"
  },
  "Hero Kid (1992) (Hartung)": {
    "key": "Hero Kid (1992) (Hartung)",
    "original_name": "Hero Kid (1992) (Hartung)",
    "name": "英雄小子",
    "name_source": "api",
    "original_desc": "Hero Kid is a side-scrolling platform game starring a young man who must rescue his girlfriend. Each stage scrolls from left to right, and is filled with enemies and obstacles that must be overcome. Hero Kid's energy is continually depleting, and he must collect fruit to replenish it. The many enemies in his way are quite deadly, and will kill our hero in only one hit. However, it is also possible to gain the ability to throw hammers to destroy enemies by collecting floating hearts. Hero Kid only has three lives, and if he runs out, he is sent back to the beginning of the current area.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:12",
    "desc_translated_at": "",
    "original_name_hash": "0542ec34",
    "original_desc_hash": "208f834d"
  },
  "Honey Bee (199x) (Watara)": {
    "key": "Honey Bee (199x) (Watara)",
    "original_name": "Honey Bee (199x) (Watara)",
    "name": "蜜蜂",
    "name_source": "api",
    "original_desc": "Honey Bee is a vertically-scrolling shooter that bears a striking similarity to Konami's TwinBee. The player controls a cute-looking ship with arms and legs, which can fire both at flying enemies and ground-based enemies. Destroyed ground enemies will drop hearts that give points, and it is also possible to shoot clouds to release items which will also give additional points. There are no power-ups to increase the ship's firepower. At the end of each stage, there is a boss that must be destroyed in order to continue.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:14",
    "desc_translated_at": "",
    "original_name_hash": "b866849b",
    "original_desc_hash": "890e5585"
  },
  "Jacky Lucky (1992) (Bon Treasure)": {
    "key": "Jacky Lucky (1992) (Bon Treasure)",
    "original_name": "Jacky Lucky (1992) (Bon Treasure)",
    "name": "傑基·拉奇",
    "name_source": "api",
    "original_desc": "Jacky Lucky is a side-scrolling platformer starring a man who carries a big stick. The player controls this man as he makes his way through each stage filled with enemies, most of which can be defeated with the stick but will also defeat our hero in a single hit, as well as destructible blocks that contain various items, including limited amounts of projectiles that can be thrown at enemies. At the end of each stage is a boss that must be defeated. There is also a bonus game between stages where the player can trade any coins they found for extra lives.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:36",
    "desc_translated_at": "",
    "original_name_hash": "b4fa81d9",
    "original_desc_hash": "b5da72e8"
  },
  "Jaguar Bomber (1992) (Bon Treasure)": {
    "key": "Jaguar Bomber (1992) (Bon Treasure)",
    "original_name": "Jaguar Bomber (1992) (Bon Treasure)",
    "name": "捷豹轟炸機",
    "name_source": "api",
    "original_desc": "Jaguar Bomber is a vertically-scrolling shooter where the player pilots a fighter jet against an invading alien army. Various types of enemies attack from all sides, and the player must avoid their attacks and destroy as many as possible. The game is very straightforward, and there are no power-ups to increase the ship's firepower. At the end of each stage, there is a large boss that must be destroyed to proceed.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:37",
    "desc_translated_at": "",
    "original_name_hash": "175b7f06",
    "original_desc_hash": "3c04d469"
  },
  "John Adventure (199x) (Watara)": {
    "key": "John Adventure (199x) (Watara)",
    "original_name": "John Adventure (199x) (Watara)",
    "name": "林克的冒險",
    "name_source": "wiki",
    "original_desc": "John Adventure is a falling-block puzzle game cloned from Dr. Mario. Each stage presents the player with a bottle filled with dancing objects that must be destroyed. Pairs of pieces fall from the top of the bottle; line four of the same color in a row to cause them to disappear. Destroy all the target pieces to clear the stage, but reach the top of the bottle and it's game over! There are 20 stages and three play speeds available.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:15",
    "desc_translated_at": "",
    "original_name_hash": "5fd61494",
    "original_desc_hash": "f7ae6e14"
  },
  "Juggler (1992) (Bon Treasure)": {
    "key": "Juggler (1992) (Bon Treasure)",
    "original_name": "Juggler (1992) (Bon Treasure)",
    "name": "雜耍者",
    "name_source": "api",
    "original_desc": "Juggler is an action game where the player controls a magician who can create large floating bubbles. The object of the game is to keep the bubble bouncing long enough for it to grow larger, then pop it to cause pieces to fall on the enemies wandering each stage. Defeated enemies will release power-ups, but the magician must also be careful to keep away from the enemies, as one hit will knock him out.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:44:39",
    "desc_translated_at": "",
    "original_name_hash": "d2f34460",
    "original_desc_hash": "78ee47d2"
  },
  "Kabi Island (199x) (Watara)": {
    "key": "Kabi Island (199x) (Watara)",
    "original_name": "Kabi Island - Gold In Island (199x) (Watara)",
    "name": "卡比島 - 金島",
    "name_source": "api",
    "original_desc": "Kabi-Island is a top-down action game that plays like Bomberman. Each stage is filled with blocks and enemies, both of which can be blown up using bombs. Blocks may contain power-ups -- such as power boosts, additional bombs, speed shoes, or remote bombs -- or one of the gold bars that are needed to complete each stage. The goal of each stage is to collect enough gold bars, which will end the stage immediately. Enemies can be defeated with a single bomb blast, but can also defeat the hero just as easily. The game includes five different worlds, each with their own enemy types and setting.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:45:01",
    "desc_translated_at": "",
    "original_name_hash": "335a1a87",
    "original_desc_hash": "f1411d42"
  },
  "Linear Racing (199x) (Watara)": {
    "key": "Linear Racing (199x) (Watara)",
    "original_name": "Linear Racing (199x) (Watara)",
    "name": "線性賽車",
    "name_source": "api",
    "original_desc": "Linear Racing is a video puzzle game. A short animation is shown, then scrambled into 16 tiles, which must be rearranged to recreate the original image. Tiles may be swapped around, as well as flipped vertically or horizontally, to rebuild the animation. There are six different animations to choose from, and three difficulty settings for each.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:45:02",
    "desc_translated_at": "",
    "original_name_hash": "4351e8a4",
    "original_desc_hash": "c75fbb7a"
  }
}