{
  "Astro Bears": {
    "key": "Astro Bears",
    "original_name": "Astro Bears",
    "name": "",
    "name_source": "",
    "original_desc": "Get ready for the biggest cosmic comeback on Nintendo Switch™! Astro Bears is back and shinier than ever, with loads of improvements, new Bears, planets and play modes to pump up the party… again!\n\nIntroducing a new update for the game that hundreds of thousands of players fell in love with! Experience even more chaotic gameplay with infinite or finite Ribbons, Planets ranging from small to huge, and 8 Bears with different stats to experiment with!\n\nMake allies (or enemies) in the new Competitive mode in which players battle 1-on-1 over five challenging rounds! Invite a friend to help you collect Jetfish in a 2-player Jetfish Hunting mode and beat the global highscore together! Destroy friendships in the classic Party mode, where “beary big” legends are born!\n\nPlay as:\n\nIgor - the proud husband and father,\nBishnu - the crazy one everyone likes,\nXiaoli - the fastest runner of them all,\nNeil - the one who likes to eat while swimming,\nWojtek - the pierogi-loving war vet,\nCybear - the villain with an extra life,\nAki - the cosplayer and tech geek,\nor Randy - the one we know nothing about!\nAstro Bears guarantees your next party will be out of this world!\n\n8 cute Astro Bears with different play styles\nLocal multiplayer for 2-4 players\nCompetitive mode for challenge-seeking players\nJetfish Hunting with single- and 2-player co-op mode\nOnline leaderboards\n‘80s-inspired soundtrack",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Chronus Arc": {
    "key": "Chronus Arc",
    "original_name": "Chronus Arc",
    "name": "",
    "name_source": "",
    "original_desc": "On their way to the Chronus Shrine to get the Chronus Fragments, Loka and his teacher Teth are surrounded by a mysterious man named Geppel and his gang. They demand the Fragments. While Teth plays for time, Loka rushes out of the cave on his own to fetch reinforcements. He is successful, but Teth and Geppel are nowhere to be found.\nAiming to gather information about his missing teacher, Teth, Loka decides to set out on a journey with his friend Sarna.\n\nThe game features familiar quests, but also dungeons filled with puzzles to solve, and characters who grow and can be developed as the story progresses with the class change system. Additional elements such as dungeons and special items are available for extra fun!\n\nDon't miss out on Loka and his friends' grand adventure",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "ARMS (World)": {
    "key": "ARMS (World)",
    "original_name": "Arms",
    "name": "",
    "name_source": "",
    "original_desc": "Reach beyond your limits and fight like never before These elite fighting superstars share one thing in common: extendable arms! So fight as never before: equip super-powered ARMS to create a slew of unprecedented combinations. Then use simple motion or button controls to dish out highly strategic beatdowns in 1-on-1, or even 2-on-2 battles!Features:Deep, strategic gameplay via simple motion and button controls: Tilt the Joy-Con™ controller to move your character about the arena, flick your fists to throw punches, then twist your hands to curve your punches midflight. It's easy to learn, and incredibly satisfying to reach out and punch someone.Mix and match arms to strategically bring new fights to your opponent: Select from a variety of different characters with unique abilities and equip a plethora of arms to strategize your approach. Use different combinations of arms and characters to change your approach in each round for endless gameplay possibilities.Take on a variety of game modes: Dunk your opponent through a basketball hoop in a game of Hoops, spike your opponent in the face with an exploding ball in a game of V-ball, take on 100 enemies in waves of increasing difficulty, and more.Brawl in multiplayer modes: Grab some friends for some team versus modes in 4-player action over local wireless, go online* as a pair, or get your game face on with some ranked 1-on-1 matches.Tournament Support and DLC: The LAN mode featured in the 2017 ARMS Open Invitational will release publicly to support competitive players (LAN adapter required; sold separately). Max Brass, the final boss of the game, and his Sky Arena stage will also become playable in a downloadable update.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Contra Anniversary Collection": {
    "key": "Contra Anniversary Collection",
    "original_name": "Contra Anniversary Collection",
    "name": "",
    "name_source": "",
    "original_desc": "The Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players.\nGrab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Captain Toad Treasure Tracker": {
    "key": "Captain Toad Treasure Tracker",
    "original_name": "Captain Toad : Treasure Tracker",
    "name": "",
    "name_source": "",
    "original_desc": "Captain Toad stars in his own puzzling quest on the Nintendo Switch™ system! Our stubby hero must dodge dangers and track treasures across many trap-filled courses. Survive smoldering volcanoes, hazardous steam engines, haunted houses, and even new courses based on the Super Mario Odyssey™ game! Luckily, a second player can join in by tossing turnips at enemies.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Amoeba Battle - Microscopic RTS Action": {
    "key": "Amoeba Battle - Microscopic RTS Action",
    "original_name": "Amoeba Battle - Microscopic RTS Action",
    "name": "",
    "name_source": "",
    "original_desc": "Unlike other RTS games, there are no bases to build - new amoebas are created through the miracle of binary fission!\nFirst though, your amoebas must forage for food in the beautiful yet alien environments that make up their world. Once well fed, these amoebas can replicate into two identical amoebas of the same type, doubling your army with a press of a button!\nBut multiplying amoebas won't always be enough. You will need to introduce mutations to evolve your weaker amoebas into stronger species. Experiment with different amoeba combinations to field a diverse force that can face any threat!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Devious Dungeon": {
    "key": "Devious Dungeon",
    "original_name": "Devious Dungeon",
    "name": "",
    "name_source": "",
    "original_desc": "Under orders by the King, players assume the control of a Knight instructed to head into the catacombs beneath the Kingdom, to slay the fowl beasts and monstrosities that have invaded the murky depths.\n\nYou must venture deep within the dungeons eliminating the threat!\n\nSlay monsters, collect loot, level up and upgrade your gear.\nOnly a true champion will be victorious!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "New Super Mario Bros": {
    "key": "New Super Mario Bros",
    "original_name": "New Super Mario Bros. U Deluxe",
    "name": "",
    "name_source": "",
    "original_desc": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Marvel Ultimate Alliance 3 The Black Order DLC": {
    "key": "Marvel Ultimate Alliance 3 The Black Order DLC",
    "original_name": "Marvel Ultimate Alliance 3 The Black Order",
    "name": "",
    "name_source": "",
    "original_desc": "In this new storyline, heroes and villains unite in a race across the Marvel Universe to find the Infinity Stones before Thanos and The Black Order use them to unleash cosmic chaos. From Avengers Tower to the X-Mansion and beyond, every stop on the dangerous quest to thwart Thanos results in unexpected collisions of fan-favorite characters and iconic locations.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Human Resource Machine (USA)": {
    "key": "Human Resource Machine (USA)",
    "original_name": "Human Resource Machine",
    "name": "",
    "name_source": "",
    "original_desc": "Human Resource Machine is a puzzle game for nerds. In each level, your boss gives you a job. Automate it by programming your little office worker. If you succeed, you'll be promoted up to the next level for another year of work in the vast office building. Congratulations!\n\nDon't worry if you've never programmed before — programming is just puzzle solving. If you strip away all the 1s and 0s and scary squiggly brackets, programming is actually really simple, logical, beautiful, and something that anyone can understand and have fun with! Are you already an expert? There will be extra challenges for you.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mujo": {
    "key": "Mujo",
    "original_name": "Mujo",
    "name": "",
    "name_source": "",
    "original_desc": "MUJO is a unique puzzle game with features that cannot be found in any other game. Let's start collecting tiles and erase them all to attack monsters!\n\nThis game has no end! Enjoy whenever you want as much as you would like.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mario vs": {
    "key": "Mario vs",
    "original_name": "Mario vs Donkey Kong",
    "name": "",
    "name_source": "",
    "original_desc": "Solve all kinds of puzzles and test your platforming smarts as you try to recover the stolen Mini-Marios in Mario vs. Donkey Kong on Nintendo Switch.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "No Man's Sky": {
    "key": "No Man's Sky",
    "original_name": "No Man's Sky",
    "name": "",
    "name_source": "",
    "original_desc": "Inspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action.\nIn No Man's Sky, every star is the light of a distant sun, each orbited by planets filled with life, and you can go to any of them you choose. Fly smoothly from deep space to planetary surfaces, with no loading screens, and no limits. In this infinite procedurally generated universe, you'll discover places and creatures that no other players have seen before - and perhaps never will again. Embark on an epic voyage \nAt the centre of the galaxy lies a irresistible pulse which draws you on a journey towards it to learn the true nature of the cosmos. But, facing hostile creatures and fierce pirates, you'll know that death comes at a cost, and survival will be down to the choices you make over how you upgrade your ship, your weapon and suit. Find your own destiny \nYour voyage through No Man's Sky is up to you. Will you be a fighter, preying on the weak and taking their riches, or taking out pirates for their bounties? Power is yours if you upgrade your ship for speed and weaponry.\nOr a trader? Find rich resources on forgotten worlds and exploit them for the highest prices. Invest in more cargo space and you'll reap huge rewards.\nOr perhaps an explorer? Go beyond the known frontier and discover places and things that no one has ever seen before. Upgrade your engines to jump ever farther, and strengthen your suit for survival in toxic environments that would kill the unwary. Share your journey \nThe galaxy is a living, breathing place. Trade convoys travel between stars, factions vie for territory, pirates hunt the unwary, and the police are ever watching. Every other player lives in the same galaxy, and you can choose to share your discoveries with them on a map that spans known space. Perhaps you will see the results of their actions as well as your own...",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kirby's Dream Buffet": {
    "key": "Kirby's Dream Buffet",
    "original_name": "Kirbys Dream Buffet",
    "name": "",
    "name_source": "",
    "original_desc": "Bump, battle, and boost your way to sweet victory\n \nRoll through a smorgasbord of food-themed stages in 4 rounds of 4-player fun as Kirby…who seems rounder than usual? Race through delicious obstacle courses to collect strawberries as Kirby grows. Then, turn the tides in the final round—a fruity fight atop a floating platform.\n \nHave a feast of fun with family and friends\n \nGet snacky by sharing Joy-Con controllers with a buddy on the same system, or with up to 4 players via local wireless or online. With 4 rounds, plenty of power ups called Copy Foods, and opportunities to steal strawberries, anyone can take the cake in this easy-to-play game. All ages can eat up the cute and competitive fun.\n \nCome back for seconds to level up and unlock delectable customization options\n \nDress Kirby in delectable costumes that resemble Meta Knight, King Dedede, Elfilin, and more! You'll also get more colors for Kirby, music to listen to, and stages as you increase your Gourmet Rank. Start the race in style by earning different decorations resembling cookies, chocolates, and candies from the Kirby™ series as you play!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Good Job!": {
    "key": "Good Job!",
    "original_name": "Good Job!",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Minecraft": {
    "key": "Minecraft",
    "original_name": "Minecraft - Nintendo Switch Edition",
    "name": "",
    "name_source": "",
    "original_desc": "Minecraft is a game about placing blocks and going on adventures.\n\nExplore randomly-generated worlds and build amazing things from the simplest of homes to the grandest of castles.\n\nPlay in Creative Mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armour to fend off the dangerous mobs.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lost Phone Stories": {
    "key": "Lost Phone Stories",
    "original_name": "Lost Phone Stories",
    "name": "",
    "name_source": "",
    "original_desc": "In Lost Phone games you explore the intimate life of a person whose phone you have just found.\nThese games take the form of narrative investigations: to progress, connect the information found in the various messages, photos and applications. Through the interface of a cell phone, you must find out what happened to its owner.\nExperience realistic and powerful stories that help to create empathy with the characters, allowing to bring sensitive topics.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mario Strikers Battle League Football": {
    "key": "Mario Strikers Battle League Football",
    "original_name": "Mario Strikers : Battle League",
    "name": "",
    "name_source": "",
    "original_desc": "Aim for victory with teamwork, tackles, table-turning items, and score-boosting Hyper Strikes in Mario Strikers: Battle League Football on Nintendo Switch. Do whatever it takes to win in frantic local multiplayer and team up with other players online to become the world's top club! Assemble a team of Mushroom Kingdom all-stars, made up of four Strikers and a goalkeeper trying to keep the ball out of your net. Each character has their own stats such as Speed, Passing and Strength, as well as the ability to unleash a game-changing Hyper Strike.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "OCTOPATH TRAVELER II": {
    "key": "OCTOPATH TRAVELER II",
    "original_name": "Octopath Traveler II",
    "name": "",
    "name_source": "",
    "original_desc": "The story takes place in Solistia, a land comprising an eastern and western continent divided by the sea.\nIt is a bustling era, wherein large vessels navigate busy sea routes and the power of steam gives birth to new technologies.\nSome people thrill to glamorous stars of the stage and industry, while others are brought to tears by war, plague, and poverty.\nIn this faraway realm, eight travelers hailing from different regions venture forth for their own reasons. Step into their shoes and explore the land as you see fit, using their unique talents to aid you along your journey.\nEmbark on an adventure all your own.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pinball FX": {
    "key": "Pinball FX",
    "original_name": "Pinball FX",
    "name": "",
    "name_source": "",
    "original_desc": "Discover brand new exclusive tables created for Pinball FX, or find your favorites among more than 20 unique and visually enhanced favorites from Zen's extensive digital pinball library. Relive the most iconic moments from entertainment powerhouses like Star Wars, Legendary Entertainment and many more. Enjoy accurate re-creations of the most famous pinball machines of all time with Williams Pinball, or have fun with Zen’s original creations.\n\nNew tables arrive frequently!\n\nBuild your dream game room\n\nBuild up your own customizable 3D playroom with collectible items unlocked by playing.\n\nThe ultimate simulation\n\nEnjoy digital pinball at its finest on the Nintendo Switch with an updated and refined physics simulation",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Retro City Rampage DX (USA)": {
    "key": "Retro City Rampage DX (USA)",
    "original_name": "Retro City Rampage DX",
    "name": "",
    "name_source": "",
    "original_desc": "Retro City Rampage reimagines the open world crime genre like it's 1989. Jump on civilians for coins -- then steal their car and outrun the law! Explore the city and complete missions, or just go on a rampage with your weapons, power-ups and vehicles!\n\nThis pop culture send-up includes a full Story Mode of open world adventure, plus Arcade Challenges for quick\npick-up-and-play action. If that's not enough, it also packs an interactive city full of shops, minigames, customizations, collectibles, special guest stars, and more.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Picross S＋": {
    "key": "Picross S＋",
    "original_name": "Picross S+",
    "name": "",
    "name_source": "",
    "original_desc": "The latest in the Picross S series, in which problems from the Picross e series can be played!\n\nPicross S+ allows users to play puzzle problems from the nine titles in the Picross e series, which have been downloaded a total of 680,000 times as Nintendo 3DS download-only software, using the Picross S system.\n\nBasic software containing problems from the original Picross e, with problems from Picross e2 through e9 available for download as additional paid downloadable content.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Mario Bros": {
    "key": "Super Mario Bros",
    "original_name": "Super Mario Bros. Wonder",
    "name": "",
    "name_source": "",
    "original_desc": "Find wonder in the next evolution of Mario fun. Classic Mario side-scrolling gameplay is turned on its head with the addition of Wonder Flowers. These game-changing items trigger spectacular moments you have to see to believe... Witness pipes coming alive, wreak havoc as a giant spiky ball, and see even more unexpected events called Wonder Effects. Pick from heroic Super Mario™ characters and Power-Ups. Choose from familiar characters including Mario, Luigi, Peach, Daisy, Yoshi and Toad. Transform into Elephant Mario to use your trunk to trounce enemies with a surprising new Power-Up! Share the wonder with friends and Mario fans. Team up with up to three friends locally* and gather around one Nintendo Switch™ system to experience the game-bending Wonder Effects together as you tackle courses as a team and help each other on your way to the goal.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Undertale": {
    "key": "Undertale",
    "original_name": "Undertale",
    "name": "",
    "name_source": "",
    "original_desc": "Undertale is an Eastern RPG with some action aspects in its combat system. In the overworld, the player explores areas, solves puzzles, and talks to NPCs. When a battle is triggered, typically through random encounter, the game switches to the combat screen. A heart representing the child's soul appears in a small box, in which objects representing the monsters' attacks appear and must be dodged in real time. On the child's turn, they can attack monsters more directly through the fight command. A meter that determines the strength of the player's attack must be hit with good timing in order to deal more damage.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Jim is Moving Out": {
    "key": "Jim is Moving Out",
    "original_name": "Jim is Moving Out",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Alien Escape": {
    "key": "Alien Escape",
    "original_name": "Alien Escape",
    "name": "",
    "name_source": "",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "New Super Mario Bros. U Deluxe": {
    "key": "New Super Mario Bros. U Deluxe",
    "original_name": "New Super Mario Bros. U Deluxe",
    "name": "",
    "name_source": "",
    "original_desc": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mario vs. Donkey Kong": {
    "key": "Mario vs. Donkey Kong",
    "original_name": "Mario vs Donkey Kong",
    "name": "",
    "name_source": "",
    "original_desc": "Solve all kinds of puzzles and test your platforming smarts as you try to recover the stolen Mini-Marios in Mario vs. Donkey Kong on Nintendo Switch.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Mario Bros. Wonder": {
    "key": "Super Mario Bros. Wonder",
    "original_name": "Super Mario Bros. Wonder",
    "name": "",
    "name_source": "",
    "original_desc": "Find wonder in the next evolution of Mario fun. Classic Mario side-scrolling gameplay is turned on its head with the addition of Wonder Flowers. These game-changing items trigger spectacular moments you have to see to believe... Witness pipes coming alive, wreak havoc as a giant spiky ball, and see even more unexpected events called Wonder Effects. Pick from heroic Super Mario™ characters and Power-Ups. Choose from familiar characters including Mario, Luigi, Peach, Daisy, Yoshi and Toad. Transform into Elephant Mario to use your trunk to trounce enemies with a surprising new Power-Up! Share the wonder with friends and Mario fans. Team up with up to three friends locally* and gather around one Nintendo Switch™ system to experience the game-bending Wonder Effects together as you tackle courses as a team and help each other on your way to the goal.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  }
}