{
  "Astro Bears": {
    "key": "Astro Bears",
    "original_name": "Astro Bears",
    "name": "Astro Bears",
    "name_source": "keep",
    "original_desc": "Get ready for the biggest cosmic comeback on Nintendo Switch™! Astro Bears is back and shinier than ever, with loads of improvements, new Bears, planets and play modes to pump up the party… again!\n\nIntroducing a new update for the game that hundreds of thousands of players fell in love with! Experience even more chaotic gameplay with infinite or finite Ribbons, Planets ranging from small to huge, and 8 Bears with different stats to experiment with!\n\nMake allies (or enemies) in the new Competitive mode in which players battle 1-on-1 over five challenging rounds! Invite a friend to help you collect Jetfish in a 2-player Jetfish Hunting mode and beat the global highscore together! Destroy friendships in the classic Party mode, where “beary big” legends are born!\n\nPlay as:\n\nIgor - the proud husband and father,\nBishnu - the crazy one everyone likes,\nXiaoli - the fastest runner of them all,\nNeil - the one who likes to eat while swimming,\nWojtek - the pierogi-loving war vet,\nCybear - the villain with an extra life,\nAki - the cosplayer and tech geek,\nor Randy - the one we know nothing about!\nAstro Bears guarantees your next party will be out of this world!\n\n8 cute Astro Bears with different play styles\nLocal multiplayer for 2-4 players\nCompetitive mode for challenge-seeking players\nJetfish Hunting with single- and 2-player co-op mode\nOnline leaderboards\n‘80s-inspired soundtrack",
    "desc": "準備好迎接 Nintendo Switch™ 上最盛大的宇宙回歸吧！Astro Bears 回來了，而且比以往更加閃亮，帶來了大量的改進、新的熊、行星和遊戲模式，讓派對再次熱鬧起來！\n\n為數十萬玩家喜愛的遊戲推出新更新！體驗更加混亂的遊戲玩法，體驗無限或有限的絲帶、從小到大的行星，以及 8 只具有不同屬性的熊來進行實驗！\n\n在新的競爭模式中結交盟友（或敵人），玩家可以在五個具有挑戰性的回合中進行一對一的戰鬥！邀請好友幫助您在 2 人噴射魚狩獵模式中收集噴射魚，並一起打破全球最高分！在經典派對模式中摧毀友誼，“熊大”傳奇就此誕生！\n\n扮演：\n\n伊戈爾 - 驕傲的丈夫和父親，\nBishnu——人人都喜歡的瘋狂人物，\n小麗——他們當中跑得最快的，\n尼爾——一個喜歡邊游泳邊吃東西的人，\nWojtek - 熱愛餃子的戰爭老兵，\nCybear——擁有額外生命的反派，\nAki - 角色扮演者和科技極客，\n或者蘭迪——我們一無所知的人！\nAstro Bears 保證您的下一場派對將是獨一無二的！\n\n8 只可愛的阿童木熊，有著不同的遊戲風格\n適合 2-4 名玩家的本地多人遊戲\n適合尋求挑戰的玩家的競爭模式\n噴射魚狩獵，提供單人和兩人合作模式\n在線排行榜\n80 年代風格的配樂",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:31",
    "desc_translated_at": "2026-01-25T16:27:31",
    "original_name_hash": "b7c6b9d2",
    "original_desc_hash": "69ccba8c"
  },
  "Chronus Arc": {
    "key": "Chronus Arc",
    "original_name": "Chronus Arc",
    "name": "Chronus Arc",
    "name_source": "keep",
    "original_desc": "On their way to the Chronus Shrine to get the Chronus Fragments, Loka and his teacher Teth are surrounded by a mysterious man named Geppel and his gang. They demand the Fragments. While Teth plays for time, Loka rushes out of the cave on his own to fetch reinforcements. He is successful, but Teth and Geppel are nowhere to be found.\nAiming to gather information about his missing teacher, Teth, Loka decides to set out on a journey with his friend Sarna.\n\nThe game features familiar quests, but also dungeons filled with puzzles to solve, and characters who grow and can be developed as the story progresses with the class change system. Additional elements such as dungeons and special items are available for extra fun!\n\nDon't miss out on Loka and his friends' grand adventure",
    "desc": "在前往時空神殿獲取時空碎片的路上，洛卡和他的老師泰斯被一個名叫格佩爾的神秘男子和他的幫派包圍。他們需要碎片。當泰斯爭取時間時，洛卡獨自衝出洞穴去尋找援軍。他成功了，但泰斯和格佩爾卻不見踪影。\n為了收集有關他失踪的老師泰斯的信息，洛卡決定與他的朋友薩爾納一起踏上旅程。\n\n該遊戲具有熟悉的任務，但也有充滿謎題需要解決的地下城，以及隨著故事的進展和階級變化系統而成長和發展的角色。地下城和特殊物品等附加元素可帶來更多樂趣！\n\n不要錯過洛卡和他的朋友們的偉大冒險",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:33",
    "desc_translated_at": "2026-01-25T16:27:31",
    "original_name_hash": "1de163a4",
    "original_desc_hash": "5a870773"
  },
  "ARMS (World)": {
    "key": "ARMS (World)",
    "original_name": "Arms",
    "name": "ARMS (游戏)",
    "name_source": "wiki",
    "original_desc": "Reach beyond your limits and fight like never before These elite fighting superstars share one thing in common: extendable arms! So fight as never before: equip super-powered ARMS to create a slew of unprecedented combinations. Then use simple motion or button controls to dish out highly strategic beatdowns in 1-on-1, or even 2-on-2 battles!Features:Deep, strategic gameplay via simple motion and button controls: Tilt the Joy-Con™ controller to move your character about the arena, flick your fists to throw punches, then twist your hands to curve your punches midflight. It's easy to learn, and incredibly satisfying to reach out and punch someone.Mix and match arms to strategically bring new fights to your opponent: Select from a variety of different characters with unique abilities and equip a plethora of arms to strategize your approach. Use different combinations of arms and characters to change your approach in each round for endless gameplay possibilities.Take on a variety of game modes: Dunk your opponent through a basketball hoop in a game of Hoops, spike your opponent in the face with an exploding ball in a game of V-ball, take on 100 enemies in waves of increasing difficulty, and more.Brawl in multiplayer modes: Grab some friends for some team versus modes in 4-player action over local wireless, go online* as a pair, or get your game face on with some ranked 1-on-1 matches.Tournament Support and DLC: The LAN mode featured in the 2017 ARMS Open Invitational will release publicly to support competitive players (LAN adapter required; sold separately). Max Brass, the final boss of the game, and his Sky Arena stage will also become playable in a downloadable update.",
    "desc": "超越極限，以前所未有的方式戰鬥這些精英格鬥巨星有一個共同點：可伸展的手臂！因此，以前所未有的方式戰鬥：裝備超強武器，創造出一系列前所未有的組合。然後使用簡單的動作或按鈕控制在一對一甚至二對二的戰鬥中進行高度戰略性的擊敗！特點：通過簡單的動作和按鈕控制進行深入的戰略遊戲：傾斜Joy-Con™控制器在競技場上移動你的角色，輕彈你的拳頭出拳，然後扭轉你的手在飛行中彎曲你的拳頭。它很容易學習，而且伸出手去打別人會帶來令人難以置信的滿足感。混合和匹配武器，有策略地為你的對手帶來新的戰鬥：從各種具有獨特能力的不同角色中進行選擇，並裝備大量武器來製定你的策略。使用不同的手臂和角色組合，在每一輪中改變你的方法，獲得無限的遊戲可能性。 採取各種遊戲模式：在籃球遊戲中將你的對手扣進籃筐，在 V 球遊戲中用爆炸球刺穿你的對手的臉，在難度不斷增加的浪潮中與 100 個敵人作戰，等等。 在多人遊戲模式中亂鬥：通過本地無線網絡在 4 人遊戲中與一些朋友進行團隊對戰模式，作為一對上網*，或者獲得更多您的遊戲將面臨一些排名第一的一對一比賽。 錦標賽支持和 DLC：2017 年 ARMS 公開邀請賽中的 LAN 模式將公開發布，以支持競技玩家（需要 LAN 適配器；單獨出售）。遊戲的最終 Boss Max Brass 和他的天空競技場舞台也將在可下載更新中開放。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:32",
    "desc_translated_at": "2026-01-25T16:27:31",
    "original_name_hash": "4b9b1c96",
    "original_desc_hash": "10f7ffd8"
  },
  "Contra Anniversary Collection": {
    "key": "Contra Anniversary Collection",
    "original_name": "Contra Anniversary Collection",
    "name": "Contra Anniversary Collection",
    "name_source": "keep",
    "original_desc": "The Contra Anniversary Collection brings this classic Run and Gun franchise back to modern platforms and a new generation of players.\nGrab power ups and blast your way through waves of menacing enemies and bosses that will put your reaction skills to the test.",
    "desc": "《魂斗羅》週年紀念合集將這款經典的《跑與槍》系列帶回到現代平台和新一代玩家中。\n獲取能量道具，在一波又一波來勢洶洶的敵人和頭目中殺出一條血路，這將考驗你的反應能力。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:33",
    "desc_translated_at": "2026-01-25T16:27:32",
    "original_name_hash": "51dabf9b",
    "original_desc_hash": "30c77e1e"
  },
  "Captain Toad Treasure Tracker": {
    "key": "Captain Toad Treasure Tracker",
    "original_name": "Captain Toad : Treasure Tracker",
    "name": "Captain Toad : Treasure Tracker",
    "name_source": "keep",
    "original_desc": "Captain Toad stars in his own puzzling quest on the Nintendo Switch™ system! Our stubby hero must dodge dangers and track treasures across many trap-filled courses. Survive smoldering volcanoes, hazardous steam engines, haunted houses, and even new courses based on the Super Mario Odyssey™ game! Luckily, a second player can join in by tossing turnips at enemies.",
    "desc": "蟾蜍船長在 Nintendo Switch™ 系統上展開他自己的令人費解的任務！我們粗壯的英雄必須躲避危險，並在許多充滿陷阱的賽道上追踪寶藏。在悶燒的火山、危險的蒸汽機、鬼屋，甚至基於超級馬里奧奧德賽™遊戲的新課程中生存！幸運的是，第二名玩家可以通過向敵人扔蘿蔔來加入。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:35",
    "desc_translated_at": "2026-01-25T16:27:32",
    "original_name_hash": "95a38a2d",
    "original_desc_hash": "8766787f"
  },
  "Amoeba Battle - Microscopic RTS Action": {
    "key": "Amoeba Battle - Microscopic RTS Action",
    "original_name": "Amoeba Battle - Microscopic RTS Action",
    "name": "Amoeba Battle - Microscopic RTS Action",
    "name_source": "keep",
    "original_desc": "Unlike other RTS games, there are no bases to build - new amoebas are created through the miracle of binary fission!\nFirst though, your amoebas must forage for food in the beautiful yet alien environments that make up their world. Once well fed, these amoebas can replicate into two identical amoebas of the same type, doubling your army with a press of a button!\nBut multiplying amoebas won't always be enough. You will need to introduce mutations to evolve your weaker amoebas into stronger species. Experiment with different amoeba combinations to field a diverse force that can face any threat!",
    "desc": "與其他 RTS 遊戲不同，無需建造基地 - 新的變形蟲是通過二元裂變的奇蹟創造出來的！\n不過，首先，阿米巴原蟲必須在構成其世界的美麗而陌生的環境中尋找食物。一旦餵飽，這些阿米巴原蟲就可以復製成兩個相同類型的相同阿米巴原蟲，只需按一下按鈕，您的軍隊就會加倍！\n但繁殖阿米巴原蟲並不總是足夠的。您需要引入突變，將較弱的阿米巴原蟲進化為更強的物種。嘗試不同的變形蟲組合，以組建一支可以應對任何威脅的多樣化力量！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:34",
    "desc_translated_at": "2026-01-25T16:27:32",
    "original_name_hash": "51723717",
    "original_desc_hash": "4a2ea64c"
  },
  "Devious Dungeon": {
    "key": "Devious Dungeon",
    "original_name": "Devious Dungeon",
    "name": "Devious Dungeon",
    "name_source": "keep",
    "original_desc": "Under orders by the King, players assume the control of a Knight instructed to head into the catacombs beneath the Kingdom, to slay the fowl beasts and monstrosities that have invaded the murky depths.\n\nYou must venture deep within the dungeons eliminating the threat!\n\nSlay monsters, collect loot, level up and upgrade your gear.\nOnly a true champion will be victorious!",
    "desc": "在國王的命令下，玩家扮演一名騎士，奉命前往王國地下的地下墓穴，殺死入侵黑暗深處的禽獸和怪物。\n\n你必須深入地牢冒險消除威脅！\n\n殺死怪物，收集戰利品，升級併升級你的裝備。\n只有真正的冠軍才能取得勝利！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:36",
    "desc_translated_at": "2026-01-25T16:27:32",
    "original_name_hash": "fccf9b92",
    "original_desc_hash": "7fd737bb"
  },
  "New Super Mario Bros": {
    "key": "New Super Mario Bros",
    "original_name": "New Super Mario Bros. U Deluxe",
    "name": "",
    "name_source": "",
    "original_desc": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Marvel Ultimate Alliance 3 The Black Order DLC": {
    "key": "Marvel Ultimate Alliance 3 The Black Order DLC",
    "original_name": "Marvel Ultimate Alliance 3 The Black Order",
    "name": "Marvel Ultimate Alliance 3 The Black Order",
    "name_source": "keep",
    "original_desc": "In this new storyline, heroes and villains unite in a race across the Marvel Universe to find the Infinity Stones before Thanos and The Black Order use them to unleash cosmic chaos. From Avengers Tower to the X-Mansion and beyond, every stop on the dangerous quest to thwart Thanos results in unexpected collisions of fan-favorite characters and iconic locations.",
    "desc": "在這個新的故事情節中，英雄和惡棍聯合起來，在漫威宇宙中展開一場競賽，在滅霸和黑暗教團利用無限寶石引發宇宙混亂之前尋找無限寶石。從復仇者大廈到 X 大廈等，在阻止滅霸的危險任務中的每一站都會導致粉絲最喜愛的角色和標誌性地點發生意想不到的碰撞。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:38",
    "desc_translated_at": "2026-01-25T16:27:33",
    "original_name_hash": "39a29bb0",
    "original_desc_hash": "91dcddec"
  },
  "Human Resource Machine (USA)": {
    "key": "Human Resource Machine (USA)",
    "original_name": "Human Resource Machine",
    "name": "Human Resource Machine",
    "name_source": "keep",
    "original_desc": "Human Resource Machine is a puzzle game for nerds. In each level, your boss gives you a job. Automate it by programming your little office worker. If you succeed, you'll be promoted up to the next level for another year of work in the vast office building. Congratulations!\n\nDon't worry if you've never programmed before — programming is just puzzle solving. If you strip away all the 1s and 0s and scary squiggly brackets, programming is actually really simple, logical, beautiful, and something that anyone can understand and have fun with! Are you already an expert? There will be extra challenges for you.",
    "desc": "人力資源機器是一款適合書呆子的益智遊戲。在每個級別，你的老闆都會給你一份工作。通過對你的小辦公室工作人員進行編程來實現自動化。如果你成功了，你將被提升到一個新的級別，在這座巨大的辦公樓裡再工作一年。恭喜！\n\n如果您以前從未編程過，請不要擔心 - 編程只是解決難題。如果你去掉所有的 1 和 0 以及可怕的波形括號，編程實際上非常簡單、合乎邏輯、美觀，並且任何人都可以理解並從中獲得樂趣！您已經是專家了嗎？你將會面臨額外的挑戰。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:37",
    "desc_translated_at": "2026-01-25T16:27:34",
    "original_name_hash": "2d80a620",
    "original_desc_hash": "5854628c"
  },
  "Mujo": {
    "key": "Mujo",
    "original_name": "Mujo",
    "name": "Mujo",
    "name_source": "keep",
    "original_desc": "MUJO is a unique puzzle game with features that cannot be found in any other game. Let's start collecting tiles and erase them all to attack monsters!\n\nThis game has no end! Enjoy whenever you want as much as you would like.",
    "desc": "MUJO 是一款獨特的益智遊戲，具有任何其他遊戲所沒有的功能。讓我們開始收集瓷磚並將其全部消除以攻擊怪物！\n\n這個遊戲沒有結局！隨時隨地盡情享受。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:39",
    "desc_translated_at": "2026-01-25T16:27:34",
    "original_name_hash": "12010917",
    "original_desc_hash": "9ee994ee"
  },
  "Mario vs": {
    "key": "Mario vs",
    "original_name": "Mario vs Donkey Kong",
    "name": "",
    "name_source": "",
    "original_desc": "Solve all kinds of puzzles and test your platforming smarts as you try to recover the stolen Mini-Marios in Mario vs. Donkey Kong on Nintendo Switch.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "No Man's Sky": {
    "key": "No Man's Sky",
    "original_name": "No Man's Sky",
    "name": "No Man's Sky",
    "name_source": "keep",
    "original_desc": "Inspired by the adventure and imagination that we love from classic science-fiction, No Man's Sky presents you with a galaxy to explore, filled with unique planets and lifeforms, and constant danger and action.\nIn No Man's Sky, every star is the light of a distant sun, each orbited by planets filled with life, and you can go to any of them you choose. Fly smoothly from deep space to planetary surfaces, with no loading screens, and no limits. In this infinite procedurally generated universe, you'll discover places and creatures that no other players have seen before - and perhaps never will again. Embark on an epic voyage \nAt the centre of the galaxy lies a irresistible pulse which draws you on a journey towards it to learn the true nature of the cosmos. But, facing hostile creatures and fierce pirates, you'll know that death comes at a cost, and survival will be down to the choices you make over how you upgrade your ship, your weapon and suit. Find your own destiny \nYour voyage through No Man's Sky is up to you. Will you be a fighter, preying on the weak and taking their riches, or taking out pirates for their bounties? Power is yours if you upgrade your ship for speed and weaponry.\nOr a trader? Find rich resources on forgotten worlds and exploit them for the highest prices. Invest in more cargo space and you'll reap huge rewards.\nOr perhaps an explorer? Go beyond the known frontier and discover places and things that no one has ever seen before. Upgrade your engines to jump ever farther, and strengthen your suit for survival in toxic environments that would kill the unwary. Share your journey \nThe galaxy is a living, breathing place. Trade convoys travel between stars, factions vie for territory, pirates hunt the unwary, and the police are ever watching. Every other player lives in the same galaxy, and you can choose to share your discoveries with them on a map that spans known space. Perhaps you will see the results of their actions as well as your own...",
    "desc": "受到我們喜愛的經典科幻小說中的冒險和想像力的啟發，《無人深空》為您呈現了一個可供探索的星系，其中充滿了獨特的行星和生命形式，以及持續不斷的危險和行動。\n在《無人深空》中，每顆星星都是遙遠太陽的光芒，每顆星星都圍繞著充滿生命的行星運行，你可以選擇前往其中任何一個。從深空平穩地飛到行星表面，沒有加載屏幕，也沒有任何限制。在這個由程序生成的無限宇宙中，您將發現其他玩家以前從未見過的地方和生物 - 也許永遠不會再出現。踏上史詩般的旅程\n銀河系的中心有一股不可抗拒的脈衝，它會吸引你踏上通往它的旅程，以了解宇宙的真實本質。但是，面對敵對的生物和兇猛的海盜，你會知道死亡是有代價的，而生存將取決於你對如何升級你的船隻、武器和套裝的選擇。找到自己的命運\n無人深空的旅程由你決定。你會成為一名戰士，掠奪弱者並奪取他們的財富，還是消滅海盜以獲得賞金？如果你升級你的船的速度和武器，力量就是你的。\n還是交易員？在被遺忘的世界中尋找豐富的資源並以最高的價格開採它們。投資更多的貨艙空間，您將獲得豐厚的回報。\n或者也許是一個探險家？超越已知的邊界，發現前所未見的地方和事物。升級你的引擎以跳得更遠，並強化你的裝備，以便在有毒環境中生存，否則會殺死粗心的人。分享您的旅程\n銀河係是一個充滿生機、會呼吸的地方。貿易車隊在星際之間穿行，派系爭奪領土，海盜追捕粗心的人，警察也時刻監視著。其他所有玩家都生活在同一個星系中，您可以選擇在跨越已知空間的地圖上與他們分享您的發現。也許你會看到他們行動的結果以及你自己的行動的結果......",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:41",
    "desc_translated_at": "2026-01-25T16:27:35",
    "original_name_hash": "15e4c873",
    "original_desc_hash": "fdd1da1d"
  },
  "Kirby's Dream Buffet": {
    "key": "Kirby's Dream Buffet",
    "original_name": "Kirbys Dream Buffet",
    "name": "Kirbys Dream Buffet",
    "name_source": "keep",
    "original_desc": "Bump, battle, and boost your way to sweet victory\n \nRoll through a smorgasbord of food-themed stages in 4 rounds of 4-player fun as Kirby…who seems rounder than usual? Race through delicious obstacle courses to collect strawberries as Kirby grows. Then, turn the tides in the final round—a fruity fight atop a floating platform.\n \nHave a feast of fun with family and friends\n \nGet snacky by sharing Joy-Con controllers with a buddy on the same system, or with up to 4 players via local wireless or online. With 4 rounds, plenty of power ups called Copy Foods, and opportunities to steal strawberries, anyone can take the cake in this easy-to-play game. All ages can eat up the cute and competitive fun.\n \nCome back for seconds to level up and unlock delectable customization options\n \nDress Kirby in delectable costumes that resemble Meta Knight, King Dedede, Elfilin, and more! You'll also get more colors for Kirby, music to listen to, and stages as you increase your Gourmet Rank. Start the race in style by earning different decorations resembling cookies, chocolates, and candies from the Kirby™ series as you play!",
    "desc": "碰撞、戰鬥並助推你的勝利之路\n\n扮演卡比，在 4 輪 4 人樂趣中闖過以美食為主題的大雜燴……誰看起來比平常更圓潤？隨著卡比的成長，通過美味的障礙賽來收集草莓。然後，在最後一輪扭轉局勢——在浮動平台上進行一場水果大戰。\n\n與家人朋友共度歡樂盛宴\n\n與同一系統上的好友共享 Joy-Con 控制器，或者通過本地無線或在線與最多 4 名玩家共享 Joy-Con 控制器，享受零食。遊戲共有 4 個回合，提供大量名為“複製食物”的能力提升，還有偷草莓的機會，任何人都可以在這款易於玩的遊戲中獲得蛋糕。所有年齡段的人都可以享受可愛和競技的樂趣。\n\n返回幾秒鐘即可升級並解鎖令人愉悅的自定義選項\n\n為卡比穿上類似於梅塔騎士、帝帝帝王、艾爾菲林等的精美服裝！隨著美食等級的提高，您還將獲得更多卡比顏色、可聽音樂和關卡。在玩遊戲時獲得卡比™系列中的餅乾、巧克力和糖果等不同裝飾，以時尚的方式開始比賽！",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:42",
    "desc_translated_at": "2026-01-25T16:27:36",
    "original_name_hash": "8b538f4a",
    "original_desc_hash": "aa156326"
  },
  "Good Job!": {
    "key": "Good Job!",
    "original_name": "Good Job!",
    "name": "Good Job!",
    "name_source": "keep",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:41",
    "desc_translated_at": "",
    "original_name_hash": "2eb15ac1",
    "original_desc_hash": ""
  },
  "Minecraft": {
    "key": "Minecraft",
    "original_name": "Minecraft - Nintendo Switch Edition",
    "name": "Minecraft - Nintendo Switch Edition",
    "name_source": "keep",
    "original_desc": "Minecraft is a game about placing blocks and going on adventures.\n\nExplore randomly-generated worlds and build amazing things from the simplest of homes to the grandest of castles.\n\nPlay in Creative Mode with unlimited resources or mine deep into the world in survival mode, crafting weapons and armour to fend off the dangerous mobs.",
    "desc": "《我的世界》是一款關於放置方塊並進行冒險的遊戲。\n\n探索隨機生成的世界並建造令人驚奇的事物，從最簡單的房屋到最宏偉的城堡。\n\n在創意模式下玩無限資源，或在生存模式下深入世界，製作武器和盔甲來抵禦危險的怪物。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:42",
    "desc_translated_at": "2026-01-25T16:27:37",
    "original_name_hash": "8c64aec5",
    "original_desc_hash": "66c2d1f7"
  },
  "Lost Phone Stories": {
    "key": "Lost Phone Stories",
    "original_name": "Lost Phone Stories",
    "name": "Lost Phone Stories",
    "name_source": "keep",
    "original_desc": "In Lost Phone games you explore the intimate life of a person whose phone you have just found.\nThese games take the form of narrative investigations: to progress, connect the information found in the various messages, photos and applications. Through the interface of a cell phone, you must find out what happened to its owner.\nExperience realistic and powerful stories that help to create empathy with the characters, allowing to bring sensitive topics.",
    "desc": "在“丟失手機”遊戲中，您將探索剛剛找到手機的人的私密生活。\n這些遊戲採用敘事調查的形式：為了取得進展，連接在各種消息、照片和應用程序中找到的信息。通過手機的界面，你必須找出它的主人發生了什麼。\n體驗真實而有力的故事，有助於與角色產生同理心，從而引發敏感話題。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:43",
    "desc_translated_at": "2026-01-25T16:27:37",
    "original_name_hash": "45240095",
    "original_desc_hash": "84efd843"
  },
  "Mario Strikers Battle League Football": {
    "key": "Mario Strikers Battle League Football",
    "original_name": "Mario Strikers : Battle League",
    "name": "Mario Strikers : Battle League",
    "name_source": "keep",
    "original_desc": "Aim for victory with teamwork, tackles, table-turning items, and score-boosting Hyper Strikes in Mario Strikers: Battle League Football on Nintendo Switch. Do whatever it takes to win in frantic local multiplayer and team up with other players online to become the world's top club! Assemble a team of Mushroom Kingdom all-stars, made up of four Strikers and a goalkeeper trying to keep the ball out of your net. Each character has their own stats such as Speed, Passing and Strength, as well as the ability to unleash a game-changing Hyper Strike.",
    "desc": "在 Nintendo Switch 上的《馬里奧前鋒：足球聯賽》中，通過團隊合作、鏟球、扭轉局面的物品和提高得分的超級打擊來取得勝利。盡一切努力在瘋狂的本地多人遊戲中獲勝，並與其他在線玩家組隊成為世界頂級俱樂部！組建一支由蘑菇王國全明星組成的球隊，由四名前鋒和一名試圖將球擋出球門的守門員組成。每個角色都有自己的統計數據，例如速度、傳球和力量，以及釋放改變遊戲規則的超級打擊的能力。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:43",
    "desc_translated_at": "2026-01-25T16:27:37",
    "original_name_hash": "7cb49e1f",
    "original_desc_hash": "069b980f"
  },
  "OCTOPATH TRAVELER II": {
    "key": "OCTOPATH TRAVELER II",
    "original_name": "Octopath Traveler II",
    "name": "Octopath Traveler II",
    "name_source": "keep",
    "original_desc": "The story takes place in Solistia, a land comprising an eastern and western continent divided by the sea.\nIt is a bustling era, wherein large vessels navigate busy sea routes and the power of steam gives birth to new technologies.\nSome people thrill to glamorous stars of the stage and industry, while others are brought to tears by war, plague, and poverty.\nIn this faraway realm, eight travelers hailing from different regions venture forth for their own reasons. Step into their shoes and explore the land as you see fit, using their unique talents to aid you along your journey.\nEmbark on an adventure all your own.",
    "desc": "故事發生在索利斯蒂亞（Solistia），這是一片被大海分開的東西大陸組成的土地。\n這是一個繁華的時代，大型船舶航行在繁忙的海上航線，蒸汽的力量催生了新技術。\n有些人為舞台和工業界的光鮮亮麗的明星而興奮，而另一些人則因戰爭、瘟疫和貧困而流淚。\n在這個遙遠的國度裡，八位來自不同地區的旅人，為了各自的理由而冒險前行。站在他們的立場上，探索您認為合適的土地，利用他們獨特的才能在您的旅程中為您提供幫助。\n踏上屬於你自己的冒險之旅。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:44",
    "desc_translated_at": "2026-01-25T16:27:38",
    "original_name_hash": "f5a7b266",
    "original_desc_hash": "fd68b784"
  },
  "Pinball FX": {
    "key": "Pinball FX",
    "original_name": "Pinball FX",
    "name": "Pinball FX",
    "name_source": "keep",
    "original_desc": "Discover brand new exclusive tables created for Pinball FX, or find your favorites among more than 20 unique and visually enhanced favorites from Zen's extensive digital pinball library. Relive the most iconic moments from entertainment powerhouses like Star Wars, Legendary Entertainment and many more. Enjoy accurate re-creations of the most famous pinball machines of all time with Williams Pinball, or have fun with Zen’s original creations.\n\nNew tables arrive frequently!\n\nBuild your dream game room\n\nBuild up your own customizable 3D playroom with collectible items unlocked by playing.\n\nThe ultimate simulation\n\nEnjoy digital pinball at its finest on the Nintendo Switch with an updated and refined physics simulation",
    "desc": "探索為 Pinball FX 創建的全新專屬牌桌，或從 Zen 豐富的數字彈球庫中的 20 多個獨特且視覺效果增強的最愛中找到您的最愛。重溫星球大戰、傳奇娛樂等娛樂巨頭最具標誌性的時刻。通過 Williams Pinball 享受有史以來最著名的彈球機的精確再現，或者享受 Zen 的原創作品帶來的樂趣。\n\n新桌子經常到！\n\n打造你的夢想遊戲室\n\n通過玩遊戲解鎖可收藏物品，打造您自己的可定制 3D 遊戲室。\n\n終極模擬\n\n通過更新和完善的物理模擬，在 Nintendo Switch 上享受最好的數字彈球遊戲",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:48",
    "desc_translated_at": "2026-01-25T16:27:38",
    "original_name_hash": "8f75b371",
    "original_desc_hash": "0f9d4b5e"
  },
  "Retro City Rampage DX (USA)": {
    "key": "Retro City Rampage DX (USA)",
    "original_name": "Retro City Rampage DX",
    "name": "Retro City Rampage DX",
    "name_source": "keep",
    "original_desc": "Retro City Rampage reimagines the open world crime genre like it's 1989. Jump on civilians for coins -- then steal their car and outrun the law! Explore the city and complete missions, or just go on a rampage with your weapons, power-ups and vehicles!\n\nThis pop culture send-up includes a full Story Mode of open world adventure, plus Arcade Challenges for quick\npick-up-and-play action. If that's not enough, it also packs an interactive city full of shops, minigames, customizations, collectibles, special guest stars, and more.",
    "desc": "《Retro City Rampage》重新構想了 1989 年的開放世界犯罪類型。向平民撲向金幣，然後偷走他們的汽車並逃脫法律制裁！探索城市並完成任務，或者只是用你的武器、能量和車輛橫衝直撞！\n\n這個流行文化諷刺包括開放世界冒險的完整故事模式，以及快速的街機挑戰\n拾取並播放動作。如果這還不夠，它還包含一個充滿商店、迷你游戲、定制、收藏品、特邀明星等的互動城市。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:45",
    "desc_translated_at": "2026-01-25T16:27:38",
    "original_name_hash": "4e315cac",
    "original_desc_hash": "2a5dc446"
  },
  "Picross S＋": {
    "key": "Picross S＋",
    "original_name": "Picross S+",
    "name": "Picross S+",
    "name_source": "keep",
    "original_desc": "The latest in the Picross S series, in which problems from the Picross e series can be played!\n\nPicross S+ allows users to play puzzle problems from the nine titles in the Picross e series, which have been downloaded a total of 680,000 times as Nintendo 3DS download-only software, using the Picross S system.\n\nBasic software containing problems from the original Picross e, with problems from Picross e2 through e9 available for download as additional paid downloadable content.",
    "desc": "Picross S系列的最新作品，可以玩Picross e系列的問題！\n\nPicross S+允許用戶使用Picross S系統玩Picross e系列的九款遊戲中的謎題，這些遊戲作為任天堂3DS的僅限下載軟件，總共被下載了68萬次。\n\n包含原始 Picross e 問題的基本軟件，以及 Picross e2 到 e9 的問題可作為附加付費下載內容下載。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:49",
    "desc_translated_at": "2026-01-25T16:27:39",
    "original_name_hash": "c3604510",
    "original_desc_hash": "ae342192"
  },
  "Super Mario Bros": {
    "key": "Super Mario Bros",
    "original_name": "Super Mario Bros. Wonder",
    "name": "",
    "name_source": "",
    "original_desc": "Find wonder in the next evolution of Mario fun. Classic Mario side-scrolling gameplay is turned on its head with the addition of Wonder Flowers. These game-changing items trigger spectacular moments you have to see to believe... Witness pipes coming alive, wreak havoc as a giant spiky ball, and see even more unexpected events called Wonder Effects. Pick from heroic Super Mario™ characters and Power-Ups. Choose from familiar characters including Mario, Luigi, Peach, Daisy, Yoshi and Toad. Transform into Elephant Mario to use your trunk to trounce enemies with a surprising new Power-Up! Share the wonder with friends and Mario fans. Team up with up to three friends locally* and gather around one Nintendo Switch™ system to experience the game-bending Wonder Effects together as you tackle courses as a team and help each other on your way to the goal.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Undertale": {
    "key": "Undertale",
    "original_name": "Undertale",
    "name": "Undertale",
    "name_source": "keep",
    "original_desc": "Undertale is an Eastern RPG with some action aspects in its combat system. In the overworld, the player explores areas, solves puzzles, and talks to NPCs. When a battle is triggered, typically through random encounter, the game switches to the combat screen. A heart representing the child's soul appears in a small box, in which objects representing the monsters' attacks appear and must be dodged in real time. On the child's turn, they can attack monsters more directly through the fight command. A meter that determines the strength of the player's attack must be hit with good timing in order to deal more damage.",
    "desc": "Undertale 是一款東方角色扮演遊戲，其戰鬥系統中包含一些動作元素。在主世界中，玩家探索區域、解決謎題並與 NPC 交談。當戰鬥被觸發時（通常是通過隨機遭遇），遊戲會切換到戰鬥屏幕。代表孩子靈魂的心出現在一個小盒子裡，裡面出現代表怪物攻擊的物體，必須實時躲避。輪到孩子的時候，他們可以通過戰鬥命令更直接地攻擊怪物。決定玩家攻擊強度的儀表必須在良好的時機被擊中，才能造成更多傷害。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:50",
    "desc_translated_at": "2026-01-25T16:27:39",
    "original_name_hash": "5fb005af",
    "original_desc_hash": "eb5ad103"
  },
  "Jim is Moving Out": {
    "key": "Jim is Moving Out",
    "original_name": "Jim is Moving Out",
    "name": "Jim is Moving Out",
    "name_source": "keep",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:50",
    "desc_translated_at": "",
    "original_name_hash": "0b08fc5a",
    "original_desc_hash": ""
  },
  "Alien Escape": {
    "key": "Alien Escape",
    "original_name": "Alien Escape",
    "name": "Alien Escape",
    "name_source": "keep",
    "original_desc": "",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T15:47:51",
    "desc_translated_at": "",
    "original_name_hash": "4cde59f6",
    "original_desc_hash": ""
  },
  "New Super Mario Bros. U Deluxe": {
    "key": "New Super Mario Bros. U Deluxe",
    "original_name": "New Super Mario Bros. U Deluxe",
    "name": "",
    "name_source": "",
    "original_desc": "Join Mario, Luigi, and pals for single-player or multiplayer fun anytime, anywhere! Take on two family-friendly, side-scrolling adventures with up to three friends as you try to save the Mushroom Kingdom. Includes the New Super Mario Bros. U and harder, faster New Super Luigi U games—both of which include Nabbit and Toadette as playable characters!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mario vs. Donkey Kong": {
    "key": "Mario vs. Donkey Kong",
    "original_name": "Mario vs Donkey Kong",
    "name": "",
    "name_source": "",
    "original_desc": "Solve all kinds of puzzles and test your platforming smarts as you try to recover the stolen Mini-Marios in Mario vs. Donkey Kong on Nintendo Switch.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Mario Bros. Wonder": {
    "key": "Super Mario Bros. Wonder",
    "original_name": "Super Mario Bros. Wonder",
    "name": "",
    "name_source": "",
    "original_desc": "Find wonder in the next evolution of Mario fun. Classic Mario side-scrolling gameplay is turned on its head with the addition of Wonder Flowers. These game-changing items trigger spectacular moments you have to see to believe... Witness pipes coming alive, wreak havoc as a giant spiky ball, and see even more unexpected events called Wonder Effects. Pick from heroic Super Mario™ characters and Power-Ups. Choose from familiar characters including Mario, Luigi, Peach, Daisy, Yoshi and Toad. Transform into Elephant Mario to use your trunk to trounce enemies with a surprising new Power-Up! Share the wonder with friends and Mario fans. Team up with up to three friends locally* and gather around one Nintendo Switch™ system to experience the game-bending Wonder Effects together as you tackle courses as a team and help each other on your way to the goal.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  }
}