{
  "Armored Unit (Japan)": {
    "key": "Armored Unit (Japan)",
    "original_name": "Armored Unit (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Armored Unit is an entertaining strategy game (once the Japanese menu's are conquered) that suffers to having enemies either too easy or far too hard.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Bakusou Dekotora Densetsu for WonderSwan (Japan)": {
    "key": "Bakusou Dekotora Densetsu for WonderSwan (Japan)",
    "original_name": "Bakusou Dekotora Densetsu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "You are a young man who lives in Japan and likes driving trucks. There is a competition of truck drivers who deliver goods all across the country. Willing to impress your girlfriend Yukie, you decide to participate in the races and to win the title of the best trucker in Japan.\n\nDekotora is short for \"decorated truck\", and this racing game consists not only of driving your truck through the highway, trying to be faster than your rivals, but also of buying various stuff for your truck and decorating it. Depending on your results in the races, you can buy truck parts and customize it the way you wish.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Beatmania for WonderSwan (Japan)": {
    "key": "Beatmania for WonderSwan (Japan)",
    "original_name": "Beatmania (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This is a portable version of beatmania and as such it contains everything one could hope for in such a game, a series of music track (with reproduced vocals!), a lot of buttons to press, and a lot of vinyl to scratch.\n\nAfter you select the music you want to play you'll have a vertical scroll which will indicate when you should hit one of the left directional buttons along with the music. The game also indicates when you should 'scratch' which should be be familiar to anyone who has played a beatmania arcade game. This refers to the scratching of a record, one might think that the WonderSwan is ill-equiped for such a for of input, well think again! beatmania for WonderSwan included in its packaging a miniature record that could be fitted over the right directional keys to  make scratching more realistic.\n\nAs you finish songs you'll on lock more difficult and interesting(?) tunes. The game plays vertically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Buffers Evolution (Japan)": {
    "key": "Buffers Evolution (Japan)",
    "original_name": "Buffers Evolution (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In a post-apocalyptic future a gambling syndicate seeks to make a quick buck in the gritty remains of earth. By fusing the best of animal and mechanical traits they create three bestial androids from a bird, a lion, and a rhinoceros. Bets are taken and then the robots are loosed into hostile mazes of scrap metal on old earth. Maybe they'll even make it back alive...\n\nThe goal of BUFFERS EVOLUTION is to run through a course while collecting ten parts in the best time possible. The courses are large and vary between jungle scenes, deserts, old factories, and general mechanical wastes. These areas are cased in by electricity to stop the contests from escaping and thereby ruining the entertainment of the masses. This will keep you in the bounds of the course. With the press of a button your character will momentarily turn into a 'buffer', a sharp pisiform metallic object, while being a buffer you can destroy enemies by slamming into them, this will often bounce you in a given direction, which is useful for reaching high ledges. \n\nAlthough you do not need to get all the parts to clear an area special items can be accrued by collection parts, while on the course proper these parts will heal any damage you may have taken. Perhaps if you collect all the part in all nine areas you'll have the means to escape you captors? \n\nGameplay is reminiscent of Sonic the Hedghog\n although in those games you race against a countdown while here you are merely trying to get good times.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Cardcaptor Sakura - Sakura to Fushigi na Clow Card (Japan)": {
    "key": "Cardcaptor Sakura - Sakura to Fushigi na Clow Card (Japan)",
    "original_name": "Cardcaptor Sakura - Sakura to Fushigi na Clow Card (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Card Captor Sakura: Sakura to Fushigi na Clow Card is a Role-Playing game, developed by Sims and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Chou Aniki - Otoko no Tamafuda (Japan)": {
    "key": "Chou Aniki - Otoko no Tamafuda (Japan)",
    "original_name": "Ch Aniki: Otoko no Tamafuda (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Cho Aniki makes it's first appearance in a handheld console with Cho Aniki: Otoko no Tamafuda, only this time the game isn't a 2D shooter developed by Masaya, but instead a card-fighting RPG.\n\nYou select your character from a roster of Cho Aniki characters and set out to explore it's funky body-building universe and challenge the many npcs for a few rounds of card combat. Win and you get to increase your collection. Special cards can be unlocked by defeating another player in the vs. mode.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Chaos Gear - Michibikareshi Mono (Japan)": {
    "key": "Chaos Gear - Michibikareshi Mono (Japan)",
    "original_name": "Chaos Gear - Michibikareshi Mono (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Chaos Gear: Michibikareshi Mono is a Strategy game, developed by Lay-Up and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Chocobo no Fushigi na Dungeon for WonderSwan (Japan)": {
    "key": "Chocobo no Fushigi na Dungeon for WonderSwan (Japan)",
    "original_name": "Chocobo no Fushigi na Dungeon for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This is the first game in the Chocobo's Dungeon series.  You take on the character of Chocobo and adventure through a randomly created dungeon.\n\nThe story evolves from the opening movie when a fellow chocobo is \"turned\" evil by a crystal he finds in a garden.  When the evil chocobo kicks you into a dungeon, the adventure begins.  Travel through an ever changing dungeon, collecting items and weapons to become more powerful, so you can defeat the increasingly difficult enemies.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Chou Denki Card Battle - Youfu Makai (Japan)": {
    "key": "Chou Denki Card Battle - Youfu Makai (Japan)",
    "original_name": "Chou Denki Card Game - Youfu Makai - Kikuchi Shuuk (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Chou-Denki Card Battle: Youfu Makai - Kikuchi Shuugyou is a card based simulation game, published by Koubunsha, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Clock Tower for WonderSwan (Japan)": {
    "key": "Clock Tower for WonderSwan (Japan)",
    "original_name": "Clock Tower (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Jennifer and her friends are adopted by a nice lady named Mary one day. They expect to be going to a wonderful new home, at the Barrows Mansion. There they will live with Mary and Mr. Barrows. Unfortunately, something goes terribly wrong and Jennifer's friends are showing up dead one by one.  While this is happening, Mary is missing and Jennifer ends up being chased by a crazed psychopath known only as...Scissorman. \n\nNow she must survive and get out of the mansion in this point-and-click horror adventure... Being a teenage girl, you have no special abilities at all, just your wits and your will to survive, there are a few enemies that can kill you instantly, but Scissorman is the true horror that will give you trouble.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Crazy Climber (Japan)": {
    "key": "Crazy Climber (Japan)",
    "original_name": "Crazy Climber (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Dans la peau de Crazy Climber, grimpez jusqu'au sommet d'une série de bâtiments, où un hélicoptère vous attend pour vous récupérer et vous emmener au bâtiment suivant. Lorsque Climber escalade un bâtiment, il est capable de monter et de se déplacer latéralement, mais il ne peut pas descendre.nnPendant l'escalade d'un bâtiment, les fenêtres s'ouvrent et se ferment simultanément. Si une fenêtre se ferme sur l'une de ses mains, il perd sa prise. Cependant, si une fenêtre se ferme sur ses deux mains, il tombera et mourra, ce qui entraînera la perte d'une vie. Vous disposez de trois grimpeurs au total, mais un grimpeur supplémentaire vous est attribué tous les 30 000 points.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Densha de Go! (Japan)": {
    "key": "Densha de Go! (Japan)",
    "original_name": "Densha de Go! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Based on the 1996 arcade game, Densha de Go! was one of the first commercial train-driving simulation games, and went on to spawn numerous successors.\n\nThe player can choose from a variety of tracks and trains and will then have to drive the train to the designated stations while sticking to the tight schedule, stopping exactly at the marked positions, obeying all signs and signals, and ensuring passenger safety and comfort.\n\nWhenever the player makes a mistake, points are deducted from a counter which at the start of each round is initialized to a value depending on the selected difficulty. If it reaches zero, the game is over.\n\nThe following lines are featured:\n\n1. Sagano Main Line (Sanin Line) from Kameoka to Kyoto\n2. Keihin-Tohoku Line from Shinagawa to Yokohama\n3. Tokaido Main Line (JR Kyoto Line) from Kyoto to Osaka\n4. Yamanote Line (Inner Circle) from Shibuya to Tokyo Station\n5. Tokaido Main Line EX from Takatsuki to Osaka, part of the rapid Tokaido Main Line from the original version, but this time with stops at every station (Windows only)\n6. Sagano Line EX from Kameoka to Kyoto, without the shortcut from Saga-Arashiyama to Tambaguchi from the original version (Windows only)",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Densha de Go! 2 (Japan)": {
    "key": "Densha de Go! 2 (Japan)",
    "original_name": "Densha de Go! 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The 1998 sequel of the popular Japanese train driving game by Taito has once again been ported to various home systems. For the first time on the PlayStation, it is possible to drive through the snow, and take a seat in the cockpit of a Shinkansen bullet train.\n\nThe gameplay is more arcade than simulation. The focus is on stopping at the stations at the perfect moment and position, keeping up with the schedule, obeying signals and speed limits, and ensuring the safety and comfort of the passengers. Mistakes result in points being deducted from a counter. If it reaches 0, the game is over.\n\nThe following routes are available:\n\n1. Hokuhoku Line from Naoetsu to Uragawara\n2. Tohoku Shinkansen from Morioka to Shin-Hanamaki\n3. Akita Shinkansen from Akita to Omagari\n4. Keihin-Tohoku Line from Shinagawa to Ueno\n5. Osaka Loop Line from Osaka to Tennoji (not in the Arcade original)\n6. Kagoshima Main Line from Hakata to Kokura (only in PlayStation and Windows versions)",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digimon - Ver": {
    "key": "Digimon - Ver",
    "original_name": "Digimon - Ver. WonderSwan (Asia)",
    "name": "",
    "name_source": "",
    "original_desc": "Digimon Ver. WonderSwan is a Japanese handheld version of the original Tamagotchi-like Digimon pet for the WonderSwan. It includes all of the original Digimon from the five different pet devices. In this game the player can have up to five different Digim",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digital Monster - Ver": {
    "key": "Digital Monster - Ver",
    "original_name": "Digimon - Ver. Wonderswan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Digimon Ver. WonderSwan is a Japanese handheld version of the original Tamagotchi-like Digimon pet for the WonderSwan. It includes all of the original Digimon from the five different pet devices. In this game the player can have up to five different Digim",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digimon Adventure 02 - Tag Tamers (Japan)": {
    "key": "Digimon Adventure 02 - Tag Tamers (Japan)",
    "original_name": "Digimon Adventure 02: Tag Tamers (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the manga series Digimon, in which children can travel to a digital world and help good digital monsters to defeat evil ones. In this game, the two heroes, Ryou and Ken, are summoned to the Digiworld to fight against the archenemy Millenniumon and his side-kick Diablomon. Upon defeating the two evil monsters once again, the heroes realize that Millenniumon has taken a different shape and is reborn to conquer the Digiworld anew. Now you must recruit digital monsters and lead them into the ultimate battle.\n\nThe gameplay follows traditional Digimon outlines: you descend into dungeons and have your monster friends fight other monsters in turn-based combat. Upon returning to the town, you can make those monsters participate in future battles. Unlike the two previous Digimon Adventure games,  Anode and  Cathode Tamers, you cannot move over the battle field.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digimon Adventure - Anode Tamer (Japan)": {
    "key": "Digimon Adventure - Anode Tamer (Japan)",
    "original_name": "Digimon Adventure: Anode Tamer (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The game is based on the popular manga series Digimon, which follows the adventures of children who can gain access into the digital world and fight digital monsters there. In this game, the evil Milenniamon has kidnapped several children and is planning to take control over the Digiworld. One of the good monsters, Agumon, escaped, and transported the hero Ryou to the Digiworld. Now Ryou has to fight monsters, capture them, and assemble an army to overthrow Milenniamon and to rescue his friends.\n\nThe gameplay involves mainly hunting monsters in dungeons and then sending them to fight other monsters. In the town you can buy supplies and take care of your monsters. The battles are turn-based, and you can move freely over the battle field. Once a contact with an enemy is initiated, an automatic battle sequence follows.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digimon Adventure - Cathode Tamer (Japan)": {
    "key": "Digimon Adventure - Cathode Tamer (Japan)",
    "original_name": "Digimon Adventure: Cathode Tamer (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This is the second game in Digimon Adventure series, a kind of an add-on to  Anode Tamer. The game is based on the popular manga Digimon. The hero, a boy named Ryou, has to travel to digital world in order to free his friends from the clutches of the evil digital monster Milenniamon.\n\nThe story of this game is identical to that of \"Anode Tamer\", and gameplay mechanics are exactly the same: you descend into dungeons to fight monsters in turn-based style, capture the monsters after the battles and then send them to fight new ones. The difference between the two games are the monsters themselves: \"Cathode Tamers\" features a brand new set of monsters, and since the beginning of the game you encounter different foes. The full collection of monsters can be achieved only if you complete both games.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digital Partner (Japan)": {
    "key": "Digital Partner (Japan)",
    "original_name": "Digital Partner (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Digital Partner is a Strategy game, developed by Tom Create and published by Bandai, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Dokodemo Hamster (Japan)": {
    "key": "Dokodemo Hamster (Japan)",
    "original_name": "Dokodemo Hamster (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In this game, you are the owner of a hamster. Your hamster is inside a cage, and is living its life in real time, regardless of your actions, walking around, sleeping, etc. However, you can do many things to help your hamster feel better. There is a list of topics you can \"discuss\" with the hamster: for example, you can order it to run inside a wheel, or ask it whether it is hungry or not. You can feed it some typical hamster food, clean the cage from time to time, and even write e-mails to your hamster. Depending on your actions the disposition of the hamster will change.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "D's Garage 21 Koubo Game - Tane o Maku Tori (Japan)": {
    "key": "D's Garage 21 Koubo Game - Tane o Maku Tori (Japan)",
    "original_name": "D's Garage 21: Koubo Game - Tane wo Maku Tori (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The raven has made a friend. But sorrow be to this raven, for this fellow avian migrates, and will not return for seasons. Filled with sadness and regret the raven takes wing. As he soars through his lonely world his tears begin to fall... and water dying flowers. At last he knows what he must do until his friend returns, he will make new friends in the flowers. He will help them grow and spread their seeds. \n\nEach level in Tane wo Maku Tori contains four pillars bridged by a series of horizontal or vertical rows. These rows are different for each of the three spaces formed by the pillar. The rows may be moved up and down, one set at a time. At the foot of a column, up to three in harder areas, will be a nascent flower. Water drops will fall along the path of the pillars, which will have a different theme for each level, and eventually either fall onto the ground or a flower. Water drops will always move along a bridge if it intersects their path, drops can't go up diagonals. Drops an combine to create larger faster moving drops. Any more than three drops and it will simply fall off the pillar, or bridge, and be of no use.\n\nWhen a flower gets enough rain drops, or tear drops, it will bloom, when all the flowers on the stage bloom it will be cleared. \n\nEnemies also roam the stage, gobbling up hydrogen based solution and plants. They follow the same laws as the drops and will move along beams when encountered, however they can go up vertical beams. Should one reach a flower it will nibble at it until dead. This ends the game; however, enemies can be destroyed by three drops combined. \n\nA time mode is available where the player picks a difficulty level and then plays on the level until a flower is eaten or they run out of time, each completed flower will add to the time. \n\nA two player mode is available through the Communication Cable\n\nThis game is played vertically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Engacho! for WonderSwan (Japan)": {
    "key": "Engacho! for WonderSwan (Japan)",
    "original_name": "Engacho! for Wonderswan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Engacho is based on a popular Japanese children game. You play a little boy named Sunzuki, who wants to prove to his angry father that he is not a coward and can stand up against the terrible monsters of the Oops Five group. Those five guys are extremely ugly and can contaminate you with an awful disease the moment they touch you. So you should outsmart them and run away before they can catch you. The gameplay is turn-based.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fever - Sankyo Koushiki Pachinko Simulation for WonderSwan (Japan)": {
    "key": "Fever - Sankyo Koushiki Pachinko Simulation for WonderSwan (Japan)",
    "original_name": "Fever: Sankyo Koushiki Pachinko Simulation (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Fever is a pachinko simulator. Pachinko is a Japanese  cross between a pinball case and a slot machine. This game supplies the player with a number of different pachinko machines, with rotating slot numbers. These can be either in a classic form of rotating wheels or an interactive digital screen. As the balls pop around the pachinko machine they'll land in different areas and effect your earnings. The player can always choose the speed at which balls are being launched onto the field which will change how they land.\n\nThis simulator also has a collection hall where the player can use his pachinko earnings to buy gambling machines and related memorabilia. These can be viewed along with information about their history.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Final Lap 2000 (Japan)": {
    "key": "Final Lap 2000 (Japan)",
    "original_name": "Final Lap 2000 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Final Lap 2000 is the first hand-held incarnation of Namco's Final Lap racing games. \n\nThis version presents a number of modes, a track building feature, and only one vehicle; an open-wheel car.\n\nThe modes are as follows:\n\n1. World Tour: in the mode the player will compete against five other racers and progress through many tracks located around the world. Although the graphics are not  very descriptive of location, the course's shape and curves will always change.\n\n2. Arcade: in this classic mode you'll race against a single opponent through one of the many global tracks of your choosing.\n\n3. Time Trial: here the player will attempt to make the best time on a course of his choosing. The player is the only car on the track for this mode.\n\nThe track editing feature can only be used to make simple tracks at the start of the game; however, playing the World Tour will unlock new track parts based on your performance. Using the communication cable players can transfer tracks between different copies of Final Lap 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fire Pro Wrestling for WonderSwan (Japan)": {
    "key": "Fire Pro Wrestling for WonderSwan (Japan)",
    "original_name": "Fire Pro Wrestling for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The first North American release of the Fire Pro Wrestling series comes to the Game Boy Advance.\n\nFire Pro Wrestling has a stacked roster, comprised of many not-quite-copyright-infringing wrestlers like \"The Bionic Man\" Steve Majors (\"Stone Cold\" Steve Austin) and Axe Duggan (Hulk Hogan), making WCW vs. WWF vs. ECW matches possible.  The controls are much more than the typical \"mash buttons until something happens\" that were so popular in earlier wrestling games, instead relying on timing to properly execute a move or hold.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Fishing Freaks - Bass Rise for WonderSwan (Japan)": {
    "key": "Fishing Freaks - Bass Rise for WonderSwan (Japan)",
    "original_name": "Fishing Freaks: BassRise for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Following in the footsteps of the fishing simulation/rpg Bass Rise this portable remake. Although one can no longer select the gender of  the character there  still remains a great variety of lures and poles to select. As well as five locations. Once a location has been selected a prompt to fill the tacklebox with the lures that and rod that might be most appropriate for the environment. The player then selects where to want to stand on the shore and then the ideal location for a cast.\n\nThe view then switches to a closer overhead of the body of water and the player's avatar. A power meter sways over head and should the play manage to stop the meter at just the right point he will be rewarded with his cast going closer to where he intended. Once in the water the player's lure will always be in the center of the screen.\n\nCatching fish is no easy matter as the PlayStation version frequently points out; it is all about finesse. The player will have to entice the fish with wiggles and jolts from the lure... this is of course assuming that the player has selected the right lure. Once a fish is caught a small screen will pop up within the screen, showing a close up of the fish's shadow on the surface of the water. The player will get a chance to see if he hooked something good should the fish jump, as they reel it in.\n\nRecords can be shared by means of the Communication Cable.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "From TV Animation One Piece - Mezase Kaizoku Ou! (Japan)": {
    "key": "From TV Animation One Piece - Mezase Kaizoku Ou! (Japan)",
    "original_name": "From TV Animation One Piece - Mezase Kaizoku Ou! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "From TV Animation One Piece: Mezase Kaizoku Ou! is an Adventure game, developed and published by Bandai, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ganso Jajamaru-kun (Japan)": {
    "key": "Ganso Jajamaru-kun (Japan)",
    "original_name": "Ganso Jajamaru-kun (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Ganso JaJaMaru-kun is a remake of the NES platformer Ninja JaJaMaru-kun. It includes new levels and bosses that stretch the gameplay in novel ways.\n\nLord Namazu Dayuu has kidnapped JaJaMaru-kun's beloved Princess Sakura. This piratical lord is no laughing matter, despite his sadistically gleeful disposition, he possess an army of creatures drawn from Japanese folklore to prevent you from reuniting with your princess ever again.\n\nThe game is quite simple and plays, for the most part, much like its predecessor. Jajamaru-kun begins on the bottom of a three tiered horizontal field. On each level of this field there are two enemies on each tier. The tiers have weak brick points in that Jajamaru-kun can break by hitting them with his head while, a common trait for arcade heroes. Once a passage is made Jajamaru-kun can move through them as can enemies. To clear a level all enemies must be defeated, most enemies can be killed by having a shuriken thrown at them, the only weapon available without a power-up, some need to be stunned either by falling through a hole in a tier or by being jumped on. Enemy projectiles can also be canceled out by the shuriken. Being touched by an enemy projectile, or in a few cases an enemies body, will instantly kill Jajamaru-kun. After an enemy has been killed its spirit will ascend, you can grab this for extra points.\n\nEach of these stages has a leader who will posses some special attribute and present a new sprite. After the level in which the leader appears he/she/it will show up in the following levels as a standard level enemy often a bit weaker. Each stage gives you two minutes to complete it, except bosses and special stages. When about one minute remains Lord Namazu will send an orb of fire onto the stage that will slowly home after Jajamaru-kun.\n\nYou start the game with two extra lives and three continues. More lives can be found in the game, or by accruing points.  \n\nThere are four levels in each game area, village, graveyard, castle and town, seaside and ship, and the hidden island. However it is not enough to kill all the enemies in a stage to progress to the next area. Each level has its a cherry blossom that will descend from the top of the screen at a certain point. If you should kill all the enemies before the blossom arrives or the blossom floats of the bottom of the screen you'll go onto the next level but have to return to get it later, in this case all the enemies will have returned. Collecting all four cherry blossoms will allow you to go onto a special stage and the area boss.\n\nEach game area has one special stage. These stages use the familiar tiers but now they scroll upwards and are littered with traps and hazards; such as, wheels of fire, falling logs, spikes, conveyor belts, etc.. As the scrolling is automatic should Jajamaru-kun not keep up and fall off the bottom of the screen he will die, touching any deadly hazard will also dispatch our hero. Should the player reach the top of the tiers he will be confronted with a gate that his shuriken will open, this leads to a boss.\n\nEach area boss is attacked in a unique boxed in area, sometimes with platforms. The final boss is the only area where Jajamaru-kun may throw his shuriken vertically. There are no power-ups in boss rooms.\n\nThe power-ups that can be found in the bricks between tiers wear out after a certain amount of time, with the exception of the frog. They will appear on the upper right hand corner of the screen so you know which ones you've picked up recently, getting the frog clears this list.\n\n1. Invisibility potion: an invisible ninja is an unstoppable ninja. Once a ninja takes the potion you'll become an ninja outline and can go through enemies. Nothing can harm you, but that doesn't limit your ability to dispatch foes.\n\n2. Ninja Cart: this is a small velocoped for ninja, one in this cart you'll be able to kill enemies by barreling into them, even though it doesn't make physical sense you can still jump in this cart.\n\n3. Big Shuriken: this will make your ninja stars about as big as you are, easily defeating evasive enemies\n\n4. Long Distance: this weapon upgrade will make your attacks go across the entire screen.\n\n5. Katana: a fearsome sword, the katana can do away with any foe, regardless of if they have armor or are to low to hit with your normal attack. The katana also destroys incoming projectiles, however, this blade has a very limited range so be careful.\n\n6. Boomerang: causes your shuriken to fly back at you, it wont harm you, but it is great for picking off foes that are weak from behind.\n\n7. Speed increase: this spherical power-up increases Jajamaru-kun speed to the the peril of his enemies, and himself.\n\n8. Watch: this item will give you more time.\n\n9. Extra Ninja: this item will grant you an extra life, very rare! They do not count as a collected item.\n\n10. Inscribed Coin: these coins available in white and black are worth varying amounts of points. They do not count as a collected item.\n\n11. Bombs: these items look like two speed boost orbs, or the wheels of the cart, however, they are a trap. Jumping into these means instant death for Jajamaru-kun\n\n12. Trusty Frog: Jajamaru-kun's noble steed, a humongous man-eating frog. Should you collect four power-ups instead of receiving the power of the fourth you will get to ride on your gigantic frog and eat all the enemies on the stage. This can be dangerous though if you have not yet gotten the stages petal as once on the frog it won't show up. There is no time limit on how long the frog stays, unless of course the time runs out entirely before you gobble up all the enemies. Once a stage ends you will have to repeat the item collection process to ride the frog again. Items in your collection carry over between stages so you can strategically pick a fourth on a stage where you need the frog.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Glocal Hexcite (Japan)": {
    "key": "Glocal Hexcite (Japan)",
    "original_name": "Glocal Hexcite (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hexcite is a puzzle game played on a honeycomb-like playing field. In the center is a hexagon; six more hexagons make up the entire playing field. Because of the turn-based gameplay, two people can play using only one system. Two-player link mode is also",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Gomoku Narabe & Reversi - Touryuumon (Japan)": {
    "key": "Gomoku Narabe & Reversi - Touryuumon (Japan)",
    "original_name": "Gomoku Narabe & Reversi Touryuumon (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A simple collection of two classic puzzle games Gomoku Narabe & Reversi/Othello.\n\nGomoku Narabe, is a ancient Japanese game the title of which means \"five stones in a row\". The goal of the game is to place five tokens of your color (white or black) in a row. Of course your opponent will be trying to block you. The game ends when  a player achieves tis penta-worthy task. The board is 14 x 14.\n\nReversi is a game commonly know under the name that it is marketed by Pressman, Othello. In reversi ones goal is to flip the opponents tiles (white or black) by surrounding the opposing token(s) on either end with your own. The board is 8x8.\n\nA challenge mode approaches! You can battle your way through ranks of board game master beginning with a horrid smiling goblin and moving up to a mysterious old guru.\n\nTwo players can play the game through the Communication Cable, which is odd as it would seem feasible to play the games on a single system, but what can ya do?",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Goraku Ou Tango! (Japan)": {
    "key": "Goraku Ou Tango! (Japan)",
    "original_name": "Goraku Ou Tango! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Go Raku Ou Tango! is a simple word game mimicking the puzzles found in the pages of popular printed Japanese word-puzzle publisher Sekai Bunka. These puzzles consist of taking words writing in English and the two syllabaries of Japan Hiragana, or Katakana, and moving tiles around beneath the word(s) to recreate them in a different writing style. There are several variants on this gameplay.\n\nThere is a story mode featuring a family of archaeologists who are digging up Japanese orthography across the globe. Sweden, for instance, is known not only as being the home of lost Atlantis but also troves of buried Japanese writing! A family member is missing perhaps there will be clues in this the ruins of these global ancient Japanese ruins? By completing the puzzles you will get to see a scene and a new more difficult puzzle.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "GunPey (Japan)": {
    "key": "GunPey (Japan)",
    "original_name": "GunPey (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Gunpey is a puzzle game set in the wild west. Your goal is to connect pieces of fuses to get one long fuse going across the board, making it explode and disappear. There are several game modes in Gunpey, such as the classical puzzle game modes \"Endless mode\", where you can either play until you mess up or timed, either for 2 or 5 minutes. \"Stage mode\", where you have to clear a certain amount of tiles before advancing to the next stage. \"Puzzle mode\", where you have a set amount of fuse pieces and you need to make them all go away in one explosion. And finally \"Vs. mode\", where you can face off against a friend.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hanafuda Shiyouyo (Japan)": {
    "key": "Hanafuda Shiyouyo (Japan)",
    "original_name": "Hanafuda Shiyouyo (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hanafuda Shiyouyo is an action based card game, published by Kaga Tech, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Harobots (Japan)": {
    "key": "Harobots (Japan)",
    "original_name": "Harobots (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Harobots is a game series developed by Sunrise Interactive, it features Haro from Gundam series, as a protagonist's pet. Haro can be customized and battle for its trainer from any mecha series by Sunrise. This game series never released outside Japan due",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Hunter X Hunter - Ishi o Tsugu Mono (Japan)": {
    "key": "Hunter X Hunter - Ishi o Tsugu Mono (Japan)",
    "original_name": "Hunter X Hunter - Ishi wo Tsugu Mono (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Hunter X Hunter is a Japanese manga series written and illustrated by Yoshihiro Togashi. The story focuses on a young boy named Gon, who discovers that his father, whom he was told was dead, is actually alive and well. He learns that his father, Ging, is",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kakutou Ryouri Densetsu Bistro Recipe - Wonder Battle Hen (Japan)": {
    "key": "Kakutou Ryouri Densetsu Bistro Recipe - Wonder Battle Hen (Japan)",
    "original_name": "Kakutou Ryouri Densetsu Bistro Recipe - Wonder Bat (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kakutou Ryouri Densetsu Bistro Recipe: Wonder Battle Hen is a Strategy game, developed and published by Banpresto, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kaze no Klonoa - Moonlight Museum (Japan)": {
    "key": "Kaze no Klonoa - Moonlight Museum (Japan)",
    "original_name": "Kaze no Klonoa: Moonlight Museum (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In this game, you control a boy named Klonoa. One day he sees a dream in which he learns that somebody has stolen a fragment of the moon. He is told that the thieves are probably some painters who took the moon fragment into a museum. As Klonoa enters the music, he gets teleported into a mysterious world. Now he has to use his wit in order to overcome all the obstacles in this world and retrieve the moon fragment.\n\nKaze no Klonoa: Moonlight Museum is a platform game with an emphasis on puzzle-solving. The enemies you encounter can be inflated with the help of Klonoa's yo-yo, and carried around. You can throw them at other enemies, or use them to jump to higher ledges. In addition, there are various kinds of symbols you have to collect to open locked doors, teleporters, switches, time bombs, and other ingredients for puzzles.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Keiba Yosou Shien Soft - Yosou Shinkaron (Japan)": {
    "key": "Keiba Yosou Shien Soft - Yosou Shinkaron (Japan)",
    "original_name": "Keiba Yosou Shien Soft - Yosou Shinkaron (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Yosou Shin Karon is a Horse Racing game, published by Media Entertainment, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kiss Yori": {
    "key": "Kiss Yori",
    "original_name": "Kiss Yori... - Seaside Serenade (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kiss Yori... Seaside Serenade is an Adventure game, developed by Kid, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kosodate Quiz Dokodemo - My Angel (Japan)": {
    "key": "Kosodate Quiz Dokodemo - My Angel (Japan)",
    "original_name": "Kosodate Quiz Dokodemo - My Angel (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kosodate Quiz Dokodemo: My Angel is a Trivia / Game Show game, developed by Namco and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kyousouba Ikusei Simulation - Keiba (Japan)": {
    "key": "Kyousouba Ikusei Simulation - Keiba (Japan)",
    "original_name": "Kyousouba Ikusei Simulation: KEIBA (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This game begins by asking you to name your own stable, and then your first horse, quickly introducing you to the world of this horse raising, breeding, and racing game. The majority of the gameplay focuses on micromanaging your horses training and care. You an select the races that you think you're horse is ready for in an attempt to win coveted ribbons, and wealth beyond the dreams of avarice!\n\nOnce you enter a race you'll be taken out of control and see if all you're hard work has payed off as your beast makes it around the track. An announcer follows the competition of there Muybridge wannabes, narrating what you see.\n\nRegardless how good your horse is it will be economically prudent to continue its line. Through shrewd husbandry you can translate the positive traits of race horse to a new generation. You'll be able to select a proper mate from other stables. \n\nHorse information and stable data can be shared with other players via the Communication Cable.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Langrisser Millennium WS - The Last Century (Japan)": {
    "key": "Langrisser Millennium WS - The Last Century (Japan)",
    "original_name": "Langrisser Millennium WS - The Last Century (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "\"Langrisser Millennium\" is yet another installment of the long-running Japanese strategy RPG series. You control five main characters: Taji, a young boy whom was chosen as the ruler of the country Salem; Nei Lee Sun, the ruler of Chin, who helps Taji when he gets involved in a war; Masariva, a half-beast and a former slave who became a queen, but preferred the life of a wanderer; Rumaty Marf, the queen of the country Misla, on a quest for an angel who appeared in her dream; and Saryune, the ruler of Vidern, whose only desire is power. Those five rulers meet each other, when they get involved in a war with hostile countries. However, soon they learn a greater evil has appeared in the world - they must reach a faraway island to prevent the reincarnation of an evil god...\n\nThe gameplay \"Langrisser Millenium\" is divided into \"Map Mode\" and \"Battle Mode\". In map mode, you move your characters over a map, trying to reach enemy fortresses and to prevent the enemy to reach yours. Everything happens in real time: if you do nothing, the enemy will come and conquer your country. Once in battle mode, you control several teams. You only assign actions to the team leaders, while others fight automatically in round-based strategy combat.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Last Stand (Japan)": {
    "key": "Last Stand (Japan)",
    "original_name": "Last Stand (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Last Stand is a Strategy game, developed by Soft Machine and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Lode Runner for WonderSwan (Japan)": {
    "key": "Lode Runner for WonderSwan (Japan)",
    "original_name": "Lode Runner for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Bungeling Empire has stolen a huge cache of gold from its rightful owners, and your mission is to infiltrate its treasury and recapture it. This entails progressing through 150 screens of platforms, ladders and ropes.\n\nThe Empire has sent robotic guards down to protect the gold, and contact with any of these will cost you a life. Your method of escaping them is to press fire to dig a hole in their line of movement, thus causing them to fall in briefly, allowing you to move across the gap safely. Once all the gold has been collected, a ladder allowing you to move onto the next screen is added. Completing these screens often requires forward planning and precision.\n\nThis was one of the earliest games to include a level editor, allowing the creation of new level designs with no programming skill.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Macross - True Love Song (Japan)": {
    "key": "Macross - True Love Song (Japan)",
    "original_name": "Macross - True Love Song (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Macross: True Love Song is a Strategy game, developed and published by Lay-Up, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Magical Drop for WonderSwan (Japan)": {
    "key": "Magical Drop for WonderSwan (Japan)",
    "original_name": "Magical Drop for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Somewhere in the world, there is a precious item called magical drop. Anyone who finds it will be granted happiness, or will be able to execute revenge upon his enemy. No wonder many people are trying to get this item. But the way to obtain it is not easy...\n\nThis is a puzzle game in which different balloons are falling down and you must match three balloons of the same type to make them disappear and to prevent them from crushing you. The player character is running sideways on the bottom of the top-down screen, and is shooting the balloons to make them change shapes and match each other. There are different player characters, all of which are Tarot cards: Demon, Justice, Priestess, etc. Each character shoots a different kind of special ball, which can be matched against any combination of other two.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mahjong Touryuumon (Japan)": {
    "key": "Mahjong Touryuumon (Japan)",
    "original_name": "Mahjong Touryuumon (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Mahjong Touryuumon is a Board game, developed by Chat Noir and published by Sammy Studios, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Makai Mura for WonderSwan (Japan)": {
    "key": "Makai Mura for WonderSwan (Japan)",
    "original_name": "Makaimura for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Arthur the brave knight must rescue his beloved Princess Prin-Prin from the Demon Emperor Azazel and his forces. Among them are various undead (ghosts, zombies), bats, ogres and goblins. Other challenges include moving platforms, ladders and water/fire hazards. This game combines enemies from all three previous Ghosts 'N Goblins games.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Medarot Perfect Edition - Kabuto Version (Japan)": {
    "key": "Medarot Perfect Edition - Kabuto Version (Japan)",
    "original_name": "Medarot Perfect Edition - Kabuto Version (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Medarot: Perfect Edition is a RPG developed by Natsume and published by Imagineer in 1999 for the WonderSwan, and is a \"director's cut\" edition of the original game released on the Nintendo Game Boy in 1997. \nIt follows Hikaru Agata on his quest to compete in Robottle tournaments and defeat the evil Roborobo Gang. It was released in two versions: Kabuto (Rhinoceros beetle), where the player's starting Medarot is Metal Beetle, and Kuwagata (Stag beetle), where the player starts with Head Scissors.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Medarot Perfect Edition - Kuwagata Version (Japan)": {
    "key": "Medarot Perfect Edition - Kuwagata Version (Japan)",
    "original_name": "Medarot Perfect Edition - Kuwagata Version (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Medarot: Perfect Edition is a RPG developed by Natsume and published by Imagineer in 1999 for the WonderSwan, and is a \"director's cut\" edition of the original game released on the Nintendo Game Boy in 1997. \nIt follows Hikaru Agata on his quest to compete in Robottle tournaments and defeat the evil Roborobo Gang. It was released in two versions: Kabuto (Rhinoceros beetle), where the player's starting Medarot is Metal Beetle, and Kuwagata (Stag beetle), where the player starts with Head Scissors.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Meitantei Conan - Majutsushi no Chousenjou! (Japan)": {
    "key": "Meitantei Conan - Majutsushi no Chousenjou! (Japan)",
    "original_name": "Meitantei Conan: Majutsushi no Chsenj! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Conan Edogawa is the pseudonym of Shin'ichi Kudo, but more than just a pseudonym, a pseudoform. Shin'ichi Kudo, an inquisitive seventeen year old student, was investigating a blackmail case when attacked by members of the Black Organization. He was forced to take an experimental APTX 4869 drug which caused, in a rare side-effect, his body to transform into that of a seven-year-old. \n\nThis does not stop Shin'ichi, adopting the name Conan Edogawa he moves in with Ran Mori, his childhood friend and sweetheart. Enrolling in a elementary school to complete his disguise he vows to find out who is backing the Black Organization, and to have his revenge. With the help of his his oddball classmates, an ex-member of the Black Organization Ai Haibara, whose also been turned into a child, and his beloved he just might do it...\n\nThe games story follows the Conan through his school life which intertwines with his search for justice. He forms a Junior Detective League in his school to help him out. This cast of characters will help supply you information throughout the game.\n\nThe gameplay consists of using a map screen to travel to a number of areas collecting clues for the case you are on. Each area offers you the ability to examine the area, talk to bystanders, collect items, and sometimes attack if a threat is apparent. \n\nAfter collecting information you will have the chance to open your notebook, which will cause the WonderSwan to switch to a vertical orientation, and review your information. Also in the note books is a logic grid. On the grid you will have to select where you've deduced something intersects,who was at the scene at what time, by marking it with a circle and voiding all impossibilities with crosses. Once you've completed an entire grid you'll be able to present your deductions or press a point further allowing you to progress. If you've gotten your reasoning wrong, however, it is back to the drawing board and time to recheck you evidence and maybe time to see if you missed some clues.\n\nThis game includes five scenarios, roughly translated to English as:\n\n1. Continuous high school girl kidnapping\n2. Murder on the suspense drama set\n3. Jack the Ripper murder\n \nThe mysteries incident's letter of notice\n4. Treasure cases at the end of the century",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Meitantei Conan - Nishi no Meitantei Saidai no Kiki! (Japan)": {
    "key": "Meitantei Conan - Nishi no Meitantei Saidai no Kiki! (Japan)",
    "original_name": "Meitantei Conan: Nishi no Meitantei Saidai no Kiki (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Detective Conan returns to the WonderSwans continuing his efforts to thwart the dreaded Black Organization. The game features new mysteries and new characters from the Conan universe. \n\nNew features include finding keys. Keys represent actual bits of evidence you can use to solve the logic puzzles in the game once you find all the keys you will be able to attempt to solve the puzzle. However, often in the search for keys one finds hints. Hints are bits of information that will point you in the right direction of a key. Hints also be presented, singularly or combined, to various people in an attempt to extract information, or keys. Once you have all the keys you will be able to have an entire logic grid, otherwise there will be grayed out areas on the grid.\n\nThere is also now a mode in some cases where Conan will have to chase the suspect through several areas before subduing him. \n\nThe game records your information at the start of the game to work a character based off of you into the game. This character can be swapped with other owners of \nMeitantei Conan: Nishi no Meitantei Saidai no Kiki !? through the Communication Cable.\n\nThis game alternates between horizontal display for regular play and investigation, and vertical display for Conan's detective notebook.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Metakomi Theraphy - Nee Kiite! (Japan)": {
    "key": "Metakomi Theraphy - Nee Kiite! (Japan)",
    "original_name": "Metakomi Theraphy - Nee Kiite! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Metakomi Theraphy: Nee Kiite! is a Strategy game, developed by Yoshidayama Workshop and published by Media Entertainment, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mingle Magnet (Japan)": {
    "key": "Mingle Magnet (Japan)",
    "original_name": "Mingle Magnet (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Mingle Magnet is a simple puzzle game of the falling block variety. The player oversees a 10 x 10 square field where the first four rows (three on easy) have been filled by blocks. Each block shows one of three symbols, a dark gray circle, a light gray circle, and a white circle. When ever any of blocks with matching symbols touch they will form a link. By moving the cursor over a chain and clicking on it the player will be given points based on its size on the chain will be removed. The goal is to get a large score while making sure that new pieces can still enter the field. Once no more pieces can enter the game ends. Blocks fall at the same time one square apart, when the next set of blocks fall they will occupy the space given by the previous drop.\n\nThe \"magnet\" aspect of Mingle Magnet come into play in how the player can control the placement of the blocks. All the blocks are attracted to a magnet which, although not seen, can be placed on any side of the field. All blocks will be drawn to the magnet. For example, if one has the magnet at the south of the field and then puts it to the north what was the top of the block pile will now be the bottom, and blocks will fall onto what was the bottom. The direction of the magnet is indicated by a magnetic field animation behind the action.\n\nThis game is played vertically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Mobile Suit Gundam MSVS (Japan)": {
    "key": "Mobile Suit Gundam MSVS (Japan)",
    "original_name": "Mobile Suit Gundam MSVS (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A must for anyone who can sing the Gundam theme tune. Great shading make this a very atmospheric title that does justice to the WonderSwan. Mr. Gunpei Yokoi would have been very proud.  Players assume the role of an Anaheim Electronics test pilot as they",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "MobileWonderGate (Japan)": {
    "key": "MobileWonderGate (Japan)",
    "original_name": "MobileWonderGate (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The Mobile WonderGate was made to connect the WonderSwan to a compatible mobile phone and then have access to the Internet via your mobile phone. NTT DoCoMo was the mobile carrier who sponsored this product at the time, and it surely only worked on this n",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Moero!! Pro Yakyuu Rookies (Japan)": {
    "key": "Moero!! Pro Yakyuu Rookies (Japan)",
    "original_name": "Moero!! Pro Yakyuu Rookies (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Moero!! Pro Yakyuu Rookies is a Baseball Sim game, developed by TOSE and published by Jaleco Entertainment, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Morita Shougi for WonderSwan (Japan)": {
    "key": "Morita Shougi for WonderSwan (Japan)",
    "original_name": "Morita Shougi (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Morita Shogi for WonderSwan is a Board game, developed and published by Yuki, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nazo Ou Pocket (Japan)": {
    "key": "Nazo Ou Pocket (Japan)",
    "original_name": "Nazo Ou Pocket (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Nazo-Oh Pocket is an Adventure game, developed by Bandai Visual and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nice On (Japan)": {
    "key": "Nice On (Japan)",
    "original_name": "Nice On (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A simple golf game; Nice On brings the gray-gradient green into the hands itinerant gamers. \n\nThe mechanism for golfing in this game is simple as it is classic. The players chibi avatar stands by the tee club aloft whilst a 'power bar' fluctuates up and down beside it. When the player presses a button the power bars movements will stop and how height the bar was will effect the distance of the shot. Before this the player may of course state the direction they'd like to hit the ball and where on it's surface they would like to strike it. Hazards are or course a threat to the novice, such as sand traps, meddlesome trees, etc. The flight of the ball is shown in an overhead view.\n\nOnce the ball is on the putting green the view remains over head regardless if the ball is in motion or being struck. The player may here select the direction of the strike to the ball, and the power bar will recommence it's spasms; however, the golfer ball will move of its own accord without any golfer in sight. The putting green is covered by marks that indicate the subtle slopping of the ground that seeks to keep you away from your triple bogey. \n\nShould you find endlessly teeing off with yourself a bit tedious you may use the Communication Cable to play with another human, or you may challenge the npc character. This veritable samurai of the rough, swarthily attired in a fly fishing hat, will critique your game as he putts against you.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nihon Pro Mahjong Renmei Kounin - Tetsuman (Japan)": {
    "key": "Nihon Pro Mahjong Renmei Kounin - Tetsuman (Japan)",
    "original_name": "Nippon Pro Mahjong Renmei Kounin Tetsuman (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Nihon Pro Mahjong Renmei Kounin: Tetsuman is a Mahjong game, developed by Chat Noir and published by Kaga Tech, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Nobunaga no Yabou for WonderSwan (Japan)": {
    "key": "Nobunaga no Yabou for WonderSwan (Japan)",
    "original_name": "Nobunaga no Yabou (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In the 16th century, Japan's Sengoku (\"Warring States\") period divided the nation into numerous feudal states, each ruled by a daimyo. These daimyos would often go to war with each other. Many dreamt of conquering the land, becoming the Shogun and ruling",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ou-chan no Oekaki Logic (Japan)": {
    "key": "Ou-chan no Oekaki Logic (Japan)",
    "original_name": "Ou-chan no Oekaki Logic (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Ou-chan no Oekaki Logic is a digital conversion, with anime mascots, of the classic Japanese newspaper puzzle nonograms. A nonogram is a puzzle on a square or rectangular grid the object of which is to reveal a hidden picture. Along each row and column there is a number or series of numbers which indicate how many squares will be colored in that row or grid. Example; \"5 9 4\" would mean there would be sets of five, nine, and four colored squares in the grid, in that order, with at least one blank in between. \n\nOu-chan no Oekaki Logic adds a story mode where Ou-Chan, representing the player, competes with other blobby anime characters in finding hidden images in the nonogram grids.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pocket Fighter (Japan)": {
    "key": "Pocket Fighter (Japan)",
    "original_name": "Pocket Fighter (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Pocket Fighter is a crossover fighting game that takes characters from the Street Fighter, Darkstalkers, and Red Earth fighting series, and presents them in a cute shrunken chibi form with ridiculous moves and costumes. The games fights take place in various Capcom locations.\n\nAt the top of the screen is your, and your opponents, health bar. Below that is a meter showing how many gems you've collected. Gems are produced from a character when they are hit by a kick or a punch, these gems will then lie on the ground until someone picks them up. Filling up your gem gauge will increase your special attack meters on the bottom of the screen. Ideally one aims to achieve a special attack level of 9 by picking up gems, however, battle will often having you using these up before you reach that lofty number.\n\nThe main difference between the Sega Saturn and PlayStation version of Pocket Fighter is a card battle mode. \n\nIn the card battle mode you will be presented with a set of three to six cards to choose from to form an attack, after which you'll view the combat and get new cards to pick from until one player is K.O.'ed\n\nThe cards will have a attack power and a defense power. By combing cards you'll get an attack, defense, and counter value\nwhich determine an overall power value. The player who has selected the higher power value will attack that turn, unless your foe has picked a guard card, an evasion card, or a high enough counter value. Other cards include recovery cards and special move cards.\n\n\"Collectible Cards\", cards featuring various graphics of the game's characters, can be obtained by playing the games various modes, such as \"Arcade\", and traded via the Communication Cable\n\nThe game also featured an online high score board through the WonderGate.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Pro Mahjong Kiwame for WonderSwan (Japan)": {
    "key": "Pro Mahjong Kiwame for WonderSwan (Japan)",
    "original_name": "Pro Mahjong Kiwame (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Pro Mahjong Kiwame for WonderSwan is a mahjong game, published by Athena, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Puyo Puyo Tsuu (Japan)": {
    "key": "Puyo Puyo Tsuu (Japan)",
    "original_name": "Puyo Puyo 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A falling block game in which the goal is the combine four or more blocks of the same color which then disappear. The remain blocks will fall down and can produce combos which can cause special blocks (can only be destroyed by eliminating adjunct blocks) to appear at the enemies field.\n\nThis game includes a story mode, in which Arle (the main character) fights against computer enemies, a vs player mode, a four player mode (SNES only), and an endless mode (SNES only).",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Puzzle Bobble (Japan)": {
    "key": "Puzzle Bobble (Japan)",
    "original_name": "Puzzle Bobble (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Bust-A-Move (also known as Puzzle Bobble) is a real-time puzzle game in which the player controls a device called \"pointer\" at the bottom of the screen, aiming and releasing randomly colored bubbles upwards. Depending on the aiming, the bubbles may float",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Rainbow Islands - Putty's Party (Japan)": {
    "key": "Rainbow Islands - Putty's Party (Japan)",
    "original_name": "Rainbow Islands: Putty's Party (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A spin-off of the Rainbow Islands games, this title features Putty instead of the classic Bub & Bob. Like the previous games set on the island the character's main tools and weapons are rainbows. These rainbows can be walked on to scale heights or cover gaps. Rainbows can also be used to kill enemies by striking them with the arc as it is created, or after it has taken form jumping on it so that it breaks and the shards rain death on those below. Enemies can also be trapped in rainbows. Enemies killed by rainbow shards will sometimes drop a special item or a gem. A series of gems are needed to properly clear each level.\n\nThe goal of each area, aside from collecting gems, is to scale to the top of the island. Islands are made out of a series of themed platforms covered with associated enemies. These areas are scattered with items, mostly food, that will increase your score. Sometimes a rainbow will dislodge hidden food or an enemy will drop some when killed. If your score is high enough you will start to  send out more than one rainbow at a time. At the end of each island there will be a boss. If you fulfilled certain requirements in the level you may get a special item.\n\nThe islands in this game are, here listed with their theme:\n\n1. Insect Island: Insects and nature\n2. Monster Island: Classic horror monsters\n3. Doh Island: Geometric\n4. Darius Island: Machines\n\nThis game plays vertically.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Ring Infinity (Japan)": {
    "key": "Ring Infinity (Japan)",
    "original_name": "Ring Infinity (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Finally, \"Ring\" has appeared as the second novel in the Theater! \nThe curse of the \"Ring\" that has infected novels, movies, TV dramas and all kinds of media has finally involved Wonder Swan! \nThe first \"TERRORS\" that was popular as a novel theater. The characteristic of \"Ring ∞\" is that the power of \"TERRORS\" is greatly improved in the quality of graphics and sound. In addition, the text is a little larger than \"TERRORS\", so the readability of the text is considerably improved. In terms of systems, more thrilling improvements have been made, such as the addition of \"normal branch\" and \"branch by teller points\" and \"branch by time\". \nThe player becomes the main character who has watched Sadako's video and advances the game. Naturally, the scenario uses a multi-ending style, so even if you can survive and finish the scenario safely, it is not the end of the game. From there, a new \"Ring\" story begins. Then, as I play a number of scenarios, the truth gradually becomes clear... \nThis software supports Wonder Gate, so if you download new data using Wonder Gate, you can enjoy additional scenarios from the perspective of the hero's best friend.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Robot Works (Asia) (En,Ja)": {
    "key": "Robot Works (Asia) (En,Ja)",
    "original_name": "Robot Works (Asia) (En,Ja)",
    "name": "",
    "name_source": "",
    "original_desc": "The WonderBorg is a programmable consumer robot kit that was bundled with specialized software known as \"Robot Works\", which is used to program the robot.  \n \nWhile mainly used to program the movement of the physical robot, it also comes with a game where your aim is to get a virtual WonderBorg from start to finish with predetermined instructions: you first see the map, then give a series of instructions \"two forward, turn left, one forward\" etc and then run your program to see whether you managed to get the robot over the finish line.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Robot Works (Japan)": {
    "key": "Robot Works (Japan)",
    "original_name": "Robot Works (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The WonderBorg is a programmable consumer robot kit that was bundled with specialized software known as \"Robot Works\", which is used to program the robot.  \n \nWhile mainly used to program the movement of the physical robot, it also comes with a game where your aim is to get a virtual WonderBorg from start to finish with predetermined instructions: you first see the map, then give a series of instructions \"two forward, turn left, one forward\" etc and then run your program to see whether you managed to get the robot over the finish line.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Rockman & Forte - Mirai Kara no Chousensha (Japan)": {
    "key": "Rockman & Forte - Mirai Kara no Chousensha (Japan)",
    "original_name": "Rockman & Forte - Mirai Kara no Chousensha (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Join Mega Man and Bass's fight for humankind as you face off with the newest menace in town--Robot King. King's captured all of the data plans for Dr. Wily's creations. They will equip King with all the knowledge he needs to build his own indestructible army of robots. As either Mega Man or Bass, you'll set out separate adventures using a variety of battle moves and weapons to defeat robot masters. Hidden bolts and CDs give you extra items to assist in battles.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sangokushi for WonderSwan (Japan)": {
    "key": "Sangokushi for WonderSwan (Japan)",
    "original_name": "San Goku Shi for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Sangokushi, or Romance of the Three Kingdoms, is a video game based on the historical novel of the same name by Luo Guanzhong. It was developed and published by Koei in 1999 for the WonderSwan. \nThe game casts the player in the role of one of the many warlords rivaling for control after the Yellow Turban Rebellion. \nThis turn-based strategy game introduces hundreds of historical characters of the Three Kingdoms era. The game's main objective is to become the supreme ruler of the remnants of the falling Han Dynasty. To do this the player has to build a mighty empire by conquering provinces and recruiting generals worthy of command. Fight massive battles, triumph over natural disasters and capture enemy strongholds.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sangokushi II for WonderSwan (Japan)": {
    "key": "Sangokushi II for WonderSwan (Japan)",
    "original_name": "Sangokushi II for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Sangokushi II, or Romance of the Three Kingdoms II, is a video game based on the historical novel of the same name by Luo Guanzhong. It was developed and published by Koei in 2000 for the WonderSwan and is the sequel to the first game released in 1999. \nUpon starting the game, players choose from one of six scenarios that determine the initial layout of power in ancient China. The scenarios loosely depict allegiances and territories controlled by the warlords as according to the novel, although gameplay does not follow events in the novel after the game begins. The player wins the game by conquering all territories in China. This is accomplished by being in control of every province on the map.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "SD Gundam - Emotional Jam (Japan)": {
    "key": "SD Gundam - Emotional Jam (Japan)",
    "original_name": "SD Gundam - Emotional Jam (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "SD Gundam: Emotional Jam is a Strategy game, developed by Tom Create and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "SD Gundam Gashapon Senki - Episode 1 (Japan)": {
    "key": "SD Gundam Gashapon Senki - Episode 1 (Japan)",
    "original_name": "SD Gundam Gashapon Senki - Episode 1 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "SD Gundam: Gashapon Senki Episode 1 is a Strategy game which focuses on the Gundam anime franchise. It was developed by Graphic Research, published by Bandai, and was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "SD Gundam G Generation - Gather Beat (Japan)": {
    "key": "SD Gundam G Generation - Gather Beat (Japan)",
    "original_name": "SD Gundam G-Generation - Gather Beat (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "SD Gundam G Generation is a series of strategy-RPG video games that focus on the Gundam anime franchise. The G Generation series most distinctive feature is the fact that the machines are always depicted in a super deformed fashion.  Gather Beat is the fi",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Senkaiden - TV Animation Senkaiden Houshin Engi Yori (Japan)": {
    "key": "Senkaiden - TV Animation Senkaiden Houshin Engi Yori (Japan)",
    "original_name": "Senkaiden - TV Animation Senkaiden Houshin Engi Yo (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Senkaiden: TV Animation Senkaiden Houshin Engi Yori is a Role-Playing game, developed by Opera House and published by Bandai, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sennou Millennium (Japan)": {
    "key": "Sennou Millennium (Japan)",
    "original_name": "Sennou Millennium (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Sennou Millennium is a Puzzle game, developed by Kouyousha and published by Bandai, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Shanghai Pocket (Japan)": {
    "key": "Shanghai Pocket (Japan)",
    "original_name": "Shanghai Pocket (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This is a portable edition of the solitaire game Shanghai, the game uses traditional Mah Jong tiles. The aim of the game is to match tiles, four of each type will be put on the playing field, when two tiles are matched they are removed when none remain you win. Only tiles that can be moved freely to the left or right may be matched. A wrong move may result in you not being able to clear the field. \n\nA slight story mode is presented in the Shanghai mode; each tile setup is based on a Zodiac animal that needs it power restored. The goal is to complete all twelve of these stages there by restoring the animals power. \n\nSome variants are also included:\n\n1. Kong Kong: Compete against a computer to clear tiles. If you go slowly you will have tiles sent over to your by your opponent. This type of play is similar to games like Puyo Pop. Kong Kong may be played against another player by using a link cable or against a computer.\n\n2. Challenge (WonderSwan only): A large Shanghai game that you'll try to race through to get the best score. \n\n3. Goldrush: In this mode you will race against an opponent to reach a tile marked 'G'. G is for GOLD, boy! So get cracking.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Shin Nihon Pro Wrestling - Toukon Retsuden (Japan)": {
    "key": "Shin Nihon Pro Wrestling - Toukon Retsuden (Japan)",
    "original_name": "Shin Nippon Pro Wrestling Toukon Retsuden (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Straight from the National Japan Pro-Wrestling (NJPW) come the greatest wrestlers of the Land of the Rising Sun; beware the Thunder Lyger!\n\nShin Nihon Pro Wrestling Toukon Retsuden is a simple wrestling game where the player takes control of one of six wrestlers, who were current figures at the time of the games publication. Random battles can be arranged or competition in a tournament against all the games wrestlers.\n\nA player controls their wrestler with the directional X buttons and the A & B buttons. A & B perform punches and kicks, in close enough a punch can perform a grab. Once a wrestler is locked in a grab they can be tossed according to the directional buttons. The more abuse a character take the longer it will take them to stand up, this makes them very agreeable to kick or jump upon. \n\nBy punching a fallen gladiator you will get him in a lock. When done closer to the injured legs you will usually try to bend them and when done closer to his head you will crush his cranium between your mighty thighs. If you can do this for ten seconds without him breaking free, your chosen wrestler will win.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Neon Genesis Evangelion - Shito Ikusei (Japan)": {
    "key": "Neon Genesis Evangelion - Shito Ikusei (Japan)",
    "original_name": "Shin Seiki Evangelion : Shito Ikusei (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Neon Genesis Evangelion Shito Ikusei is a Japanese video game for the WonderSwan which was developed by Gainax and published by Bandai in 1999. \nThis game has Tamagotchi-elements to it. You play as Ryoji Kaji. You have to take care of Adam, or \"Shito\" as it is named in the game, in an embryonic state. You'll be able to make it evolve through different options. It will evolve into different forms depending of its stats. You can then make it battle the three Evangelions of Shinji, Rei and Asuka. \nYou can also explore different places from the Evangelion anime as Kaji himself, talk to different characters and acquire different items for Shito.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Shougi Touryuumon (Japan)": {
    "key": "Shougi Touryuumon (Japan)",
    "original_name": "Shougi Touryuumon (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Shougi Touryuumon is a Board game, developed and published by Sammy Studios, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Side Pocket for WonderSwan (Japan)": {
    "key": "Side Pocket for WonderSwan (Japan)",
    "original_name": "Side Pocket (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The main objective is to cross different USA cities and reach the predetermined scores to go ahead. But remember: you'll have only 16 balls and every error can be lethal!\n\nThe game also comes with modes for 2 players with two variants: 2P Pocket Game (the traditional mode) and 2P 9-Ball Game, where the premise is to sink 9 balls before the other player makes them first. If you prefer, test your target in Trick Game or even hear your favorite song in Jukebox.\n\nAfter each stage completed (and some luck), a bonus stage will appear, as well as the chance to earn extra balls. You will only need a good target in the parquet block!",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Slither Link (Japan)": {
    "key": "Slither Link (Japan)",
    "original_name": "Slither Link (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Slither Link is a fiendishly simple puzzle game from the pages of the Nikoli puzzle magazine. While Nikoli is widely known for coining the puzzle name Sudoku they also have produced a myriad of puzzles often dealing with numbers. \n\nIn this puzzle the player needs to create a loop around the fields grid with out having the loop's line cross itself. This would of course present little challenge if it weren't for those pesky numbers. The field is dotted with numerals that signal how many times the line may be next to it. The number one may only have the line contiguous with it on one side, the two two sides, the three three side. Four of course does not exist as that would, by a requirement to have four sides, create a square and thus a intersection of the line. Zeros also exist these may not have any lines bordering them at all. \n\nWhen a loop has been created so that all numbers are 'touched' appropriately and the line make a full loop you've cleared the puzzle. The game possesses six levels of difficulty and is played vertically on the WonderSwan.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Soccer Yarou! - Challenge the World (Japan)": {
    "key": "Soccer Yarou! - Challenge the World (Japan)",
    "original_name": "Soccer Yarou! - Challenge the World (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Like Coconuts Japan Entertainment Co., Ltd.'s other WonderSwan title Soccer Yarou! ~Challenge The World~ can largely be summed up by it's title; you will pick one of many global soccer teams and set off on a crusade against the rest.\n\nThe player controls a single one of their chosen team's members. The AI clumsily takes care of the rest. The player's selected splinter of the team avatar will move in the direction the player presses while dribbling the ball, should it be in his possession. When a button is pressed the ball will be kicked, should fortune spare your 2.49 inch screen a glance, to another player on your team. If another team member gets the ball you will automatically switch to that player. Kicking the ball is achieved by pressing a button which will more likely cause the player's character to fall on his face.\n\nA penalty shot mini-game is included where the view shifts to behind the player making the shot.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Sotsugyou for WonderSwan (Japan)": {
    "key": "Sotsugyou for WonderSwan (Japan)",
    "original_name": "Sotsugyou for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Graduation is a Japanese anime \"life-sim\" game which are popular in Japan. Except for Princessmaker 2, which was never officially released, this is the only game of its type that I know of which was ever translated to English. In Graduation you take the r",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Space Invaders (Japan)": {
    "key": "Space Invaders (Japan)",
    "original_name": "Space Invaders (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "A conversion of the classic arcade title, Space Invaders. This version, as part of the Arcade Classic series on Game Boy, has both 1 and 2 player modes using the usual 2 color Game Boy tones (black, grey) to re-create the addictive shooter. However, plug the cart into a Super Game Boy (an accessory of the Super Nintendo) and you have the option of playing the game in full color, with the original arcade cabinet as border art to the action while you play.\n\nThe game is very simple to play. Shoot down the incoming invaders while dodging their fire. They will advance slowly at first towards you, but the closer they come, the faster they get.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Robot Taisen Compact (Japan)": {
    "key": "Super Robot Taisen Compact (Japan)",
    "original_name": "Super Robot Taisen Compact (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "The very first installment of the Super Robot Taisen series is quite different from all of its successors; most notably, the robots are treated as sentient organisms, and all pilots are absent from the game. As the intro tells, they live on the planet of",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Robot Taisen Compact 2 - Dai-1-bu - Chijou Gekidou Hen (Japan)": {
    "key": "Super Robot Taisen Compact 2 - Dai-1-bu - Chijou Gekidou Hen (Japan)",
    "original_name": "Super Robot Taisen Compact 2 - Dai-1-bu - Chijou G (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Super Robot Taisen Compact 2 - Dai Ichibu - Chijou Gekidou Hen is a Sci-Fi Turn-Based Strategy game, developed by TOSE and published by Bandai, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Robot Taisen Compact 2 - Dai-2-bu - Uchuu Gekishin Hen (Japan)": {
    "key": "Super Robot Taisen Compact 2 - Dai-2-bu - Uchuu Gekishin Hen (Japan)",
    "original_name": "Super Robot Taisen Compact 2 - Dai-2-Bu - Uchuu Ge (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Super Robot Taisen Compact 2 was the second Super Robot Taisen strategy RPG to be released on the WonderSwan. Like Super Robot Taisen F/ F Final before it, Compact 2 is split into multiple parts: Part 1 and Part 2 occur simultaneously, while Part 3 continues from Part 2. Using the WonderSwan's internal memory, players can send their clear data to each successive game; several events are altered based on the player's previous save, gained items are carried over to Part 3, and a special final scenario can be unlocked by clearing the entire trilogy within 777 turns. The game, like its predecessor, borrows almost all of its gameplay mechanics from F/F Final; however, it introduces the \"Support System\" which immediately became a core mechanic of the SRW franchise. In Part 2, Excellen Browning and the Londo Bell forces fend off enemies in outer space.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Super Robot Taisen Compact 2 - Dai-3-bu - Ginga Kessen Hen (Japan)": {
    "key": "Super Robot Taisen Compact 2 - Dai-3-bu - Ginga Kessen Hen (Japan)",
    "original_name": "Super Robot Taisen Compact 2 - Dai-3-bu - Ginga Ke (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Super Robot Taisen Compact 2 Dai-3-Bu: Ginga Kessen-hen is a Sci-Fi Turn-Based Strategy game, developed by TOSE and published by Banpresto, which was released in Japan in 2001.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Taikyoku Igo - Heisei Kiin (Japan)": {
    "key": "Taikyoku Igo - Heisei Kiin (Japan)",
    "original_name": "Taikyoku Igo - Heisei Kiin (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Taikyoku Igo: Heisei Kiin is a Board game, developed by Success and published by Kaga Tech, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tanjou Debut for WonderSwan (Japan)": {
    "key": "Tanjou Debut for WonderSwan (Japan)",
    "original_name": "Tanjou Debut for WonderSwan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "TanjÅ : Debut puts the player into the role of a music company agent, who has to work with three potential stars of entertainment: three young girls named Aki, Kumi, and Saori. In the beginning of the game, the player views the statistics of each girl and",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tare Panda no GunPey (Japan)": {
    "key": "Tare Panda no GunPey (Japan)",
    "original_name": "Tare Panda no GunPey (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Tarepanda no Gunpey is a Gunpey style puzzler which has the modes of Gunpey EX with an additional Tarepanda story mode. \n\nThe game includes classic Gunpey, endless Gunpey, a timed line removal mode, and a mode where the player must clear all lines at once. Two players can also link up to challenge each other and exchange high-scores. \n\nA story mode is also included. Tarepanda discovers the existence of other lazy pandas all around the world; wondering what other floppy pandas are like Tare rolls off in search of them.\n\nEach panda wears headgear associated with its homeland, top hat for Britain, turban for India, etc. When our hero is about to reach the new lazy panda something gets in the way, usually an incline too large to roll over. By finishing a certain number of lines you'll give your stymied panda the energy to jump the obstacle. \n\nIn the story mode a number of novel hazards are presented. Your lines may flip angles, or parts of the screen may be entirely blocked out.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tekken Card Challenge (Japan)": {
    "key": "Tekken Card Challenge (Japan)",
    "original_name": "Tekken Card Challenge (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Fighting games are generally interested in making a player hit a complex mash of buttons to perform pugilistic wonders. This game is however card based, how can that work? During a battle between two opponents a set of five moves will appear on a roulette. The player hits a button to stop the rotation of the selector to semi-randomly select a field. A higher number card will always cancels out a lower number card. Higher number cards also do more damage. Block cards and counter cards also exist.\n\nA number of different attacks are available: combo cards pile up, allowing multiple cards to be selected until a combo card is reselected or a non-combo card is selected; juggling cards which allow for classic fighting game mechanics by allowing another attack after the first; charge cards allow the player to wait a turn to do extra damage should the player use an attack the next turn.\n\nAll cards have different visuals, and oft times different names, for different characters. \n\nThere are several game modes: a classic arcade battle where the player selects a character and a computer controlled character to face; an adventure mode where the player finds new cards and unlocks new character by defeating them; and a multiplayer vs. match for WonderSwan wielding humans.\n\nThe story mode plays on a 15x15 grid map covered with shrines, villages, and impassible mountains. You will only have a certain number of steps to make it to stage exit or you'll lose. Of course this Harshadic field is populated with a grave propensity of villains. Roving in the dark, for all the area of the world is obscured by 'fog' until the player walks there, are mysterious stormtroopers called Crow, Owl, Eagle. Also wandering the land are Tekken characters who hold long standing grudges against the player's character. Above it all in a high tower is the heinous Ogre, can he be defeated? \n\nAlong the way cards can be found that will increase the amount of moves that can be performed in combat. Sacred ziggurats exist, two per map, that will heal wounds and, if enough enemies have been defeated since the last shrine, a new form of attack card be obtained. These shrines may not be reentered. \n\nPlayers may fight their friends or foes using the Communication Cable to connect two WonderSwans for a fight.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Terrors (Japan)": {
    "key": "Terrors (Japan)",
    "original_name": "Terrors (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Terrors is an Adventure game, developed by Megas and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tetsujin 28 Gou (Japan)": {
    "key": "Tetsujin 28 Gou (Japan)",
    "original_name": "Tetsujin 28 Gou (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Tetsujin 28-gou is an Adventure game, published by MegaHouse, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Time Bokan Series - Bokan Densetsu - Buta mo Odaterya Doronbou (Japan)": {
    "key": "Time Bokan Series - Bokan Densetsu - Buta mo Odaterya Doronbou (Japan)",
    "original_name": "Time Bokan Series - Bokan Densetsu - Butamo Odater (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Time BÃ´kan Series: BÃ´kan Densetsu - Butamo Odaterya Doronbou is an RPG based on Tatsunoko's Time Bokan anime franchise.  It was developed by Alpha Unit, published by Banpresto, and was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Tokyo Majin Gakuen - Fuju Houroku (Japan)": {
    "key": "Tokyo Majin Gakuen - Fuju Houroku (Japan)",
    "original_name": "Tokyo Majin Gakuen - Fuju Houroku (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "It is the Bakumatsu era in Japan - 1860-ies, the time when the feudal rulers of Japan, the dynasty of Tokugawa shoguns, were continuously suffering under the attacks of rebelling groups that wished to end the Tokugawa reign and to restore the Empire. You are a god who does battle using unique cards, of which 500 various types are available. The game's story covers thirteen chapters set in the unique Tokyo Majin Gakuen world.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Trump Collection - Bottom-Up Teki Trump Seikatsu (Japan)": {
    "key": "Trump Collection - Bottom-Up Teki Trump Seikatsu (Japan)",
    "original_name": "Trump Collection - Bottom-Up Teki Trump Seikatsu (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Trump Collection: Bottom Up Teki Trump Seikatsu is a Gambling game, developed and published by Bottom Up, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Trump Collection 2 - Bottom-Up Teki Sekaiisshuu no Tabi (Japan)": {
    "key": "Trump Collection 2 - Bottom-Up Teki Sekaiisshuu no Tabi (Japan)",
    "original_name": "Trump Collection 2 - Bottom-Up Teki Sekaiisshuu no (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Trump Collection 2: Bottom Up Teki Sekai Isshuu no Tabi is a Gambling game, published by Bottom Up, which was released in Japan in 2000.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Turntablist - DJ Battle (Japan)": {
    "key": "Turntablist - DJ Battle (Japan)",
    "original_name": "Turntablist - DJ Battle (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Turntablist: DJ Battle is a Rhythm / Music game, developed and published by Bandai, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Umizuri ni Ikou! (Japan)": {
    "key": "Umizuri ni Ikou! (Japan)",
    "original_name": "Umizuri ni Ikou! (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Umitsuri ni Ikou! is a simple fishing simulator where you control a little boy at a variety of seaside locations; a pier, a beach, a stone outcropping, and out on the ocean.\n\nAs you cast a bar will rise and fall on the right side of the screen, when you press the A button the the bar will stop. Depending on how high the bar is when you stop it correlates to how far your line goes. Bigger fish lurk farther out; however, bigger fish are more difficult to real in given their distance from shore.\n\nOne your hook is in the water you will be treated to a [fisheye?] view of it in the brine. The background water is represented in different gradients so that the player can tell if they are moving up and down. A meter on the right hand side of the screen shows how deep you are, the farther you cast the deeper you'll be. \n\nBy pulling the line up with fish will be attracted to the hook. Should one grab on you'll get a \"HIT\". The view will now revert to being behind the fisher. Based on indications from a bar on the bottom you will have to push left and right, based on how the fish is trying to escape while pressing A. \n\nOnce caught you'll learn how big your fish was and be able to exchange data about it with other WonderSwan players.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Uzumaki - Denshi Kaiki Hen (Japan)": {
    "key": "Uzumaki - Denshi Kaiki Hen (Japan)",
    "original_name": "Uzumaki: Denshi Kaikihen (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "This interactive manga tells the tale of the town of a small Japanese town, Kurôzu-Cho, trapped in a vast spiraling curse. The story is told from the perspective of a woman, Kirie Goshima, who lived Kurôzu-Cho and now looks back to certain events that took place during here high school years.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Itou Junji Uzumaki - Noroi Simulation (Japan)": {
    "key": "Itou Junji Uzumaki - Noroi Simulation (Japan)",
    "original_name": "Uzumaki: Noroi Simulation (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "In this game you take play as the \"Spiral Curse\" of Uzumaki trying to bring curling madness to all of Kurôzu-Cho! Kirie Goshima returns but no longer as a beloved protagonist. Now she is a target, one of many, that you will try to infect with the spiral curse. In this oddly comic twist on the old horror story, not to say that this game is devoid of similar horrific elements of its predecessor.\n\nAfter a brief explanation of your role as the Spiral Curse, given by Uzumaki Sen'nin (The Spiral Master) you begin your task. Generally you make life worse as merry mischief making curse.\n\nYou will be presented with a map of Kurôzu-Cho; from which you can select where to travel. At each locations you will meet different people and be able to collect unique items. Items can be used to make the influence of the Spiral grow in certain areas, along with interacting with various people. \n\nAs you cause more mayhem more areas being to open, which allow you torment the old heroes even more!\n\nA small human/slug monster hybrid virtual pet can be accessed from the main menu.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Vaitz Blade (Japan)": {
    "key": "Vaitz Blade (Japan)",
    "original_name": "Vaitz Blade (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Vaitz Blade is an RPG set in a medieval European-style world, where you collect monsters by lowering their hitpoints. You can also fuse two monsters to create a stronger one. The game has 200 collectible species. The main point of this game is the \"Vaitz\" in the title. It is a generic term for monsters, and there are more than 180 different types of Vaitz in total in \"Vaitz Blade\". And it's not just monsters that can be combined with each other, but also items that can be combined with each other in this game. The variety of battles is one of the game's charms. In addition to the normal battles in which the player makes full use of the weapons and items he/she has created, the game also includes events and special battles in the arena (one-on-one combat, tag team matches, team battles, winner-take-all battles and time attacks) that add to the excitement of the game. There are also plenty of events during the story, such as a vertical shooting game that takes advantage of the unique characteristics of WonderSwan.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Wonder Stadium (Japan)": {
    "key": "Wonder Stadium (Japan)",
    "original_name": "Wonder Stadium (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Wonder Stadium, not to be confused with the near identical Wonder Stadium '99, presents a monochrome baseball experience for the WonderSwan. Players will quickly be able to start playing as one of fourteen teams, twelve professional two fictional, in All-Star Duel, Exhibition Game, or Homerun Competition modes. Player can also personalize their teams by giving the generic characters who comprise the teams names. \n\nWhen starting a game you'll be asked to select a team, a stadium; classic, seaside, or space, and how many innings the game will run from 1 to 9.\n\nHitting the ball is the 'simple' affair that it usually is, time your swing and if you timed well your ball will fly into or out of the field. Wonder Stadium does give the ability to bunt and tweak the direction that bunt will go. \n\nWhile playing the field you'll have considerable command over a number of different pitches. From moving your pitchers subtly around the mound to how hard a throw you'll give. Once your opposing team manages to get a hit the game stops giving you the view from behind the plate a switches to a birds-eye view of the field.\n\nEach ballplayer is hooked to another for instance when you move your man on first base the fellow in the field behind him will move in the same way, a bit clumsy but an acceptable compromise. The person nearest the ball will always be under your control. Once you get the ball you may throw it toward a base of your choice.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Wonder Stadium '99 (Japan)": {
    "key": "Wonder Stadium '99 (Japan)",
    "original_name": "Wonder Stadium '99 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Wonder Stadium '99 was released a mere five months after the original Wonder Stadium and does not add much in the way of gameplay. This update adds information about the 1999 Japanese baseball season to the game. Such as Seibu's Matsuzaka and Uehara of the Yomiuri Giants.\n\nThe game gives you a selection of 14 fictional and professional teams as well as three different stadiums, just as the original did.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "WonderSwan Handy Sonar (Japan)": {
    "key": "WonderSwan Handy Sonar (Japan)",
    "original_name": "Wonderswan Handy Sonar (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "WonderSwan Handy Sonar is a fishing game developed and published by Bandai in 1999 for the WonderSwan. It is bundled with the Handy Sonar, a fish-finder device similar to the Pocket Sonar also released by Bandai for the Nintendo Game Boy.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Wasabi Produce - Street Dancer (Japan)": {
    "key": "Wasabi Produce - Street Dancer (Japan)",
    "original_name": "wuzb? Produce: Street Dancer (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Street Dancer is a rhythm game starring the crew of wuz?b? a Japanese pop music performance group. \n\nThe game features standard with a line of button prompts scrolling across the bottom of the play are that you will have to press when they reach the center of the screen. Before you start a game you will be asked to select a member of the wuz?b? crew; Nana, Kaoru, Shino, or U. As you press buttons the chosen terpsichorean will shake it or stare at you in stupefaction, depending on your performance. A 'life bar' is presented on the screen if you fail to perform well the bar will go down, when it is empty your game ends. To clear a stage and unlock a new background with a harder song you'll have to get about a 60% perfect score. You can always record your performances to watch over and over.\n\nWhen a stage is clear you unlock new dance moves, these dance moves will appear in the game and in the \"Step Book\". In the step book you can watch the members of wuz?b? perform all their signature moves. You can also have the dancers perform in any way you like which you can record and repay for your friends. \n\nThree different musical styles are represented: jazz, hip hop, and rock. The game makes each of these modes unique, not just by changing musical tone but, by having the player change the way he holds the WonderSwan for each genre.\n\nThe forms are:\n\n1. Hip hop: the screen is held in the normal horizontal position so that the left hand can hit the A+B buttons and right hand can press the basic directional keys.\n\n2. Lockin' [sic]: In the mode the system is held so that both hands can press the directional buttons.This mode also requires you to press two notes at a time usually matching directions on both sets of directional buttons.\n\n3. Jazz: This is a total reversal of the hip hop mode. The system will now be horizontal but essentially upside down. Now the directional keys and A+B buttons will be at the top of the console\n\nA multiplayer mode is also included for two people on one system. both players take one set of the WonderSwans directional buttons and both players select different dancers. The multiplayer mode takes place in the vertical \"lockin'\" style, with two columns of press commands scrolling on the right. Both players are instructed by one of the columns, the player that is doing better will have their chosen dancer displayed on the screen.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Anchorz Field (Japan)": {
    "key": "Anchorz Field (Japan)",
    "original_name": "Anchor Field 2 (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Anchorz Field is a Strategy game, developed and published by Sammy Studios, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kiss Yori.": {
    "key": "Kiss Yori.",
    "original_name": "Kiss Yori... - Seaside Serenade (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kiss Yori... Seaside Serenade is an Adventure game, developed by Kid, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kiss Yori..": {
    "key": "Kiss Yori..",
    "original_name": "Kiss Yori... - Seaside Serenade (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kiss Yori... Seaside Serenade is an Adventure game, developed by Kid, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digimon - Ver. WonderSwan (Asia)": {
    "key": "Digimon - Ver. WonderSwan (Asia)",
    "original_name": "Digimon - Ver. WonderSwan (Asia)",
    "name": "",
    "name_source": "",
    "original_desc": "Digimon Ver. WonderSwan is a Japanese handheld version of the original Tamagotchi-like Digimon pet for the WonderSwan. It includes all of the original Digimon from the five different pet devices. In this game the player can have up to five different Digim",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Digital Monster - Ver. WonderSwan (Japan)": {
    "key": "Digital Monster - Ver. WonderSwan (Japan)",
    "original_name": "Digimon - Ver. Wonderswan (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Digimon Ver. WonderSwan is a Japanese handheld version of the original Tamagotchi-like Digimon pet for the WonderSwan. It includes all of the original Digimon from the five different pet devices. In this game the player can have up to five different Digim",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  },
  "Kiss Yori... - Seaside Serenade (Japan)": {
    "key": "Kiss Yori... - Seaside Serenade (Japan)",
    "original_name": "Kiss Yori... - Seaside Serenade (Japan)",
    "name": "",
    "name_source": "",
    "original_desc": "Kiss Yori... Seaside Serenade is an Adventure game, developed by Kid, which was released in Japan in 1999.",
    "desc": "",
    "desc_source": "",
    "needs_retranslate": false,
    "name_translated_at": "",
    "desc_translated_at": "",
    "original_name_hash": "",
    "original_desc_hash": ""
  }
}