{
  "Fuzion Frenzy (USA)": {
    "key": "Fuzion Frenzy (USA)",
    "original_name": "Fuzion Frenzy",
    "name": "融合狂潮",
    "name_source": "api",
    "original_desc": "Fuzion Frenzy is a launch title for the Microsoft Xbox. At its core, Fuzion Frenzy is a four-player party game featuring 45 different mini-games (not including the titular Fuzion Frenzy). A demo of the game was included with some other launch titles in the US, including Halo, Munch's Oddysee, the first Project Gotham Racing game and Amped. The title was among the first to be released as a part of the Xbox Originals program.\n\nA sequel was later released for the Xbox 360, entitled Fuzion Frenzy 2.",
    "desc": "Fuzion Frenzy 是 Microsoft Xbox 的首發遊戲。從本質上講，Fuzion Frenzy 是一款四人派對遊戲，包含 45 個不同的迷你游戲（不包括名義上的 Fuzion Frenzy）。該遊戲的演示版包含在美國其他一些發布的遊戲中，包括 Halo、Munch's Oddysee、第一款 Project Gotham Racing 遊戲和 Amped。該遊戲是首批作為 Xbox Originals 計劃的一部分發布的遊戲之一。\n\n隨後，Xbox 360 發布了續作，名為《Fuzion Frenzy 2》。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:20:42",
    "desc_translated_at": "2026-01-25T16:20:42",
    "original_name_hash": "de570391",
    "original_desc_hash": "92b72786"
  },
  "JSRF - Jet Set Radio Future (USA)": {
    "key": "JSRF - Jet Set Radio Future (USA)",
    "original_name": "JSRF : Jet Set Radio Future",
    "name": "JSRF : Jet Set 無線電未來",
    "name_source": "api",
    "original_desc": "A follow up to the Dreamcast title Jet Grind Radio. The setting is Tokyo in the year 2024. Freedom is a valuable commodity and freedom of expression even more so. Gangs of misbehaving teens strap on rocket-powered roller blades and skate, grind, and mark their territory with graffiti tags. Players take the role of the GGs, and can choose between any member of the gang, each with different stats, while in gang HQ. The city of Tokyo can be leisurely explored without a time limit, but the heat will be turned up when story missions are activated and the GGs find themselves being challenged by rival gangs or under attack from the cops. This time around spraying no longer requires thumbstick inputs; just roll up and start spraying away, although large tags still require more cans than smaller tags. Each section of the city has hidden objectives that are revealed by finding a hidden tape, and once completed these challenges will unlock new graffiti patterns.",
    "desc": "Dreamcast 作品 Jet Grind Radio 的後續作品。故事背景是 2024 年的東京。自由是一種寶貴的商品，言論自由更是如此。一群行為不端的青少年綁上火箭驅動的輪滑鞋，滑冰、磨蹭，並用塗鴉標籤標記他們的領地。玩家扮演 GG 的角色，可以在幫派總部中選擇幫派的任何成員，每個成員都有不同的屬性。東京市可以在沒有時間限制的情況下悠閒地探索，但當故事任務被激活並且 GG 發現自己受到敵對幫派的挑戰或受到警察的攻擊時，熱度就會升高。這次噴塗不再需要操縱桿輸入；只需捲起並開始噴塗，儘管大標籤仍然比小標籤需要更多的罐子。城市的每個部分都有隱藏的目標，通過找到隱藏的膠帶即可揭示這些目標，一旦完成這些挑戰將解鎖新的塗鴉圖案。",
    "desc_source": "api",
    "needs_retranslate": false,
    "name_translated_at": "2026-01-25T16:20:43",
    "desc_translated_at": "2026-01-25T16:20:43",
    "original_name_hash": "e148006d",
    "original_desc_hash": "449a9858"
  }
}